[
    {
        "podcast_id": 14035,
        "title": "Lady Scientist Podcast",
        "description": "Lady Scientist Podcast brings you into conversations with scientists. Academic research is often siloed in tough-to-read academic journals. This podcast strives to introduce you to new voices and to break down barriers, along with striking a note of positivity in an often-negative world. \n \nSupport the podcast through patreon.com/ladyscientistpodcast\nAll links are available through our website, ladyscientistpodcast.com\n",
        "language": "en",
        "author_name": "Jocelynn Pearl",
        "slug": "ladyscientistpodcast",
        "cover": "20210708_140307_a1908e28c90fd587484971a4a007ab25.jpg"
    },
    {
        "podcast_id": 26666,
        "title": "Podcast Molecular - Nos Bastidores da Ciência",
        "description": "No Podcast Molecular, fala-se sobre os bastidores da Ciência, com foco especial na Química.\nSerão entrevistados Investigadores e Professores universitários que nos falarão dos projetos científicos em que estão a trabalhar, dos problemas que estes pretendem responder, no percurso que tiveram até chegar aqui e naquilo que fazem para além da ciência.",
        "language": "pt-pt",
        "author_name": "Molecular JE",
        "slug": "podcastmolecular",
        "cover": "20210123_215013_421586a663d952e0353fcfd14962ebfa.jpg"
    },
    {
        "podcast_id": 44805,
        "title": "Physique & Chimie en pandémie",
        "description": "Nous, Félix - Physique - (maîtrise en physique) et Mathieu - Chimie - (bientôt Docteur en sciences pharmaceutiques) essayons, du mieux qu'on peut, de vous présenter/expliquer de façon simple des phénomènes naturels qui nous passionnent et qui vous intriguent. Sans math, sans calcul, sans équation. Bref, sans tout ce qui vous fait normalement suer. On commence, ça ne va y aller qu'en s'améliorant! Bonne écoute!",
        "language": "en",
        "author_name": "Felix Blais",
        "slug": "physique-et-chimie",
        "cover": "20210328_192119_ccf09062ad4b9c53526cc9e7ac17d373.jpg"
    },
    {
        "podcast_id": 59780,
        "title": "The Black Science Guy Podcast",
        "description": "Do you have a curiosity about all things science? Do you enjoy learning about science? Well this is the podcast for you! Each episode we cover everyday science topics from astronomy to microscopy. Then if it's something you're curious about, you can ask the black science guy! ",
        "language": "en",
        "author_name": "Chris Edwards",
        "slug": "blackscienceguypodcast",
        "cover": "20210530_021905_3de06922d6f88792c052059c114790d9.jpg"
    },
    {
        "podcast_id": 68060,
        "title": "PubReading",
        "description": "Researchers would love if they can expand time to fit in that publication, article, or review of their topic of interest; if that were true, however, there is no end to bottomless scrolling and missing the important details. PubReading would read out the abstract, results, and discussions to allow hassle-free information and a chance to create connections with like-minded individuals.",
        "language": "en",
        "author_name": "Mando Mourad",
        "slug": "pub-reading",
        "cover": "20220604_120651_b1eb6c62ae4201ef92e04bdcecbaf143.jpg"
    },
    {
        "podcast_id": 80019,
        "title": "Quick Chem with Anna ",
        "description": "Our aim is to make mini episodes about chemistry or news going on in the chemistry world :) We aim to get more students interested in chemistry and the sciences ",
        "language": "en",
        "author_name": "Quick Chem",
        "slug": "stcatsquickchem958",
        "cover": "20210918_150348_261a1856aefae7f1d9c3476c98bdf73e.jpg"
    },
    {
        "podcast_id": 83833,
        "title": "Disrupting PFAS",
        "description": "The Disrupting PFAS Podcast highlights cutting-edge PFAS innovations and innovators in a compact, digestible, and entertaining format for Environmental Managers and Technologists responsible for confronting the intractable problem of PFAS. ",
        "language": "en",
        "author_name": "Woodard & Curran",
        "slug": "disrupting-pfas",
        "cover": "20220503_060516_b64b036b0cc3ee594ce83717edeeef27.jpg"
    },
    {
        "podcast_id": 87197,
        "title": "La sicurezza alimentare a portata d'orecchio",
        "description": "Ciao, sono Daniela Maurizi, una chimica esperta di sicurezza degli alimenti.\nCon i miei podcast ti spiegherò in maniera chiara e semplice come scegliere, conservare e cucinare gli alimenti.\n🌐https://danielamaurizi.it/\n💻https://www.linkedin.com/in/daniela-maurizi-6168383/?originalSubdomain=it",
        "language": "it",
        "author_name": "Daniela Maurizi",
        "slug": "danielamaurizi",
        "cover": "20211027_093957_282d3f0edb6e01b51821da0a6b70871d.jpg"
    },
    {
        "podcast_id": 95958,
        "title": "The Chemfluencer",
        "description": "#Chemfluencer a podcast by CheMondis.\n\nThe chemical industry goes digital. But, what does that mean? What issues will be driving us in the future? Which innovations are exciting the industry?\n\nIn the #chemfluencer podcast, we discuss with experts about trends, challenges and innovations driving the industry. \n\nOnce a month we will discuss the latest trends and updates around the chemical industry with different specialists. Logistic crisis, investments in digital solutions, which skillsets are required today and which role plays agile leadership? We will take a closer look at each of them and many more.\n\nDuring your daily work you often come across many exciting topics, pick up some new buzzwords or headlines from the countless newsletters you subscribed. Most of the time, however, there is not enough time to deal with the most important information about the topic in a short and crisp way. \n\nWith the Chemfluencer podcast we want to change that. Exciting trends & news from the industry in a compact form to listen to on demand - wherever and whenever you want.\n\nThe free episodes will be available on this page and all common audio platforms.\n\nTune in!",
        "language": "en",
        "author_name": "CheMondis",
        "slug": "chemfluencer",
        "cover": "20220228_030251_69c168819bd8c153d8d7980ad1c16789.jpg"
    },
    {
        "podcast_id": 106804,
        "title": "What I Love About Bell with Hillary Cole",
        "description": "<p>Hillary Cole, Director of Sales at Bell Wine Cellars, discusses her passion for wine in general and specifically what sets Bell Wine Cellars apart. Hillary started out as a military linguist and counter-terrorism analyst in the Washington, DC area, during which time she also had the opportunity to visit vineyards in Italy fairly regularly. The serenity and romance of the vineyards were a stark contrast to her Intelligence career and she felt at home every time she stepped foot on one. After leaving the Intelligence field, she moved to Sacramento to learn how to fly fixed-wing aircraft. She intended to be here for two years and then to fly airlifts in Africa, but gravitated instead to the wine industry via restaurant management as the General Manager and Sommelier for three Sacramento-area restaurant groups after finishing her MBA studies and Intro Sommelier exam. Her final position on the restaurant side of wine was running the wine program at Ella Dining Room and Bar in Sacramento. Hillary has completed several wine certification programs, her favorites among which include French Wine Scholar, Champagne Master Level, Napa Valley Wine Expert, and The Business of Wine. She has loved having the opportunity to maximize her backgrounds in business, wine, and leadership via her position as Director of Sales Manager at Bell Wine Cellars.</p>",
        "language": "en",
        "author_name": "Bell Wine Cellars",
        "slug": "whatiloveaboutbell",
        "cover": "20220206_050228_9ee9599189a489b987a356ae3a735bf3.jpg"
    },
    {
        "podcast_id": 114360,
        "title": "Paraksilen Kimya",
        "description": "Paraksilen Kimya youtube kanalına ait podcastleri burada bulabilirsiniz. Yolda, evde, okulda podcastlar ile kimya bilginizi tazeleyebilir, unuttuğunuz yerleri aklınızda tutabilirsiniz.",
        "language": "tr",
        "author_name": "Mehmet Sait Özdemir",
        "slug": "paraksilenkimya",
        "cover": "20220420_100458_34ffd60c053b59b6944043329196326a.jpg"
    },
    {
        "podcast_id": 119961,
        "title": "Cannabis Data Science",
        "description": "You can join a group of like-minded individuals who are interested in learning about how to apply data science to cannabis data. Utilize the web and APIs to get the data that you need. Wrangle the data like a pro into a format suitable for analysis. Then calculate statistics to your heart's galore. Furthermore, learn how to build forecasting and prediction models to get an upper-hand on your competition.\n\nAt the Cannabis Data Science meetup, you can join like-minded individuals, learn modern data science techniques, and go through hands-on exercises with real cannabis data. This is a great opportunity for anyone in a cannabis-testing lab, anyone working at a cannabis cultivation or processing plant, any cannabis retailer, and even any cannabis researcher or consumer seeking knowledge. Please join us for a coffee, I like tea, for a fun time crunching cannabis numbers. We follow the value for value principle, so if you find value then you may consider donating so the Cannlytics team can continue to provide you with value.",
        "language": "en",
        "author_name": "Cannlytics",
        "slug": "cannabis-data-science",
        "cover": "20220408_020404_0417d7a86990a41807ffdf3d38c624a5.jpg"
    },
    {
        "podcast_id": 133450,
        "title": "Ingeniería Química en 5!!! Ep. 1",
        "description": "Canal dedicado a la divulgación científica en el área de ingeniería química y procesos sustentables.  ¡¡¡¡¡Ven a descubrir esta maravillosa disciplina!!!!!",
        "language": "es",
        "author_name": "ADREESUG",
        "slug": "adreesug",
        "cover": "20220610_010631_9f9ee22ea07e258927a551156b6912cd.jpg"
    },
    {
        "podcast_id": 138398,
        "title": "Heme.Onco.Mania",
        "description": "Data is not enough to answer our questions without the perspective of experts. We envision our podcast platform hosting outstanding experts, leaders, and frontiers in oncology fields will train our perspectives.\n",
        "language": "en",
        "author_name": "Heme.Onco.Mania",
        "slug": "hemoncomaina",
        "cover": "20220704_040720_774f3fffaf83c7f283a14a2818d1b91b.jpg"
    },
    {
        "podcast_id": 138653,
        "title": "Chemical FM",
        "description": "<p>Jump into the world of ChemicalFM, a real-time podcast interviewing activists and game changers in the chemical industry and beyond!</p>",
        "language": "en",
        "author_name": "Ecolink, Inc.",
        "slug": "chemicalfm",
        "cover": "20220705_020751_df66c9ae9042e747fd9907bb3f288b02.jpg"
    },
    {
        "podcast_id": 153519,
        "title": "Pillole",
        "description": "Il podcast dedicato ai farmacisti appassionati di galenica",
        "language": "it",
        "author_name": "Antonio Bortoletto",
        "slug": "galenicamente",
        "cover": "20220924_010934_e158db5e974c59b584cdd3bcabd937a2.jpg"
    },
    {
        "podcast_id": 153764,
        "title": "Materials.Business",
        "description": "Welcome to Materials Business! This is an initiative oriented towards the creation of a virtual space for the updating and strengthening of your knowledge about relevant topics related to your duties on equipment’s integrity and materials protection.\n\nThis space is designed as the meeting point for all the colleagues being part of your global community of managers and responsible people in charge of the management and decision in relation to materials and equipment integrity (planners, designers, plant managers and engineers, laboratory managers, QA&QC managers, researchers, contractors, and other specialists concerned with caring equipment and materials). From the design and selection, to the disposal, after as long as possible life in service, according to the principles of Circular Economy and the expectations in front of a new economy for a more sustainable world.",
        "language": "en",
        "author_name": "Monica Hernandez/Felipe Rocha",
        "slug": "materials-business-podcast",
        "cover": "20220921_090956_91e1ec50ae2c39547197ce69f4b582ef.jpg"
    },
    {
        "podcast_id": 155086,
        "title": "The RVGS Rat Chat",
        "description": "<p>STEM focused podcast from the Roanoke Valley Governor's School. Learn about students STEM interests as they talk with classmates and share their passions.</p>",
        "language": "en",
        "author_name": "RVGS Rat Chat",
        "slug": "rvgsratchat",
        "cover": "20230320_120346_7d06cd776518dc1538819bd282b78710.jpg"
    },
    {
        "podcast_id": 179801,
        "title": "The Rad Lab",
        "description": "This podcast mainly focuses on radiochemistry and nuclear science. We will be diving into its rich history and where it is headed with experts in the field. We will also use this platform to explore other aspects of science through special guests. We will discuss their research in detail and learn about who the person is beyond the lab.",
        "language": "en",
        "author_name": "Dr. David Dan",
        "slug": "theradlab",
        "cover": "20230111_020148_86479041acf0f611aefefc5a76842094.jpg"
    },
    {
        "podcast_id": 204008,
        "title": "The Professional Brewers' Podcast",
        "description": "<p>Welcome to the Professional Brewers' Podcast where we interview brewers, brewery owners, and other folks in the industry to take a deep dive into what it takes to have a successful brewing operation.</p><p>This show is for brewers of all kinds: folks considering going pro, professional brewers, people who wants to look behind the scenes of their favorite breweries, or merely the brewcurious.</p><p>Whether you’re hanging over a fifty barrel mash tun while you listen to this or you’re just starting your professional brewing journey, we hope this show helps you become a better, more profitable, happier brewer.</p><p>New episodes every Wednesday!</p>",
        "language": "en",
        "author_name": "Ricky the Meadmaker",
        "slug": "professionalbrewers",
        "cover": "20230713_060758_e62e74166d0eac680cdcb1fdcc5f0dc3.jpg"
    },
    {
        "podcast_id": 207147,
        "title": "Ciencias Ciencillas",
        "description": "<p>Podcast dedicado a la divulgación científica. Segmentos cortos con la finalidad de informar e incentivar la curiosidad científica.</p>",
        "language": "es",
        "author_name": "Juan Carlos Diaz y Sergio Mancillas",
        "slug": "cienciasciencillas",
        "cover": "20230503_080522_2c0bd3df93696d0e4ebdac5656ee19a1.jpg"
    },
    {
        "podcast_id": 222748,
        "title": "Hydrogenated Oil Is Good Or Bad",
        "description": "<p>In this podcast I will show you how the hydrogenated oil is being used for making food yes it is. Do you know how it's harmful to our health do you know in this podcast you will know about how it's good or bad</p>",
        "language": "hi",
        "author_name": "DHR PODCAST ",
        "slug": "dhr-podcast-2007",
        "cover": "20230806_030835_1b9acd304b78fcee6cbb2315b5d1d5f7.jpg"
    }
]