[
    {
        "podcast_id": 4373,
        "title": "Two Pushy Dames",
        "description": "Say ‘hello’ to The Two Pushy Dames!  We hope that you’ll check out our website – twopushydames.com – where you’ll find information to highlight our philosophy of children learning through play and exploration, rather than the academic and technological ‘push down’ that is so prevalent today.  #pushbackonthepushdown\nWho might be interested in The Two Pushy Dames?\nteachers of young children,\nPublic School educators who are sick of the academic push down, parents of young children,\ngrandparents of young children, ANYONE who cares about what is best for young children and our society!",
        "language": "en",
        "author_name": "Two Pushy Dames",
        "slug": "whoarethesedames",
        "cover": "20200117_031214_baedb72ae7824cac190421f381b6371c.jpeg"
    },
    {
        "podcast_id": 5005,
        "title": "The Reading Instruction Show",
        "description": "The Reading Instruction Show is a podcast about reading instruction (and other things) with a little bit of attitude. There is plenty here to inform and entertain all.",
        "language": "en",
        "author_name": "Dr. Andy Johnson",
        "slug": "drandy",
        "cover": "20230123_020122_7d7e2d09fe1dad184b31307b05b21d3e.jpg"
    },
    {
        "podcast_id": 7022,
        "title": "O C N W T R",
        "description": "<p>In 2010 I rode my bicycle over 16,000 kilometers thru 10 countries from Canada to Colombia. As I traveled I learned that people didn’t have clean drinking water in certain parts of the world. In 2015 I adopted the village of El Palmar in El Salvador. Over the next 7 years from 2015-2022 I took over 200 people on 17 different trips to discover how to best solve this problem In 2019 I founded O C N W T R - a local church that began with 3 people in a Jui Jitsui studio on Wednesday Nights in San Clemente CA in May 2019. Since that time we helped start 35 other churches in 6 countries that disciple about 1100 people and have produced 7287 liters of water I have traveled to 42 countries and hold a B.A. in Religious Studies, an M.A. in Counseling &amp; a Doctorate in Public Health Policy. I work as a Special Education teacher in the public school system in California. I am a volunteer at O C N W T R and teach this podcast as a way to give back what I have learned. Love and Blessings. Dr. Ryan Delamater. www.ocnwtr.com</p>",
        "language": "en",
        "author_name": "Dr. Ryan Delamater",
        "slug": "ocnwtr",
        "cover": "20221014_111050_e701079da61f90660a656aec2e1e9e5b.jpg"
    },
    {
        "podcast_id": 8748,
        "title": "The LODOWN",
        "description": "Welcome to The LODOWN: A Podcast brought to you by the Students of Lillian Osborne High School. Tune in for interviews with Staff, Students and Community members and get the LODOWN on everything LOHS. ",
        "language": "en",
        "author_name": "Lillian Osborne High School",
        "slug": "lodwn",
        "cover": "20210126_211539_9ae33a09b99042a664d12c7a83b2330f.jpg"
    },
    {
        "podcast_id": 8851,
        "title": "So Many Questions",
        "description": "So Many Questions is an informative series of episodes where I talk with administrators, teachers and staff at Northside Middle School. My goal is to help incoming 7th graders feel connected with the adults and get excited for Middle School life. ",
        "language": "en",
        "author_name": "Paige Finke",
        "slug": "somanyquestions",
        "cover": "20200528_131946_2348853de26d25f81c29ccc4f6f03b97.jpeg"
    },
    {
        "podcast_id": 9802,
        "title": "Utta filter",
        "description": "Podcast fra ungdomsrådet i Nord Aurdal kommune. Uformelle samtaler om det å være ung i Valdres,- av ungdom og for ungdom.",
        "language": "nb",
        "author_name": "Ungdomsrådet i Nord Aurdal",
        "slug": "uttafilter",
        "cover": "20200619_123006_910d87d9e4b300ed74d10a6fab7a8ac7.jpeg"
    },
    {
        "podcast_id": 12746,
        "title": "Terrier Talk",
        "description": "Redlands High School ASB Podcast.  ",
        "language": "en",
        "author_name": "Redlands High School ASB",
        "slug": "redlandshighschool",
        "cover": "20200927_234638_1b4ba293eda5592aad3aebd355ea1d48.jpg"
    },
    {
        "podcast_id": 13576,
        "title": "OwlCast",
        "description": "Students in Podcasting and Audio Production class work together in creating Hoosac's #1 and only podcast. Each episode takes you on a journey through the life and times of Hoosac School. ",
        "language": "en",
        "author_name": "Hoosac's Podcasting Class",
        "slug": "owlcast",
        "cover": "20201017_142115_331800935a05b579c3068590e61ee8f8.jpg"
    },
    {
        "podcast_id": 14931,
        "title": "YFU Eesti maailmakodanike podcast!",
        "description": "Kultuuri- ja haridusprogramme pakkuv Youth For Understanding ehk YFU Eesti MTÜ pakub 14-18aastastele noortele võimalust minna vahetusaastale. Siin podcastis kohtume erinevate yfukatega, kes on juba vahetusaastal käinud või YFUga mõnel muul moel lähedalt seotud. Loodame, et need lood inspireerivad, julgustavad ja tõstavad Su tuju. Head kuulamist!",
        "language": "en",
        "author_name": "YFU Eesti MTÜ",
        "slug": "carmeniyfulugu",
        "cover": "20220609_110612_5c5d3b0f2295f1b7aa082a91e8ed9fd2.jpg"
    },
    {
        "podcast_id": 18856,
        "title": "Cultivating & Integrating Literacy Across the Curriculum  ",
        "description": "Literacy and its cultivation is the key to education in the 21st Century.  We say that THOSE WHO READ, SUCCEED and that has never been more important than it is today.  From the earliest grades, we need to encourage literacy which today means more than just being able to read and write. It means being able to understand and apply what we read to our own lives and the world around us.  We live in an increasingly global, technologically driven world and our young people need to be able to make sense of that world through all variety of reading, online and off.  I hope to contribute to your successful literacy program and to the advancement of literacy not just in the classroom but out of it as well, in the homes of our students.  Therefore, there will the oral reading of books for children to listen to and think about.  There will be ideas for how parents and teachers can use the books I read as well as many other, to advance knowledge of the world.  Plus there will be ideas on how to enrich your literacy program and help your students indeed make applicable, those who read, will succeed.",
        "language": "en",
        "author_name": "Howard Slepkov",
        "slug": "hes",
        "cover": "20201217_160709_ab5c475500ccd4a0ab200578f515b627.jpg"
    },
    {
        "podcast_id": 19924,
        "title": "De Broklede Podcast",
        "description": "Een podcast voor docenten, leerlingen en ouders met uiteenlopende onderwerpen. \t\n\nSoms educatief en informerend en soms geheel het tegenovergestelde. Docenten, leerlingen en ouders luisteren immers wekelijks al genoeg naar elkaars geleuter. ",
        "language": "en",
        "author_name": "Thomas Mentink",
        "slug": "brokledepodcast",
        "cover": "20201223_084700_6fa773204d34705eafa5a6587e65bf83.jpg"
    },
    {
        "podcast_id": 21034,
        "title": "ספרות עם משמעות",
        "description": "שעת ספרות עם משמעות עם שני פרידמן- על חינוך, טיפול וספרות ילדים.\n",
        "language": "he",
        "author_name": "שני פרידמן",
        "slug": "sifruteemmashmaut",
        "cover": "20201229_115302_7621f76d4daef7cb1c437ef3b947f27d.jpg"
    },
    {
        "podcast_id": 22252,
        "title": "The Resource Room",
        "description": "As a Special Education Teacher, you are always helping others. But who supports YOU? In this podcast, I'll be sharing my SPED tips, tricks, researched based strategies, and professional development to help you grow and learn as a resource room teacher. \n\nIn the coming seasons, I'll be discussing how to improve reading comprehension, decoding, encoding, math computation, and so much more! ",
        "language": "en",
        "author_name": "Amanda Wilp",
        "slug": "theprimarygal",
        "cover": "20210107_135521_25e9c30034de0f734c0b8d48ae9693f4.jpg"
    },
    {
        "podcast_id": 25717,
        "title": "Early Childhood Discussions ... A Conscious Conversation",
        "description": "A podcast for early childhood providers.  Join us as we explore the world of child care in New Jersey.  Listen to experts in early childhood and experience early childhood providers share their knowledge and experience.",
        "language": "en",
        "author_name": "GNJK - Technical Assistance Center North",
        "slug": "early-childhood-discussions-a-conscious-conversation",
        "cover": "20210119_021840_36485eae5abba27a18dd92a05271323c.jpg"
    },
    {
        "podcast_id": 26529,
        "title": "Come glielo dico (dedicato ai genitori)",
        "description": "Questo è \"Come glielo dico\", un podcast per raccontare ai tuoi figli, con le parole giuste, il mondo là fuori. Qualche consiglio e piccole strategie per genitori che si interrogano.\nA cura di Eleonora Mazzola\n",
        "language": "it",
        "author_name": "Eleonora Mazzola",
        "slug": "comeglielodico",
        "cover": "20210615_103144_80cb373c59a6b92fe0223d5467046bb0.jpg"
    },
    {
        "podcast_id": 28104,
        "title": "The Education Conversation",
        "description": "Brought to you by The Teaching Awards Trust, 'The Education Conversation' will focus on our past and present Teaching Award winners and judges, with guests discussing their experience of being involved in the awards, challenges schools/colleges have been facing, and ideas for best practice. \n \n| Entries for The Pearson National Teaching Awards close March 12th 2021! Visit www.teachingawards.com to find out more.\nTwitter and Instagram: @TeachingAwards / Facebook: @TheTeachingAwards / LinkedIn: @the-teaching-awards . |\nSend a Thank A Teacher e-card at www.thankateacher.co.uk.\nFacebook and Instagram: ThankATeacherUK / Twitter: @UKThankATeacher |",
        "language": "en",
        "author_name": "The Teaching Awards Trust",
        "slug": "theeducationconversation",
        "cover": "20210128_121723_9b103196dd5f51500fc2002a6dc2bcb7.jpg"
    },
    {
        "podcast_id": 28431,
        "title": "The House of Music presents The Bridge",
        "description": "We will be exploring how musicians have learned to play music from generation to generation. Music is passed along in many ways. Sometimes through formal lessons or schools and other times from family members, neighbors or other folks in one's community...or all of the above! We'll explore the many ways this happens and how music can remain a vital part of our world and more specifically our local life. Whether we are musicians ourselves or not, most parents want to give their children the experience of music. ",
        "language": "en",
        "author_name": "Brad McLemore",
        "slug": "houseofmusic",
        "cover": "20210129_172348_22b63410dc6f7e106a2995db9bac7c31.jpg"
    },
    {
        "podcast_id": 28699,
        "title": "Lemon-aid",
        "description": "Lemon-aid is a podcast where teens can come together to speak about various topics related to mental health. It is a place where teens can learn, teach and share about what is going on in their lives. Teenage host Shai Davis wanted to create a safe place where she could bring her friends together to speak about important topics, laugh, and have a good time.  ",
        "language": "en",
        "author_name": "Shai Davis",
        "slug": "lemon-aid",
        "cover": "20210130_193348_a4e4cafed7e7fa32c862f332ab33de4e.jpg"
    },
    {
        "podcast_id": 31991,
        "title": "Experiencias Pedagógicas Lux",
        "description": "Las Experiencias Pedagógicas Lux significativas es un espacio de transformación\neducativa donde se comparten las actividades realizadas durante cada ciclo escolar que ayuden al fortalecimiento de las líneas de formación del Instituto Lux, colegio jesuita de educación básica y media superior en León, Guanajuato, México.",
        "language": "es",
        "author_name": "Instituto Lux",
        "slug": "feps-lux",
        "cover": "20210211_191048_6d746a28a1429c4d96f4e364f3c40730.jpg"
    },
    {
        "podcast_id": 32380,
        "title": "The Positive Way",
        "description": "A podcast, presented in short episodes, directed at youth sports coaches, leaders, and parents who want to move our communities forward towards a more positive sports experience for young athletes. \nInstagram - thepositivewaypodcast\nTwitter - @DanaSmithMIZPCA",
        "language": "en",
        "author_name": "Dana Smith",
        "slug": "thepositiveway",
        "cover": "20210219_182303_fd3c07df4cfeda04b2682347bbc23e35.jpg"
    },
    {
        "podcast_id": 35637,
        "title": "The Penrith Perception",
        "description": "The Penrith Perception podcast is designed to guide Penrith Selective High School students to succeed in life. Its aim is to share wholesome experiences and wisdom from prefects, teachers, successful alumni and professionals at the top of their field.\n",
        "language": "en",
        "author_name": "The Penrith Perception",
        "slug": "thepenrithperceptionpodcast",
        "cover": "20210315_093328_ee2e8633168241ce4a3ec1e7d8cbf2b7.jpg"
    },
    {
        "podcast_id": 35639,
        "title": "JUVY Podcast ",
        "description": "<p>Whether you're a young professional looking to make your mark, or simply curious about the minds and experiences of the next generation of leaders, JUVY is the spot for you. Hang out with us each week as we reverse stereotypes and challenge perspectives.</p>",
        "language": "en",
        "author_name": "Night Noroña and Joshua Altamura ",
        "slug": "juvypodcast",
        "cover": "20221107_091111_35a44d1acc4392e09d45675e5b4a9e4c.jpg"
    },
    {
        "podcast_id": 39923,
        "title": "Empowering (You)th Podcast",
        "description": "Building Utah Youth (BUY), a non­profit organization, was established in 2007 by area companies in Northern Utah to provide powerful leadership training to the youth of our communities. BUY strongly believes that the investment in our youth will positively and powerfully impact our families, communities, and businesses. What each individual learns about themselves in relation to who they can truly become provides them with a skill set that will guide them into taking responsibility and accountability for their success.",
        "language": "en",
        "author_name": "Brett Johnston + BUY board",
        "slug": "buildingutahyouth",
        "cover": "20210313_182801_8f382f1244d2243ce8a59454451f12c6.jpg"
    },
    {
        "podcast_id": 42075,
        "title": "The Gay Podcast",
        "description": "<p>A social experiment to find out if through consistency, dedication and self improvement Matt Gay can generate a Popular Podcast.</p><p><a href=\"mailto:thegaypodcst@gmail.com\">thegaypodcst@gmail.com</a></p>",
        "language": "en",
        "author_name": "Matt Gay",
        "slug": "wellfigureitout",
        "cover": "20230216_120213_60925c57956a24f7f6ab6a1f35455934.jpg"
    },
    {
        "podcast_id": 43410,
        "title": "Language Arts Workshop's Communication Arts Podcast (LAW's CAP)",
        "description": "Welcome to LAW's CAP! Each episode brings inspirational, educational, entertaining, heartwarming, and kid-friendly talk shows and podcasts. LAW's CAP covers topics that concern EVERYONE, from parenting to education and everything in between.  Stay tuned to find out how we inspire each other and bring great ideas to life!",
        "language": "en",
        "author_name": "Sue Sudarak",
        "slug": "law-communication-arts-podcast",
        "cover": "20210322_100142_43ac330ca6b25db2646032e3e933c253.jpg"
    },
    {
        "podcast_id": 44160,
        "title": "SM México",
        "description": "En el podcast de SM México encontrarás charlas informales sobre educación, un espacio que entiende tu labor docente y los mejores tips para el nuevo contexto educativo. También un espacio donde papá y mamá se sentirán identificados.",
        "language": "es",
        "author_name": "SM México",
        "slug": "sm",
        "cover": "20210409_004407_d12ba6fcb6c550f98c86ecbc3d0fc586.jpg"
    },
    {
        "podcast_id": 45223,
        "title": "Déjame contarte la Historia : History Stories in Spanish for Kids & Families",
        "description": "“Déjame contarte la Historia” es una serie de historias educativas\ny relajantes de la vida real para niños y sus familias. \nNuestros temas incluyen a Jacques Cousteau, Frida Kahlo, \nLa Mona Lisa, La gran Muralla China, entre otros. \n\nSi deseas, puedes hacer una Donación a este programa \nen: bedtimehistorystories.com, menú: Donate.\n",
        "language": "es",
        "author_name": "Bedtime History",
        "slug": "bedtimehistory",
        "cover": "20210513_184826_ae34b46bd5fd0bad59dc996505d97029.jpg"
    },
    {
        "podcast_id": 45571,
        "title": "The Humbled Millennial",
        "description": "A millennial that used to know everything there was to know about everything... then got humbled, so now it's time to listen. ",
        "language": "en",
        "author_name": "Silas Nacita",
        "slug": "speakidentity",
        "cover": "20220830_020815_ee97934e8a70380c9cac12e9b9f35a70.jpg"
    },
    {
        "podcast_id": 49880,
        "title": "YouthTalks",
        "description": "This podcast is a space to talk about hot topics for youth and activists from all over the world. We will publish one episode every two weeks and we will talk about youth activism, environment, mobilizing communities and so much more. We will have diverse and amazing guests and ask the hard and interesting questions but we will also have lots of fun!",
        "language": "en",
        "author_name": "State of Youth",
        "slug": "youthtalks",
        "cover": "20210419_125317_535e4cfeae3d4c01f190234394f6814f.jpg"
    },
    {
        "podcast_id": 51176,
        "title": "Big Minds",
        "description": "The Journey School of Houston students explore topics that spark curiosity, excitement, and sometimes make you go \"hmm.\" ",
        "language": "en",
        "author_name": "The Journey School of Houston",
        "slug": "bigminds",
        "cover": "20210421_202504_bd1ce2c4f9f6d485045a1d2cedd61dd4.jpg"
    },
    {
        "podcast_id": 51848,
        "title": "Sciencious Soundwaves",
        "description": "Sciencious is a rising 501(c)3 non-profit orgnisation initiated by a group of young STEM enthusiasts from around the world. We aim to bring STEM to under-resourced and financially-disadvantaged children. In this podcast, our board members will interview professors or scientists and discuss interesting STEM topics that will feed your curiosities and help you understand more about the world around you. So ... Are you ready to become a future scientist? ",
        "language": "en",
        "author_name": "Sciencious",
        "slug": "sciencious",
        "cover": "20210424_135443_492e5968ebf80486e55539ff4d7fdcc1.jpg"
    },
    {
        "podcast_id": 53945,
        "title": "CSD@WCU",
        "description": "CSD@WCU Podcasts were created to advance educational and career goals of future and current speech-language pathologists and audiologists. The CSD@WCU Podcasts are hosted by the faculty in the Communication Sciences and Disorders (CSD) department at West Chester University (WCU). WCU is located in West Chester, Pennsylvania, 30 miles west of Philadelphia. Please enjoy!",
        "language": "en",
        "author_name": "Elizabeth Grillo",
        "slug": "csdatwcu",
        "cover": "20230204_060232_e7074b1a82b10ad328051730f7d81c3a.jpg"
    },
    {
        "podcast_id": 53977,
        "title": "The DBIS Podcast",
        "description": "Discovery Bay International School has been a cornerstone of the community since the school's founding in 1983. Located in tranquil and idyllic surroundings on the island of Lantau, our school offers a broad curriculum and compelling learning path. ",
        "language": "en",
        "author_name": "Discovery Bay International School",
        "slug": "dbis",
        "cover": "20210503_040839_a1d4b61c75909a1574d20db43584f080.jpg"
    },
    {
        "podcast_id": 57876,
        "title": "Teen Advice: Stuff You Really Want to Hear ",
        "description": "This podcast is based on providing advice for teens as they go through those hard teenage years. We are Nate and Jess. We both teach junior high school to 8th and 9th graders. Based on the time we have/are spending in the classroom with teens; we are providing advice and help in consideration of our students concerns, questions, and struggles. Those teenage years are the hardest so we want to help however we can.\n\n\n\nThe image background was found on a royalty free photo site and can be found here:\nhttps://unsplash.com/photos/2nbIfDeT4t4?utm_source=unsplash&utm_medium=referral&utm_content=creditShareLink",
        "language": "en",
        "author_name": "Jessica Mohler",
        "slug": "teenadvice",
        "cover": "20210519_185545_79715ca6c370eb6b2db42ec5c8aa8d02.jpg"
    },
    {
        "podcast_id": 60067,
        "title": "FAIRY FRIDAY",
        "description": "Bạn có còn nhớ kỉ niệm thời thơ ấu gọi 1080 nghe các cô tổng đài kể truyện cổ tích cho nghe? Có một cái gì đó rất thú vị, rất khác khi nghe những câu chuyện từ một ai đó khác với giọng thân thuộc của Bà hay Mẹ thủ thỉ hằng đêm... \n\nFairy Friday góp nhặt những câu chuyện cổ tích từ khắp nơi trên thế giới. Có những truyện nội dung rất quen, nhưng tới từ một đất nước hoàn toàn khiến bạn bất ngờ. Có những truyện bạn chưa nghe bao giờ, và rất nên nghe.\n\nMong rằng Fairy Friday có thể mang tới cho bạn những phút giây nhẹ nhàng, thư giãn. Một nút follow và share của bạn sẽ là động lực rất lớn cho Fairy Friday!",
        "language": "en",
        "author_name": "Nguyen Hong Anh",
        "slug": "fairyfriday",
        "cover": "20210531_033016_bea9c0c7b7d9eb361e6aad90b184b78b.jpg"
    },
    {
        "podcast_id": 60341,
        "title": "Early Years Parenting Podcast",
        "description": "Podcasts from Number 9 The Nursery in Croydon all on supporting parents through the early years. ",
        "language": "en",
        "author_name": "Number 9 The Nursery ",
        "slug": "number9thenursery",
        "cover": "20210601_112708_1d83f854a75e528d668977f1ebeb91f7.jpg"
    },
    {
        "podcast_id": 62583,
        "title": "Miss Fintech Talks",
        "description": "Fintech is the future of finance, teens are the future of fintech. Are you ready?",
        "language": "en",
        "author_name": "Miss Fintech",
        "slug": "missfintech",
        "cover": "20210616_093822_1dbc6843f700601eb9fb6f3d2e5f00b2.jpg"
    },
    {
        "podcast_id": 63230,
        "title": "School Counselor Karaoke",
        "description": "Welcome to our unique space where school counselors come together to discuss their journey to the profession, their cultural backgrounds, and today's educational experience in our schools. Stay tuned for other discussions around best practices, favorite superheroes, favorite songs, and some fun sprinkled in between. Can you guess what kind of fun it is?",
        "language": "en",
        "author_name": "CounselHero",
        "slug": "school-counselor-karaoke",
        "cover": "20210616_054727_1c100b3d0a20e3c3e7fa2e12cff5270c.jpg"
    },
    {
        "podcast_id": 63617,
        "title": "High School Not So Much A Musical",
        "description": "<p>Join Rishi Sinha, Nitin Jaladanki, and Ayush Agarwal as they take you on a ride through the peaks and valleys of a high school journey, meeting with industry leaders experts to discuss how High School is really Not So Much a Musical.</p>",
        "language": "en",
        "author_name": "Rishi Sinha, Nitin Jaladanki, Ayush Agarwal",
        "slug": "high-school-not-so-much-a-musical",
        "cover": "20210621_094737_23f8d2b3c141030d539a34fcd91750d4.jpg"
    },
    {
        "podcast_id": 67201,
        "title": "How Are We Today?",
        "description": "A mental health show for those affected by mental health issues - which is all of us! Join host Tyler Coe as he brings on medical experts, your favorite personalities, and success stories for raw, insightful, and educational conversations about mental illness. ",
        "language": "en",
        "author_name": "Tyler Coe",
        "slug": "howarewetodayshow",
        "cover": "20210708_205955_637baf9573a354407eb01a9a6498d9a0.jpg"
    },
    {
        "podcast_id": 69378,
        "title": "Mindful Admissions",
        "description": "The Strive to Learn team demystifies college admissions topics that can confound even the savviest of students: financial aid, SAT/ACT testing, educational planning, college admissions essay writing, scholarships, and much, much more. Press play to hear from our expert college counselors as well as frequent guest stars and guiding voices in the field of college admissions!",
        "language": "en",
        "author_name": "Strive to Learn",
        "slug": "mindfuladmissions",
        "cover": "20210721_200956_e8fc1ff584c38eec39a8f0d5dfd3a353.jpg"
    },
    {
        "podcast_id": 69749,
        "title": "Why on Earth Should I Gamify?",
        "description": "Would you believe some students will graduate high school with the same amount of gaming hours as hours spent in class? With this in mind, why would teachers ever think gamifying their classroom is a good idea? Don't students spend enough time gaming already? Michelle Watrin, a middle school teacher from beautiful Abbotsford, B.C., explains the ins and outs of what gamifying a classroom could look like, and why some teachers are finding such success in gamification. ",
        "language": "en",
        "author_name": "Michelle Watrin",
        "slug": "whyonearthshouldigamify",
        "cover": "20210723_221416_31e512c589b852fcc1d928856098d7ec.jpg"
    },
    {
        "podcast_id": 72480,
        "title": "TC Braves Nation",
        "description": "Tishomingo County High School Information",
        "language": "en",
        "author_name": "TCHS Public Relations Class",
        "slug": "tcbravesnation",
        "cover": "20220713_060749_583d9725da3159211fc5617d591158b0.jpg"
    },
    {
        "podcast_id": 74213,
        "title": "Mosaic Foster Parents Cafe",
        "description": "The Mosaic Foster Parents Café is a digital coffee house where foster parents come to connect, learn and grow. A recharging station of sorts where caregivers come for encouragement and insight to help them continue to serve on the frontlines of the child welfare system. The #MosaicCafe was created and is hosted by Takkeem Morgan who spent 8 years of his life navigating the foster care system as a child. That experience inspired him to become a change maker for vulnerable children and an advocate for foster parents.\n\nThrough this podcast Takkeem is inspiring the next generation of foster parents and foster children to achieve greatness. In fact Mosaic's mission is to inspire and nurture the spirit of serving children and families one foster parent, one episode, and one community at a time.",
        "language": "en",
        "author_name": "Takkeem Leon Morgan",
        "slug": "mosaicfosterparentscafe",
        "cover": "20210906_050056_4d840bd67582dd78c945f703cb0fed8a.jpg"
    },
    {
        "podcast_id": 74642,
        "title": "Thursday Thoughts",
        "description": "In this podcast we will talk about life from a Christian perspective. We will look at the good, the bad, and the messy. We will examine all these things through the lenses of the Bible and think of the practical application for our everyday lives. \n\nMusic from Uppbeat (free for Creators!):\nhttps://uppbeat.io/t/hey-pluto/swings-and-roundabouts\nLicense code: 1G2OVI2SFCU0JWUS",
        "language": "en",
        "author_name": "Joshua Warren ",
        "slug": "thursdaythoughts",
        "cover": "20210824_190847_7c1ce45325fe2f6f8fecf561a3fa748c.jpg"
    },
    {
        "podcast_id": 76614,
        "title": "Using My Lessons Learned the Hard Way to Inform Teaching in the 21st Century",
        "description": "It has now been five years since I last stood in front of a class of students.  I have wanted to share my experiences with young people interested in their own career in the classroom.  I loved being a teacher, an educator, but I didn't become an expert overnight although I thought at first it would be easy.  Little did I know it would take me a lot of lessons learned the hard way how to be a successful classroom teacher. I want to help those interested in hearing my stories and learning from my experiences and I hope you will take me up on my offer to contact me at any time.  Once a teacher, always a teacher.",
        "language": "en",
        "author_name": "Dr. Howard Slepkov",
        "slug": "lessonslearnedthehardway",
        "cover": "20211109_224426_ab46af73034045560501c7b20b22c6ff.jpg"
    },
    {
        "podcast_id": 83316,
        "title": "Padres Imperfectos",
        "description": "Conversaciones de @patymier con expertos que nos ayudan en el camino de ser papás, educando desde el amor y aceptando que nos podemos equivocar.",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "padresimperfectos",
        "cover": "20211005_003206_7bf33079d61d70854e7ce8f43a8b8615.jpg"
    },
    {
        "podcast_id": 85970,
        "title": "SEL Rockstars",
        "description": "<p>Sandy Tarantino interviews teachers around Buncombe county who have great SEL practices so other teachers can use them. The SEL Rockstars Logo is collaborative work by Ms. Luther, Ms. Ebinger, and Ms. McDaris' classes inspired by The Dot by Peter Reynolds. Art lesson source: Cassie Stephens.</p>",
        "language": "en",
        "author_name": "Sandy Tarantino",
        "slug": "tarantino",
        "cover": "20221013_021026_10177ee8d9a4c8fbd83dca8f5734da90.jpg"
    },
    {
        "podcast_id": 91061,
        "title": "טיפול בדיבור",
        "description": "הכל על התפתחות שפה, דיבור ותקשורת בשנים הראשונות לחיים.\n\nעם נועה ברק - קלינאית תקשורת התפתחותית, מדריכת הורים, מלווה התפתחותית ויוצרת משחקים טיפוליים ותהליכי ליווי לקידום הדיבור אצל ילדים.\n\nבקרו באתר שלי:\nnoabarak.co.il",
        "language": "he",
        "author_name": "Noa Barak",
        "slug": "tipul-bedibur",
        "cover": "20211117_090400_cfca4aa82293f6e0178152a5fabdd96a.jpg"
    },
    {
        "podcast_id": 91924,
        "title": "What Do Scientists Do?",
        "description": "\"What Do Scientists Do?\" is a STEM podcast for all ages! In each episode, a guest expert teaches us all about a new science, technology, engineering, or math topic. How do we study things that are too small to see with our eyes? How do we keep track of ocean creatures that swim all around the world? Our guests answer these questions and more! \n\nDo your curious kids have questions they’d like answered by an expert? Send us an email and/or voice recording at whatdoscientistsdo@superstaff.ca or find us @scientistsdopod on Twitter and Instagram. \n\nThis podcast is made by SuperNOVA at Dalhousie University, a network member of Actua. ",
        "language": "en",
        "author_name": "SuperNOVA at Dalhousie University",
        "slug": "whatdoscientistsdo",
        "cover": "20211122_135353_ffbbbbe91c3e41d7cc773946c994154e.jpg"
    },
    {
        "podcast_id": 95665,
        "title": "The Kidsplorer Podcast",
        "description": "Featuring the Kidsplorer Claire and her Dad!\n\nThis is a kids podcast where Claire researches and talks about topics that excite her and her friends.",
        "language": "en",
        "author_name": "Claire Martin",
        "slug": "explorerseriespodcast",
        "cover": "20221220_101250_d82131dd056869cc9b79a3d80575301e.jpg"
    },
    {
        "podcast_id": 97620,
        "title": "Uncharted Geography",
        "description": "Mapping the world, one conversation at a time. ",
        "language": "en",
        "author_name": "Jon McQ",
        "slug": "unchartedgeography",
        "cover": "20211231_061252_5e1456ffdf4794b924fa9bd7bb5e9bb2.jpg"
    },
    {
        "podcast_id": 99002,
        "title": "Heart to Heart",
        "description": "The podcast that brings you inside King Street to explore the people, their passions, and the programs that make our hearts beat.\n",
        "language": "en",
        "author_name": "Sacred Heart Greenwich",
        "slug": "heart-to-heart-shg",
        "cover": "20220106_110110_82900aece2fc911bb6d7b69f97f8231c.jpg"
    },
    {
        "podcast_id": 100446,
        "title": "Crecimiento DeMente Podcast",
        "description": "Hablamos con expertos en Salud, Sicología, Recursos Humanos, Ventas, Liderazgo, para que tengas un Crecimiento DeMente",
        "language": "en",
        "author_name": "Luis Angel Marín",
        "slug": "luisangelmarin",
        "cover": "20220810_100815_4cb464b7ca0fd5fba7cde3dcb3a58c15.jpg"
    },
    {
        "podcast_id": 101146,
        "title": "MAMÁ SIN LÍMITES",
        "description": "Vero Ale es una mamá de tiempo completo, madre de dos niños; “Pollito”, de 5 años, quien la ha convertido en una mujer todo terreno, llevándola a ver y vivir el mundo desde un lugar muy especial. Y Lucca, de 3 años, que hace que su espacio sea un un campo de batalla pero lleno de colores. Colores que en ocasiones son opocados por las tormentas que así como Vero, cada Mamá enfrenta a diario.\n\nAsí que en este podcast, Vero Ale compartirá contigo su día a día en esta batalla por intentar llevar una “maternidad perfecta”, con la seguridad de que te sentirás muy indentificada con ella, y que juntas, podrán compartir secretos, anécdotas y mucha información para derribar todos los obstáctulos que se presenten y poder demostrar que así como ella, existen muchas Mamás Sin Límites. \n\n¡Bienvenidas!",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "mamasinlimites",
        "cover": "20220116_090144_7eff2c0d2936da449a403c0e33d94d3f.jpg"
    },
    {
        "podcast_id": 101744,
        "title": "EmpowerMe",
        "description": "A podcast developed by teen influencers. These middle and high school students empower their peers to make positive daily choices. Topics include mental health, mindfulness and more. ",
        "language": "en",
        "author_name": "I'm A Star Foundation",
        "slug": "empowerme",
        "cover": "20220118_100131_10e34c83d0224ffe3f2e5c48a100ef8c.jpg"
    },
    {
        "podcast_id": 102065,
        "title": "TYG - The Youth Group",
        "description": "In this podcast, you will find sermons that have been preached at Grace Bible Church's TYG (the youth group), in Pleasant Hill CA. ",
        "language": "en",
        "author_name": "Luke Shelnutt",
        "slug": "tyg",
        "cover": "20220119_100111_1978f7c8605510cabf2a25ab928c32e0.jpg"
    },
    {
        "podcast_id": 105342,
        "title": "The Daddy and Kidz Podcast!",
        "description": "This is our weekly podcast. Just a daddy and his 3 kids under 10 talking about our day.",
        "language": "en",
        "author_name": "Matthew",
        "slug": "daddyandkidz",
        "cover": "20220201_030229_a11c33fb2244963304035262590b5624.jpg"
    },
    {
        "podcast_id": 105392,
        "title": "Гласът на нашите корени",
        "description": "Гласът на нашите корени е подкаст канал, който представя по артистичен, приятен и интригуващ начин известни литературни текстове, голяма част от тях включени в задължителната учебна програма. Текстовете са преплетени с песни събирани по време на нашите етнографски експедиции с цел създаване на една пълнокръвна образност на съдържанието. За основа на всеки епизод използваме един от спектаклите на театрална лаборатория Алма Алтер. Текстовете ще се изпълняват от актьори от Алма Алтер под режисурата на Николай Георгиев. Всеки месец от годината очаквайте по един епизод: \nЯнуари - “Албена” по Йордан Йовков\nФевруари - “Последна радост” по Йордан Йовков\nМарт - “Житие и страдания грешнаго Софрония” по автобиографичния разказ на българския духовник и будител Софроний Врачански\nАприл - “За бащата и за братята”, за живота и идеалите на братята Христо и Евлоги Георгиеви\nМай - “Часът на моето убийство”, за живота и делото на  Стефан Стамболов  по романа на Христо Даскалов\nЮни -  “Дядо Йоцо гледа” по Иван Вазов\nЮли - “По-добре да бъдеш недоволен човек отколкото доволна свиня” по Алеко Константинов\nАвгуст - “Септември” по Гео Милев\nСептември - “Що е отечество” по текстове на Гео Милев\nОктомври -  “Гаврошовци и котета разбойници” по текстове за деца на Гео и Леда Милеви, \nНоември -  “Маргарита и Майстора” по романа на Михаил Булгаков\nДекември - “Мъртвият Дом” по едноимения роман на Ф. М. Достоевски Записки от мъртвия дом. \nПреди всеки епизод ще има и кратък разговор със създателите на епизода, които в един интерактивен диалог ще извеждат основните послания на текста и мостовете му с днешната действителност. Приятно слушане!\nДейностите по проекта \"Гласът на нашите корени\" отразяват единствено гледната точка на автора и Комисията не носи отговорност за използването, по какъвто и да било начин, на съдържащата се в тях информация.\nПроектът се реализира с финансовата подкрепа на Европейски корпус за Солидарност към Европейски съюз",
        "language": "bg",
        "author_name": "Театър-студио 4хс",
        "slug": "glasatnanashitekoreni",
        "cover": "20220201_090215_213b0878ca5e422b0d538d696f4f0693.jpg"
    },
    {
        "podcast_id": 105881,
        "title": "Be Quiet Grown Folk Is Talking",
        "description": "political. community. education discussions ",
        "language": "en",
        "author_name": "Allan Coles",
        "slug": "bequietgrownfolktalking",
        "cover": "20220203_040201_4b8318e3ca73ae6aa8f2de14f8053d96.jpg"
    },
    {
        "podcast_id": 111699,
        "title": "The Teens for Peace Podcast",
        "description": "Using several years of research by youth-led organization Teens for Peace in the Middle East, this miniseries seeks to uncover the opinions, ideas, and experiences of teenagers caught in the middle of the Israeli-Palestinian conflict and use the words of teenagers to craft suggestions for the future of youth peacebuilding in the Middle East. Each episode highlights one question asked by host, 17-year-old Max Hyman from Chicago, to each of over 30 teens from Israel and/or Palestine in interviews and dissects many of the responses and what they reveal over the successes and failures of the peacebuilding system. Episodes end with conclusions from these discoveries and focus on the importance of listening to teen voices. Teens for Peace in the Middle East, founded in 2020, was built by a team of teens looking to make a difference by creating a network of connected teens for a more peaceful future in Israel and Palestine that values the voices of youth, who are young enough to reverse permanent and harmful stereotypes and opinions. In addition to over 30 interviews, teenspeace.org features educational materials for teens to learn about the conflict from an unbiased perspective, and Teens for Peace in the Middle East hosts panels and discussions. The organization is currently planning a PeaceSummit event and is conducting professional research on the successes and failures of the peacebuilding system.",
        "language": "en",
        "author_name": "Maxwell Hyman",
        "slug": "teenspeacepodcast",
        "cover": "20220227_040249_bd38a85b5f3f3a78ac7bdd0a7c663eb8.jpg"
    },
    {
        "podcast_id": 112115,
        "title": "Ready for Reading",
        "description": "United Through Reading is proud to present Ready for Reading, dedicated to helping military families create reading routines that support family connection, help with navigating change, and build literacy skills for military children.\n\nIn this podcast, you'll hear from members of military families as well as\nexperts in the education and child development fields. Gain tips on why reading routines matter to military children, how to read to kids, and tools to help navigate military life, including our United Through Reading app.",
        "language": "en",
        "author_name": "United Through Reading",
        "slug": "readyforreading",
        "cover": "20220228_100210_e818e1ee7302d298f4ad4eca7905061d.jpg"
    },
    {
        "podcast_id": 112756,
        "title": "Aprende 21 idiomas simultáneamente ",
        "description": "Hippo es una organización de origen japonés donde los afiliados adquirimos simultáneamente 21 idiomas sin clases, sin maestros y sin exámenes. \nEn Hippo, el Multilingüismo es nuestro proyecto de vida.",
        "language": "es",
        "author_name": "Club Familiar Hippo",
        "slug": "aprende-21-idiomas",
        "cover": "20220303_060312_0a143867cae56a7565a5019935d12a90.jpg"
    },
    {
        "podcast_id": 113035,
        "title": "Demystifying Latin and Greek: Undead Languages for Living Brains",
        "description": "Dr. Kirsten Jaqua and PhD candidate Anne Phillips, share a passion for teaching Latin and Greek at all levels. This collaborative podcast aims to making learning and teaching ancient languages accessible and fun for all, whether you are a teacher, a parent or a casual learner. In this podcast we explore language-learning approaches and strategies, we review and discuss curricula and resources, and bring in our combined experience to help YOU be the best teacher or learner you can be. ",
        "language": "en",
        "author_name": "Anne Phillips and Kirsten Jaqua",
        "slug": "demystifyinglatinandgreek",
        "cover": "20220811_030831_9108faf222e824e7d8a01c0b11901ea6.jpg"
    },
    {
        "podcast_id": 114160,
        "title": "Saving water, one drop at a time !",
        "description": "Podcast made by kids for kids about the future of our planet and specifically about tips on saving water, ",
        "language": "en",
        "author_name": "Balthazar Marc Eliott Luc",
        "slug": "saving-water-one-drop-at-a-time-podcast",
        "cover": "20220311_020358_531bc6f04c052e53a61b5fae80920b89.jpg"
    },
    {
        "podcast_id": 114957,
        "title": "Reality Check Podcast",
        "description": "Reality Check Podcast, Revitalizing the youth.",
        "language": "en",
        "author_name": "CHARLES R JACKSON",
        "slug": "realitycheckpodcast4",
        "cover": "20220424_030457_ab007e111ae59cf1058a1bf342ede84c.jpg"
    },
    {
        "podcast_id": 115214,
        "title": "GreenTeens",
        "description": "<p>Welcome to the GreenTeens podcast! GreenTeens is a podcast that interviews teens who are making a difference for the planet and leading the movement towards environmental change. The main goal of GreenTeens is to inspire our listeners to get out and make a change for our Earth from hearing others' stories, so they too can become green teens! I'm your host, Colleen McDermott. I am 16 years old and a part of the Miss America's Teen Program. The MAO is not only the leading scholarship provider for young women. They also give young women the platform to advocate for a cause they are passionate about called their Community Service Initiative. My Community Service Initiative is Planet Youth, advocating for the environment to our youth through education, service, and awareness. I hope to be able to share a little inspiration to every young listener to get out and get green through this podcast. I hope you enjoy and thank you for tuning in!</p>",
        "language": "en",
        "author_name": "Colleen McDermott",
        "slug": "greenteen",
        "cover": "20220314_090319_54ccd2c7ad7817eb737bf14cbfe3f141.jpg"
    },
    {
        "podcast_id": 117941,
        "title": "Von Schmetterlingen und Drachen",
        "description": "Von Schmetterlingen und Drachen - der facettenreiche und vielseitige Podcast von Annika Seelenspiel. Fantastische, lichtvolle und manchmal auch dunkle Seelenbotschaften aus dieser und anderen Dimension(en). Hier werden spannende, querdenkende, freigeistige Blickwinkel auf das Leben geboten und Erkenntnisse aus Selbstreflexion, Spiritualität, Achtsamkeit, Trauma- und Schattenarbeit, Pflanzenmedizin und veganem Lifestyle geteilt. Es erwarten dich außerdem heilsame Seelenreisen und Unterhaltungen über neue Ansätze wie wir Bildung im deutschsprachigen Raum nachhaltig revolutionieren können um den Kindern der neuen Zeit einen individuellen, zeitgemäßen und naturverbundenen Start ins Leben zu ermöglichen. \n\nMehr Infos zu Annika Seelenspiel und ihre Arbeit findest du unter www.annikaseelenspiel.com! ",
        "language": "de",
        "author_name": "Annika Seelenspiel",
        "slug": "vonschmetterlingenunddrachen",
        "cover": "20220326_100346_2b6bd037045ee51674d5d0cbe3ccbb30.jpg"
    },
    {
        "podcast_id": 119671,
        "title": "Radio Olive Kids - It's for you..",
        "description": "First time in Doha exclusive channels for Kids to bring out the creativity in them - started by Olive Suno Radio Network.",
        "language": "en",
        "author_name": "Radio Majlis",
        "slug": "olivekids",
        "cover": "20220403_010410_5258eb09a3240ab3d56bf921ee376e81.jpg"
    },
    {
        "podcast_id": 121594,
        "title": "Karınca Bacak ile Dev Yaprak",
        "description": "Sürdürülebilir kalkınma amaçları çerçevesinde TÜBİSAD, TEGV ve TURKCELL İşbirliğinde hazırlanan \"Karınca Bacak ve Dev Yaprak\" kitabı ile \"Döngüsel Elektronikler\" konusunda farkındalık oluşturulması amaçlanmaktadır. \n\"Karınca Bacak'ın yaratttığı \"Eğitime Dönüştür Okulu\" artık ülkenin pek çok yerinde kendisi gibi çocukların eğitimi için kendisi gibi yaşayacaktı. Bu hayatının en güzel günüydü...\"\n\nYazar             : Sebahat Söylemez\nResimleyen   : Gökçe Güvenç\nSelendiren   : Melis Sezen\n\nSürdürülebilir Kalkınma Amaçları Döngüsel Elektronikler Danışmanlar:\n\nTÜBİSAD\nMeltem Bağdatlı\nN. Selen Tanner\nİ. Haluk Onay\nBengisu Evrensel\n\nTEGV\nDevrim Uygan\nPınar Palamutlu\nElif Mert\n\n",
        "language": "tr",
        "author_name": "TÜBİSAD",
        "slug": "karincabacakiledevyaprak",
        "cover": "20220901_120917_ea1d8369a9926d75d19128844800dcd8.jpg"
    },
    {
        "podcast_id": 121817,
        "title": "Jewish Trivia for Kids",
        "description": "Some fun trivia questions around Jewish holidays, customs, and of course, FOOD! ",
        "language": "en",
        "author_name": "Ross Wolman",
        "slug": "jewishtriviaforkids",
        "cover": "20220413_060457_5df7fb0c63729dcc53cd79896bcc9522.jpg"
    },
    {
        "podcast_id": 124223,
        "title": "The Orangutan Podcast",
        "description": "The Orang Utan Republik, a rainforest education and conservation organization, lets you dive into their world of adventures, as host Anthony Porter and Gary Shapiro take a look into what makes the rainforest such a special place. ",
        "language": "en",
        "author_name": "The Orangutan Podcast",
        "slug": "torangutanpodcast",
        "cover": "20220424_060403_8306f098b57cd1b12185c4401da97650.jpg"
    },
    {
        "podcast_id": 125330,
        "title": "The Conifers Podcast",
        "description": "Hello everyone! Welcome to The Conifers Podcast… A space for us to chat about all things in and outside of Conifers School. Whether you’re listening to us in the car on a drive, or watching us in the comfort of your own home, we hope you enjoy being part of the conversation.",
        "language": "en",
        "author_name": "Bounceback Studios",
        "slug": "theconiferspodcast",
        "cover": "20220523_080537_4dd0aea7f90a27af3c355dd07b3c1a5a.jpg"
    },
    {
        "podcast_id": 128315,
        "title": "Buggin Out",
        "description": "Hi! And welcome to “Buggin’ out” A podcast dedicated to all things creepy and crawly. I’m your host Tyler Wiedmeyer a Entomology Master’s student at the University of Delaware here to take you on a journey to the world of insects, arachnids, and all the rest of the ‘bugs’.  ",
        "language": "en",
        "author_name": "Tyler Wiedmeyer",
        "slug": "bugginout",
        "cover": "20220515_060555_dec5f221e652edb4019edd7be5e8ffdc.jpg"
    },
    {
        "podcast_id": 129499,
        "title": "Maraca Learning",
        "description": "A podcast dedicated to discussing topics in the Applied Behavior Analysis science field. Hosted by Robbie El Fattal, Ph.D., BCBA-D, CEO of Maraca Learning. ",
        "language": "en",
        "author_name": "Robbie El Fattal, Ph.D., BCBA-D",
        "slug": "maracalearning",
        "cover": "20220524_030517_9f570a24acb7943b324c2cc79b2653fa.jpg"
    },
    {
        "podcast_id": 131842,
        "title": "Futures",
        "description": "5th Grade APIS Students explore important future technologies and how they may spark new innovation and worldwide change.",
        "language": "en",
        "author_name": "APIS 5th Grade",
        "slug": "apis5",
        "cover": "20220602_040622_5feafbfea36a9f739e8b45d2742ca02d.jpg"
    },
    {
        "podcast_id": 131876,
        "title": "The Branch ",
        "description": "The Branch is a podcast devoted to being a resource for parents who want to raise their kids to thrive, and to know and follow God through all of their life. We cover a wide variety of topics that will help parents gain practical tools to raise their kids so that they become fruitful in their communities and the salt of the Earth. ",
        "language": "en",
        "author_name": "The Branch",
        "slug": "thebranch",
        "cover": "20220610_070653_9ae0972d401fe8eed7dd0cac2c7b9d37.jpg"
    },
    {
        "podcast_id": 133418,
        "title": "Colònies Eix Estels",
        "description": "Podcast sobre les colònies",
        "language": "es",
        "author_name": "Fernando Javier Figueroa",
        "slug": "eixestels",
        "cover": "20220610_090648_46cef7ad032881025e9002a18cb273ca.jpg"
    },
    {
        "podcast_id": 134197,
        "title": "El sendero del hacker",
        "description": "Hablaremos de algunos conceptos y una vida dentro de la computadora",
        "language": "es-mx",
        "author_name": "Sendero del hacker",
        "slug": "sendero",
        "cover": "20220614_030628_59fd0e8b5dda5bb727c13a0cd850e7f2.jpg"
    },
    {
        "podcast_id": 136742,
        "title": "Derecho a la identidad",
        "description": "Los derechos de los niños y uno de los más importantes es el derecho a la identidad, tener un nombre y una acta de nacimiento.",
        "language": "es-mx",
        "author_name": "Rosa María Carranza",
        "slug": "399176",
        "cover": "20220626_070659_5d32ce3c271d17721aba7930712342ec.jpg"
    },
    {
        "podcast_id": 137239,
        "title": "Cuentos narrados",
        "description": "<p>Canción para dialogar</p>",
        "language": "es",
        "author_name": "Gustavo saldaño",
        "slug": "libertad",
        "cover": "20220628_020627_c8b826d6169bd61a6865b8bb97545f38.jpg"
    },
    {
        "podcast_id": 145176,
        "title": "CareerView",
        "description": "<p>CareerView is the podcast where we ask questions students want to know when it comes to pursuing a career path. We ask questions on behalf of students across the country from secondary schools and universities submitted on our CareerView website, what they want to know when it comes to pursuing their dream job.</p>",
        "language": "en",
        "author_name": "Career Advice Podcast ",
        "slug": "careerview",
        "cover": "20230614_090655_ab35726231a05561889930cb4c7f73fe.jpg"
    },
    {
        "podcast_id": 147306,
        "title": "Trivia with Dad",
        "description": "<p><strong>The Sassy and Classy Trivia Podcast.</strong></p><p><strong>Turn the drive into quality time with your family.</strong></p><p>Trivia with Dad is a family friendly trivia show with 4 different topics each episode.</p><p><strong>Support the show by rating and reviewing!</strong></p><p>Email <a href=\"mailto:Triviawithdad@gmail.com\">Triviawithdad@gmail.com</a> to submit topics, ask questions or interact with us in any way.</p>",
        "language": "en",
        "author_name": "Brian Graziano",
        "slug": "triviawithdad",
        "cover": "20230608_090639_885fd6b60f4086abf3d85c84c8befc9d.jpg"
    },
    {
        "podcast_id": 148680,
        "title": "The Wright Compassion for Youth",
        "description": "<p>Mrs. Wright always gives great words of wisdom that will push you through the day or current situation! Listen in and feel lifted, empowered, and motivated to be the amazing human you were destined to be!</p>",
        "language": "en",
        "author_name": "aywrightcounseling@gmail.com",
        "slug": "thewrightcompassionforyouth",
        "cover": "20230625_110646_dbbaead787ddf500540b3efe9ec2a6be.jpg"
    },
    {
        "podcast_id": 149787,
        "title": "Youth Inc - a new way to learn",
        "description": "Youth Inc. is a new learning alternative designed for young people aged 17-24.\n\nThis podcast is made by them, for them.",
        "language": "en",
        "author_name": "Youth Inc",
        "slug": "youthinc",
        "cover": "20220830_120856_aba5ea140fa9cecd991ee6e6da73e83a.jpg"
    },
    {
        "podcast_id": 151166,
        "title": "Kids Two Kids",
        "description": "Coleman (6), Vaughn (4), and Grampa explore lots of stuff that kids care about. Sports, games, toys, family, pets, health topics are all on the table to be discussed through the eyes and lives of kids.\n\nWe have special guests from to time and even some surprises. Kids from 4 to 10 will enjoy these episodes.\n",
        "language": "en",
        "author_name": "Kevin Wixom",
        "slug": "kidstwokids",
        "cover": "20220909_040921_92d1c6a2acb051cfe8a8b998113b2777.jpg"
    },
    {
        "podcast_id": 152331,
        "title": "The Morning Lesson - Waldorf Stories for the Classroom or Home",
        "description": "The Morning Lesson is a storytelling podcast for children in kindergarten through 5th grade. These stories I use in my Waldorf classroom and build all my lesson plans around the characters and elements in the stories. \n\nFollow me on Patron for lesson plan ideas. ",
        "language": "en",
        "author_name": "Laura Keys",
        "slug": "themorninglesson",
        "cover": "20220909_060954_27cae89237fe412b59f67cf1b35e521c.jpg"
    },
    {
        "podcast_id": 152904,
        "title": "Breakfast With Barnette",
        "description": "Dr. Shane Barnette, Superintendent of the Cullman County, Alabama school system, sits down for breakfast conversation with students, faculty, and staff across Cullman County Schools to highlight the great things going on in our school system.",
        "language": "en",
        "author_name": "Dr. Shane Barnette",
        "slug": "breakfastwithbarnette",
        "cover": "20220912_020958_e70499e948efd73c8e6d723d1593c692.jpg"
    },
    {
        "podcast_id": 153348,
        "title": "ΟΛΥΜΠΟΣ Πρώτα Βήματα",
        "description": "Η ΟΛΥΜΠΟΣ Παιδικό και η Κάρμεν Ρουγγέρη παρουσιάζουν τις περιπέτειες των Θεών του\nΟλύμπου σε μια σειρά από λαχταριστά παραμύθια.\nΑνακαλύψτε τι σκαρώνουν οι μικροί μας φίλοι στο βουνό του Ολύμπου.\nΗ ιστορία μας ξεκινά…μαζευτείτε!",
        "language": "el",
        "author_name": "ΟΛΥΜΠΟΣ Πρώτα Βήματα ",
        "slug": "tokouvertakitismiterasgisolympos",
        "cover": "20220914_070921_c77d30aa7a004092f1a5fe6bf57b6742.jpg"
    },
    {
        "podcast_id": 154124,
        "title": "Тардиграда на проводе",
        "description": "Podcast of the school Nomadic Tardigrade",
        "language": "ru",
        "author_name": "Sophya Welle",
        "slug": "nomadictardigrade",
        "cover": "20220917_060958_dc106ad1285c4f6735034825ee2fbc78.jpg"
    },
    {
        "podcast_id": 155743,
        "title": "Successfully Speaking",
        "description": " “Successfully Speaking” hosted by Jessica Courtney-Rivera Owner/Operator of Lotus Family Education Center and Homeschool mom of 3 along with Tyler Smith-Barbosa Owner of The Apothecafery  and Homeschool Mom of 2. \nThese two good friends homeschool their children while maintaining their families and growing their businesses.\n “Successfully Speaking” Podcast is a lifestyle podcast featuring discussions of homeschool, motherhood, marriage, entrepreneurship and how to balance it all as Jessica and Tyler share tips, tricks and juicy girl talk!!!\n",
        "language": "en",
        "author_name": "Jessica Simone Courtney-Rivera and Tyler Smith-Barbosa",
        "slug": "sucessfullyspeaking",
        "cover": "20220925_030943_6db92e86d4e1cfcbbcffec042c85450d.jpg"
    },
    {
        "podcast_id": 156346,
        "title": "TATA BAJA",
        "description": "TATA BAJA to projekt non-profit. Jego celem jest popularyzacja czytania bajek dzieciom i inspiracja innych rodziców do podejmowania podobnych działań. \n\nAutorem projektu jest podcaster, bez doświadczenia profesjonalnego lektora i umiejętności aktorskich, ale z ogromną chęcią sprawienia przyjemności swojemu synowi Gabrielowi i dzieciom znajomych, przyjaciół, czy innych słuchaczy. \n\nBajki czyta Andrzej Wierzchoń, który chce udowodnić, że można czytać bajki z czystej pasji i chęci sprawienia innym radości.",
        "language": "pl",
        "author_name": "Andrzej Wierzchoń",
        "slug": "tatabaja",
        "cover": "20221022_111058_b1f89344c2b46f877ce80ee6a23337ef.jpg"
    },
    {
        "podcast_id": 156436,
        "title": "Youth Yarn - Weddin Shire",
        "description": "What's happening in the Weddin Shire? A podcast for all ages, our community shares their stories, ambitions, and adventures. Join us for some fun listening and contact us at weddinspt@gmail.com if you would like to share something exciting, informative, or interesting in future episodes!",
        "language": "en",
        "author_name": "Weddin Shire Community",
        "slug": "youthyarnweddinshire",
        "cover": "20230206_100252_0bfe5ed2d15f520241f7857bff81ec98.jpg"
    },
    {
        "podcast_id": 156672,
        "title": "Mighty Girls",
        "description": "Welcome to Mighty Girls. I’m your host Sarah, founder of Lava Tribe. This podcast is dedicated to girls who are achieving great things in their sports, despite the challenges that lead 55% of girls to drop out by the age of 17.\n\nOften it's not because they don't like sport anymore either. It's other things. It might be juggling sport with schoolwork or grappling with changing bodies and managing periods. \n\nOn each episode of Mighty Girls, we chat about highs and lows, what the girls have done to last the distance and we discuss how sport has helped them in other areas of their lives. I also talk to their parents, coaches, and other health care and sports professionals for tips, advice and insights on how we can keep girls engaged in sport. \n\nJoin me on my mission to keep girls moving. \n\nhttps://www.lavatribe.com.au\n\nWant to arm yourself with more information around the causes of sports disengagement among girls?\n\nWomen in Sport, a not-for-profit that campaigns to transform sport for the benefit of every woman and girls, has developed ‘8 Principles for Success’. They’re the key steps in minimising the barriers girls experience so they can make sport and exercise a more meaningful and exciting prospect in their lives.\n\nRead more in the full report (March 2022) (https://www.womeninsport.org/.../Tackling-Teenage...). It's from the UK but the findings are pretty much a carbon copy of results of similar research on young Australian girls.",
        "language": "en",
        "author_name": "Lava Tribe",
        "slug": "mighty-girls",
        "cover": "20220929_030944_d916155a8b65af8687d0f175cd9bb372.jpg"
    },
    {
        "podcast_id": 157159,
        "title": "Roxy Raves",
        "description": "A child friendly, short, fun, light hearted podcast where children talk and answer questions on todays topics. ",
        "language": "en",
        "author_name": "Foxy Studios",
        "slug": "foxystudios",
        "cover": "20221002_051054_2b478a65d821517d15931dfac7f100c3.jpg"
    },
    {
        "podcast_id": 158295,
        "title": "Storytelling with Sarita ",
        "description": "An interactive ASMR platform to share storytelling in Spanish and English.",
        "language": "en",
        "author_name": "Sara",
        "slug": "saritaasmr",
        "cover": "20221005_081018_2c08d17234ccf1f674af5efe3191e124.jpg"
    },
    {
        "podcast_id": 158683,
        "title": "Paidoscast",
        "description": "Bienvenidos al podcast del Colegio Paidos Villahermosa",
        "language": "es-mx",
        "author_name": "Colegio Paidos",
        "slug": "paidoscast",
        "cover": "20221007_021031_ecae81412cbc1c5da8b76d6d65b8dc14.jpg"
    },
    {
        "podcast_id": 159371,
        "title": "LCCA Celebrates!",
        "description": "This podcast provides news and events to the families at Legacy Classical Christian Academy. ",
        "language": "en",
        "author_name": "Belinda Henson",
        "slug": "legacy-classical-celebrates",
        "cover": "20221010_091007_7348095398e80b50e97d91b2a02fe4f2.jpg"
    },
    {
        "podcast_id": 159418,
        "title": "Emma I Dyrenes Verden",
        "description": "Vidste du, at verdens stærkeste dyr er en bille? At geder har dialekter? Eller at der findes en flagermus der ikke vejer mere end 2 gram? Alt det, og meget mere kan du blive klogere på i Emma i Dyrenes Verden, en podcast om verdens mange dyr, lavet i en højde, hvor alle kan være med.\n\nBag podcasten sidder Emma, en 23 år ung og farverig biologistuderende med en brændende passion for dyrenes verden. Emma har nørdet dyr siden hun var barn og fascinationen for dyreriget, er over tiden ikke blevet mindre.\n\nFølg med, og se billeder af alle dyrene på Instagram: @emma.i.dyrenes.verden",
        "language": "da",
        "author_name": "Emma Jensen",
        "slug": "emmaidyrenesverden",
        "cover": "20221010_111052_95b0717b6e04b1a37fd0633a35399555.jpg"
    },
    {
        "podcast_id": 160415,
        "title": "Music Explained for Teens",
        "description": "Flo and Isabel look into the past eras and decades of music with the intent of explaining music for teens, by teens. In this podcast, they combine their last two brain cells to help you understand the past of music.",
        "language": "en",
        "author_name": "Flo and Isabel",
        "slug": "musicexplainedforteens",
        "cover": "20221014_071016_030d29e6aaf45917f3671f24fe532ee7.jpg"
    },
    {
        "podcast_id": 161095,
        "title": "Sustainability with Soren by SustainableMe!",
        "description": "<p>Join us every week when Soren Wattamwar, SustainableMe's kid expert tackles important sustainability topics in less than 5minutes. Check out www.SustainableMe.Today for more content on how to incorporate sustainability into your daily lives.</p>",
        "language": "en",
        "author_name": "Soren Wattamwar",
        "slug": "sustainablesoren",
        "cover": "20230718_020701_3027b2e1e6d1af3ff643e46ff4a4ee3a.jpg"
    },
    {
        "podcast_id": 162567,
        "title": "This Week in College Viability",
        "description": "Imagine your college student calls home in a panic.  Their college just announced it is about to close - for good.   \n\nHow do you avoid this story happening to you?\n\nMany private colleges have recently closed and it is likely many more will close.  \n\nOur College Viability App shows which ones are more likely to do so.   Don't let your student choose a financially unhealthy college and lose lost credits, lost time and lost money if it closes.  We have done all the work to let you compare the financial health of these colleges and choose one that will have the resources to provide your student with a solid education.\n\nAs a former college administrator, I have seen first-hand the financial challenges that too many private colleges face and have chosen not to share with you.\n\nThe College Viability App enables students, parents, leaders and others to compare the changes in a private colleges’ finances, enrollment, and outcomes over a recent period of 6 years.\n\nFor families this information lets them make more informed decisions about their college choice -- limiting the risk choosing a one whose financial results suggest viability concerns in the coming months and years.\n\nFor higher education leaders, the App provides comparative data about competitors and potential merger or alliance partners.\n\nHere is a YouTube link showing how to use the College Viability App.  https://bit.ly/3jGXA9t\n\nHere is the full College Viability YouTube channel.   See if a college you are considering is reviewed for financial health and viability.    https://bit.ly/3DLq7mr\n\nIf you want to get updates to your inbox, go to   https://www.collegeviability.com/institute-lead-magnetj5cyzcmf \n\nAt CollegeViability.com, we have also developed a curated site about private colleges and higher education.  It serves as a single source for timely news about the challenges of both.\n",
        "language": "en",
        "author_name": "Gary Stocker",
        "slug": "twicv",
        "cover": "20221023_021047_741376d0cc56ed28a0a7aed2414c1b5e.jpg"
    },
    {
        "podcast_id": 163781,
        "title": "CEA Colegio Inglés Ciudad Juárez",
        "description": "Podcast de educación, Pedagogía, Información y oferta educativa de Colegio Inglés Ciudad Juárez",
        "language": "es",
        "author_name": "CEA Colegio Inglés Ciudad Juárez",
        "slug": "ceacolegioinglesciudadjuarez",
        "cover": "20221028_111024_bef0a68f85e949ca628b432b4935b020.jpg"
    },
    {
        "podcast_id": 164871,
        "title": "STEP Devotionals",
        "description": "<p>Help your whole family focus your hearts and your minds on Jesus with these short devotional podcasts. Each episode will lead your family through a discussion question, passage from scripture, and prayer by taking a \"STEP\": Stop- and be in the presence of God Talk- about a family discussion question Explore- a passage from God's Word Praise God- with a memory verse and prayer. Listen in car, before bed, at the dinner table, or however works best for your family! We hope these devotionals will help your whole family walk in faith together. -Crossing Kids Team</p>",
        "language": "en",
        "author_name": "Crossing Kids",
        "slug": "step-devotionals",
        "cover": "20230210_020212_ea69bee572779465feef8c430f0d25a6.jpg"
    },
    {
        "podcast_id": 165907,
        "title": "HERvolution",
        "description": "A piece of herstory to our story; getting to know the women that were deemed too radical because of their ideas. How we have so much to learn by the courage of other women that fought for their voices and spaces in a male dominant society.\nwww.hervolutionpodcast.com",
        "language": "en",
        "author_name": "Clara Lopes",
        "slug": "hervolution",
        "cover": "20221117_031145_969bb691fabbf11b3f6498ced223e470.jpg"
    },
    {
        "podcast_id": 166198,
        "title": "Jack & Suzy Come Follow Me for Kids and Family scripture time",
        "description": "In these  Come Follow Me for Kids stories Jack & Suzy learn about the Old Testament and how to apply it into their lives today.  These Bible videos for primary children teach basic principles of the Gospel of Jesus Christ.  Come Follow Me for Kids and families",
        "language": "en",
        "author_name": "Jessica M Francis",
        "slug": "familyscriptures",
        "cover": "20221107_091122_49f81290a812961ce2d102bd6bda699b.jpg"
    },
    {
        "podcast_id": 166395,
        "title": "Hippo & Friends type 1 diabetesfonds podcast",
        "description": "Welkom bij de Hippo & Friends podcast. \n\nIn deze podcast behandelen we thema’s die belangrijk zijn voor mensen met type 1 diabetes. Type 1 diabetes is een chronische auto-immuunziekte die ongeveer 50 000 Belgen treft. Met het Hippo & Friends type 1 diabetesfonds creëren we meer bewustzijn, dragen we bij tot projecten voor meer levenskwaliteit en steunen we wetenschappelijk onderzoek. ",
        "language": "nl",
        "author_name": "Hippo & Friends type 1 diabetesfonds",
        "slug": "hippoandfriends",
        "cover": "20221108_031100_9b201f5f5abc697ca57ff1f57d966473.jpg"
    },
    {
        "podcast_id": 166941,
        "title": "#SMWay Podcast ",
        "description": "We can all learn something, right? The #SMWay podcast answers questions from South Milwaukee parents about education, how the school district operates, what challenges are in front of us, and what we as a community can do about it. When we're not answering parent questions, we're sharing what's best about our schools - our student successes, and our teachers' dedication. ",
        "language": "en",
        "author_name": "Daniel Bader",
        "slug": "smway",
        "cover": "hotlinked-removed-1706f6082c6b9b93303894e4f9b771fd20221122_061146_fa7030acb9fd6a4894155bc1455c3953.jpg"
    },
    {
        "podcast_id": 167537,
        "title": "Bethany Bible Study",
        "description": "Explore the Bible with Bethany House of Worship, Philadelphia, USA",
        "language": "en",
        "author_name": "Bro. Philip Russel",
        "slug": "bethanybiblestudy",
        "cover": "20221113_021142_e983a3cbef5cbf29dfd8e2f8049c1d8e.jpg"
    },
    {
        "podcast_id": 170383,
        "title": "Educación con E de Escolapias",
        "description": "Escolapias inicia una serie de podcasts sobre educación, porque educación se escribe con E de Escolapias. Aquí compartiremos ideas, consejos... sobre crianza y educación.",
        "language": "es-mx",
        "author_name": "Escolapias",
        "slug": "escolapias",
        "cover": "20221125_111142_7733001f44b12cbf9a8adcbd666b8125.jpg"
    },
    {
        "podcast_id": 171699,
        "title": "EL CAMBIO CLIMATICO ",
        "description": "cuatro alumnos del plantel 61  hablando sobre el cambio climático ",
        "language": "es-mx",
        "author_name": "belem efrat collar martinez ",
        "slug": "el-cambio-climatico-grupo-307-4i",
        "cover": "20221201_121258_bcbd9eabb97733a95854f546708f0d59.jpg"
    },
    {
        "podcast_id": 172674,
        "title": "Girls Tech Show",
        "description": "Girls Tech Show is a monthly series for girls to have peer-to-peer conversations about technology, social media, and issues that affect them. The girls discuss topics relevant to digital policy, campaigns, gender biases and stereotypes, the digital gender gap, misinformation and disinformation, digital technologies, and the intersection of technology across other issues. Girls Tech Show is a platform for girls to raise their voices, inspire each other and speak about their experiences related to technology. ",
        "language": "en",
        "author_name": "Plan International",
        "slug": "girlstechshow",
        "cover": "20230111_050145_aba606065bc2c640024c648bcbfce137.jpg"
    },
    {
        "podcast_id": 172755,
        "title": "They'll Be Fine ",
        "description": "“She’s smart and things come easy for her. Why would she need additional services? She’ll be fine!” \n\nSound Familiar? \n\nTime and time again we hear “they’ll be fine, they’re smart, they’re already ahead of the game” when people refer to gifted learners. Because of this sad misconception, too many students fail to reach their potential because they do not receive appropriately challenging curriculum and services. The National Association for Gifted Children (NAGC) reports that 73% of teachers agreed that, “Too often the brightest students are bored and under-challenged in school. - we’re not giving them a sufficient chance to thrive.” \n\nOur nation’s education policies narrowly focus on the achievement gap for struggling learners, which is extremely problematic for the widening “excellence gap” faced by high-ability students. Most regular classroom teachers do not receive adequate training to recognize and address the needs of high-ability learners. This is even more pronounced for children of color, English Language Learners, and children from low-income backgrounds. In addition, these teachers are under a prohibitive amount of pressure to close the achievement gap of their struggling students; while this is an important measure, it shouldn’t be at the expense of our gifted and talented students. \n\nHere at NCAGT we believe that it is up to us, as parents, educators and stakeholders to provide the gifted community the support that they rightfully deserve.  Listen to “They’ll Be Fine’ to learn more about what you can do to ensure that your Gifted and Talented Scholars are provided the resources they need to thrive. \n\nWe're here because the saying “they’ll be fine” just isn’t good enough. \n\n----------------------------------------------------------------------------------------------------------------\n\nPlease complete this form (https://forms.gle/6GxhA3e9no1k6P4t6) to receive your professional development certificate for the ‘They'll Be Fine’ podcast. Please note that NCAGT is not a credit-granting agency and therefore, we encourage you to check with your administration to determine if your participation will count toward continuing education requirements.",
        "language": "en",
        "author_name": "NCAGT",
        "slug": "ncagtpodcast",
        "cover": "20221206_011243_3badaaed7d5b9290215999b504d3dc93.jpg"
    },
    {
        "podcast_id": 173812,
        "title": "The stupid opinion of teenagers",
        "description": "<p>Two teenagers talking about interesting topics. If you want an experts opinion you've come to the wrong place. Our instagram is the_stupid_opinion_of_teenager. Donations will go to Save the children. https://www.savethechildren.org.uk . Its also on our web page on RSS.com.</p>",
        "language": "en",
        "author_name": "William Jones and Jemima Mcvittie. ",
        "slug": "the-stupid-opinion-of-teenagers-podcast",
        "cover": "20230901_080937_817c6d325e1ad8895d1cc0346c269662.jpg"
    },
    {
        "podcast_id": 174651,
        "title": "Personne Extraordinaire",
        "description": "Personne Extraordinaire is a series of inspiring conversations with people who have achieved extraordinary feats with their exceptional grit and perseverance. More importantly, they have helped uplift others along the way and encouraged them to maximise their potential! Hosted by Zehn Kashyap a young student with special needs who is an internationally published writer, an award winning speaker and a passionate advocate for de-stigmatizing disability and differentness!",
        "language": "en",
        "author_name": "Zehn Kashyap",
        "slug": "personne-extraordinaire-by-zehn-kashyap",
        "cover": "20221215_071216_6ff4bf1810d43f0c4016954ae02958a3.jpg"
    },
    {
        "podcast_id": 176575,
        "title": "🐥 Radio Pollito 🐇 ",
        "description": "Bienvenidos a Radio Pollito. 🐣 \n\nEs una serie de 21 cápsulas radiofónicas que hablarán sobre la alimentación infantil en la segunda infancia la duración de cada cápsula es de 4:40 seg. Los conductores serán Pollin P. Chuga y Con Lechuga.\nEn ellas vamos a poder entrevistar a diferentes alimentos como: al chocolate, la hamburguesa, la leche, la tortilla, el chile, el frijol, el refresco y al Dr. Filete. \nRealizaremos la preparación de platillos divertidos y fáciles, diremos cuentos, fabulas, chistes, adivinanzas, realizaremos preguntas a polloamigos, diremos algunos top 5 de interés y revelaremos algunos mitos sobre los alimentos. \n\n 🐥 Come nutritivo con alimento divertido 🐰 ",
        "language": "es",
        "author_name": "Alejandro Maldonado Orduña ",
        "slug": "radiopollito-6-donhamburgueso",
        "cover": "20230118_100112_d4eec9d2a15befd71630e08b04c0b53a.jpg"
    },
    {
        "podcast_id": 178681,
        "title": "NYC Digital Media Center",
        "description": "<p>NYC Digital Media Center is a first-of-its-kind, radio, ​television, and production studio that also provides a community space for education, training and facilitating community programming. Participants and students can acquire employable skills in broadcasting and television while having the option of earning certification that can be applied to long-term education solutions. Our members are given the opportunity to work with state-of-the-art equipment, local multidisciplinary leaders and our community partners.</p>",
        "language": "en",
        "author_name": "NYC Digital Media Center",
        "slug": "nycdmc-season-1-ep-1-tannisha-middleton-interviewed-by-amanda-ruff",
        "cover": "20230622_040638_e1ee3010c4b6fa1c700a3662e4e8c4e0.jpg"
    },
    {
        "podcast_id": 180254,
        "title": "Mañana es lunes",
        "description": "Mañana es lunes, un podcast de Música y Pedagogía escrito y presentado por Eugenia Arús. \nUn programa de radio semanal emitido por Bellaterra Música Ed para motivar y dar valor, a toda la labor que desempeñan los maestros de música, en su día a día, y un punto de encuentro distendido para compartir con los profesionales de la educación y con todos aquellos que quieran escucharnos.\nSon reflexiones y propuestas creadas por la Dra. Eugénia Arús en el marco del Aula de Didáctica que la lidera en el Musical de Bellaterra dentro del Máster en Pedagogía de la Música y el Movimiento que ofrece la Universidad Ramon Llull-Blanquerna y El Musical dentro de su programa de formación permanente para maestros.",
        "language": "es",
        "author_name": "Bellaterra Música - Eugenia Arús",
        "slug": "bellaterramusica",
        "cover": "20230124_090120_114c016897cba0d29c991cc05f14cfca.jpg"
    },
    {
        "podcast_id": 181486,
        "title": "Bedtime Stories with Dad",
        "description": "As a dad to three amazing kids, I love ending the day with tucking them in to bed and reading them all a bedtime story.\nIn this podcast we want to share some of our favorite stories with you all at home.\nSo get tucked in and ready for a nice Bedtime Story with Dad.",
        "language": "en",
        "author_name": "Dad",
        "slug": "bedtime-stories-with-dad",
        "cover": "20230118_030159_63d312b7c84f02700224e8f67a5c8a0e.jpg"
    },
    {
        "podcast_id": 181971,
        "title": "The State of State Schools",
        "description": "<p>The State of State Schools is a weekly podcast recapping some of the most important headlines in education—from a Christian perspective. The goal is to help keep teachers, parents, and homeschool families up-to-speed on the state of our kids’ schools. John Stamper is a former homeschooler, former public school teacher, and author of the book \"Conflicted: Pulling Back the Curtain on Public Education.\" His homeschool background, coupled with his experience teaching in the nation’s third largest public school system, provide a unique perspective on education that parents and teachers will want to hear. </p><p>Twitter: @thesosspodcast. </p><p>Instagram: thestateofstateschools</p><p>YouTube:  <a href=\"https://www.youtube.com/playlist?list=PL9PXMwAv4_RcVXknCBY1BfyhsuPCawSR0\">https://www.youtube.com/playlist?list=PL9PXMwAv4_RcVXknCBY1BfyhsuPCawSR0</a> </p>",
        "language": "en",
        "author_name": "John Stamper",
        "slug": "thesosspodcast",
        "cover": "20230124_010124_817e663faf8a968d3b25a4f2713c3c19.jpg"
    },
    {
        "podcast_id": 182084,
        "title": "Rewind Podcast",
        "description": "We love to share the gospel of Jesus with children. We share how to love Jesus, love people and love life in a way that brings glory to God.\nSubscribe to get notification every time a new episode is released.",
        "language": "en",
        "author_name": "Liberty Kids South Africa",
        "slug": "lkrewind",
        "cover": "20230120_110138_edd660c800575af2affb8fb4566be516.jpg"
    },
    {
        "podcast_id": 182551,
        "title": "The Brothers in Faith",
        "description": "Our main goal is about our faith. We share what we received, and we talk about our transmission of faith. We try to see how we can involve parents, young people and children in this way. We will offer some patterns to the parents and young people. The dream parents/children can be achieved. We will talk about education of faith and other topics. ",
        "language": "en",
        "author_name": "Saint Joseph Astoria Radio",
        "slug": "saint-joseph-astoria-radio",
        "cover": "20230122_040123_87d749f6ae6afcedced7835817d1ebcd.jpg"
    },
    {
        "podcast_id": 185279,
        "title": "Meditação para Crianças e Famílias",
        "description": "Através desse podcast iremos trazer meditações para o dia-a-dia das crianças e famílias! \nRespirem fundo e aproveitem!\n\nAtivem as notificações para receber as novas meditações e sigam o Instagram @meditacaoparacriancas para mais informações e novidades!",
        "language": "pt-br",
        "author_name": "Amanda Lieuthier",
        "slug": "meditacaoparacriancas",
        "cover": "20230201_080208_9785b158006e57c5946f0f7e6361cd34.jpg"
    },
    {
        "podcast_id": 186046,
        "title": "Storypillar",
        "description": "<p>Storypillar is a podcast for kids and their grownups. Together with Sneak, Bean, and Meg, we’ll tackle the sticky situations kids face as they grow and change. To guide us, we’ll explore stories from all over the world and pick up advice from our listeners along the way. If you're interested in...  </p><p>Stories and using your imagination,  </p><p>Learning about new places and perspectives,  </p><p>Laughing and being silly,  </p><p>Having a space to process big feelings and social emotional challenges,  </p><p>Getting advice from real, live (and very smart) kids</p><p>...then Storypillar is for you! We can't wait to say \"Hey!\" and find our way together.  </p><p><strong>Website:</strong> <a href=\"http://www.storypillar.com\">www.storypillar.com</a>   </p><p><strong>Instagram:</strong> <a href=\"https://www.instagram.com/storypillar\">@storypillar  </a></p><p><strong>Support us on Ko-fi:</strong> <a href=\"https://ko-fi.com/storypillar\">https://ko-fi.com/storypillar</a>  </p><p><strong>Contact:</strong> <a href=\"mailto:info@storypillar.com\">info@storypillar.com</a>  </p><p><strong>Created, Written, and Produced by:</strong> Meg Lewis</p>",
        "language": "en",
        "author_name": "Meg Lewis",
        "slug": "storypillar",
        "cover": "20230204_050242_ad8ad91412027ae0ae3db2e0411e5fde.jpg"
    },
    {
        "podcast_id": 187431,
        "title": "Cotorreando en el recreo",
        "description": "🎧 ¡Bienvenidos a nuestro podcast hecho por estudiantes de secundaria! 🎓 Aquí compartimos nuestras opiniones, proyectos y perspectivas sobre temas que nos importan. 💬 Desde la vida escolar hasta la cultura, la tecnología y la ciencia, cada episodio es una oportunidad para aprender y conectarnos con otros jóvenes. ¡Únete a la conversación y amplía tus horizontes! 🌎 #PodcastSecundaria #Aprendizaje #Jovenes #Escuela #cotorreandoenelrecreo",
        "language": "es",
        "author_name": "Carlos Prado",
        "slug": "cotorreando-en-el-recreo",
        "cover": "20230207_110209_f6d947e3bc4a1e420b2e9460a2def9ff.jpg"
    },
    {
        "podcast_id": 187469,
        "title": "Podcast de las y los alumnos del Colegio Eugenio Garza Sada",
        "description": "<p>Diferentes trabajos y proyectos de interés general, elaborados por las y los alumnos, en colaboración con sus docentes. </p>",
        "language": "es",
        "author_name": "Alumnos Colegio Eugenio Garza Sada",
        "slug": "alumnoseugeniogarzasadaoaxaca",
        "cover": "20230308_080337_8c3e7564b55f083273961e9263d9f38d.jpg"
    },
    {
        "podcast_id": 187686,
        "title": "Billie Atoms Adventures - Stories For Amazing Human Beings",
        "description": "<p>More at <a href=\"http://billieatoms.com\">billieatoms.com</a></p><p>Suitable for all ages 5 to 105. Inspiring amazing human beings.</p><p>Listening to audio stories and sounds is one of the most powerful tools parents have at their disposal. Audio stories can stimulate your child's imagination, creating a peaceful atmosphere that promotes relaxation and sound sleep.</p><p>Each episode ends with Billie drifting off to sleep and a guided meditation to help your child sleep.</p><p>Our stories are boring enough to promote sleep but engaging enough to want to listen again.</p><p>Produced by billionsofatoms</p><p>For more content visit us at <a href=\"https://billieatoms.com/\">Billie Atoms – Inspiring Kindness</a></p>",
        "language": "en",
        "author_name": "Billions Of Atoms",
        "slug": "billieatoms",
        "cover": "20230517_030545_a4875db0dc95a0b792e5d876d28bd945.jpg"
    },
    {
        "podcast_id": 188357,
        "title": "Ascendance Kids World",
        "description": "Join us as we share anything and everything Ascendance Kids World related. These include stories, experiences of our time teaching kids, what we do in the classroom, personal reflections, truthful sharings and some tips and tricks that you may find useful or can relate to.",
        "language": "en",
        "author_name": "Harjas & Caroline",
        "slug": "ascendancekids-world",
        "cover": "20230210_040223_cc33cf9640fa7dca219a54ef5f6c5ee5.jpg"
    },
    {
        "podcast_id": 188885,
        "title": "Creating Space with Dr. Bell ",
        "description": "<p>Join Dr. Bell as she helps us create spaces for children to succeed on their educational journey. Helping children to navigate these spaces is one of Dr. Bell's superpowers. Let a trusted educational thought leader provide you with key strategies to support your child, family, or organization.</p>",
        "language": "en",
        "author_name": "Dr. Joy Bell",
        "slug": "gracespaceconsulting",
        "cover": "20230309_020343_9564a2821bb1a460de0c33e5388ddc5e.jpg"
    },
    {
        "podcast_id": 189044,
        "title": "书在起跑点——绘本的启发",
        "description": "<p>嗨，您好。</p><p>欢迎您走进 “书在起跑点——绘本的启发”。这是 Berries 百力果特别为您呈现的绘本分享平台。</p><p>除了带给您精彩的绘本故事，我们也特别邀请资深教育工作者与我们分享相关绘本带给我们的启发。让我们一起加油，成为更好的自己，也成为更懂孩子的家长。</p><p>Welcome to “Once Upon a Book: Stories that Inspire”, a podcast series by Berries dedicated to sharing timeless stories from picture books that will take you on a journey to other worlds. </p><p>Our podcast will also feature special guests from the education industry who will share their insights and experiences on how stories can inspire us to become our best selves and be the best gift to our children.</p>",
        "language": "zh",
        "author_name": "Berries 百力果",
        "slug": "berriesworldsg",
        "cover": "20230220_080213_deb6070913f649bea72e77e29d952f5a.jpg"
    },
    {
        "podcast_id": 189858,
        "title": "DYRC m&m's PODCAST",
        "description": "<p>Dungannon Youth resource centres podcast.</p>",
        "language": "en",
        "author_name": "Michael Devlin",
        "slug": "dyrcmandmspodcast",
        "cover": "20230327_060344_131dd1e1680a42c6246f08382ef5f3b6.jpg"
    },
    {
        "podcast_id": 192298,
        "title": "DON PURO CUENTO",
        "description": "<p>Una producción de aficionados a los cuentos infantiles en donde podremos escuchar dramatizaciones de cuentos conocidos o no tan conocidos en la voz de creadores de contenido que tienen muchas ganas de relatar estas historias a través de la vida de Don Puro Cuento, una persona mayor que disfruta pasar tiempo platicando con su nieto y su conciencia.</p>",
        "language": "es-mx",
        "author_name": "SANTIAGO YAÑEZ SANCHEZ",
        "slug": "donpurocuento",
        "cover": "20230225_060208_51048333525a2dc85caf03454310ba20.jpg"
    },
    {
        "podcast_id": 195471,
        "title": "Milken Community School Podcast ",
        "description": "<p>Welcome to the Milken Community School podcast, where we dive into the rich history and vibrant culture of this exceptional institution. As one of the premier independent schools in the Los Angeles area, Milken Community School is home to a diverse and dynamic community of students, teachers, and stakeholders who are passionate about education, innovation, and making a positive impact on the world.</p><p>In this podcast, we will bring you conversations with members of our community, exploring their unique perspectives and experiences. From current students and faculty to alumni and community partners, we will delve into the stories and insights that make Milken Community School such a special place.</p><p>With a history spanning over 30 years, Milken Community School has evolved into a nationally recognized leader in education, providing an exceptional academic program that prepares students for success in college and beyond. Through our podcast, we aim to highlight the incredible achievements of our community members, while also providing an inside look at the day-to-day life on our campus.</p><p>So join us as we explore the rich tapestry of Milken Community School, and get to know the people who make this institution such a vibrant and inspiring place to learn and grow.</p>",
        "language": "en",
        "author_name": "Milken Community School",
        "slug": "milkencommunityschool",
        "cover": "20230308_060339_aa1fd33020d9c9e11735761035c3dfa3.jpg"
    },
    {
        "podcast_id": 197309,
        "title": "Elevate Yourself to Elevate the World! ",
        "description": "<p>Laili Bialo age 14, interviews Jewish thinkers, educators, celebrities, and even regular day to day life people. Or as she calls, Tzaddikim and Tzaddaikuses! She has the Interviewees speak about their life story, and what they can learn from it. Laili also creates Daily Videos and short messages. Laili Bialo has the spunk of a teenager, with the wisdom of a 40-year-old educator. She has spoken to schools and has a huge following. Join Laili to help Elevate Yourselves, and then to ultimately Elevate the World!</p>",
        "language": "en",
        "author_name": "Laili Bialo",
        "slug": "elevateyourself",
        "cover": "20230316_060320_5e968a955b38edcefbafb2cb9cbd3465.jpg"
    },
    {
        "podcast_id": 199504,
        "title": "The Bully Food Challenge",
        "description": "<p>Take the Bully Food Challenge and stop being bullied!</p>",
        "language": "en",
        "author_name": "Kelly Sorg",
        "slug": "the-bully-food-challenge",
        "cover": "20230328_110341_4e597cef09dcc5cec65932c5748c6bd1.jpg"
    },
    {
        "podcast_id": 200142,
        "title": "Nat Theo Nature Lessons Rooted in the Bible",
        "description": "<p>Join Master Naturalist, Bible teacher and author Eryn Lynum as we explore God's Word and his created world!</p><p>What can a bird's migration teach us about God's guidance in our life? How can counting tree rings help us understand our life story? How can a milkweed plant help us cut off toxic thoughts and think about everything lovely and true?</p><p>God's wild wonderful world is full of amazing life lessons. As we get outside and adventure through creation, we'll discover how deep and wide the Father's love is for us!</p><p>Each episode of The Nat Theo Nature Lessons podcast teaches God's truth through visuals in nature. Nat = Natural, Theo = Theology. Where kids dive into the study of Natural Theology—discovering God through nature!</p>",
        "language": "en",
        "author_name": "Eryn Lynum",
        "slug": "nattheolessons",
        "cover": "20230330_120341_e0f514856d23006191ad5c12a1059113.jpg"
    },
    {
        "podcast_id": 200318,
        "title": "Barquito de papel",
        "description": "<p>Reseñas de literatura infantil y juvenil de los estudiantes de los grados en Educación de la URJC</p>",
        "language": "es",
        "author_name": "Reslij",
        "slug": "barquitodepapel",
        "cover": "20230330_070316_3af575ae6942809b9eea6a62663c1649.jpg"
    },
    {
        "podcast_id": 204747,
        "title": "Careers4Kids",
        "description": "<p>Careers4Kids is a podcast created by kids, for kids! We interview leaders, teachers, doctors, authors, athletes, law enforcement, and many more to talk about their careers and help to inspire kids in the job industry.</p>",
        "language": "en",
        "author_name": "Henry Morrison & Maxwell Valencia",
        "slug": "careers4kids",
        "cover": "20230422_010444_42c82842e3aa39a56d54d6745db50f93.jpg"
    },
    {
        "podcast_id": 204776,
        "title": "ENTREVISTA CON EL PASADO",
        "description": "<p>Después de muchos años utilizando técnicas de Gianni Rodari, tengo la gran oportunidad de crear una entrevista al Gran Maestro de la Fantasía. Para realizarla he consultado documentos, libros y artículos encontrados en la Web. Espero que os guste y os anime a utilizar alguna de sus técnicas. Gracias</p>",
        "language": "es-mx",
        "author_name": "MARÍA JOSÉ RAMÍREZ BLÁZQUEZ",
        "slug": "mjrb2023",
        "cover": "20230422_080455_f793d0f5a34d7c863bf8158e86095313.jpg"
    },
    {
        "podcast_id": 205632,
        "title": "Emisora del CRA Alciares",
        "description": "<p>Grabaciones realizadas por el alumnado de nuestro Colegio Rural Agrupado</p>",
        "language": "es",
        "author_name": "CRA Alciares",
        "slug": "craalciares",
        "cover": "20230426_110412_ba7456a59c497741ee3e82bb8712bb8e.jpg"
    },
    {
        "podcast_id": 206500,
        "title": "The Follow Up",
        "description": "<p>In a weekly show that started in 2020, Noah &amp; his now 8-year-old daughter Eden turn on the microphone for a conversation on the chat about a topic of her choice. These chats are meant to entertain audiences of all ages, but most importantly to build confidence in young children learning how to actively listen &amp; communicate effectively. The Follow Up stems from a simple concept: ask a question, listen to the answer, then follow up.</p>",
        "language": "en",
        "author_name": "Eden & Noah",
        "slug": "thefollowup",
        "cover": "20230501_120522_856f742f79ecb905368633e321a627f5.jpg"
    },
    {
        "podcast_id": 206504,
        "title": "Voices Matter Young Adult's Educational Community Podcast",
        "description": "<p>Voices matter is a podcast for young adults created to empower voices in the educational community. It is about artistic expression and social justice.</p>",
        "language": "en",
        "author_name": "Voices Matter Kids Podcast",
        "slug": "voices-matter-kids-podcast",
        "cover": "20230430_100441_282327bcc0c37a167f154ba253cb37e2.jpg"
    },
    {
        "podcast_id": 206968,
        "title": "The Leading for Children Podcast",
        "description": "<p>The Leading for Children podcast brings together the adults in the young child’s life for conversations that explore the collective impact we have on children during their most formative years.</p>",
        "language": "en",
        "author_name": "Judy Jablon & Nichole Parks",
        "slug": "leadingforchildren",
        "cover": "20230503_020510_1b9378e279472c28b4112a55f4dfe93e.jpg"
    },
    {
        "podcast_id": 208444,
        "title": "Children Stories By Ohana",
        "description": "<p>In this podcast I share stories from around the world to inspire and educate children, teaching them that we may come from different countries however we are all one people and should embrace peace, prosperity and love for all mankind</p><p>SUPPORT OUR CHANNEL Buy Uncle Amos a Cup of Coffee <a href=\"https://www.ko-fi.com/ohanastories\">https://www.ko-fi.com/ohanastories</a></p><p>Donate and help us make more videos <a href=\"https://www.patreon.com/ohanastories\">https://www.patreon.com/ohanastories</a> LEARN HOW TO PLAY THE UKULELE <a href=\"https://ohanastories.thinkific.com/\">https://ohanastories.thinkific.com/</a></p><p>FOLLOW US ON SOCIAL MEDIA <a href=\"https://www.instagram.com/storiesohana/\">https://www.instagram.com/storiesohana/</a> <a href=\"https://www.tiktok.com/@ohanastories\">https://www.tiktok.com/@ohanastories</a> <a href=\"https://twitter.com/StoriesOhana\">https://twitter.com/StoriesOhana</a></p><p>Listen to Uncle Amos and Lucas Song “Fly Away” <a href=\"https://music.apple.com/us/album/fly-\">https://music.apple.com/us/album/fly-</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbkVFVkVudzdLUk1hWWU3M3I2XzZsaFhlUHFrUXxBQ3Jtc0ttQWFkX3JrcVBzYkdYVVdUWE1TdWtVVnA0QmFWRzRLTktfMml0WnpJU3FWQzhTT1RYazJjQ09CTXBqY2RGc3g1WUxMVktWWlhlZG5xTE9OdXFjTkVCSjNQRVpMWFJqNlo5bDYzOWtJaHk5OHZzMXY1RQ&amp;q=https%3A%2F%2Fmusic.apple.com%2Fus%2Falbum%2Ffly-away-single%2F1657357546&amp;v=FlxuqmLIJqE\">...</a> <a href=\"https://open.spotify.com/album/3X7MJP\">https://open.spotify.com/album/3X7MJP</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqa3hxcy1DZkUxRm9zal9SemJhME9PMHUwc1piZ3xBQ3Jtc0ttcEJMUVp1U1B5dk16LU52Uy1sclpjakNQSE5Ycm9hMnJOUC1MZFRsSk9JOFpfZ0J3Y3Jaam1kbmQxUC1wMFpDSVUwb3ZTaldHNnpNMkZFNnREeXZnWnhqdDZ2N3E4eXVhNWxLUmowYU56X0dFbkJuTQ&amp;q=https%3A%2F%2Fopen.spotify.com%2Falbum%2F3X7MJPVIOE3CdOcuJnH9Cy&amp;v=FlxuqmLIJqE\">...</a> <a href=\"https://music.amazon.com/albums/B0BNP\">https://music.amazon.com/albums/B0BNP</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbXA4Y2F0cGNnV2NMblhBcFQyd1NlYXdra19PZ3xBQ3Jtc0ttaXd6em1ieDBQSExNb3lHa2xLOWxCUmd5YWhRaWItRXNpNm5sUUQ4VEQ2ZjBtcU1WUTdVZWlOUHVMSmlIQVVyZ0FkMWJLN2NBZEZTeE1XeWtsaTRzTGRldjZiT2tKMU9DaUk4QW5IMDk4R1FZTmoxUQ&amp;q=https%3A%2F%2Fmusic.amazon.com%2Falbums%2FB0BNPXTRM3%3Fdo%3Dplay%26trackAsin%3DB0BNQ7LHY1%26ref%3Ddm_sh_o9p2wTGsB272KvJ1Fxgb8snPZ&amp;v=FlxuqmLIJqE\">...</a></p>",
        "language": "en",
        "author_name": "Amos Balongo",
        "slug": "childrenstories",
        "cover": "20230510_090547_360d32291e696d9151999dc8c704aa16.jpg"
    },
    {
        "podcast_id": 208848,
        "title": "ExoDexa Podcast- Featuring Nolan Bushnell and Dr. Leah Hanes",
        "description": "<p>\"ExoDexa is the ultimate gamified learning platform that turns learners into passionate problem solvers.\" Founded by visionary Nolan Bushnell. We would like to welcome you to our exciting new platform featuring podcasts, special interviews and more! Stay tuned each week for new episodes, exclusive content and interviews.</p>",
        "language": "en",
        "author_name": "Joe Rovinsky",
        "slug": "exodexa",
        "cover": "20230512_060505_de4a5544e5b5d2530d669be31ed81a32.jpg"
    },
    {
        "podcast_id": 211045,
        "title": "Storie da Cani",
        "description": "<p>Sei una mamma o un papà? Stai pensando di adottare un cucciolo e hai un bambino? Hai un cane e stai per diventare genitore? ALLORA DOVRESTI SAPERE CHE i bambini vengono morsi più frequentemente rispetto agli adulti e riportano ferite più gravi essenzialmente per tre motivi:</p><ul><li><p>La loro innata curiosità li porta a cercare un contatto con gli animali;</p></li><li><p>La loro inesperienza e la voglia di giocare li porta a interagire in modo sbagliato suscitando a volte reazioni aggressive;</p></li><li><p>Una volta aggrediti i bambini hanno una minore capacità di difendersi.</p></li></ul><p>In questo podcast \"Storie da Cani\" Martina e Elena vi guideranno nel mondo dei cani e dei bambini dandovi tutte le informazioni di cui avete bisogno per vivere a pieno il potenziale di una \"famiglia/branco\" senza ansie e in serenità.</p>",
        "language": "it",
        "author_name": "Martina Donà ed Elena Froldi",
        "slug": "storiedacani",
        "cover": "20230523_060529_7ee4623d901b1e08d7451dbcd71f0e5f.jpg"
    },
    {
        "podcast_id": 211589,
        "title": "M(P)aternidad al Habla ",
        "description": "<p>Un espacio en el que encontrar algo de luz y calma para disfrutar de la bonita aventura de convertirse en M(p)adres.</p><p>Te acompañamos en las diferentes etapas y necesidades de vuestros hijos.</p><p>Reuteri, Tranquilidad desde el primer día</p>",
        "language": "es",
        "author_name": "Reuteri ",
        "slug": "mpaternidadalhabla",
        "cover": "20230804_090836_fbbaf9143da14c38ad3dc79c3cad634a.jpg"
    },
    {
        "podcast_id": 211720,
        "title": "PREVENCION DEL  ALCOHOL ",
        "description": "<p><strong>Este es un podcast dirigido a todos los adolecentes creado por alumnos del Centro De Estudios De Bachillerato 6/13 \"Lic. Jesus Reyes Heroles\" </strong></p>",
        "language": "es-mx",
        "author_name": "CEB 6/13",
        "slug": "ceb613serdan402",
        "cover": "20230527_060524_8c15063c2323648098ec162def447061.jpg"
    },
    {
        "podcast_id": 212677,
        "title": "Wonder Kids",
        "description": "<p>Brought to you by Scitech, the Wonder Kids podcast is here to answer all your science questions - big or small.</p>",
        "language": "en",
        "author_name": "Scitech",
        "slug": "wonder-kids",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 213378,
        "title": "Scuola dell'Infanzia \"B. Spadafora\"",
        "description": "<p>Esistono delle parole che hanno il potere di far spuntare il sorriso. Sono parole magiche e sono talmente semplici che anche i più piccoli le possono imparare. Sono: buongiorno, per piacere, grazie, bravo, benvenuto, scusa, ti voglio bene, ti aiuto io. Sono le parole della gentilezza</p>",
        "language": "it",
        "author_name": "ANGELINA",
        "slug": "angelinacovelli",
        "cover": "20230605_080656_75ce722a529aeaeebb6d0d893337bcaf.jpg"
    },
    {
        "podcast_id": 214183,
        "title": "Enciclopedia Zimitot - Mijloace de transport",
        "description": "<p>Calculatorul Zimitot, care știe tot, îi învață pe Itsy și pe Bitsy despre lumea înconjurătoare. Află și tu ce au inventat oamenii de-a lungul timpului, pentru a se deplasa ușor dintr-un loc în altul și pentru a explora lumea.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "enciclopedia-zimitot-mijloace-de-transport",
        "cover": "20230610_100650_4f4b6a916be8b4a91e879caeed22514a.jpg"
    },
    {
        "podcast_id": 214234,
        "title": "Cântece",
        "description": "<p>Itsy si Bitsy au compus împreună cu prietenii lor o serie de cântece despre supereroi, copilărie, joacă, sport, natură, emoții. Ascultă-le și bucură-te de muzică și dans împreună cu Supereroii Itsy Bitsy! Producător muzical: ON AIR STUDIO SRL</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "cantece-supereroi-cu-itsy-si-bitsy",
        "cover": "20230610_100648_1c22663f644487bf9f00128d157d3452.jpg"
    },
    {
        "podcast_id": 214308,
        "title": "Misiunile lui Itsy și ale lui Bitsy",
        "description": "<p>Pe Planeta Zizilon din Galaxia Xarazon trăiesc doi copii: Itsy și Bitsy. Datorită curajului și istețimii lor, ei au devenit Apărătorii Galaxiei Xarazon. Sub îndrumarea lui Zamax, Spiritul Bun al Galaxiei, Itsy și Bitsy învață să-și dezvolte și să-și folosească la maximum capacitățile cu care au fost dotați din naștere și să utilizeze uneltele extraterestre cu puteri neobișnuite. Misiunea lor este aceea de a apăra Galaxia Xarazon de influența unui spirit malefic numit Varsar, care are o armată de vartari. Itsy și Bitsy pleacă de fiecare dată în misiune cu Nava Zorar și sunt ajutați de computerul de bord al navei, Zimitot, care a înregistrat toate misiunile lor.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy FM",
        "slug": "misiunile-lui-itsy-si-ale-lui-bitsy",
        "cover": "20230610_100623_ad56acaf09f1968df9c46f697e9db218.jpg"
    },
    {
        "podcast_id": 214310,
        "title": "Povești de pe strada mea ",
        "description": "<p>Cunoscutul scriitor pentru copii, Leon Magdan, a realizat seria de povești cu cei doi frați: Andrei și Sofia. Copiii merg la școală și la grădiniță, se joacă cu alți colegi și prieteni, au tot felul de provocări și aventuri, din care învață câte o lecție de viață, zi de zi.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy FM",
        "slug": "povesti-de-pe-strada-mea",
        "cover": "20230610_100643_3a21a24493467025fa6620683bbdf9e2.jpg"
    },
    {
        "podcast_id": 214589,
        "title": "I Am Glory Bound ",
        "description": "<p>Welcome to Going for the W!!! Presents the I Am Series in association with Glory Bound Athletics. Our mission is to develop leaders both on and off the court. We strive daily to grow Physically, Mentally, and Spiritually Through hard work, determination, and Biblical guidance. We get better and better until we can't be beat!</p>",
        "language": "en",
        "author_name": "Glory BOUND Athletics  ",
        "slug": "i-am-glory-bound",
        "cover": "20230710_030719_70c6d9e8a235073d45ffa3b3596f1547.jpg"
    },
    {
        "podcast_id": 214598,
        "title": "Claretianos en ambiente con Valentina Gutierrez",
        "description": "<p><em>Hablaremos sobre la vida de Jesús y reflexionaremos parábolas. </em></p>",
        "language": "es",
        "author_name": "Aylin Valentina López Gutiérrez",
        "slug": "claretianosenambiente",
        "cover": "20230611_100650_e83af95da85949b9cc7bc647961e616a.jpg"
    },
    {
        "podcast_id": 215414,
        "title": "F1 for Kids",
        "description": "<p>A podcast for kids and by kids that covers Formula 1 technical insights, track assessments, driver and team strategy, race recaps, and much more.</p><p>Join Kesler Sauvé, a 9-year-old go-kart racer and Formula 1 enthusiast as he covers a variety of the sport's topics with his Dad and other special guests.</p><p>Send questions along with your name, where you're from, and who your favourite team and drivers are to <a href=\"mailto:questions@f1forkids.com\">questions@f1forkids.com</a> and we'll try to answer them on the podcast. Send them in an audio format and you might even hear yourself on the podcast!</p>",
        "language": "en",
        "author_name": "Kesler Sauvé",
        "slug": "f1forkids",
        "cover": "20230617_050659_846a4a8cf2725c2906329da311a9bbea.jpg"
    },
    {
        "podcast_id": 216719,
        "title": "Merles Welt Gefühle ",
        "description": "<p>In diesem Podcast erzähle ich von meinen Leben und dem Klimawandel.</p>",
        "language": "de",
        "author_name": "Merle",
        "slug": "bonn",
        "cover": "20230625_070633_1a41447d496256c1f2f927eced6e52b0.jpg"
    },
    {
        "podcast_id": 217164,
        "title": "Emma has Questions",
        "description": "<p>Emma is a nine year old Thai Canadian girl who lives in Bangkok. During her summer break she decided to start her own podcast interviewing important people in her life. Stay tuned for a new episode each week where she interviews someone new and allows them to ask her questions and return.</p>",
        "language": "en",
        "author_name": "Emma Rue",
        "slug": "emmahasquestions",
        "cover": "20230628_110635_09216fb3ed4618bf3db4deef951b98a0.jpg"
    },
    {
        "podcast_id": 217273,
        "title": "La hora de los niños",
        "description": "<p>Episodio 100</p>",
        "language": "es-mx",
        "author_name": "La hora de los niños",
        "slug": "laautentica",
        "cover": "20230629_030619_a6e293f8d31ecc822f2f0b5384a07216.jpg"
    },
    {
        "podcast_id": 217404,
        "title": "Baby Talk Podcast by Baby Corp",
        "description": "<p><strong>Baby Talk Podcast by Baby Corp </strong>nace para mujeres con la necesidad de conversar sobre el universo que abarca ser MADRES  🎧</p>",
        "language": "es",
        "author_name": "Baby Talk ",
        "slug": "babytalkbolivia",
        "cover": "20230630_120612_317be88f31fd0885ad7290f811cdfea7.jpg"
    },
    {
        "podcast_id": 217538,
        "title": "Voces Estudiantiles ",
        "description": "<p>Podcast elaborado por estudiantes de formación docente en Paysandú, Uruguay.</p>",
        "language": "es-mx",
        "author_name": "Mateo Carvalho",
        "slug": "vocesestudiantiles",
        "cover": "20230701_010725_e917d4d01c98b2293d463d2a0c599155.jpg"
    },
    {
        "podcast_id": 217892,
        "title": "KYS? Know Your Stuff Trivia",
        "description": "<p>Know Your Stuff Trivia is a short 20 question trivia podcast to test your knowledge for all ages. Questions will hit either a specific topic for all 20 questions or it will be a grab bag of 20 random questions. Hope you all enjoy!</p>",
        "language": "en",
        "author_name": "Brendon D",
        "slug": "kys",
        "cover": "20230703_110750_1be65ecd0dcbea8732e180f602b504b3.jpg"
    },
    {
        "podcast_id": 218083,
        "title": "Kleurplaten",
        "description": "<p>Welkom bij <a href=\"https://kleurplatenwk.nl/\">Kleurplaten WK</a>, dé online kleurwebsite voor kinderen! Hier kunnen kinderen van over de hele wereld hun creativiteit de vrije loop laten en prachtige <a href=\"https://kleurplatenwk.nl/\">kleurplaten</a> tot leven brengen. <strong>Kleurplaten WK</strong> is eigendom van tekenleraar Becky Gomez, de oprichter van het merk WK - World Kids. Met een wereldwijde aanwezigheid in landen als Amerika, Nederland, Italië, Spanje en Frankrijk, bieden we een uitgebreide verzameling afdrukbare kleurplaten aan die zowel educatief als vermakelijk zijn. Kom en ontdek de kleurrijke wereld van <strong>Kleurplaten WK</strong>, waar plezier en creativiteit samenkomen!</p>",
        "language": "nl",
        "author_name": "Becky Gomez (Art teacher)",
        "slug": "kleurplaten",
        "cover": "20230705_090721_bca3e19c5c1e9e41ceaaac648f170406.jpg"
    },
    {
        "podcast_id": 218209,
        "title": "DOS y B PODCAST \"Lo mejor para reflexionar\"",
        "description": "<p>1) Identifica roles y estereotipos de género que influyen en su identidad.</p><p>2) Analiza el enfoque de equidad de género en sus relaciones interpersonales.</p>",
        "language": "es",
        "author_name": "Ambrosio Quintana Ian Emiliano",
        "slug": "dosybpodcast",
        "cover": "20230706_040735_09c1ae3b0ff4437f07294c9a04f641dd.jpg"
    },
    {
        "podcast_id": 219788,
        "title": "Kembali Pada Tempatnya",
        "description": "<p>Disini, semesta kita dimulai, kan?? Semesta juga butuh rumah untuk bernaung. Jika kita dalah semesta, maka kita akan memilih tempat paling nyaman untuk berlindung. Kita semua adalah semesta yang pasti kembali ke rumah saat lelah.</p>",
        "language": "en",
        "author_name": "yummy bubblegum",
        "slug": "ourminds",
        "cover": "20230717_050733_f6cbb062df426def623a9fc27c6f3ce6.jpg"
    },
    {
        "podcast_id": 220745,
        "title": "Hello Dante, My Son",
        "description": "<p>Messages for my son</p>",
        "language": "en",
        "author_name": "Opus Lilium",
        "slug": "hellodantemyson",
        "cover": "20230723_020717_7e725ce34344bc260e2471cf06323284.jpg"
    },
    {
        "podcast_id": 220964,
        "title": "Children's Stories Around The World",
        "description": "<p>Listen to beautiful &amp; fun children's stories from around the world. Let your children travel the globe and feast on the literally treasures of different cultures. Each story holds a valuable life lesson that children will carry in their heart and are able to apply to real life situations. Topics include such as teamwork, kindness, generosity, courage and gratitude. </p>",
        "language": "en",
        "author_name": "Nancy Agbenu",
        "slug": "children-stories-around-the-world",
        "cover": "20230724_080741_a83a5c3df86e495f9b9366dff4f67c70.jpg"
    },
    {
        "podcast_id": 221440,
        "title": "A guide on how to survive wild",
        "description": "<p>Good </p>",
        "language": "en",
        "author_name": "Tyrone wilson",
        "slug": "amaeri",
        "cover": "20230727_090752_5b7c6d6f2dac438dbf2151c4d27e51fe.jpg"
    },
    {
        "podcast_id": 221909,
        "title": "CVPS Classroom's",
        "description": "<p>Join Year 5 students on finding out what has been happening around the school lately.</p>",
        "language": "en",
        "author_name": "Year 5 2023",
        "slug": "cvps",
        "cover": "20230731_070759_7b6f27674b233175b7c9cb61aba1e245.jpg"
    },
    {
        "podcast_id": 222576,
        "title": "Parecido pero no Igualito",
        "description": "<p>Un Podcast hecho por adolescentes para adolescentes. Algunas preguntas que nos hacemos, algunas respuestas que no encontramos y otras cosas que inventamos mezclando trabajo con diversión.</p><p>Somos un grupo de estudiantes de la UTU Arroyo Seco que participamos del proyecto Aprender Todos y queremos compartir las cositas que hacemos y algunas reflexiones, como por ejemplo: los disléxicos también somos persianas.</p>",
        "language": "es",
        "author_name": "Aprender todos Arroyo Seco",
        "slug": "parecidoperonoigulito",
        "cover": "20230804_030839_c47ccc2d131f64d660f62c6eb92484dc.jpg"
    },
    {
        "podcast_id": 222677,
        "title": "Education Kite",
        "description": "<p>Education should be accessible to all. My podcast discusses education in our society.</p>",
        "language": "en",
        "author_name": "Lyndsay Conroy",
        "slug": "educationkite",
        "cover": "20230805_030854_c21e4840b9aeaa05924a8ec02530f58c.jpg"
    },
    {
        "podcast_id": 222795,
        "title": "Touch A Rainbow",
        "description": "<p>Touch A Rainbow Podcast is geared towards parents, teachers, educators to share a journey about looking after our children…who along with all of us…are living through some pretty difficult times. Come on a journey every two weeks to take a look inside the hearts and minds of our children…and ourselves...touching rainbows along the way to re-discovering our “better angels.\"</p>",
        "language": "en",
        "author_name": "Andy Phillips Jr.",
        "slug": "toucharainbowpod",
        "cover": "20230806_120842_7d360470a0c36803cfd6fd9115725e6c.jpg"
    },
    {
        "podcast_id": 222847,
        "title": "Dinosaur Stories for Kids",
        "description": "<p>For all those kids who love dinosaurs, Purple TREX Productions bring you, Dinosaur Stories for Kids!</p>",
        "language": "en",
        "author_name": "Oliver Evans",
        "slug": "dinosaurstoriesforkids",
        "cover": "20230806_080858_e02fc944ed60602ae63a0d91b0b82950.jpg"
    },
    {
        "podcast_id": 223098,
        "title": "Enciclopedia Zimitot - Geografie și Astronomie",
        "description": "<p>Calculatorul Zimitot, care știe tot, îi învață pe Itsy și pe Bitsy despre lumea înconjurătoare. Află și tu cât de diversă este geografia Pământului, dar și cât de uimitoare sunt fenomenele naturale și formele de relief, dar și obiectele și fenomenele cerești.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "enciclopedia-zimitot-geografie-si-astronomie",
        "cover": "20230818_100820_9cb95e98fce3bcb0adbd0e2931fd6ae5.jpg"
    },
    {
        "podcast_id": 223109,
        "title": "Părinți de pici",
        "description": "<p>Esti proaspăt părinte? Atunci sigur vei găsi informații utile și inspirație în experiențele unui părinte ca tine, din prima zi de viață a bebelușului până la vârsta de 3 ani.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "parinti-de-pici",
        "cover": "20230808_120819_963ba1fba3c9cd3f2b48ec98a0455729.jpg"
    },
    {
        "podcast_id": 223185,
        "title": "Профессия наизнанку",
        "description": "<p>Подкаст о профессиях без иллюзий и прикрас. Зина и Лиля говорят с профессионалами о том, с какими задачами и обязанностями реально придется столкнуться. </p><p>Зина - преподаватель с опытом HR, ментор подростков. Лиля - HR консультант, коуч.</p><p>Мы помогаем определиться с тем, кем ты хочешь стать в будущем.</p>",
        "language": "ru",
        "author_name": "Зина Гарт и Лиля Гермерсхаузен",
        "slug": "naiznanku",
        "cover": "20230808_090854_42c32bae688fec324529293084181b32.jpg"
    },
    {
        "podcast_id": 223210,
        "title": "French Dialogues episode 1",
        "description": "<p>The transcription is availlable on my website</p><p><a href=\"http://willytz.com\">willytz.com</a></p>",
        "language": "en",
        "author_name": "Willy tz",
        "slug": "willy-tz",
        "cover": "20230809_010832_f6f5b2b1bf732535cc87714ba134db5d.jpg"
    },
    {
        "podcast_id": 223259,
        "title": "MeteoHeroes",
        "description": "<p>MeteoHeroes are 6 kids with superpowers and where do they come from, what are their powers. Where the MeteoHeroes live and lots of other news about them.</p>",
        "language": "it",
        "author_name": "Mopi Srl - Meteo.Expert",
        "slug": "metehoeroes-en",
        "cover": "20230809_090816_11a40b00a1327291295c1bab6e0b8ee5.jpg"
    },
    {
        "podcast_id": 223433,
        "title": "日本瞎槓",
        "description": "<p>進來聽我們用日文瞎聊，邊聽邊學。</p>",
        "language": "zh",
        "author_name": "vivian liu",
        "slug": "vivian-and-winston",
        "cover": "20230810_010809_1dd22e57877dc72558438d6f15ba3bfb.jpg"
    },
    {
        "podcast_id": 223533,
        "title": "Tide Pod Challenge",
        "description": "<p>El nuevo \"desafío\" que se ha masificado por las redes sociales consiste en comer, cocinar o morder cápsulas de detergente como si fueran dulces.</p>",
        "language": "es",
        "author_name": "NoTenemosNombre",
        "slug": "tide-pod-challenge",
        "cover": "20230811_020812_6cead6c726c2b732bc1df46fa2c99752.jpg"
    },
    {
        "podcast_id": 224073,
        "title": "De Uitzoekers",
        "description": "<p>Waarom lopen krabben zijwaarts? Waarom heet het de supermaan? En nog veel meer vragen die wij voor jullie gaan beantwoorden in de podcast De Uitzoekers</p>",
        "language": "nl",
        "author_name": "Pepe en Teun ",
        "slug": "deuitzoekers",
        "cover": "20230814_080852_5b088531ad9c33544732e0fd97c03cee.jpg"
    },
    {
        "podcast_id": 224199,
        "title": "Bulldog Box",
        "description": "<p>This is the official podcast of the Hancock County School District in Sparta, GA. Students will interview one school leader or former Bulldog each month to discuss various topics. Tune in to learn how the Hancock County School District has influenced the lives of many successful Bulldogs. If you would like to see a former Bulldog featured as a special guest, please send their name to BulldogBoxPodcast@gmail.com.</p>",
        "language": "en",
        "author_name": "Students of the Hancock County School District",
        "slug": "bulldogbox",
        "cover": "20230815_040801_7e4dea62a75daa7db935cd3086886969.jpg"
    },
    {
        "podcast_id": 224655,
        "title": "Boreham Wood & Elstree Community Radio ",
        "description": "<p>Boreham Wood &amp; Elstree Community Radio</p>",
        "language": "en",
        "author_name": "BECR",
        "slug": "becrcommunityradio",
        "cover": "20230818_090809_108297ad781d6f8630681eca9085e785.jpg"
    },
    {
        "podcast_id": 224860,
        "title": "¿Que son las TIC´s?",
        "description": "<p>Se hace mención acerca de las TIC´s y como facilitan nuestra vida</p>",
        "language": "es-mx",
        "author_name": "CAROLINA JUAREZ BERISTAIN",
        "slug": "innocacion-y-tecnologia-aplicada-a-la-educacion-cjb",
        "cover": "20230819_070807_8e18357dc51ba84a40f72db9a8919231.jpg"
    },
    {
        "podcast_id": 224864,
        "title": "La Reseña",
        "description": "<p>¿Que aprendemos diariamente? De todo lo que llega a nuestros oidos día con día, hablemos de pequeñas reseñas que nos quedan de aprendizaje.</p>",
        "language": "es",
        "author_name": "Ana Mier ",
        "slug": "sociedad-de-conocimiento",
        "cover": "20230819_070807_1064d73dc5203a9418b80a494f30e352.jpg"
    },
    {
        "podcast_id": 225301,
        "title": "\"When talent does not work hard,hard-work beats talent.\"",
        "description": "<p>A short and simple audio about \"when talent does not work hard, hard-work beats talent.\"</p>",
        "language": "en",
        "author_name": "Laksh Sharma",
        "slug": "lakshsharma-police-dav",
        "cover": "20230822_020858_a7db601042db5111447898c4090bcd94.jpg"
    },
    {
        "podcast_id": 225488,
        "title": "Speaking of Schools - The Podcast!",
        "description": "<p>Speaking of Schools with Save Our Schools Arizona Network!</p>",
        "language": "en",
        "author_name": "Save Our Schools Arizona Network",
        "slug": "sosaz",
        "cover": "20230828_050841_2d530b2c8f6152a3ef26b4c24244f1cb.jpg"
    },
    {
        "podcast_id": 226101,
        "title": "¿Esto es caca o chocolate?",
        "description": "<p>Un podcast de @lazonatal.</p><p>Hecho para quienes tienen vínculo cotidiano con niños y niñas: material CLAVE en el tiempo JUSTO.</p><p>Somos Ileana Contrera (psicóloga infanto-juvenil y perinatal) y Aldana Contrera (puericultora y consultora en crianza), hermanas y creadoras de Lazo Natal®️.</p><p>En estos episodios vamos a hablar de los grandes temas que atraviesan nuestro vínculo con las infancias.</p><p>Nos hacemos muchas preguntas para encontrar algunas respuestas.</p><p>¿Por qué el podcast se llama así? La respuesta en el primer episodio.</p><p>Guión: Lazo Natal®️</p><p>Música original, grabación y edición: Antonio Boyadjián</p>",
        "language": "es",
        "author_name": "¿Esto es caca o chocolate?",
        "slug": "estoescacaochocolate",
        "cover": "20230827_070838_3c317fb1df5bdffebc2e15992415e881.jpg"
    },
    {
        "podcast_id": 226694,
        "title": "OwlBooks, micro-aventuras visuales para jóvenes soñadores.",
        "description": "<p>OwlBooks presenta una revolucionaria experiencia narrativa diseñada específicamente por pedagogos para niños entre 5 y 12 años: micro-libros en formato de podcast con video. Cada episodio, meticulosamente creado, transporta a los jóvenes oyentes a mundos envolventes a través de relatos breves y cautivadores, complementados con visualizaciones dinámicas y efectos sonoros inmersivos. </p><p>Esta combinación no solo busca entretener, sino también educar, aprovechando técnicas pedagógicas que facilitan el aprendizaje y fomentan la imaginación. OwlBooks combina la magia de la narración tradicional con la conveniencia y el atractivo multimedia, ofreciendo historias adaptadas a las necesidades y curiosidades de la audiencia infantil en la era digital.</p>",
        "language": "es",
        "author_name": "Sofia Garcia",
        "slug": "owlbooks",
        "cover": "20230831_100834_815febdd81d5a5567162082ad80d21a9.jpg"
    },
    {
        "podcast_id": 227901,
        "title": "Blooket Play with Hash",
        "description": "<p>Gamification in education is a concept that has gained immense popularity in recent years. It involves integrating game elements into the learning experience, tapping into our innate desire for competition, achievement, and rewards. At the forefront of this <a href=\"https://blooketjoin.us/blooket-game-modes-fun-learning-all-ages/\">gamification revolution stands Blooket</a>, a platform that's revolutionizing the educational landscape.</p>",
        "language": "en",
        "author_name": "David",
        "slug": "blooket",
        "cover": "20230909_110916_8d470fa2557f2d5c608cd06c1247fab1.jpg"
    },
    {
        "podcast_id": 228066,
        "title": "ACTIVIDAD 1. PÓDCAST EDUCATIVO.",
        "description": "<p>LECTURA  1 MITOS Y REALIDADES DEL SOBREDOTADO</p><p>LECTURA  2 ATENCIÓN EDUCATIVA A LOS ALUMNOS CON APTITUDES SOBRESALIENTES</p><p>LECTURA 3 EVOLUCIÓN DE LOS CONCEPTOS SOBRE INTELIGENCIA.</p>",
        "language": "es",
        "author_name": "ANGEL ARTURO TORRES BERNAL",
        "slug": "angelarturotorresbernal",
        "cover": "20230910_040906_3cca5a91c4f9d5ec17748a097124380f.jpg"
    },
    {
        "podcast_id": 228160,
        "title": "Povești românești",
        "description": "<p>Cunoscutul scriitor pentru copii Leon Magdan a realizat o nouă serie de povești pentru copii, pornind de la proverbe și cuvinte românești. </p>",
        "language": "ro",
        "author_name": "Itsy Bitsy FM",
        "slug": "povesti-romanesti",
        "cover": "20230911_090927_922f9fcdfe1d65b384bc2a221d3b0655.jpg"
    },
    {
        "podcast_id": 228210,
        "title": "Look Who's Talking",
        "description": "<p>Community Action Council's Look Who's Talking podcast is completely Head Start focused with engaging guest that will provide informative and educational conversations with our host, Head Start Director, Jessica Coffie.</p><p>Head Start programs operate locally to help young children from low-income families prepare to succeed in school, promoting children’s development through early learning, health, and family well-being.</p>",
        "language": "en",
        "author_name": "Commaction",
        "slug": "lookwhostalking",
        "cover": "20230912_030917_93a9e07121ed3341a7d5ef5048f44052.jpg"
    },
    {
        "podcast_id": 228250,
        "title": "MathFit Moments",
        "description": "<p>MathFit is a fun, unique, interactive way of learning and teaching math. During the show, we will share a strategy, from PreK to 5th grade, that will address what kids learn in math class.</p>",
        "language": "en",
        "author_name": "Ms. Dana",
        "slug": "getmathfit",
        "cover": "20230911_100927_670a91595cabbc907d95c6c3b7f63a5f.jpg"
    },
    {
        "podcast_id": 228327,
        "title": "Enciclopedia Zimitot - Invenții și inventatori",
        "description": "<p>Calculatorul Zimitot, care știe tot, îi învață pe Itsy și pe Bitsy despre lumea înconjurătoare. Află și tu ce invenții și inventatori au uimit și au schimbat lumea, de-a lungul timpului.</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "inventii-si-inventatori",
        "cover": "20230912_110911_4eed169ae74f194c85d70d401cb30b2d.jpg"
    },
    {
        "podcast_id": 228343,
        "title": "Mr Teo Podcast",
        "description": "<p>Mrteo Always podcast</p>",
        "language": "zh",
        "author_name": "Mr Teo Podcast",
        "slug": "mrteoalwayspodcast",
        "cover": "20230912_010947_fce385d486396cfc4555399dc0519c4a.jpg"
    },
    {
        "podcast_id": 228354,
        "title": "MA.SI.BO.4M.",
        "description": "<p>¡Bienvenidos a nuestro espacio de comunicación!</p>",
        "language": "es",
        "author_name": "Escuela 53",
        "slug": "masibo4m",
        "cover": "20230914_120936_f6474b6482943e871029e2b685a3b9f0.jpg"
    },
    {
        "podcast_id": 228488,
        "title": "Do What's Best for Kids!",
        "description": "<p>  </p>",
        "language": "en",
        "author_name": "Kristen Cormier",
        "slug": "kidscomefirst",
        "cover": "20230913_110919_dc24c66607896e439f222e0f208ee124.jpg"
    },
    {
        "podcast_id": 228710,
        "title": "Does it Make Sense Living in Fear?",
        "description": "<p>Does it make sense living in fear? For example, we only have 12 years left, before climate apocalypse if we don't act now? Do you agree?  Are you scared? If you are scared, what does it feel like in your gut?  Is that feeling good for you?  Let's dig into this deeper. How long is your list of fears? If it is very short, you have to be an extraordinarily happy person!  If your list is long, are you feeling sad and depressed? When we listen to the media what do we hear?  The media believes fear sells! My podcast is my belief people want to find hope...for themselves, for their kids, and for their friends.  Why wouldn't they?  Why wouldn't you?  How do we find hope? I will give part of the answer now.  Fear is an irrational feeling.  Hope is a rational choice.  In order to go from fear to hope requires a change...a change in your beliefs.  And the person to start with is you.  Does this make sense?</p>",
        "language": "en",
        "author_name": "Wm. Gray McQuarrie",
        "slug": "doesitmakesense",
        "cover": "20230914_090956_603f07acefd506e37df0927d459c26a1.jpg"
    }
]