[
    {
        "podcast_id": 3187,
        "title": "Tame Aperture",
        "description": "Welcome to the Tame Aperture podcast, where we talk all things movies...from first-time directors, indie films, art house and much more. Join us in the conversation.\n\nSubscribe on all streaming platforms! \n\nwww.tameaperture.com\n@dutchanglepics",
        "language": "en-us",
        "author_name": "Dutch Angle Pictures",
        "slug": "tameaperture",
        "cover": "20211028_162028_eb678741a3136e7de4e1f90a1dd04115.jpg"
    },
    {
        "podcast_id": 6394,
        "title": "Our Man Ernest",
        "description": "Hosts Frank and Jos discuss the life and times of Ernest P. Worrell!",
        "language": "en",
        "author_name": "Frank Mosley & Joslyn Jensen",
        "slug": "ourmanernest",
        "cover": "20200222_223228_5f835f88a51be956d3018eba0e95c7ad.jpeg"
    },
    {
        "podcast_id": 6633,
        "title": "Happy Hour with Victabulous! ",
        "description": "Entertainment reviews, discussions and analysis accompanied with mixed beverages resulting in heavy doses of sarcasm and laughter!",
        "language": "en",
        "author_name": "Victabulous",
        "slug": "victabulous",
        "cover": "20200424_175755_1855cf3e9e8ed62a5d437f412770ef16.jpeg"
    },
    {
        "podcast_id": 7736,
        "title": "Watch With Jen™",
        "description": "3-time national award-winning writer & full time walking movie encyclopedia Jen Johans of FilmIntuition.com delivers a steady stream of great movie recommendations, thoughtful career deep dives, & first rate conversations with critics, authors, actors, journalists, filmmakers, and more on Watch With Jen.™️\n\nOriginally launched on Patreon (https://patreon.com/FilmIntuition), where new installments premiere first, once each episode is unlocked to the public, you'll be able to find every episode here as well.",
        "language": "en-us",
        "author_name": "Jen Johans",
        "slug": "watchwithjen",
        "cover": "20211218_051256_7fca9258f33dbd3fcebbafe0744f613e.jpg"
    },
    {
        "podcast_id": 8264,
        "title": "Platicando con Jacque Podcast",
        "description": "<p>“Platicando con Jacque” es un podcast creado por Jacqueline Sarabia inspirado en experiencias y personas que ella admira y le han ayudado a lo largo de su vida. Esperando que como ella, tu también puedas conectar con historias de triunfo, entrega y dedicación para enamorarte de la vida y seguir adelante.</p>",
        "language": "es",
        "author_name": "Jacqueline Sarabia ",
        "slug": "platicandoconjacque",
        "cover": "20230314_030355_9dd902ec537892f6adee5541e2da09d6.jpg"
    },
    {
        "podcast_id": 9729,
        "title": "Stout Un Film Podcast",
        "description": "Un podcast énergique et sans compromis; on regarde des films avec une bonne pinte de bière artisanale à la main. Joins toi à nous dans notre aventure pour explorer des petits joyaux non-explorés mais surtout, pas assez appréciés! Bonne écoute mais aussi, bonne bière!\n\nWe also have a few episodes in English although we mainly do them in French so be on the lookout for English episode titles !",
        "language": "fr",
        "author_name": "Stout Un Film Podcast",
        "slug": "stoutunfilmpodcast",
        "cover": "20210422_180023_8cd9e742692974b6393bb0270accc589.jpg"
    },
    {
        "podcast_id": 9797,
        "title": "Theo's Podcast Show ",
        "description": "Welcome! Theo and Nadah shares dialogue on daily issues; political views; musical topics; film and animation; sports; travel and more! Hell we discuss everything except gossip while enjoying our favorite adult beverage!",
        "language": "en",
        "author_name": "Theo's Podcast Show",
        "slug": "theospodcastshow",
        "cover": "20200619_055017_6579afac5d9303e97ab6d670a9b6776b.jpeg"
    },
    {
        "podcast_id": 11091,
        "title": "Views in Paradox Film Club",
        "description": "A filmmaker, an actress, and usually a guest discuss a new film each week. Follow us on Instagram @viewsinparadox to find out what's to coming, and join our Facebook Group if you love to talk about film!",
        "language": "en",
        "author_name": "Jon Olson and Rochalle Racine",
        "slug": "viewsinparadox",
        "cover": "20200803_205012_c87524ee24d12eb13b393bccb5d86eca.jpg"
    },
    {
        "podcast_id": 13023,
        "title": "Medium Cool: A Movie Podcast",
        "description": "Medium Cool: A Movie Podcast is a weekly show focused on discussing film like a bunch of nerds. Please subscribe to get film reviews, interviews, retrospectives on movies, genres, and filmmakers, and much more. Our host, Austin Glidden, will take you along for the ride as we explore the world on the silver screen. Don't just be cool... be medium cool. Are you ready? ",
        "language": "en",
        "author_name": "Medium Cool: A Movie Podcast",
        "slug": "mediumcoolpod",
        "cover": "20210204_022805_dd4405be260c315429cc26cffff29c54.jpg"
    },
    {
        "podcast_id": 13508,
        "title": "Hollywood Casting and Film",
        "description": "Hollywood Casting and Film is a casting website and a production company offering breakdown services across the United States. \n\nThroughout our episodes you will learn more details about the films we are casting for and you will have the opportunity to better prepare for your auditions!\n\nMake sure to subscribe to stay updated!\n\n",
        "language": "en",
        "author_name": "Hollywood Casting and Film",
        "slug": "hollywoodcastingandfilm",
        "cover": "20201015_231846_4323acd62a92853ba8ad02959bdb61e3.jpg"
    },
    {
        "podcast_id": 13615,
        "title": "Ghouls On Film ",
        "description": "In the grand tradition of Goth Talk & Men On Film comes GHOULS ON FILM, an interview based podcast from two lifelong horror gays. Step into the crypt with \ndirecting duo Roman Chimienti and Tyler Jensen (Scream, Queen! My Nightmare On Elm Street) as they sit down with a variety of creative friends and colleagues to discuss the thrills and horrors of bringing their nightmares to life. ",
        "language": "en",
        "author_name": "Roman Chimienti & Tyler Jensen",
        "slug": "ghoulsonfilm",
        "cover": "20201018_181548_8fe9c9046d7303a9e449a6a058d75188.jpg"
    },
    {
        "podcast_id": 13908,
        "title": "Lasting Looks",
        "description": "<p>We take you behind the scenes of pop culture's most iconic looks! We are set costumers who are obsessed with pop culture, fashion, and of course, costumes. We want to shine a light on costume designers and stylists to give them the credit they deserve!</p>",
        "language": "en",
        "author_name": "Jules & Meghan",
        "slug": "lastinglooks",
        "cover": "20230605_100642_32cd7ed868796edcd7e31f63b2ab9283.jpg"
    },
    {
        "podcast_id": 14490,
        "title": "InHinesight",
        "description": "People everyday are trying to figure life out and make sure we feel successful at doing it. For me, Matt Hines, this journey has led me to want to understand more about people's own successes in life. Not the objective ones like Fortune, Fame and Glory, but the dark valley’s people had to rise up through to get to the next peak within their life’s journey. I’m doing this as a sort of time capsule for myself to better understand what it means to be true to yourself as you follow that inner beacon and pursue your values and how the success from those choices evolved you into the present day person we see before us. ",
        "language": "en",
        "author_name": "Matt Hines",
        "slug": "inhinesight",
        "cover": "20201111_181349_c2ec9386a6a2b81b213bc5eac73da9ff.jpg"
    },
    {
        "podcast_id": 18210,
        "title": "The Nightsisters Podcast",
        "description": "A Star Wars Podcast dedicated to uplifting and highlighting the women that make the Star Wars fandom great. Weekly interviews by Madison Fairchild.",
        "language": "en",
        "author_name": "Madison Fairchild",
        "slug": "nightsisters",
        "cover": "20220705_020707_7dd1b100ae892d59f2287723940ea027.jpg"
    },
    {
        "podcast_id": 19877,
        "title": "Bonus Features ",
        "description": "Jacob and Marten bring you conversations with writers, directors, actors, academics, authors, podcast hosts, and fellow film freaks, delivering in-depth chats that, in one way or another, pair well with the movie(s) of the week. ",
        "language": "en",
        "author_name": "Jacob Knight and Marten Carlson ",
        "slug": "secrethandshakebonusfeatures",
        "cover": "20201221_071008_2a71ea3f8d67180567d2fce7ba5890d9.jpg"
    },
    {
        "podcast_id": 21483,
        "title": "The Things We Do: Podcast",
        "description": "A Podcast talking about Film, Life, Television, Culture, Mental Health and all that Fun Jazzy Stuff. Hosted by Martin Theobald",
        "language": "en",
        "author_name": "Martin Theobald",
        "slug": "thethingswedo",
        "cover": "20230123_010128_102b01f3aac060bf871b6822b934a41f.jpg"
    },
    {
        "podcast_id": 23305,
        "title": "Travolting",
        "description": "A weekly investigation into the strange filmographies of cinemas most fascinating careers. ",
        "language": "en",
        "author_name": "Jeff Sweeney & Stuart Elmore",
        "slug": "travolting",
        "cover": "20220731_020702_3312db125ed59f64e1b9818d65602105.jpg"
    },
    {
        "podcast_id": 24492,
        "title": "The Reel Girls Club",
        "description": "The Reel Girls Club, hosted by Lucie Rose, is a podcast to educate, inform, inspire and empower girls who want to work in cinema and television. In the podcast, I interview women in the industry, providing you with expert knowledge, tips and inspirational anecdotes about their careers.",
        "language": "en",
        "author_name": "Lucie Rose",
        "slug": "reelgirlsclub",
        "cover": "20210212_083124_212160dfd43616007aeca42fb2364cde.jpg"
    },
    {
        "podcast_id": 25181,
        "title": "SuperImage, Ltd.",
        "description": "Join Kyle and Carlos Plummer, the filmmaking duo of SuperImage, Ltd., as they interview and discuss filmmaking stories both past and present with fellow collaborators as well as industry professionals in this in-depth exploration of film, art and life in the modern age.",
        "language": "en",
        "author_name": "SuperImage, Ltd.",
        "slug": "superimageltd",
        "cover": "20210117_014323_ec9aa36e355ac05dc0f2a8a69cc5992e.jpg"
    },
    {
        "podcast_id": 28275,
        "title": "The ROQ Initiative",
        "description": "Podcast hosted by Diego Roque where we incorporate some comedy and dive in with creatives from all different sort of fields touching on the featured guests experiences, growth, taste, and more. Have a laugh, get in-depth and informed by tuning in!",
        "language": "en",
        "author_name": "Diego Roque",
        "slug": "theroqinitiative",
        "cover": "20210508_051242_a6de1145cb1d22db4b7d5e72e9ca302a.jpg"
    },
    {
        "podcast_id": 29381,
        "title": "Cinemagic",
        "description": "Cinemagic is a weekly look at the world of film and television. Ric and Janathan will look at everything from the current scene to past works. Each episode will bring something new from watch-alongs to interviews with industry professionals. ",
        "language": "en",
        "author_name": "Ric Acevedo",
        "slug": "cinemagic",
        "cover": "20210202_065734_5b93647bf2c98c953221c1bcc9b115fa.jpg"
    },
    {
        "podcast_id": 31306,
        "title": "The Deeper Into Movies Podcast",
        "description": "Conversations about cinema\nwith host Steven T. Hanley ",
        "language": "en",
        "author_name": "DEEPER INTO MOVIES",
        "slug": "deeperintomovies",
        "cover": "20210209_121757_65b95b9c06aaec3077ae8acb964072eb.jpg"
    },
    {
        "podcast_id": 40984,
        "title": "Totalfilm Podcast",
        "description": "Novinky, rozhovory s filmaři, pohledy do zákulisí, analýzy filmového byznysu. Nejsledovanější trailerový kanál českého YouTube do vašich uší. ",
        "language": "cs",
        "author_name": "Totalfilm.cz",
        "slug": "totalfilmcast",
        "cover": "20210319_211257_479eade980e17af981d282c81fc7afed.jpg"
    },
    {
        "podcast_id": 49692,
        "title": "Oscarbate",
        "description": "we probably havent thought this through, but we aren’t going to listen to the cop in our heads…we have takes and we are goin to give them, with or without anyone else input. Lack of oxygen meets investigative reporting  meets the guests you know and love, meets fun recommendations meets hard driven attitudes, you don’t wanna miss",
        "language": "en-us",
        "author_name": "Oscarbate",
        "slug": "oscarbate",
        "cover": "20220118_030130_08e2e5a303aaebc87b30ca271c79dc5c.jpg"
    },
    {
        "podcast_id": 50682,
        "title": "MIFF Unscripted",
        "description": "MIFF Unscripted brought to you by the Muslim International Film Festival is a podcast bringing together Muslim filmmakers, artists, creators, and more to discuss some serious and fun conversations alike. ",
        "language": "en",
        "author_name": "Muslim International Film Festival",
        "slug": "miffunscripted",
        "cover": "20210419_212323_2ed89a58276ddbba605ae1abf57c5c09.jpg"
    },
    {
        "podcast_id": 52703,
        "title": "Framework: The Last Podcast About Film",
        "description": "A film-centric podcast featuring various young filmmakers as they talk about how a single frame relates to the bigger picture. Producers, writers, directors, and cinematographers break down films and dig deeper into the art form as a medium for storytelling in this modern world. \n\nYOUTUBE  ►  https://www.youtube.com/channel/UCNlJ-KQroklp-XQXqLjssyA",
        "language": "en",
        "author_name": "Cameron Thorpe",
        "slug": "framework",
        "cover": "20220130_100108_6f05e74d779ae9c48af960bcecb440a2.jpg"
    },
    {
        "podcast_id": 53187,
        "title": "Reel Collections w/ Edward Beasley",
        "description": "A film history podcast that dives into the more obscure titles and filmmakers that helped shaped my love of cinema. ",
        "language": "en",
        "author_name": "Edward Beasley",
        "slug": "reelcollections",
        "cover": "20210429_184638_d56631a67158747f9a7d1e00f6526bad.jpg"
    },
    {
        "podcast_id": 53664,
        "title": "Portalville",
        "description": "<p>Comedy, Celebrity Interviews...and Horror. Welcome to Portalville. Hear what made us one of Apple Podcast's top 10 Comedy Fiction shows of 2022!</p><p>Subscribe to our YouTube channel &amp; watch our celebrity interview videos: <a href=\"https://www.youtube.com/channel/UCubA2hHRSpeZzG7r4FBD8_g/\">https://www.youtube.com/channel/UCubA2hHRSpeZzG7r4FBD8_g/</a></p><p>(Rad horror synth vibes for this show are provided by Karl Casey @ White Bat Audio):</p><p><a href=\"https://www.youtube.com/@WhiteBatAudio\">White Bat Audio - YouTube</a></p>",
        "language": "en",
        "author_name": "August Pots",
        "slug": "portalville",
        "cover": "20230316_120325_99d914ef7d608da7a5e88f83af5366db.jpg"
    },
    {
        "podcast_id": 71461,
        "title": "The Yellow Shirt Podcast",
        "description": "A one-on-one podcast where actor and YouTuber Tom Spoors (TXM) interviews a new creative every week about the content they create, their inspirations and processes. Tangents are common and frequent.",
        "language": "en",
        "author_name": "Tom Spoors",
        "slug": "yellowshirt",
        "cover": "20210803_005305_36c8ee6fde9604306d6f5d55e5d58fbd.jpg"
    },
    {
        "podcast_id": 72448,
        "title": "Scranton Talks",
        "description": "Are you an aspiring filmmaker? Do you love film? Or are you new to filmmaking? Scranton Talks is the podcast for you! It is inspirational, informative, and fun talks with other filmmakers about their projects and their journeys. Scranton Talks is part of the Independent Film Creative Hub. Based in Scranton, Pennsylvania, hosts Luz Cabrales and Desiree Zielinski founded the Independent Film Creative Hub which is geared to help filmmakers reach their potential in becoming successful creative artists!",
        "language": "en",
        "author_name": "Desiree Zielinski and Luz Cabrales",
        "slug": "scranton-talks",
        "cover": "20210808_134236_cfa6243c164b9cded1452d5b5bf0066a.jpg"
    },
    {
        "podcast_id": 75536,
        "title": "Swervinn’ Podcast ",
        "description": "Welcome to The Swervinn’ Podcast my people! I’m your host Darryl (Swerve_o) Buckhanan. Many have been on this ride & many are just joining but this isn’t just any podcast. This is the life of me as well. The guest I have within the platform are close within my life or true influencers. This pod will have many laughs but you will be able to take a little something from each guest and myself every episode as we vary from, life talks, mental health, the future, psychedelic talks, sports, music & always some Swervinn Q&A with every guest. So be sure to follow, catch up & stay tuned because the Swervinn’ is just really starting. ",
        "language": "en",
        "author_name": "Darryl Buckhanan",
        "slug": "swervinnpods",
        "cover": "20210929_211328_4e34f1330c130eb138332af6065e52cb.jpg"
    },
    {
        "podcast_id": 77039,
        "title": "Two Halves Podcast",
        "description": "<p>Keith Rock It, Bex and Blerdoc!</p>",
        "language": "en",
        "author_name": "Keith Rock It",
        "slug": "two-halves-podcast",
        "cover": "20230731_010711_490d4df4cd787bf52920a71fd34d3fb8.jpg"
    },
    {
        "podcast_id": 81118,
        "title": "Caropop",
        "description": "There may be nothing more inspiring and entertaining than relaxed, candid conversations among creative people. Mark Caro, a relentlessly curious journalist and on-stage interviewer, loves digging into the creative process with artists and drawing out surprising stories that illuminate the work that has become part of our lives. The Caropopcast is for anyone who wants to dig deeper into the music, movies, food and culture that they love.",
        "language": "en",
        "author_name": "Mark Caro",
        "slug": "thecaropopcast",
        "cover": "20210923_222107_f86600be468f0a94861a761a0e383d24.jpg"
    },
    {
        "podcast_id": 81296,
        "title": "The Mailroom",
        "description": "Hear from the unheard voices of Hollywood with \"The Mailroom.\" Each week welcomes a different up-and-coming entertainment industry professional to talk about their current role, experiences breaking into the industry, and future aspirations. New episodes every Monday!",
        "language": "en",
        "author_name": "Steven Aronow",
        "slug": "themailroom",
        "cover": "20211002_164157_20432bd2e5518c89a4d00a54ac7a9e37.jpg"
    },
    {
        "podcast_id": 87416,
        "title": "Beauty and the Beazts ",
        "description": "Podcasts discussing current episodes in The Walking Dead universe.",
        "language": "en",
        "author_name": "Renee Chris and Ryan ",
        "slug": "beautyandthebeazts",
        "cover": "20211027_180609_c1052605daa82e0354e3209094f9576a.jpg"
    },
    {
        "podcast_id": 87491,
        "title": "The Nobody's Podcast",
        "description": "Have you ever been listening to a podcast that has no relativity to your life at all? Well you've come to the right place. The Nobody's are average people like you and I, and here, we decide if we think they deserve to stay Nobody's, or if they have what it takes to be a Somebody. Do you think you have what it takes to be famous? lets find out.",
        "language": "en",
        "author_name": "Jackson Sorensen",
        "slug": "the-nobodys",
        "cover": "20211028_015621_6d5eee99a7ac901945cfc35facf55e0a.jpg"
    },
    {
        "podcast_id": 89518,
        "title": "Fright Fights",
        "description": "<p>Join your co-hosts, Chris Lacks, Tyler Cavin, and Mike McKinney, as they deep-dive into the darkest crypts of our favorite film genre. Three films enter, and one film wins.</p>",
        "language": "en",
        "author_name": "Chris Lacks, Tyler Cavin, and Mike McKinney",
        "slug": "frightfights",
        "cover": "20211108_181052_e0a874677c033ced2c4fb17ad36455bc.jpg"
    },
    {
        "podcast_id": 90285,
        "title": "ReelHorrorShow ",
        "description": "Join Lee and Mark, two lifelong horror fans and grumpy old gits, as they bring you news, reviews and interviews from the world of horror.",
        "language": "en",
        "author_name": "Lee Richmond Mark Green",
        "slug": "reelhorrorshow",
        "cover": "20220509_010543_eb0f77d25e32543d0bfbb9c13dfb6e0c.jpg"
    },
    {
        "podcast_id": 90867,
        "title": "The Sound of Cinema",
        "description": "Zonder muziek blijft er weinig over van een film. Want hoe eng is Jaws zonder geluid, hoe episch Star Wars zonder aanzwellend orkest? En hoe verliefd zijn Olivia Newton John en John Travolta zonder discobeat? Film schuurt, film knalt, film zucht, film klikt. En Filmhuis Den Haag laat het allemaal horen. In deze podcast reis je door de geschiedenis van de filmmuziek. Open je oren voor intiem pianospel, melancholische strijkers, opzwepende discobeats... of juist helemaal niets. Luister mee en je ziet meer!\n\nThe Sound of... is een klinkend programma dat schuurt, knalt, zucht en klikt. Met talks, podcasts, playlists, expo’s en meer, open je je ogen voor alles wat film te bieden heeft. Nieuwe geluiden, vertrouwde geluiden, tegengeluiden – Filmhuis Den Haag laat ze weerklinken. Luister mee en je ziet meer!\n\nMeer weten? Ga naar https://filmhuisdenhaag.nl/the-sound-of-cinema",
        "language": "nl",
        "author_name": "Filmhuis Den Haag",
        "slug": "fhdhthesoundofcinema",
        "cover": "20211116_180414_ed8c0e56dbb73a7d65fb3bb839ec31f2.jpg"
    },
    {
        "podcast_id": 91999,
        "title": "HORRORAMA ",
        "description": "<p>Horrorama es una plataforma de discusión para fans del cine de terror que pretende mostrar todo lo nuevo respecto películas, series, soundtracks y franquicias, así como revaluar clásicos así como joyas pérdidas alrededor del género. Conducido por: Mike Sandoval y Dengue</p>",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "horrorama",
        "cover": "20230419_090402_8d9731e526a49b5a6db0b0fc8abedb94.jpg"
    },
    {
        "podcast_id": 94298,
        "title": "We Are Not Reviewers",
        "description": "Tom Spoors and Aaron Murray, two passionate film fans, discuss films, the industry and more, all whilst barely knowing what they're talking about and not being qualified to do so!",
        "language": "en",
        "author_name": "Tom Spoors",
        "slug": "wearenotreviewers",
        "cover": "20211206_121254_ff281a12744ec210dd01b7d98f8eff73.jpg"
    },
    {
        "podcast_id": 95812,
        "title": "T's Reel Talk Podcast",
        "description": "T's Reel Talk Podcast is a conversation with some of the most talented and innovative filmmakers and audiences who love an occasional watch. From directors, actors, writers, and so on... We will be diving into the process, art, and lifestyle of filmmaking from every aspect. Even the occasional discussion with audiences who love a specific type of show or film. ",
        "language": "en",
        "author_name": "Tayyib",
        "slug": "reel-talks",
        "cover": "20211221_071243_30ba140712566913a7c85ee84489416f.jpg"
    },
    {
        "podcast_id": 97907,
        "title": "Mormon Book Reviews Podcast",
        "description": "\"Where an Evangelical Encounters the Restoration\"\n",
        "language": "en",
        "author_name": "Steven Pynakker",
        "slug": "mormonbookreviewspodcast",
        "cover": "20211231_021207_4f19bae2ab50ae26b2e6e8530813e24d.jpg"
    },
    {
        "podcast_id": 102128,
        "title": "Dream Baby Dream",
        "description": "Welcome to the DREAM BABY DREAM podcast. My name is Taylah Clements, and I talk all things life, acting, creative industries, mental health and just how to get by. Total disclaimer: I am not an industry professional, far from successful right now, but I feel I have a lot to chat about. ",
        "language": "en",
        "author_name": "Taylah",
        "slug": "dreambabydream",
        "cover": "20220120_030157_75fa2483ea148007cb3692f8ca44a08d.jpg"
    },
    {
        "podcast_id": 102622,
        "title": "Inclusion at Work by No Limits Media",
        "description": "Welcome to Inclusion at Work where we show the value and ability of people with disabilities through thoughtful interviews.\n\nOur host is Larry Rothstein, bestselling author and filmmaker focused on producing films and documentaries that improve job opportunities for people with disabilities.\n\nThis podcast is brought to you by No Limits Media (NLM), a non-profit dedicated to helping all people with different abilities live lives of opportunity and achievement through films, videos, podcasts, television, web, documentaries, art exhibits, and educational curriculum. Learn more at https://nolimitsmedia.org/\n",
        "language": "en",
        "author_name": "Larry Rothstein",
        "slug": "inclusionatwork",
        "cover": "20220121_060142_60f7de85238bc67e0b5bad89c4a3167e.jpg"
    },
    {
        "podcast_id": 102948,
        "title": "Obscuria Filmcast",
        "description": "There are currently close to half a million movies in circulation that date from the turn of the 20th century to the present day.  Obscuria Filmcast explores the countless films of note that have slipped through the cracks of history for one reason or another.  Our selections include box office flops that went on to become cult classics, made-for-TV movies that hold a special place in our hearts, groundbreaking documentaries that you've probably never heard of, as well as any obscure film with an emphasis on the strange, surreal, or grotesque.  Each week we rotate to a different host who presents a film for the other hosts to watch for the upcoming episode.  If you'd like to suggest a film for an upcoming episode and be featured as a guest on our special clubhouse edition of the podcast, feel free to email us at obscuriafilmpodcast@gmail.com.",
        "language": "en",
        "author_name": "Abram Kaplan",
        "slug": "obscuriafilmcast",
        "cover": "20220123_120157_f49c29b02708b9679156feda277b1275.jpg"
    },
    {
        "podcast_id": 109217,
        "title": "Andy's Podcasts",
        "description": "Early stages.",
        "language": "en",
        "author_name": "Andrew Brennan",
        "slug": "123456789987654321",
        "cover": "20220216_100217_2eae3c38dc528cc807e722f9eeb49016.jpg"
    },
    {
        "podcast_id": 111923,
        "title": "Sweeping The Country with Jimmy  Carter & Derik Walker",
        "description": "With over 70 years of collective broadcasting experience, we will take you on a journey that will make you think, laugh and sometimes cry! We'll talk news, current events, music, entertainment & more! With celebrity guests that will give you a \"Back Stage Pass\". It's \"Sweeping the Country\" with Derik & Jimmy...be part of it!",
        "language": "en-us",
        "author_name": "D. Walker",
        "slug": "sweepingthecountrywithderikwalkerandjimmycarter",
        "cover": "20220416_080435_37552f7018497d85dc88f29b6cb3240f.jpg"
    },
    {
        "podcast_id": 112942,
        "title": "The Mike Figgis Podcast",
        "description": "<p>A straight talking podcast about film, photography, music and whatever else crops up. </p>",
        "language": "en",
        "author_name": "Mike Figgis",
        "slug": "the-mike-figgis-podcast",
        "cover": "20220310_110310_419e4151af2326d5b9c19ff54d7b551f.jpg"
    },
    {
        "podcast_id": 112979,
        "title": "The FilmUp Podcast ",
        "description": "Welcome to The FilmUp Podcast, Your Home For All Things Filmmaking. We are Aryeh and Christina, Founders of FilmUp. Here we explore the journey of accomplished filmmakers and their road to success. \n\nEach podcast episode will be dedicated to a non-profit of our guest's choosing. We dedicate each podcast episode to a non-profit of our guest’s choosing to both highlight our interviewee’s passion outside of filmmaking and bring awareness to a good cause. Our goal is to use Film to move the world Up - FilmUp. \n\nCome join us for this week's episode and let's explore the world of filmmaking together. ",
        "language": "en",
        "author_name": "Aryeh Hoppenstein & Christina Chironna",
        "slug": "thefilmuppodcast",
        "cover": "20220304_060309_bb38ae45c8a13c05a4d42b6437d792c5.jpg"
    },
    {
        "podcast_id": 113628,
        "title": "Dezil & Reeser",
        "description": "Each episode, hosts Stefan Dezil and Jeffrey Reeser explore two films from past and present, how they relate and differ and how the cinematic medium is continuing to evolve. \n\nJeffrey Reeser is a filmmaker and writer from Ojai, CA whose credits include the features \"Shadow of a Gun\", \"Take None Give None\", \"Super Heady\" and the forthcoming \"Snake Oil Song\". He currently resides in Los Angeles.\n\nHailing from NY and South FL, Stefan Dezil is an American genre filmmaker, actor and illustrator of Haitian descent. He has worked with Disney, 20th Digital, VICE, Noisey, and Soundcloud. For his film \"The Treadmill\", he was nominated for the prestigious international Lumen Prize in the moving image category.  His latest, \"THIRST\" is currently streaming on HULU. ",
        "language": "en",
        "author_name": "Stefan Dezil and Jeffrey Reeser",
        "slug": "dezilreeser",
        "cover": "20220311_060313_276860e9d051316d2446de8d1ab3116c.jpg"
    },
    {
        "podcast_id": 114287,
        "title": "Steeping DIY ",
        "description": "<p>A Doors At Seven project to provide listeners with a close and intimate conversation with anyone and everything having to do with DIY music, art and more.</p>",
        "language": "en",
        "author_name": "DOORS AT SEVEN",
        "slug": "doorsatseven",
        "cover": "20230721_050707_ca20c49f5db9df0a5191713224bdb137.jpg"
    },
    {
        "podcast_id": 117019,
        "title": "Friend-chising",
        "description": "Welcome to my podcast, Friend-chising! \n\nThis is where I have separate interviews with some of my best friends in which we discuss their favorite transmedia franchises, what their point of entry was, paratexts they engage with, and more.  \n\n I am primarily interested in people's own world-building experiences, interactivity, and immersion (ie playing a videogame, going to Disneyworld, etc). Inevitably, I will be addressing what fan culture means to them about the franchise of their choice. \n\nRecorded at the outbreak of COVID-19, I had this idea due to the state of the world, and how I felt like more than ever transmedia could be a way to find respite when everything was constantly changing. ",
        "language": "en",
        "author_name": "Luiza Sobreira",
        "slug": "friend-chising",
        "cover": "20220323_010347_d175e3e21c26ebc029a893a2bda232b8.jpg"
    },
    {
        "podcast_id": 118328,
        "title": "Not The Final Cut",
        "description": "Just a couple of guys here to talk about movies and have a good time!\nJoin Us!",
        "language": "en",
        "author_name": "Greg Susi and Sam Brown",
        "slug": "notthefinalcut",
        "cover": "20220409_030403_c74b99b9bb551b1185667ffdfb744951.jpg"
    },
    {
        "podcast_id": 118845,
        "title": "Now Then Talks",
        "description": "NOW THEN! A podcast that discusses commercial and creative filmmaking. Our guests lay bare the ups and downs of finding a voice within an ever-changing and, at times, unforgiving industry.\n\nThis podcast is hosted by Ozzie Pullin and Craig Bingham, fellow directors and close friends.\n",
        "language": "en",
        "author_name": "Ozzie Pullin & Craig Bingham",
        "slug": "nowthentalks",
        "cover": "20220424_090423_8e1425708626c177983376aaa95f5a9e.jpg"
    },
    {
        "podcast_id": 119363,
        "title": "A.J. Chat",
        "description": "Covering topics in Film, TV, interviews with celebrities  and pop culture. And fun!",
        "language": "en",
        "author_name": "Jody A.J.Chat",
        "slug": "a-j-chat",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 120255,
        "title": "BYTE-SIZED | A Limited Podcast Series from the Reality Bytes Independent Student Film Festival",
        "description": "BYTE-SIZED is a student-produced podcast by Emily Fried and Ben Raeside accompanying the 2022 Reality Bytes Independent Student Film Festival. The goal of this podcast is to shed light on the students who run the festival, independent student filmmakers who have submitted their films, and the faculty who have created, directed, and judged for Reality Bytes. \n\nFind more info about Reality Bytes on our website: http://realitybytes.niu.edu \n\nWhere to watch the official selection after the festival, free of charge: https://vimeo.com/channels/1780343 \n\nYou can find Ben at the Multiverse Madness podcast, wherever you get your podcasts. You can also find Emily at @emilyfinchat on Instagram and Twitch.\n\nProduced by Emily Fried, Ben Raeside, and Dr. Laura Vazquez.\nHosted by Emily Fried and Ben Raeside.\nCover art and music by J. Fried.",
        "language": "en",
        "author_name": "Emily Fried and Ben Raeside",
        "slug": "byte-sized",
        "cover": "20220407_080431_dea253a67c4c34469eca61e59ff3af58.jpg"
    },
    {
        "podcast_id": 122090,
        "title": "Couch Conversations",
        "description": "Couch Conversations with Justin Couch focuses on interviewing public figures, athletes, pro wrestlers, musicians and well known content creators on social media. We dive into the stories of each individual and provide entertaining videos uploaded to Facebook and YouTube.",
        "language": "en",
        "author_name": "Justin Couch",
        "slug": "couchconversations",
        "cover": "20220414_030430_91423ed4205a94bb7ec7db70638309a0.jpg"
    },
    {
        "podcast_id": 129224,
        "title": "From Suarez's Basement - A Communication, Media, and the Arts Podcast",
        "description": "Are you looking for an exclusive, behind-the-scenes sneak peek from some of your favorite TV shows, movies, play, musicals, concerts, and more? Then, From Suarez’s Basement is the podcast for you! Our goal is to build a bridge between YOU, the audience, and those experts in the Communication, Media, and Arts fields. Our mission is to keep you informed, educated, and entertained by having meaningful conversations with the professionals who make the magic happen! In each episode, we welcome a new guest to speak about media industries’ present and future states, their work, and other essential matters. We want to welcome you to our family, and if you really like what we are doing, don’t forget to subscribe to our audio and video podcast in the links below for new episodes bi-weekly.",
        "language": "en",
        "author_name": "Francisco J Suarez ",
        "slug": "fsbasement",
        "cover": "20220721_090706_0baf096b773dd0b765b2ed72b0d3b302.jpg"
    },
    {
        "podcast_id": 132364,
        "title": "Mutant City Horror",
        "description": "<p>A low budget podcast about low budget horror - Each episode Mathias the Ill and Rated-PG get together over drinks to review low budget horror movies.</p>",
        "language": "en",
        "author_name": "Rated-PG & Mathius The iLL",
        "slug": "mutantcityhorror",
        "cover": "20221015_111037_72b8c4d3bf8a3f738659840db5a5a1d3.jpg"
    },
    {
        "podcast_id": 132395,
        "title": "The Video Store",
        "description": "<p>A weekly chat amongst friends working a shift at local video store. You know, the place you can go to once a week whenever it's movie night! Interesting customers pop in to rent something all the time. Come for the advice on what you could watch but stay for the characters you will come to love.</p>",
        "language": "en",
        "author_name": "Red Team Go",
        "slug": "thevideostore",
        "cover": "20230514_010507_ff66c3396391e2e113eff13ae9e8300d.jpg"
    },
    {
        "podcast_id": 132950,
        "title": "El Replicante",
        "description": "El Replicante es un lugar sobre cultura popular. Un espacio para hablar sobre cine, series, películas, cómics, libros, mangas y todo lo que tenga que ver en ese amplio espectro del ocio y el entretenimiento.",
        "language": "es",
        "author_name": "David Lorao",
        "slug": "elreplicante",
        "cover": "20220608_120632_9f99b0837436248e2376fc88228170f3.jpg"
    },
    {
        "podcast_id": 133536,
        "title": "L'Isola Nascosta Podcast ",
        "description": "Fabrizia Cao intervista i protagonisti dell'\"Isola Nascosta\", un cortometraggio basato su \"Ila\", il tredicesimo idillio di Teocrito, presentato in sala il 18/05/2022 al Cinemino.\n\nUn’isola nascosta, un viaggio impossibile. La morte del giovane Ila e la colpa presunta del suo mentore Eracle. Mito e realtà si incontrano nell’adattamento per schermo di Ila, il tredicesimo idillio del poeta greco Teocrito. \n\nTutti i retroscena e i segreti della produzione del corto dalle parole degli attori e della crew.\n\nOra disponibile in alcuni cinema a Milano, per sapere le date segui @isolanascostafilm su Instagram, Facebook, YouTube.",
        "language": "it",
        "author_name": "Tommaso Miragoli",
        "slug": "isolanascosta",
        "cover": "20220610_100623_792d9b77048573eb463c921359164f12.jpg"
    },
    {
        "podcast_id": 134558,
        "title": "Just Chit Chatting ",
        "description": "A podcast where I literally just sit and chit chat about every topic in the books! ",
        "language": "en",
        "author_name": "Celeste ",
        "slug": "justchitchatting",
        "cover": "20220615_060616_6e5294539accd054eabadf2d5b17b00b.jpg"
    },
    {
        "podcast_id": 138282,
        "title": "Midnight Terrors",
        "description": "A podcast hosted by two brothers-in-law celebrating all things horror! ",
        "language": "en",
        "author_name": "Kevin Roche",
        "slug": "midnightterrorspodcast",
        "cover": "20220703_010726_29852b0c73b07f81707568862a0a473a.jpg"
    },
    {
        "podcast_id": 138619,
        "title": "The Revenant Studios After Hours Podcast",
        "description": "This is a series where we interview Directors, Producers, Actors, Writers, and anybody else in the world of film.",
        "language": "en",
        "author_name": "Joshua B. Alexander",
        "slug": "therevenantstudiosafterhourspodcast",
        "cover": "20220705_070723_fc90a6a97d4d3e9616cc002658f4b8cd.jpg"
    },
    {
        "podcast_id": 139768,
        "title": "Martini's Up Podcast",
        "description": "A Tri-weekly Podcast made FOR Production Assistants BY Production Assistants. \n\nHost: Alexis S.\nMusic By: Jesse Rack$on\nSound Mixer: Jake Jurich ",
        "language": "en",
        "author_name": "Alexis S.",
        "slug": "martinisuppodcast",
        "cover": "20220715_020727_379ca004693c90b3c3193b320e6f76db.jpg"
    },
    {
        "podcast_id": 142075,
        "title": "The Coffee House Experience",
        "description": "A Podcast to discuss things pertaining to Bengal and Bengali people. Our informal discussions (a.k.a. Adda in Bengali) are long, topical and largely spontaneous. We mostly talk in Bengali and occasionally in English. The channel is run by three Engineering graduates from Jadavpur University, namely, Pratyay Mukherjee, Srinjoy Ganguly and Soumik Ghosh. ",
        "language": "bn",
        "author_name": "The Coffee House Experience",
        "slug": "thecoffeehouseexperience",
        "cover": "20220725_060722_51acb2d4a18ee6de9e9bc4e34cc03187.jpg"
    },
    {
        "podcast_id": 146363,
        "title": "FLEXXXZONE",
        "description": "<p>The FLEXXXZONE podcast is a platform that gives our voices a place to be heard. Its more than a podcast, it's a home for our cultures history and a voice for our future.</p>",
        "language": "en",
        "author_name": "Jay Henderson",
        "slug": "flexxxzone1",
        "cover": "20230604_020619_086267d49ccb310b4c80ae2168030c24.jpg"
    },
    {
        "podcast_id": 146944,
        "title": "Parche Magistral",
        "description": "Parche Magistral es un espacio de difusión para artistas. Nos interesamos por los procesos creativos que van detrás de las obras. Aquí cualquiera puede hacerlo Magistral. ",
        "language": "es",
        "author_name": "Jacobo Ortiz y Julián Escalante",
        "slug": "parchemagistral",
        "cover": "20220816_100845_cf3b8a54a7e195e0bb99179b49b289bf.jpg"
    },
    {
        "podcast_id": 148354,
        "title": "Movie Marathon",
        "description": "Join Andrew and Mike as they try to recapture the magic of the movie marathons from their youth. Email us at moviemarathonwam@gmail.com. Follow us on Twitter at @moviemarathonAM",
        "language": "en",
        "author_name": "Murph and Mike",
        "slug": "moviemarathon",
        "cover": "20220823_040807_52a7cdabe0073647fefc79eec2479861.jpg"
    },
    {
        "podcast_id": 150623,
        "title": "FILMD Chats",
        "description": "FILMD Chats",
        "language": "en",
        "author_name": "FILMD",
        "slug": "filmd",
        "cover": "20220905_050952_dce4b2a6ef8ce0bf1c2d61a2f0047e21.jpg"
    },
    {
        "podcast_id": 150994,
        "title": "Batman the Animated Series Podcast",
        "description": "A podcast where DC Comics artist & writer Will Robson and mega Batman fan Alex Robson, delve into the critically acclaimed Batman the Animated Series! \nThis podcast takes a close look at this groundbreaking series, including: episode reviews, cast and crew interviews, toy and merchandise retrospectives, character designs, music reviews, comic book influences, and so much more. \nThis is the definitive podcast for all BTAS fans and one you won't want to miss!",
        "language": "en",
        "author_name": "Alex & Will Robson",
        "slug": "batmantaspod",
        "cover": "20220904_090918_98f412b608f4c876793699268a00c59b.jpg"
    },
    {
        "podcast_id": 151556,
        "title": "DR BEN Chats with...",
        "description": "Medical writer and broadcaster Dr Ben chats with various SUPER-DUPER COOL people, like scientists, musicians, actors, athletes and other very special guests. Here, you'll find a mix of past radio shows and interviews. \n\nPrefer live radio? Tune in live to Cornwall's Coast FM to hear more!",
        "language": "en",
        "author_name": "Ben Makin",
        "slug": "drben",
        "cover": "20220906_050903_74688d9f0ce633ccccf131b55cba0341.jpg"
    },
    {
        "podcast_id": 152121,
        "title": "The CultWorthy Classic",
        "description": "A cinema podcast dedicated to obscure films and cult classics made before 1970!",
        "language": "en",
        "author_name": "Antonio Palacios",
        "slug": "thecultworthyclassic",
        "cover": "20220911_020925_8c4e26aa401f34ff41dfabc7f2cabb7b.jpg"
    },
    {
        "podcast_id": 155695,
        "title": "GRAYZONE",
        "description": "A New Interview Podcast",
        "language": "en",
        "author_name": "Gray Barnard",
        "slug": "grayzone",
        "cover": "20220925_120933_592d1370d604ee8a5fc469b9ab3a14ec.jpg"
    },
    {
        "podcast_id": 156133,
        "title": "The Immediately No Podcast",
        "description": "Thank you so much for tuning in! I am here on a mission to entertain and become one of your best friends! I take on multiple topics, regular life struggles, pop culture and any other themes that might come up in my head! Always ending each episode with some food for your soul, some may say *the vibes are immaculate here*.\n\nHave a great day everyone!\n\nMy other media:\nTikTok, Instagram & Youtube: MarielaaMorales",
        "language": "en",
        "author_name": "Mariela Morales",
        "slug": "immediatelynopodcast",
        "cover": "20230104_090107_1c6806542c8b9d35e2b3cb6321762113.jpg"
    },
    {
        "podcast_id": 156717,
        "title": "EL CAFE DE RICK",
        "description": "EL CAFE DE RICK - La web del Cine Clásico.\nLos mejores Documentales del Cine Clásico: Películas,generos,actores,actrices,directores ",
        "language": "es",
        "author_name": "El Cafe de Rick",
        "slug": "cinepodcast",
        "cover": "20220930_070932_85881fc45a9d6c50aadfa1f0c7f8c2b3.jpg"
    },
    {
        "podcast_id": 158750,
        "title": "Que•💕•Pedishhh !!!",
        "description": "Welcoming everyone to this amazing aventura con un Pedishhh chingon !",
        "language": "en",
        "author_name": "Yes Garcia",
        "slug": "que-pedishhh",
        "cover": "20221007_091050_d965a5dd43ace37caac7e643fa57edb3.jpg"
    },
    {
        "podcast_id": 159667,
        "title": "39 Minute Conversations",
        "description": "<p>Screenwriter, actor, comedian, and shut-in Brian T. Arnold hosts a podcast about reconnecting with old friends and making new ones. But, he's only got 39 minutes to do it because he will not be paying for Zoom Pro. Conversations feature screenwriters, comedians, filmmakers, actors, and more. Music by Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 4.0 License http://creativecommons.org/licenses/by/4.0/</p>",
        "language": "en",
        "author_name": "Brian T. Arnold",
        "slug": "39minuteconversations",
        "cover": "20230110_090119_996da9e0ca4eeb6df1da42e4988157e9.jpg"
    },
    {
        "podcast_id": 159861,
        "title": "The VaMo Radio Podcast",
        "description": "The VaMo Radio Podcast gives the inside scoop into the music, acting, modeling, and entertainment industry with special celebrity guests & updates on their upcoming projects and endeavors. We also have our \"Featured Artist Spotlight\" where we highlight an up and coming artist sharing news of their new music releases and projects. We also give exclusive views into our upcoming endeavors with open welcome to the public.",
        "language": "en",
        "author_name": "VaMo",
        "slug": "vamoradio",
        "cover": "20221012_041024_111cd0f7dc34ebd84c18f81e90488f57.jpg"
    },
    {
        "podcast_id": 161380,
        "title": "Cinema Pathway",
        "description": "Cinema Pathway Podcast is about the craft of filmmakers who are active in the film industry in the United States & around the world. We have assembled this venue to start an honest and friendly conversation about how unique every individual is in their craft's approach as they manifest themselves professionally with different experiences, styles, and techniques with our host, Howard Brande. We will get you up close and personal with every one of our guests, going deep into a conversation that will bring enlightenment to your career path in this fantastic world of cinema. It is an opportunity to hear great filmmakers of all types of the spectrum who have one thing in common, their love for cinema.",
        "language": "en",
        "author_name": "Howard Brande",
        "slug": "paradoxicalfilms",
        "cover": "20221018_031028_4a516af0a198d60acddc2f37627afb51.jpg"
    },
    {
        "podcast_id": 162208,
        "title": "AltWire Podcast",
        "description": "<p>Welcome to the AltWire podcast, where we share candid interviews with some of the best names in the Entertainment Industry. Hosted by Derek Oswald.</p><p>SUPPORT US AND HELP US GROW: <a href=\"https://www.buymeacoffee.com/altwire/\">https://www.buymeacoffee.com/altwire/</a></p>",
        "language": "en",
        "author_name": "Derek Oswald",
        "slug": "altwire",
        "cover": "20230828_120838_d5229fd5dd4180c6cb15765d53b9d7f5.jpg"
    },
    {
        "podcast_id": 164102,
        "title": "The Watchful Knight's Week in Review",
        "description": "Tune in each week to hear The Watchful Knight expand on his reviews of the past week, give you a film to keep on your radar, and other recommendations! Follow @thewatchfulknight on Instagram and watchfulknight on Letterboxd.",
        "language": "en",
        "author_name": "Eshiv Garg",
        "slug": "thewatchfulknight",
        "cover": "20221029_101052_8a7d9ce5ffe38cd49557694b04a5c4b6.jpg"
    },
    {
        "podcast_id": 164384,
        "title": "Living To Write",
        "description": "<p>Welcome to the<em> Story Summit</em> Podcast - Living To Write. This podcast is presented in collaboration with David Paul Kirkpatrick, founder of <em>Story Summit</em>. In each episode, screenwriter Brian Landwehr and writer-director Bailey Patterson delve into conversations with accomplished writers to explore their creative processes, triumphs, challenges, and insights.</p><p>Living To Write features raw, unfiltered discussions with authentic individuals.</p>",
        "language": "en",
        "author_name": "Brian Landwehr and Bailey Patterson",
        "slug": "livingforwriting-storysummit",
        "cover": "20221031_031032_753a3c8961804ed70ba94ce3d3c7407b.jpg"
    },
    {
        "podcast_id": 164708,
        "title": "LowKey Curious ",
        "description": "A Visual podcast delivering the witty, non-professional opinions of a bunch of awesome, diverse chicks and one average white dude, who all work together at an Entertainment Production Company. This motley crew will be covering essential adulting topics such as dating, movies, societal taboos, pop culture, crypto and other things to help you better navigate through this pile of crap called life. \n \nStay tuned for weekly episodes (unless we royally screw up).\n",
        "language": "en",
        "author_name": "LowKey Curious",
        "slug": "lowkeycurious",
        "cover": "20221101_081116_8c30fca3bb74d9cf0fbd0c059da169e1.jpg"
    },
    {
        "podcast_id": 168593,
        "title": "Cinema Vixens",
        "description": "Bi-weekly film podcast highlighting the girls and gays of cinema. \n\nwww.CinemaVixens.com\n@cinemavixenspod on IG and Twitter! ",
        "language": "en",
        "author_name": "Steph Cozza, and Madison Fairchild",
        "slug": "cinemavixens",
        "cover": "20221117_051141_20df1975b35ccac44d40a0165887e4e7.jpg"
    },
    {
        "podcast_id": 169242,
        "title": "NT Movie Reviews",
        "description": "<p><strong><em>Nick Tiffany's Movie Reviews</em></strong> has been a destination for film reviews, podcasts, talent interviews, and all sorts of information on movie news for over a decade! Now, we offer an audio take on the latest films and news in the world of cinema. We'll cover theatrical releases, streaming and digital releases, film background information, and we'll offer more in-depth discussions about particular films as well.</p>",
        "language": "en",
        "author_name": "Nick Tiffany",
        "slug": "nicktiffanysmoviereviews",
        "cover": "20230711_090740_9ebfd1c921e53194badf5fc265ac4d95.jpg"
    },
    {
        "podcast_id": 170792,
        "title": "The Greg Gab",
        "description": "Greg is a witty conversationalist looking for the scoop on all things young filmmakers. His podcast, The Greg Gab is a bi-weekly podcast where he sits down with your favorite ‘under 30’ film-makers and through inquisitive conversation, aims to learn for about them, their upcoming projects, and their process to making it happen.",
        "language": "en",
        "author_name": "Gregory Jones",
        "slug": "thegreggab",
        "cover": "20221127_061108_b36d2bdf30c50e6ff626de856c49e488.jpg"
    },
    {
        "podcast_id": 171511,
        "title": "Burnt Orange Dreams",
        "description": "Hi, this is a podcast about films. I will speak with writers, directors, actors, composers, cinematographers, and just about anyone else connected to films and filmmaking. Oh and TV shows. I love music too, so I will definitely talk to some musicians. Um, I'll talk to chefs and cooks about food too. I might talk to some authors. Politics? Most likely! I know that podcast logic is that you should only talk about one thing, but I probably won't. Maybe Burnt Orange Dreams is just about the things that I am passionate about. Yeah, that sounds about right. ",
        "language": "en",
        "author_name": "Dolores Quintana",
        "slug": "burnt-orange-dreams",
        "cover": "20221204_081227_f5764b92e19ebdf751a78cd8e7674e2f.jpg"
    },
    {
        "podcast_id": 178592,
        "title": "Esserenero Show",
        "description": "Esserenero Show è un format di interviste a personaggi noti all’interno della comunità nera che possono fingere da ispirazione per i giovani afrodiscendenti. Il format si sviluppa anche al di là delle telecamere: le interviste sono svolte in live in teatro per incontri con soggetti conosciuti a livello nazionale e internazionale. Esserenero Show é condotto da Marlon Brandão , attore angolano dalla personalità carismatica",
        "language": "it",
        "author_name": "condotto da Marlon Brandão",
        "slug": "essereneroshow",
        "cover": "20230106_060110_bceb4a359388f62290843fbc49de30d6.jpg"
    },
    {
        "podcast_id": 179261,
        "title": "The London Horror Society Podcast",
        "description": "Chatting with pioneers of independent horror to demystify the process and share the info you need to make your film. New episodes every Friday.",
        "language": "en",
        "author_name": "Jim Dexter and Chris Nials",
        "slug": "londonhorrorpod",
        "cover": "20230114_010154_c899c180470b8f9c665aca97faa60472.jpg"
    },
    {
        "podcast_id": 179614,
        "title": "Afterimages",
        "description": "<p>Afterimages is a podcast for cinephiles that takes a deep dive into moving images. Each episode features a special guest who is invited to explore a film of their choice with your hosts, film writers Franck Boulègue and Marisa C. Hayes.</p>",
        "language": "en",
        "author_name": "Franck Boulègue & Marisa C. Hayes",
        "slug": "afterimages",
        "cover": "20230614_070608_36ef7f49976c8846de6af21ad368c98e.jpg"
    },
    {
        "podcast_id": 181248,
        "title": "Viatge a Júpiter",
        "description": "<p>El pòdcast de la Filmoteca de Catalunya.</p>",
        "language": "ca-es",
        "author_name": "Filmoteca de Catalunya",
        "slug": "filmotecacat",
        "cover": "20230119_030142_30aea83af1369d0cf8b092f8e6dac2f0.jpg"
    },
    {
        "podcast_id": 182651,
        "title": "The WATCHLIST Podcast",
        "description": "<p>Join up-and-comers Josh Toomes (@joshtoomes.films) Ellis Pignanelli, Felicity Horsfall and Archie Smith as weekly they go through their MOVIE/TV WATCHLIST and discuss what's going on in the film world right now.</p>",
        "language": "en",
        "author_name": "Josh Toomes",
        "slug": "thewatchlistpodcast",
        "cover": "20230202_080224_76adfee9d92ab045912022a9d48d67d9.jpg"
    },
    {
        "podcast_id": 183246,
        "title": "The Good Film Archive ",
        "description": "<p>TGFA is a platform for film lovers from the MENA region. We Journey through films from all over the world, trying to answer one simple question: What's a good film? </p>",
        "language": "ar",
        "author_name": "Karim El Dalil",
        "slug": "thegoodfilmarchive",
        "cover": "20230809_010805_611556985178340a556c704690af804c.jpg"
    },
    {
        "podcast_id": 183499,
        "title": "The Reel Thing",
        "description": "From Bergen Filmklubb comes 'The Reel Thing', a podcast hosted by Joe Lawrence, in which he covers the films included in the film club's existing and upcoming program. Join him as he discusses the movies, the film industry, and much more with guest stars ranging from members of the club, to industry professionals.",
        "language": "en",
        "author_name": "Bergen Filmklubb",
        "slug": "thereelthing",
        "cover": "20230201_110206_353e1a24164966e31df719982e6979b5.jpg"
    },
    {
        "podcast_id": 184556,
        "title": "The Popcorn Podcast",
        "description": "<p>Hosted by Dylan Annasingham, The Popcorn Podcast brings together like-minded individuals, including fellow film enthusiasts, filmmakers and content creators alike, to discuss all things film, television, art and entertainment!</p>",
        "language": "en",
        "author_name": "Dylan Annasingham",
        "slug": "thepopcornpodcast17",
        "cover": "20230620_030657_4fc41be69ed370ecc018470bae01b468.jpg"
    },
    {
        "podcast_id": 185477,
        "title": "Create Your Opportunity Podcast",
        "description": "Yo whats up Im Jeff Williams Jr and I am launching a new podcast called ‘Create Your Opportunity pod’.  Twice a Month I will be sitting down with individuals who I believe are real \"difference makers\" in their respective industries. My guests will include Professional Athletes, Tv Personalities, Actors, Real Estate agents, and much much more. During these interviews we will dive into my guest journey, learn what keeps them motivated, and break down how they’ve created opportunities themselves. AND Hopefully give you, the viewer, the motivation and ‘blueprint’ to create your own!",
        "language": "en",
        "author_name": "Jeff Williams Jr",
        "slug": "createyouropportunitypod",
        "cover": "20230201_050256_d1a694f3e5e7b82d2662b864863f218e.jpg"
    },
    {
        "podcast_id": 186253,
        "title": "Greetings From Beyond Radio",
        "description": "This channel is dedicated to the pursuit of discussing the Supernatural, Demonology, Unsolved Mysteries, Horror and engaging our listeners to better give them what topic they would want us to cover but to give them a voice amidst this journey we all call life.",
        "language": "en",
        "author_name": "Rich Valdes and Vickie Burnett",
        "slug": "greetingsfrombeyondradio",
        "cover": "20230203_040219_0fe1f1219bcb98f6d4c8f3c25ef6f5ce.jpg"
    },
    {
        "podcast_id": 189888,
        "title": "Fandom Sessions",
        "description": "<p>We bring you interviews from talented people in all mediums of entertainment including your favorite movies/TV, anime, and comics as well as coverage of some of our favorite pop culture events and conventions!</p>",
        "language": "en",
        "author_name": "Geek Network",
        "slug": "fandom-sessions",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 190062,
        "title": "The Sidekick Critic Podcast",
        "description": "<p>Welcome to the Sidekick Critic Podcast! It's time we gave attention to all the Robins of the world, especially while looking at the film industry. In that vein we are happy to present this new film &amp; entertainment industry podcast! Our love for film and seeing movies in theaters has spawned this new podcast. Join us while we review the newest releases to theaters, highlight the sidekicks of each film we review, and look at the film industry at large and give our thoughts on it!</p>",
        "language": "en",
        "author_name": "The Sidekick Critic",
        "slug": "sidekickcritic",
        "cover": "20230216_050250_3e373284c4b839a33d2e70fa1a15b914.jpg"
    },
    {
        "podcast_id": 193912,
        "title": "Studio Six Productions ",
        "description": "<p>We do live streams for the paranormal community as well as educate people in the paranormal field. My name is <strong>Jay</strong>, and I am the <strong>founder</strong> of <strong>Studio Six Productions</strong>, I am also a <strong>Psychic Medium</strong> who not only interviews people in the paranormal field but other members of the collective spiritual community. Such people like <strong>Mediums</strong>, <strong>researchers</strong>, <strong>Authors</strong>, <strong>Actors</strong>, <strong>musicians</strong>, <strong>ect</strong>. We have 3 shows under this banner, 2 of which I host. Come give us a listen.</p><p>..</p><p>I am also petitioning funds for a start up paranormal documentary show in which I hope to start within this year. Donations are very welcomed</p><p><a href=\"https://gofund.me/9a5d536d\">https://gofund.me/9a5d536d</a></p>",
        "language": "en",
        "author_name": "Jay Hill",
        "slug": "studiosixparanormal",
        "cover": "20230906_120932_e7b1f101ca196d86dae4baa910e2aa7c.jpg"
    },
    {
        "podcast_id": 200883,
        "title": "SKST Radio Network and Podcast",
        "description": "<p>SKST Radio Network; Podcast offers a variety of great shows. The Kami Grayson Show debuted in 2021 from SKST Radio studios in Virginia. SKST along with Authors, Reel Talk, Artist Network, and Small Business Network. She began her career in radio/podcast in TX in 2009 and quickly developed a reputation for her warm and honest ability to talk and meet with Movie Stars, Celebrities, Directors, Actors, and artists. Her quick wit and sometime no-filter fun interviews. Fans quickly fell in love with Grayson's candor, which also can ruffle feathers among some of those entertainers along the way. Support this podcast: <a href=\"https://podcasters.spotify.com/pod/show/skstradio/support\">https://podcasters.spotify.com/pod/show/skstradio/support</a></p><p>Kami Grayson, Podcast Hostess</p>",
        "language": "en",
        "author_name": "Kamili Grayson",
        "slug": "skstradionetwork",
        "cover": "20230402_060438_91635aebee41f40bba066f35b4143dc9.jpg"
    },
    {
        "podcast_id": 201367,
        "title": "Lister: In Conversation",
        "description": "<p>Join Ben Lister every week as he interviews some of the biggest radio stars within England!</p>",
        "language": "en",
        "author_name": "Ben Lister",
        "slug": "listerinconversation",
        "cover": "20230404_090404_7e2082f3d4391dffa5fee94130c81eb5.jpg"
    },
    {
        "podcast_id": 203181,
        "title": "Zbliżenia. Alicja Resich",
        "description": "<p>Cykl podcastów video Alicji Resich pokazuje największe gwiazdy w Polsce z niedostępnej dla większości osób i mediów strony. Jakimi wartościami kierują się w życiu? Co daje im szczęście? Które doświadczenia i relacje ukształtowały ich biografie i wpłynęły na kierunek rozwoju? Rozmowy Alicji Resich z artystami i przedstawicielami show-biznesu motywują i zachęcają do działania i rozwoju.</p><p>Alicja Resich to niekwestionowana ikona polskiego dziennikarstwa. Autorka i prowadząca pierwszego talk show „Wieczór z Alicją\". Mistrzyni wywiadu. Od sześciu lat realizuje w Polsacie program \"W bliskim planie\".</p>",
        "language": "pl",
        "author_name": "Zbliżenia",
        "slug": "zblizenia",
        "cover": "20230917_030940_34c4dd0b00d7e8342f952ec360af6680.jpg"
    },
    {
        "podcast_id": 204699,
        "title": "IN with LINDA DANO",
        "description": "<p>Interviews with people from Daytime, Fashion &amp; The Arts and just talking about everyday life.. Tune IN with Linda Dano!</p>",
        "language": "en",
        "author_name": "Linda Dano",
        "slug": "lindadano",
        "cover": "20230421_090459_f15a3c2afa4311a02cfa0bdde57ab148.jpg"
    },
    {
        "podcast_id": 205592,
        "title": "The All Bro’s",
        "description": "<p>The All Bro’s are two bros that enjoy a good film and all things superhero-related. They talk about all the things that they find interesting in the world of film and also talk about all their collectible purchases like Funko Pops, Blu-Ray Steelbooks, and also breakdown movies that they’ve seen to give them a final grade. Join two bros on their adventure to give movies the rating they truly deserve.</p>",
        "language": "en",
        "author_name": "The All Bro’s",
        "slug": "the-all-bros",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 210753,
        "title": "Mysfit Live",
        "description": "<p>Mysfit Radio Is a networking platform for up and coming Artist to share, promote, and interact with one another on a more personal level. </p>",
        "language": "en",
        "author_name": "Mysfit Muziq",
        "slug": "mysfitlive",
        "cover": "20230522_010529_b633858cbce44653c0eb72262def1183.jpg"
    },
    {
        "podcast_id": 211160,
        "title": "Flash Johnson | Director's Cut ",
        "description": "<p>\"Director's Cut Hosted by Flash Johnson\" is an esteemed show meticulously crafted by the visionary Flash Johnson, with production handled by the esteemed collaboration of Movies Only Productions and MSB Films. This exceptional series aims to fulfill its objective of captivating audiences by conducting profound and insightful interviews with the world's foremost music video directors. Through engaging discussions, this show delves deep into the behind-the-scenes perspectives and remarkable stories of these industry giants, while inspiring and igniting the aspirations of the next generation of talented directors.</p>",
        "language": "en-gb",
        "author_name": "Flash Johnson",
        "slug": "flashjohnson",
        "cover": "20230524_040531_191e2aa8ca1241da61b47f11c2e7c931.jpg"
    },
    {
        "podcast_id": 211576,
        "title": "Cuentame Cosas ",
        "description": "<p>¡Bienvenidos a Cuentame Cosas! Este es el espacio donde la curiosidad y la intriga se encuentran. Exploramos una amplia variedad de temas fascinantes y misteriosos en forma de podcasts, entrevistas y otras secciones emocionantes.</p><p>En nuestros episodios de podcast, te sumergirás en relatos cautivadores de eventos históricos intrigantes, enigmas sin resolver y fenómenos sorprendentes. Te llevaremos de la mano en un viaje de conocimiento y entretenimiento, descubriendo detalles sorprendentes que te dejarán pensando.</p><p>Además, Cuentame Cosas te brinda entrevistas exclusivas con expertos, investigadores y personas apasionadas por diferentes áreas de estudio. Obtendrás una visión más profunda de los temas que exploramos y tendrás la oportunidad de escuchar las perspectivas y conocimientos de profesionales en el campo.</p><p>Y eso no es todo. En el futuro, también presentaremos otras secciones emocionantes, donde abordaremos temas adicionales, desafíos divertidos y sorpresas para mantenerte enganchado.</p><p>Suscríbete a nuestro canal para no perderte ninguno de nuestros episodios de podcast, entrevistas y emocionantes secciones futuras en Cuentame Cosas. ¡Acompáñanos en este viaje de descubrimiento y entusiasmo!</p><p>.</p><p>.</p><p>.</p><p>.</p><p>No olvides seguirnos en todas las plataformas para que no te pierdas ninguna noticia!</p><p>IG de Cuentame cosas: <a href=\"https://www.instagram.com/cuentame.cosas/\">https://www.instagram.com/cuentame.cosas/</a></p><p>IG de Julio: <a href=\"https://www.instagram.com/juliopardog/?hl=en\">https://www.instagram.com/juliopardog/?hl=en</a></p><p>IG de Gian: <a href=\"https://www.instagram.com/giandominici_/\">https://www.instagram.com/giandominici_/</a></p>",
        "language": "en",
        "author_name": "Julio Pardo ",
        "slug": "cuentame-cosas",
        "cover": "20230526_020557_0a52668d89caa9d3ddc489662dee6b8f.jpg"
    },
    {
        "podcast_id": 214162,
        "title": "Would You Give Me A Stagehand? ",
        "description": "<p>Hello! Welcome to the Would You Give Me A Stagehand? podcast. Join Tobi Pitan, an aspiring filmmaker, as he interviews friends, colleagues, and various professionals in the entertainment industry and asks them how they got there. Some topics covered include how necessary is film school, joining a union, and what is it like to be in a writer's room. The industry is huge, but there's a lot of room. Join him as he asks his guests, how far are you willing to go for a career in the entertainment industry?</p><p>Special thanks to Cash O'Brien(@cash.obrien) for making the theme music.</p><p>socials:</p><p>Instagram: @tobi.pitann</p><p>Website: <a href=\"http://tobipitanfilms.weebly.com\">http://tobipitanfilms.weebly.com</a></p><p>Youtube: <a href=\"https://youtube.com/@tobipitanmakingfilms?si=kv6SUGKvJiwm-t4d\">https://youtube.com/@tobipitanmakingfilms?si=kv6SUGKvJiwm-t4d</a></p>",
        "language": "en",
        "author_name": "Tobi Pitan",
        "slug": "wygmas",
        "cover": "20230609_060633_efee030a3d99b4f7bd662c2bb7e4d8fb.jpg"
    },
    {
        "podcast_id": 216065,
        "title": "Massacre Radio with Membersonly Dave",
        "description": "<p>Join Membersonly Dave, the baddest boy in Cleveland, as he jams your ears with MASSACRE RADIO! Terrifying guests of the horror film world and beyond! Spooky sketches! Silly Psyops! Are you ready?!</p>",
        "language": "en",
        "author_name": "Massacre Video",
        "slug": "massacreradio",
        "cover": "20230620_060621_ed73917cda70b00b3963866fa58dc6a3.jpg"
    },
    {
        "podcast_id": 216318,
        "title": "Coming Soon - Cigars & Shots",
        "description": "<p>My name is ABee and Im a Filmmaker. lets do this!!</p>",
        "language": "en",
        "author_name": "ABee",
        "slug": "cigarsandshots",
        "cover": "20230622_120645_0ee98756a5c9ce5de2ca0cce58ab444c.jpg"
    },
    {
        "podcast_id": 216887,
        "title": "The Hunter Davidson Radio Hour",
        "description": "<p>Come form a new para-social relationship with Hunter and his friends! Conversation, insight, goofs, gags, riffs, bits, laughs, and beer. Crack open your favorite cold beverage and come hang out for a little bit. It can't hurt.</p>",
        "language": "en",
        "author_name": "Hunter Davidson",
        "slug": "thehunterdavidsonradiohour",
        "cover": "20230626_040602_024e1b1fe26d02d38b88431c78cf3e20.jpg"
    },
    {
        "podcast_id": 217468,
        "title": "Ciné-story",
        "description": "<p>هنا البودكاست الجديد لتحيا السينما، خيرنالو اسم سينيستوري، بصح وعلاش سينيستوري؟</p><p>.على خاطر حاولنا فيه الجمع بين الشغف الذي يدفع صانع الفيلم لإنجاز فيلمه والشغف الذي يجعل المتلقي يتحدث عنه مطولا.</p><p>اخترنا هذه المرة فيلم \"تحيا يا ديدو\" ليس فقط لأننا استلهمنا منه الهوية البصرية لمؤسسة ومنصة تحيا السينما بصح لأننا نعتقد أيضا أنه يشكل جزء هام من هوية السينما ككل في الجزائر</p><p>هنا، حديث جمعنا مع \"مينة\"، أستاذة وباحثة في النقد المسرحي في جامعة الجزائر 2.. المفارقة أن هذا الحديث ماكانش الهدف منه الوصول لقراءة نقدية ومقاربات بحثية بقدر ما أردنا الغوص من خلاله في ذاكرة سيدة تختبئ فيها صورة طفل صغير قال يوما \"قولي لي يا بهجتي\"</p><p>فهل مازال ذلك الطفل حيا؟</p>",
        "language": "ar",
        "author_name": "Tahya cinema ",
        "slug": "tahyacinemapodcast",
        "cover": "20230630_020629_8e81b89008235d6c5ca15b9bbedc1562.jpg"
    },
    {
        "podcast_id": 218975,
        "title": "Woodstock Film Festival's LET'S TALK FILM! Podcast",
        "description": "<p>The official Woodstock Film Podcast, where we feature Alumni and friends of the festival + talk about all things indie film!</p><p>Follow us @woodstockfilmfestival on YouTube, TikTok, Instagram, Twitter, Facebook, &amp; Letterboxd.</p><p>Connect with us: <a href=\"https://linktr.ee/WoodstockFilmFestival\">https://linktr.ee/WoodstockFilmFestival</a></p>",
        "language": "en",
        "author_name": "Woodstock Film Festival",
        "slug": "woodstockfilmfestival",
        "cover": "20230711_040753_1e396b63df545306dcb781a2f2c62fd9.jpg"
    },
    {
        "podcast_id": 219657,
        "title": "The VHS Vault Podcast",
        "description": "<p>Welcome to the VHS Vault Podcast! We are so happy you found us. What we hope to do in our show is introduce you to movies you may not have seen before... forgotten gems that we like to say we 'pull from the vault.'</p><p>Our main focus is older horror movies, but we will do other types and ages of movies as well. Stick around, and get to know us! If you have any movies you'd like for us to watch, leave the name in the comments!</p>",
        "language": "en",
        "author_name": "Owen Brand & Katie Kadaver",
        "slug": "vhsvaultpodcast",
        "cover": "20230716_050709_2be8cf6b168185059044c29ba95a2343.jpg"
    },
    {
        "podcast_id": 220226,
        "title": "Ciné-story ",
        "description": "<p>يمكن للأفلام أن تحكي قصصا ويمكن لنا أيضا أن نحكي قصصا حول تلك الأفلام. بودكاست سينيستوري على \"تحيا السينما\" يهتم بالسينما، بالذاكرة، بالمشاهد وبكل القصص التي تنتج عن ذلك.</p>",
        "language": "ar",
        "author_name": "tahyacinemadz@gmail.com",
        "slug": "tahyacinema",
        "cover": "20230719_030728_62efecce375a0ab92e6181ff3818e583.jpg"
    },
    {
        "podcast_id": 221107,
        "title": "MNV Gowda Twitter Space Podcast",
        "description": "<p>I host a twitter space for film makers</p>",
        "language": "en",
        "author_name": "Mohana Nyamanahlli Venkatesha",
        "slug": "mnvgowdapodcast",
        "cover": "20230725_040757_103f7d5c57288065aa826c832ac42cfb.jpg"
    },
    {
        "podcast_id": 222113,
        "title": " Music2PSYCHOLOGY, Είρκη Μπαζάκα, CRYSTALEX | DARK PODCASTS",
        "description": "<p>Η<strong> Είρκη Μπαζάκα</strong> είναι μια διάσημη στιχουργός με έντονο σκοτεινό ύφος, που έχει κερδίσει ευρεία αναγνώριση για τους ποιητικούς στίχους της. Με τη μοναδική της προσέγγιση και την ενδιαφέρουσα αισθητική, έχει καταφέρει να καθηλώσει το ακροατήριο της.</p><p>Εντούτοις, η δημιουργικότητά της δεν περιορίζεται μόνο στους στίχους. Η Είρκη εξερευνά νέα μονοπάτια ψυχαγωγίας και παρουσιάζει τον κόσμο της μέσα από ένα σκοτεινό podcast. Το <strong>dark</strong> podcast της εστιάζει στη μουσική και εξερευνά τον κόσμο των μυστηρίων μέσα από μια συναρπαστική σύνθεση των δύο στοιχείων. Με αναλύσεις, ιστορίες και ανεξερεύνητα μυστικά, καταφέρνει να προσφέρει μια μοναδική και σκοτεινή εμπειρία ψυχαγωγίας στο ακροατήριο της.</p><p>Μέσα από το podcast της, η Είρκη Μπαζάκα δημιουργεί μια ατμόσφαιρα που συνδυάζει το μυστήριο και την απόκοσμη αισθητική, καθιστώντας το ένα από τα πιο αγαπημένα και εθιστικά podcasts για τους λάτρεις της μουσικής και των μυστηρίων.</p>",
        "language": "el",
        "author_name": "Είρκη Μπαζάκα",
        "slug": "eirkimpazaka",
        "cover": "20230801_040833_3a7053d7451368f71d7bf0cdbd8ce2fc.jpg"
    },
    {
        "podcast_id": 222125,
        "title": "Year of the Movie Podcast",
        "description": "<p>On this podcast we discuss movies that have released in the year of the movie, 2023. A lot of goofy movies have 2023 release dates, and we felt that it got so goofy an entire podcast was needed to discuss that.</p>",
        "language": "en",
        "author_name": "Sebastian Russell and Maggie Crady",
        "slug": "yotmp",
        "cover": "20230810_090854_71ce20dd7283e223f76b4b643c48c832.jpg"
    },
    {
        "podcast_id": 222430,
        "title": "Butaca 39",
        "description": "<p>Charlas de cine, en una sala de cine.</p>",
        "language": "es",
        "author_name": "Espacio Solaris",
        "slug": "butaca39",
        "cover": "20230803_010830_7176484478e5289ce81db9c1adf6c625.jpg"
    },
    {
        "podcast_id": 223521,
        "title": "Reel talk",
        "description": "<p>2 brothers talk about movies</p>",
        "language": "en",
        "author_name": "Reel Talk ",
        "slug": "88-mutua-rd",
        "cover": "20230810_110855_e3160d4f573e623eec05a8a9f0d296c3.jpg"
    },
    {
        "podcast_id": 223734,
        "title": "Casual Conversation with My Life in West",
        "description": "<p>#Who we are-</p><p>'The Casual Conversation' is for people from the Film, TV and Media Industries, executives from different Film and TV companies, Actors, Casting Directors, Producers, Theatre, fashion industry, modelling, Talent agents, etc., are invited to talk about their life, career and their experience living in London.</p><p>The format of the podcast is very fun and straightforward.</p><p>If you are based in London and would like to be a guest on our Podcast, DM me Or shoot me an email: <a href=\"mailto:mylifeinwest01@gmail.com\">mylifeinwest01@gmail.com</a>; <a href=\"mailto:acasualconversation33@gmail.com\">acasualconversation33@gmail.com</a></p><p>Audio channels:- </p><p>Spotify:- <a href=\"https://open.spotify.com/episode/3z5bUi8awBA33D1UWxz9Fi?si=vYYOFeIeRhK2QzRjogbFUA\">https://open.spotify.com/episode/3z5bUi8awBA33D1UWxz9Fi?si=vYYOFeIeRhK2QzRjogbFUA</a> </p><p>Apple Podcast:- <a href=\"https://podcasts.apple.com/in/podcast/casual-conversation-with-juliet-riddell-producer/id1702325834?i=1000624246087\">https://podcasts.apple.com/in/podcast/casual-conversation-with-juliet-riddell-producer/id1702325834?i=1000624246087</a> </p><p>Amazon Music:- <a href=\"https://music.amazon.co.uk/podcasts/af26dd48-f5de-48c8-a758-3ff0d1139934/casual-conversation-with-my-life-in-west\">https://music.amazon.co.uk/podcasts/af26dd48-f5de-48c8-a758-3ff0d1139934/casual-conversation-with-my-life-in-west</a> </p><p>Google Podcast:- <a href=\"https://www.google.com/podcasts?feed=aHR0cHM6Ly9tZWRpYS5yc3MuY29tL3RoZWNhc3VhbGNvbnZlcnNhdGlvbi9mZWVkLnhtbA%3D%3D\">https://www.google.com/podcasts?feed=aHR0cHM6Ly9tZWRpYS5yc3MuY29tL3RoZWNhc3VhbGNvbnZlcnNhdGlvbi9mZWVkLnhtbA%3D%3D</a> </p><p>Social Media Platforms: </p><p>Youtube: <a href=\"https://www.youtube.com/@TheCasualConversation\">https://www.youtube.com/@TheCasualConversation</a></p><p>Linkedin: <a href=\"https://www.linkedin.com/company/the-casual-conversation/\">https://www.linkedin.com/company/the-casual-conversation/</a> </p><p>Twitter: <a href=\"https://twitter.com/Thecasualconver\">https://twitter.com/Thecasualconver</a> </p><p>Facebook: <a href=\"https://www.facebook.com/profile.php?id=100094682019848\">https://www.facebook.com/profile.php?id=100094682019848</a> </p><p>Tiktok : <a href=\"https://www.tiktok.com/@thecasualconversation?is_from_webapp=1&amp;sender_device=pc\">https://www.tiktok.com/@thecasualconversation?is_from_webapp=1&amp;sender_device=pc</a> </p><p>Instagram: <a href=\"https://instagram.com/thecasualconversation_?utm_source=qr&amp;igshid=MzNlNGNkZWQ4Mg%3D%3D\">https://instagram.com/thecasualconversation_?utm_source=qr&amp;igshid=MzNlNGNkZWQ4Mg%3D%3D</a></p><p>More Details about today's Podcast will be shared soon... #help #finances #email</p><p>If Anyone would like to help us or like to be a sponsor to help us with our finances, then definitely reach out 🤣</p><p>Director: Jing W Leila</p><p>Producer: Vaibhav Garg</p><p>Host: Vaibhav Garg, Michael Moodekar and Andrew</p><p>Executive Producer: Vaibhav Garg and Siddhanth Pandey</p><p>Production- MyLife In West Productions</p><p>Editor- Naveen and Sudeep Panwar</p><p>Post Producer- Sudeep Panwar</p><p>#london #experience #podcast #like #like #fashionindustry #fashionindustry #talent #film #film #career #career #team #development</p>",
        "language": "en",
        "author_name": "The Casual Conversation",
        "slug": "thecasualconversation",
        "cover": "20230812_010804_83cd5aed7ecfbac42efd3699532ddfac.jpg"
    },
    {
        "podcast_id": 224168,
        "title": "The Big Screen Bulletin",
        "description": "<p>Welcome to The Big Screen Bulletin, your ultimate destination for all things movies! Immerse yourself in the captivating world of cinema as we delve deep into the magic, art, and culture of film.</p>",
        "language": "en",
        "author_name": "Dominic Stuart",
        "slug": "thebigscreenbulletin",
        "cover": "20230815_120802_561d334b8d6e30ba57650668eee59a90.jpg"
    },
    {
        "podcast_id": 224472,
        "title": "El Cine y...",
        "description": "<p>Programa dedicado al cine, nuevos lanzamientos y entrevistas con jugadores clave del medio cinematográfico.</p>",
        "language": "es",
        "author_name": "Ibero 90.9",
        "slug": "el-cine-y-cdb",
        "cover": "20230913_110914_f2ff9e48ce873b501ce5d61cfc2b0fee.jpg"
    },
    {
        "podcast_id": 225180,
        "title": "All Entertainment with Justin Urciuoli",
        "description": "<p>In this podcast, host Justin Urciuoli interviews several actors and actresses from the TV/Film industry about their work in the field.</p>",
        "language": "en",
        "author_name": "Justin Urciuoli",
        "slug": "all-entertainment-with-justin-urciuoli",
        "cover": "20230822_120802_d7a6b7f17ff79edb8991a4880eeb32e7.jpg"
    },
    {
        "podcast_id": 225957,
        "title": "JuzzBaatt By Akash Season 3",
        "description": "<p>JuzzBaatt By Akash ✨ We chat with smart people who know their Journey, and they share their thoughts in a way that's easy to understand. that'll make your day better!\"</p><p><a href=\"https://www.youtube.com/hashtag/juzzbaattbyakash\">#juzzbaattbyakash</a> <a href=\"https://www.youtube.com/hashtag/akashchoudhary\">#akashchoudhary</a> <a href=\"https://www.youtube.com/hashtag/podcast\">#hindipodcast</a></p>",
        "language": "hi",
        "author_name": "AKASH CHOUDHARY",
        "slug": "juzzbaattbyakash",
        "cover": "20230826_050825_da23a2baf39614265f3373c3cff960f7.jpg"
    },
    {
        "podcast_id": 226844,
        "title": "Filmographies Podcast",
        "description": "<p>Join host and filmmaker Jake Laystrom as he interviews independent filmmakers on specific works from their filmographies. From shorts to features, learn about filmmaker's inspirations, lessons learned, and experiences from Pre-Production to Distribution.</p>",
        "language": "en",
        "author_name": "Jake Laystrom",
        "slug": "filmographiespodcast",
        "cover": "20230901_040939_6d7db2565f7e64baa0585342b46e7b06.jpg"
    },
    {
        "podcast_id": 228324,
        "title": "Portrait Urbain",
        "description": "<p>Bienvenue dans \"Portrait Urbain\", une série de vidéos où je mêle la photographie de rue, les rencontres artistiques et les interviews intimes. Chaque mois, je choisis un DJ/Producteur pour une expérience unique en plein air. À l'aide de ma GoPro fixée sur ma poitrine, plongez dans mes pas et découvrez le processus de création de portraits saisissants au cœur des rues animées de villes différentes. Vous serez témoin de la fusion magique entre l'artiste et l'environnement urbain, tandis que je saisis l'essence de leur personnalité à travers des clichés uniques. En plus des photos, chaque vidéo est accompagnée d'une interview avec l'artiste, où ils partagent leur parcours, leurs inspirations et leurs rêves. Joignez-vous à moi pour une immersion totale dans l'univers créatif de ces talents et laissez-vous inspirer par leurs histoires captivantes.</p><p>Ici, je vous publie toutes les parties interview en Podcast.</p><p>Vous pourrez écouter PU de n'importe où et n'importe quand !</p>",
        "language": "fr",
        "author_name": "Thirty One Production",
        "slug": "thoneprod",
        "cover": "20230913_120925_0d33e51c0463c5cf91149ab37ad02714.jpg"
    }
]