[
    {
        "podcast_id": 2618,
        "title": "False Bottomed Girls",
        "description": "False Bottomed Girls features two beer experts guiding listeners through the wonderful yet sometimes confusing world of beer.",
        "language": "en",
        "author_name": "Jen Blair & Rachael Hudson",
        "slug": "falsebottomedgirls",
        "cover": "5e1da13bd62c2.png"
    },
    {
        "podcast_id": 6174,
        "title": "Biscuits and Gravy 808",
        "description": "Two Maui comedians discuss food, comedy, TV & movies, porn, and conspiracy theories.  Not recommended for lizard people!\n\nListen on Spotify & Apple Podcasts!",
        "language": "en",
        "author_name": "Chuck Thompson and Vince Foti",
        "slug": "biscuitsandgravy",
        "cover": "20201015_024559_1518d853d6cb3fa96c9341dcbedcb77d.jpg"
    },
    {
        "podcast_id": 7035,
        "title": "\"A Familiar Face Part 1\"",
        "description": "Part 1: Jack and Curtis Kang sit-sitdown before his flight to Austrila to backpack around the globe. Me and Curtis discuss our years together in the military(U.S. Army); the bond we have created; life after the military; food, whiskey and travel. Tune in and listen to me and my crazy ass veteran friends have interesting conversations. This is an 3verywhereuaintTv Productions/ OPELA Studios  ",
        "language": "en",
        "author_name": "Jack",
        "slug": "3verywhereuainttv",
        "cover": "20200324_015909_d0b84cd671dbbbca8fa9ef8cdafb6495.jpeg"
    },
    {
        "podcast_id": 7042,
        "title": "Vi drikker vin ",
        "description": "Skål og velkommen til vi drikker vin podcast , en podcast for den vinteresseret der er på udkig efter en ny spændende vin, vinnyheder eller en at dele et glas vin med når det er fyraften eller ungerne er lagt. ",
        "language": "da",
        "author_name": "Jacob Iversen",
        "slug": "vidrikkervin",
        "cover": "20200324_103752_27bdf1e97a11d273c1de61fd9e8d511b.jpeg"
    },
    {
        "podcast_id": 7590,
        "title": "RedAss Podcast",
        "description": "Roy and Rob set out to discuss Aggie sports, BBQ, movies, life experiences, yell boy stories, music, food, faith, and everything in between! Ride along with us and we'll show you exactly what it means to be Redass!",
        "language": "en",
        "author_name": "Robert White",
        "slug": "redasspodcast",
        "cover": "20200409_194732_c3f9679f2b8ea72380e10761e3d4b047.jpeg"
    },
    {
        "podcast_id": 7673,
        "title": "Peacemindedly",
        "description": "A podcast focusing on uplifting stories and ideas of peace. Our guests are Peaceful Bridge Makers, filling gaps between nations, cultures and ideas. \n\nSara Jamshidi, an award-winning Iranian-American peace journalist, explores women, especially Muslim women, contribution to help bridging gap among us. \n",
        "language": "en",
        "author_name": "Sara Jamshidi",
        "slug": "peacemindedly",
        "cover": "20200411_233501_05ce3a33849a1562767a3f1fb0c382bd.jpeg"
    },
    {
        "podcast_id": 7683,
        "title": "Yaşama Dair",
        "description": "Korona",
        "language": "tr",
        "author_name": "Murat Gayberi",
        "slug": "mmg",
        "cover": "20200412_032426_ab8edbfbeca60244025a5865eada8329.jpeg"
    },
    {
        "podcast_id": 7764,
        "title": "KULINARNE WYCIECZKI",
        "description": "Jeśli lubicie wycieczki i lubicie jeść - lepiej nie mogliście trafić. Zabiorę Was z kanap prosto do miejsc pałnych zapachów, smaków i tekstur. Gotowi? Zapinajcie pasy, przygotujcie paszporty - ruszamy!",
        "language": "pl",
        "author_name": "FOODist Anna Marciniak",
        "slug": "foodistannamarciniak",
        "cover": "20200414_113913_7153e75f0fc4a865e5be0147580bc11c.jpeg"
    },
    {
        "podcast_id": 8070,
        "title": "Better Living for Texans",
        "description": "Better Living for Texans is a Supplemental Nutrition Assistance Program SNAP implementing program within the Texas A&M AgriLife Extension Service. This podcast will give you knowledge, tips and tricks to create a sustainable, healthy lifestyle on a budget for you, your family and friends. We'll talk about healthy foods, physical activity, gardening and so much more!\n\n**USDA is an equal opportunity provider and employer. This material was funded by the USDA's Supplemental Nutrition Assistance Program - SNAP.",
        "language": "en",
        "author_name": "Better Living for Texans",
        "slug": "betterlivingfortexans",
        "cover": "20200423_015134_5816917f540be5e5f827aa0d78c120d6.jpeg"
    },
    {
        "podcast_id": 8549,
        "title": "Whisky Justificado",
        "description": "Degustações Técnicas e Análises Sensoriais sobre maravilhosos rótulos de Whiskies incluindo Single Maltes, Turfados, Blended Scotch e Blended Malts com uma visão diferente direta, imparcial, descritiva e narrativa / \nDegustar é andar em um corredor escuro portanto um Podcast que pode lhe ajudar a nortear sensações visuais, olfativas e gustativas / Lembrando sempre que o objetivo é o crescimento pessoal para que todos aproveitemos melhor o que a Água da Vida tem a oferecer em sua nobreza e complexidade e Degustar é para se divertir, bem diferente de se embriagar ou afetar o bem estar físico, biológico e social! / Faça o Download dos Podcasts e Ouça ao caminho de casa ou em frente a bebida que escolheu, lembrando que seremos imparciais sem falar mal daquilo que almeja comprar ou que adquiriu, e degustar é uma experiência pessoal e intransferível, sendo o melhor Malte aquele que você gostou ou que coube no seu bolso / Venha acompanhar nosso BLOG www.whiskyjustificado.com.br / Nosso Instagram: @WhiskyJustificado /  Slàinte mhath!",
        "language": "pt-br",
        "author_name": "Guga Marc",
        "slug": "whiskyjustificado",
        "cover": "20220625_090640_7509be3e760a69ee0b66a81cb1c044c8.jpg"
    },
    {
        "podcast_id": 9896,
        "title": "Drink at the Rink Podcast",
        "description": "Let's grab a drink and hear some stories from the rink!",
        "language": "en",
        "author_name": "Drink at the Rink Podcast",
        "slug": "datrpod",
        "cover": "20200622_141149_e91fc558e2999e9368faaa87ef114140.jpeg"
    },
    {
        "podcast_id": 10046,
        "title": "Delilah's Everyday Soul",
        "description": "“I wake up to eat!” exclaims Philadelphia born and bred Restaurateur, Celebrity Chef, Cookbook Author and TV Personality, Delilah Winder. Join Delilah and her daughter, Delana, as they share recipes, business advice, and life with food.",
        "language": "en",
        "author_name": "Chef Delilah Winder + Daughter",
        "slug": "delilahseverydaysoul",
        "cover": "20200626_215918_398c91fa0d89dbb21a31bd13e86a8e2f.jpeg"
    },
    {
        "podcast_id": 10580,
        "title": "Libations for Everyone",
        "description": "Sipping shots and sharing thoughts is the name of the game. Hosts Ben Quam and Charles Awad serve their guests one shot of booze for each of six topics of conversation, totaling six roundtable topics and six shots of liquor. Libations for Everyone!",
        "language": "en",
        "author_name": "Charles Awad & Ben Quam",
        "slug": "libationsforeveryone",
        "cover": "20200715_154208_e6a156a638ce54cae3e6ae13c93c5703.jpg"
    },
    {
        "podcast_id": 11070,
        "title": "Dose Dupla ",
        "description": "Aproveite, a qualquer hora, em qualquer lugar, todos os bons momentos do meu programa de lives, o Dose Dupla. Todo o conteúdo, na íntegra e sem cortes, dos papos que acontecem ao vivo, no meu Instagram Da Vinha Ao Vinho, com os melhores profissionais do mundo da enogastronomia. O melhor conteúdo sobre vinhos você encontra aqui. Bem-vindo e divirta-se! ",
        "language": "pt-br",
        "author_name": "Ana Cristina Mokdeci ",
        "slug": "davinhaaovinho",
        "cover": "20221217_111210_2ff918b29af99e185fc5526fc69d9ed1.jpg"
    },
    {
        "podcast_id": 11403,
        "title": "Cheesy Gordita Bunch Podcast ",
        "description": "Have you ever wondered where the coolest Taco Bells were,  or what items are on the secret menu?  Join the Cheesy Gordita Bunch every other week as they dive deeply into all things Taco Bell. Trust us, we are the party pack you're looking for.",
        "language": "en",
        "author_name": "The Cheesy Gordita Bunch ",
        "slug": "cheesygorditabunch",
        "cover": "20210103_213815_7343cf64036e9b915ebb5623060109e3.jpg"
    },
    {
        "podcast_id": 11923,
        "title": "Everyone Needs A Spotter",
        "description": "<p>Welcome! Fitness will never be the same. The world we once knew is gone forever. Whether you’re a trainer, gym owner, property manager, equipment dealer or a repair technician you will all agree, we have to adjust our daily operations. It’s not easy, but we are here to help. From the social media standpoint, to customer experience, to first hand knowledge, we discuss ways to help our customers as well as fellow fitness enthusiasts navigate through these very challenging times. Have an issue pertaining to fitness equipment purchase, repair or maintenance? We can assist you by being your spotter.</p>",
        "language": "en",
        "author_name": "RMS Fitness",
        "slug": "rmsfitness",
        "cover": "20200902_214843_207e2c1fef3be215be8d32970c6f4603.jpg"
    },
    {
        "podcast_id": 12309,
        "title": "High Gluttony",
        "description": "<p>High Gluttony is about cooking, consuming, relaxing, and learning a few things along the way. Pour yourself a drink, light up a joint, or settle in with some tea, and join Gretchen and Becca for their latest adventure.</p>",
        "language": "en",
        "author_name": "Gretchen Heller and Becca Dewbey",
        "slug": "highgluttony",
        "cover": "20200919_233127_d0f4dce651e0db8bd31e33018c67b89a.jpg"
    },
    {
        "podcast_id": 12901,
        "title": "Butcher Baker Podcast Maker",
        "description": "The food podcast series where we get to know a little bit more about the foods people enjoy, from recipe favourites to biscuit chat.",
        "language": "en",
        "author_name": "Jemima Wilch",
        "slug": "butcherbakerpodcastmaker",
        "cover": "20221125_061131_8d4843a5d8324b1c0ba6b768fc73be86.jpg"
    },
    {
        "podcast_id": 14155,
        "title": "Rocksalt Cafe Podcast",
        "description": "Gain a real insight into the day-to-day workings of one of Ireland's top lifestyle cafes, Rocksalt.\nHear interviews with our team, our customers and local heroes. We aim to give you a real feel of the highs, lows, challenges and success stories of operating our café.\n\nWhether you're interested in business, culture, coffee or all things food, this is the podcast for you!\nBe sure to subscribe to the podcast and leave us a review! We'd love to know what you think. Enjoy!\n\nKeep up to date with us on Instagram:\n@caferocksalt\n@rocksalt_dundalk\n\nwww.RockSaltCafe.ie",
        "language": "en",
        "author_name": "Emily Mcloughlin",
        "slug": "rocksaltcafepodcast",
        "cover": "20201102_144817_db8722f91bbc0d548fbaac7991fa347a.jpg"
    },
    {
        "podcast_id": 14338,
        "title": "Vine to Glass",
        "description": "A podcast about all things wine, by Yuanbo Liu and Phoebe Champion\n",
        "language": "en",
        "author_name": "Yuanbo Liu & Phoebe Champion",
        "slug": "vinetoglasspodcast",
        "cover": "20201113_174602_ff7d79854465ba706917419589706364.jpg"
    },
    {
        "podcast_id": 14556,
        "title": "Addicted To The Pot",
        "description": "Ron and Christi are Alabama natives with a watchful redeye on the happenings in Gulf Shores and the surrounding area. We created this podcast as an excuse to hangout and drink coffee. We aren't trying to be anything other than what we are, a couple of beach bums who like good conversation and a caffeine buzz. ",
        "language": "en",
        "author_name": "Christi and Ron",
        "slug": "attp",
        "cover": "20201118_185318_a32e07374153965f479ad18b977f926d.jpg"
    },
    {
        "podcast_id": 16252,
        "title": "Raw de Podcast",
        "description": "welkom allemaal!\n\nik ben Lars Vierhout aka Chef Lars. patissier, food content creator, podcast maker en ondernemer.\n\nin deze podcast ga ik in gesprek met mensen uit de food wereld, van vooraanstaande food fotografen, productontwikkelaars en ondernemers.\n\nwil je meer weten over mij en me ondernemingen ? kijk op www.cheflars.nl\n ",
        "language": "nl",
        "author_name": "Lars Vierhout",
        "slug": "rawbycheflars1",
        "cover": "20201130_155937_2f9819a77cb767006776549707abe8e7.jpg"
    },
    {
        "podcast_id": 19333,
        "title": "Food Adventures",
        "description": "This is a podcast dedicated to all things food. From recipe ideas to interviews with chef, producers and farmers to taking culinary adventures together! For the show notes go to https://www.elizabethrfuller.com. Submit all your podcast questions to letsgoonafoodadventure@gmail.com or @letsgoonafoodadventure on Instagram. All questions can be submitted via email or send a voice memo if you want to be on the podcast! New Episodes on Fridays wherever you podcast!",
        "language": "en",
        "author_name": "Beth Fuller",
        "slug": "foodadventures",
        "cover": "20220102_120105_53bab9f987c8b9aae9cd72ef6c01c2b9.jpg"
    },
    {
        "podcast_id": 19335,
        "title": "Polish Culture NL",
        "description": " \nWil je meer weten over Poolse Cultuur en Tradities? Luister naar onze podcasts. ",
        "language": "nl",
        "author_name": "Bozena Kopczynska",
        "slug": "polishculturenl",
        "cover": "20210402_122938_6ea96e5e224715608f57a5a05ebfc1cc.jpg"
    },
    {
        "podcast_id": 21052,
        "title": "Books, Bites, Booze",
        "description": "Welcome to the Books, Bites, Booze bi-weekly podcast where two best friends enjoy their favorite books, food, and cocktails! Read, drink, and eat along with Madison and Alexis each month to participate in this alcohol and calorie friendly book club.",
        "language": "en",
        "author_name": "Alexis and Madison",
        "slug": "booksbitesbooze",
        "cover": "20201229_173606_bd0ee3f3992746eabf43e5ba3052fc51.jpg"
    },
    {
        "podcast_id": 22560,
        "title": "Charlie the Chicken Mushroom",
        "description": "An exploratory journey into all the things that feed us. What feeds our bellies, feeds our minds and our souls? And how are they all connected? We focus on environmental health and how that contributes down the path from our farms, foods and individual health. This series is partnered with my children's cook book series, The 9 Lives of Charlie the Chicken Mushroom. An adventure series complete with kid friendly recipes. I believe healthy habits start young and encourage kids to gain nutrition through variety. Together we can learn more about our current food systems and collectively improve the health of our planet and our bodies, minds and spirits. It takes a village. \nwww.charliethechickenmushroom.com ",
        "language": "en",
        "author_name": "Katie Kirwan",
        "slug": "charliethechickenmushroom",
        "cover": "20210106_200226_09c3f8e9e9860e3947d14407156abcb8.jpg"
    },
    {
        "podcast_id": 25796,
        "title": "Unvermittelbar",
        "description": "Zwei Kerle, Mitte 20, die in der Midlife-Crisis stecken",
        "language": "en",
        "author_name": "Unvermittelbar",
        "slug": "unvermittelbar",
        "cover": "20220406_050415_41903bf556c4459c04cc546065a97629.jpg"
    },
    {
        "podcast_id": 31653,
        "title": "Friends with Forks ",
        "description": "Two Friends reviewing and rating local restaurants in New Jersey ",
        "language": "en",
        "author_name": "Brice Crosby, Peter Falk, Wyatt Pirtle",
        "slug": "friendswithforks",
        "cover": "20210210_162440_f16f07ff6263e07e0aa1d2cd11b8cedc.jpg"
    },
    {
        "podcast_id": 37352,
        "title": "a little taste of everything",
        "description": "Mckinnlei and Lexi here with a little taste of everything. This is where we talk about a lot of food and a little of everything else. Thanks for joining!",
        "language": "en",
        "author_name": "a little taste of everything",
        "slug": "alittletasteofeverything",
        "cover": "20210303_174939_840b87a43919ec38155892e51ffe7f2f.jpg"
    },
    {
        "podcast_id": 38276,
        "title": "Bourbon & Bullshit",
        "description": "When three fellas from bourbon country get together to pass around a bottle of America's Spirit, the talk about bourbon is just the beginning... ",
        "language": "en",
        "author_name": "Todd Bailey, Jacob Morris, Gabe Goforth",
        "slug": "bourbonandbullshit",
        "cover": "20210312_035905_f16bc90c599729435076373bbd8dc7cf.jpg"
    },
    {
        "podcast_id": 38653,
        "title": "Flowers After Hours with My Lady Garden",
        "description": "Flowers After Hours is a conversational style Podcast where founder of My Lady Garden, Kai, speaks with likeminded creatives about business, lifestyle and music. Episodes released monthly! ",
        "language": "en",
        "author_name": "Kai ",
        "slug": "flowersafterhours",
        "cover": "20210805_134847_3237354d40060fc350264c1a71cf7dd1.jpg"
    },
    {
        "podcast_id": 38741,
        "title": "Beyond the pass",
        "description": "Beyond the pass",
        "language": "en",
        "author_name": "Kyle McClure",
        "slug": "beyondthepass",
        "cover": "20210325_161408_e9c75157199608e02c40f7e76d50caa8.jpg"
    },
    {
        "podcast_id": 41377,
        "title": "Sinners And Dinners",
        "description": "A true crime podcast hosted by two psychos and their food babies. Join Georgia and Shannon each week to discuss the worlds most depraved (and delicious!) crimes",
        "language": "en",
        "author_name": "Sinners And Dinners Podcast",
        "slug": "sinnersanddinnerspod",
        "cover": "20210314_113635_a1cdaca959b35e44a870943adc277425.jpg"
    },
    {
        "podcast_id": 42273,
        "title": "Hospitality Queens",
        "description": "Two Best Friends Erin & Whitney Talking food, The Hospitality industry , life and Everything in Between!",
        "language": "en",
        "author_name": "Hospitality Queen's",
        "slug": "hospitalityqueens",
        "cover": "20210824_231213_b9fdf5a678348336ef3e1e25ca4d4bcc.jpg"
    },
    {
        "podcast_id": 44078,
        "title": "Evolution!!!!",
        "description": "Helping others begin the  journey to reach a state of better health. Body, Mind and Finances!",
        "language": "en",
        "author_name": "Michael Madden",
        "slug": "myhealthjourney",
        "cover": "20210828_121319_ce96fdec9f78efe2d816e53307330479.jpg"
    },
    {
        "podcast_id": 44079,
        "title": "Mic Check M.I.A",
        "description": "Mic Check M.I.A is a newly created platform with the goal inform our audience of what's happening in world of entertainment... We also strive hard in acknowledge INFORMATION that will intrigue and stimulate the minds of our listens.. Our interviews are building blocks for the aspiring independent movers, shakers and trend setters out there.. Our goal is to level up on our guest , our presence and audience in the podcast world..",
        "language": "en",
        "author_name": "MicCheckM.I.A Da Podcast",
        "slug": "miccheckmiadapodcast",
        "cover": "20210324_214133_5b619fe16bb526ca2eaa66003a2d2087.jpg"
    },
    {
        "podcast_id": 45175,
        "title": "Mao was a Mensch",
        "description": "A Podcast where we allegedly review Beer.\n\nBut mostly just shoot the shit.",
        "language": "en",
        "author_name": "The Gang",
        "slug": "maowasamensch",
        "cover": "20210521_180237_287c2c1095c7d2102712940a548bdfc3.jpg"
    },
    {
        "podcast_id": 45732,
        "title": "The Boom Shop",
        "description": "Open minds, no filters, and a few beers can turn a normal conversation into an unforgettable one. We will get into our lives, hopefully interview some entertaining guests, and dive deep into our messed up minds. Enjoy!",
        "language": "en",
        "author_name": "Clayton Halbert, Stephen Standridge, and Trey Davis",
        "slug": "theboomroom",
        "cover": "20210402_020314_c8b1b53f248843c58300baac4955220f.jpg"
    },
    {
        "podcast_id": 45885,
        "title": "The Bite Size Podcast",
        "description": "Bite Size is a psychoeducation podcast series for hospitality workers created with the goal to provide a fundamental foundation into understanding how our minds work. We’ll start with the basics, explaining exactly “what is mental health?” before exploring topics and situations that we find ourselves in while working in the hospitality industry. Each topic we discuss will come with a glossary of terms and thought prompts to help you dig deeper into learning not just about what mental health is, but their personal mental health journey. We believe that mental health education is paramount in successfully rebuilding the structures of the hospitality world.\n_______________________________________________________________________________________\n\nBite Size es una serie de podcasts de psicoeducación para trabajadores de la hostelería creada con el objetivo de proporcionar una base fundamental para comprender cómo funciona nuestra mente.  Comenzaremos con lo básico, explicando exactamente \"qué es la salud mental?\"  antes de explorar temas y situaciones en las que nos encontramos mientras trabajamos en la industria hospitalidad. Cada tema que discutimos vendrá con un glosario de términos e indicaciones para pensar que lo ayudarán a profundizar en el aprendizaje no solo sobre lo que es la salud mental, sino también sobre su viaje personal de salud mental.  Creemos que la educación en salud mental es fundamental para reconstruir con éxito las estructuras del mundo de la hospitalidad.",
        "language": "en",
        "author_name": "Support Staff",
        "slug": "bitesize",
        "cover": "20210401_214939_f906ce9307123a4230c2dd54026bd385.jpg"
    },
    {
        "podcast_id": 45916,
        "title": "Matthew's World of Wine and Drink",
        "description": "An Englishman in California soaking up the sun, I am a WSET Diploma graduate, Certified WSET Educator, and MW student. I blog about wine, teach it at all levels, and drink plenty of it. Follow me on twitter @mattswineworld or check out my website: matthewsworldofwineanddrink.com",
        "language": "en",
        "author_name": "Matthew Gaughan",
        "slug": "matthewsworldofwineanddrink",
        "cover": "20210401_225443_1ba75f1c4157ab0cb8cb337153bad746.jpg"
    },
    {
        "podcast_id": 46046,
        "title": "The Cocoa Pod Cast",
        "description": "The Cocoa Pod Cast is a place where we amplify voices in the Chocolate and Cocoa Industry in search for true sustainability. We will be interviewing knowledgeable people from along the entire supply chain, from cocoa farmers, to chocolate makers, activists, journalists, film makers, and more!",
        "language": "en",
        "author_name": "The Cocoa Pod Cast",
        "slug": "the-cocoa-pod-cast",
        "cover": "20210401_140242_c119fb1275036e33a817bc33b693effb.jpg"
    },
    {
        "podcast_id": 48796,
        "title": "Digital Gastronomy Talks",
        "description": "Digital Gastronomy Talks, nace con la vocación de difundir contenidos relacionados con nuevos desarrollos tecnológicos orientados al sector HORECA. \n\nDesde LABe Digital Gastronomy Lab, identificamos constantemente soluciones tecnológicas que emergen y se adaptan en respuesta a los problemas inmediatos que pueden tener gestores y operarios en el sector. Sin embargo, pueden haber muchas opciones y poco tiempo para poder analizar sus funcionalidades y potenciales ventajas con calma. Digital Gastronomy Talks, es un espacio para dar visibilidad a los proveedores de nuevas soluciones tecnológicas y al mismo tiempo, conectar con una audiencia interesada que pueda generar un debate en torno a las mismas. \n\nPara ello en cada sesión se busca invitar a uno o más expertos en diferentes materias para contar sus experiencias bajo una temática en concreto. Se trata de webinars de una duración promedio de una hora, en la cual se alternan ponentes, se realizan preguntas a los invitados, así como las que pueda tener la audiencia a través del chat. \n",
        "language": "es",
        "author_name": "LABe Digital Gastronomy Lab",
        "slug": "digitalgastronomytalks",
        "cover": "20210412_144246_87353620407f9b70fcb17f4d02d8a44a.jpg"
    },
    {
        "podcast_id": 50793,
        "title": "Voeding Leeft Zorgprofessionals ",
        "description": "In deze serie podcasts inspireren we jou wat een andere leefstijl met je kan doen, voor jou en je patiënt. Voor ons begint dat in de spreekkamer, daar waar symptoom en oplossing bij elkaar komen. Wil jij mee doen met een van onze nascholingen of wil je weten hoe je je patiënt kan doorverwijzen naar Keer Diabetes2 Om? Ga dan naar keerdiabetesom.nl/voor-zorgverleners/ ",
        "language": "nl",
        "author_name": "Voeding Leeft",
        "slug": "voedingleeft",
        "cover": "20210420_101644_59f1cba6aee0e20a123a54ff146bf710.jpg"
    },
    {
        "podcast_id": 51408,
        "title": "SunDried Tomatoes Podcast",
        "description": "An eclectic journalist talking with guests about a variety of topics ranging from sports to music to homebrewing and beer to movies and TV shows.",
        "language": "en-us",
        "author_name": "Anthony Iozzo",
        "slug": "sundriedtomatoespodcast",
        "cover": "20210425_025015_ab8be1c4aa688d94cba9dd1bab68b33a.jpg"
    },
    {
        "podcast_id": 52378,
        "title": "All About Food Founders",
        "description": "Cullen Gilchrist, CEO & Founder of Union Kitchen, takes a deep dive behind the scenes of packaged Food and Beverage businesses made in DC. From launch to national scale, Cullen speaks with DC founders about their challenges and triumphs throughout their journey to building successful CPG food businesses. Union Kitchen is a food business Accelerator. We build successful food brands by bringing together our Accelerator with our Kitchen, Distribution, and Stores. Since 2012, we have worked with over 650 food businesses including over 100 Accelerator members.",
        "language": "en",
        "author_name": "Union Kitchen",
        "slug": "unionkitchenfoodfounders",
        "cover": "20210426_193112_2ffdada134609ae271e22f417a73cc39.jpg"
    },
    {
        "podcast_id": 53192,
        "title": "Dram Bell Society Tasting Room",
        "description": "Dram Bell Society Tasting room is a weekly special where members of our group will review and taste different whiskey, scotch, bourbon, spirits.",
        "language": "en",
        "author_name": "Shaun Smith",
        "slug": "drambellsociety",
        "cover": "20210429_190746_ca68bdd0361ef10ee72312035dc21b7b.jpg"
    },
    {
        "podcast_id": 53983,
        "title": "Canadian Pirate Cast",
        "description": "Canadian Pirate Cast is a Vancouver Island based variety podcast. Focused on local and provincial news, cooking, and general commentary.\nFeaturing host Captain Beckham Kidd and co-host Gummi Bear",
        "language": "en",
        "author_name": "Captain Beckham Kidd",
        "slug": "canadianpiratecast",
        "cover": "20210504_015855_6919e9a6ca5f592aa32daae05626acee.jpg"
    },
    {
        "podcast_id": 54415,
        "title": "Two Dudez And Foodz",
        "description": "We love test trying food and well making a mess of things. We have brands compete against each other and just try crazy combinations! We have twitter and reddit!",
        "language": "en",
        "author_name": "Two Dudez And Foodz",
        "slug": "twodudezandfoodz",
        "cover": "20210505_153642_90d35ee7cf22a6022efaa252d03e4bae.jpg"
    },
    {
        "podcast_id": 57314,
        "title": "Voeding Leeft ",
        "description": "Voeding Leeft ontwikkelt en exploiteert samen met wetenschappers, artsen en andere professionals leefstijlprogramma's voor mensen met een chronische aandoening. We vergroten de kennis over voeding in de breedste zin van het woord in relatie tot gezondheid door te delen, te coachen, te inspireren en te vernieuwen.",
        "language": "nl",
        "author_name": "Voeding Leeft",
        "slug": "podcastvoedingleeft",
        "cover": "20210517_113133_8f9a68b38dfb89900ec8b9f455a7b6c3.jpg"
    },
    {
        "podcast_id": 60043,
        "title": "Alambic & Cie",
        "description": "Gin, vodka et autres alcools.\nOn s'intéresse aux entrepreneurs en distillerie.\nLeurs passions, ce qui les motive. Des rencontres. Le tout agrémenté des doux parfums qui émanent de l'alambic.\n\nhttps://alambicginetcie.wordpress.com/",
        "language": "fr",
        "author_name": "Christian Thivierge",
        "slug": "alambic",
        "cover": "20210531_174100_50395f64300d7b2d4bd0e24fc59e9909.jpg"
    },
    {
        "podcast_id": 60529,
        "title": "Filterlos",
        "description": "Kirsty und Sarah reded jedi Wuche filterlos über allerlei Theme wo si gad beshäftigt. Es wird gfluecht, vo Alkohol und Tindr gred drum eher 18+. Ganz alltäglichi, lushdigi, wildi oder au mal trurigi stories. Wies mit 25+ halt so ish. Erwachse aber iwie doch no Chind. ",
        "language": "en",
        "author_name": "Kirsty Stephenson und Sarah Giger",
        "slug": "filterlospodcast",
        "cover": "20210602_144542_d3dc2142269caac8daf202c2ba4a7926.jpg"
    },
    {
        "podcast_id": 62955,
        "title": "2 Dewds Podcast ",
        "description": "The 2 Dewds Podcast is hosted by two former collegiate track and field teammates who have a fond appreciation for Mtn Dew. This show will cover topics ranging from pop culture and comedy to which soda is best. \n\nThis is a podcast that will attempt to approach topics and current events with a mature and adult-like attitude... but we make no promises. \n\nMost importantly we just want to have a good time and bring a little joy and laughter into your lives. ",
        "language": "en",
        "author_name": "Adam and Max",
        "slug": "2dewds",
        "cover": "20211023_204334_88b20c35a7b8e914c2f2e302c9a277f5.jpg"
    },
    {
        "podcast_id": 63678,
        "title": "Feast & Forum",
        "description": "A CIA community discussion of our food system. ",
        "language": "en",
        "author_name": "Camden Miller & Applied Food Studies ",
        "slug": "feastandforum",
        "cover": "20210618_154047_58f0ca949d04633b13ec0df54593b0d1.jpg"
    },
    {
        "podcast_id": 68196,
        "title": "Pouring Over Pages",
        "description": "“Pouring Over Pages” is a podcast of words and wine. Hosted by wine blogger Alexa Ferra and book aficionado Maritza Lacayo, the dynamic duo gets lit on literature while diving into pop culture, wine, and current events. \n\nFollow our Instagram, subscribe to our newsletter, and check out our merch: flowcode.page/pouringoverpagespodcast",
        "language": "en",
        "author_name": "Maritza Lacayo and Alexa Ferra",
        "slug": "pouring-over-pages",
        "cover": "20220202_020233_a1c89e21f4f41674b7a6bb0a7a1705c1.jpg"
    },
    {
        "podcast_id": 72808,
        "title": "Crime Bistro",
        "description": "Crime Bistro is a true crime podcast that examines the stories, forensics, and investigations surrounding each case we discuss. Every episode dives into a unique case and provides a comprehensive look at a fascinating mystery and all those involved. Gaze into the world of true crime and coffee tasting as you listen to each story, and join us for some entertainment and a great brew.",
        "language": "en",
        "author_name": "Anna DiNino",
        "slug": "crimebistro",
        "cover": "20210810_124214_3a8f1d158134412bc1dc4bb4a63adf2a.jpg"
    },
    {
        "podcast_id": 76422,
        "title": "Coffee News Break ",
        "description": "Your place for coffee industry news, events and resources.",
        "language": "en",
        "author_name": "Bubba",
        "slug": "coffeebreakyt",
        "cover": "20220409_070421_621213162b9bad543fe5ba05dda1be2d.jpg"
    },
    {
        "podcast_id": 77881,
        "title": "Humlepodden",
        "description": "Humlepodden är en ölpodd med Julia, Maja och Rebecca 3 hembryggare och ölnördar från Humlegårdens Ekolager.  I Humlepodden kommer vi diskutera bryggning, ölstilar och bryggeriernas senaste öl på systemet, går från ölhistoria till trender och mycket, mycket mer.",
        "language": "sv",
        "author_name": "Humlegårdens Ekolager",
        "slug": "humlepodden",
        "cover": "20210907_095153_47624ae4bda63b1be4d3144b3fb4eab9.jpg"
    },
    {
        "podcast_id": 78449,
        "title": "China On The Rocks",
        "description": "<p>Our podcast is about the F&amp;B industry in China, over drinks we talk about booze, cocktail history, and our stories related to our experiences working here!</p>",
        "language": "en-us",
        "author_name": "Logan Brouse",
        "slug": "chinaontherocks",
        "cover": "20230803_110848_0ae094c9b46c3eaa5bd960ca18637b6e.jpg"
    },
    {
        "podcast_id": 79492,
        "title": "Secondary Fermentation",
        "description": "Your hosts - Joe, Nick, and Lauren of East Carolina Beer and Brewing - are beer enthusiasts who love to talk about all things craft beer. This weekly podcast will dive into live beer tastings, discussions of current and local events in the beer industry, fun banter (including constant digressions), and everything in between!",
        "language": "en",
        "author_name": "East Carolina Beer and Brewing",
        "slug": "secondaryfermentation",
        "cover": "20210916_224810_8415a011ed984f8dcda0bad16a9390d7.jpg"
    },
    {
        "podcast_id": 80580,
        "title": "Eighty7 Podcast",
        "description": "The Eighty7 Podcast is the brain child of two friends, Matt and Aaron who want to use this podcast to talk about trending topics, have a tonne of banter, invite a whole host of special guests on but most importantly they want to make a positive impact on anyone listening any way they can!\n\nIf you enjoyed this podcast please feel free to subscribe and tell your friends about us!",
        "language": "en",
        "author_name": "Eighty7 Podcast",
        "slug": "frcpodcast",
        "cover": "20211013_180308_f7bd318e89f82fd2727990ce5c158a40.jpg"
    },
    {
        "podcast_id": 80615,
        "title": "Distilled California",
        "description": "Distilled California began as a joke. A historian and a distiller walk into a tasting room. What do they do? The historian says to the other. Do you know the story of the liquor that's in that glass? \"No,\" says the distiller, do you know how it got into the glass in the first place? Do you know what it takes? \"No,\" says the historian. And the rest is well...\n\nDistilled California is the distiller-driven podcast for the booze nerd. Join hosts Dylan Almendral and Ryan Freisen as we take a deep dive into the bottle. We discuss the history, legends, politics and future of the California distilling industry from the ground up and distill what it means to be grain to glass in California. Ryan is a distiller and Vice President of the California Artisanal Distillers Guild. Dylan is a historian and writer. Both are devout students and stewards of the glass. This show exists to create informed drinkers. If you drink, know what's in your bottle! And, of course, to document the California distillery world while it is in its infancy. \nThis podcast is for everyone; the aficionado, the vaguely interested, the distiller, the historian and the nerd alike. All are welcome and always will be. We all float down here. \n\nThe podcast will feature tastings, science, history, interviews with distillers, book reviews, distributors, and of course, good times. \n\nJoin us as we learn and pass on the experience to you! \n\nPlease LIKE, COMMENT, SHARE AND SUBSCRIBE\n",
        "language": "en",
        "author_name": "Dylan Almendral and Ryan Friesen",
        "slug": "distilledcalifornia",
        "cover": "20210921_141304_388ca2853dc5ed607cceead2f7872d4b.jpg"
    },
    {
        "podcast_id": 81679,
        "title": "THE FRC PODCAST",
        "description": "This is The FRC Podcast, the podcast that discusses all things food! Brought to you by Matt and Calum, the guys behind the legendary Food Review Club. Each week they invite a special guest on to the show, to talk about all their favourite foods, best takeaways, their careers and way more!  \n\nFollow us on social media @FoodReviewClub \n",
        "language": "en",
        "author_name": "Food Review Club",
        "slug": "thefrcpodcast",
        "cover": "20230118_080120_bfa68e85bc1f267c02ec20adc80ce496.jpg"
    },
    {
        "podcast_id": 82450,
        "title": "Sommets et Collets - Le Balado",
        "description": "<p>Sommets et Collets est une baladodiffusion qui met en valeur des randonneurs et aventuriers expérimentés mais aussi des amateurs connus et moins connus qui pratiquent le sport. Ils partagent la passion des grands espaces, de l'aventure et des bières de micro. Animé par Alexis le Randonneur et secondé par Sylvain Bouchard sommelier en bières, ce podcast te feras passer en leur compagnie une heure de pur plaisir!</p>",
        "language": "fr",
        "author_name": "Alexis le Randonneur",
        "slug": "alexislerandonneur",
        "cover": "20220929_050909_8c8fb9dde9ae57f055c03c801316bbc1.jpg"
    },
    {
        "podcast_id": 83298,
        "title": "La SabroZona",
        "description": "La SabroZona, el podcast del Chef Mariano Sandoval, quien te llevará con su estilo único el lado más sabroso y cumbianchero de la gastronomía, mediante invitados especiales, recetas inigualables y muchas cosas más. Semana a semana entretenidos episodios para que disfrutes ahora de la cocina a tu bocina.",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "lasabrozona",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 83814,
        "title": "Ne hladu podcast o výživě",
        "description": "<p>Podcast o nejrůznějších zákoutích ze světa výživy se srozumitelnými a ucelenými informacemi, který ti pomůže se v této sféře lépe orientovat. Vyjasní ti nejčastější výživové mýty, pomůže se správným výběrem potravin, seznámí tě se zajímavými hosty a jejich pohledem na výživu a mnoho dalšího. Jednotlivými epizodami tě provedou nutriční terapeutky z Ne hladu - Ing. Mgr. Veronika Pourová, Mgr. Andrea Jakešová a další. ————————— Za možnost zrealizovat tento podcast děkujeme především Sportisimu.</p>",
        "language": "cs",
        "author_name": "Ne hladu ",
        "slug": "nehladupodcastovyzive",
        "cover": "20230517_010525_7986dffef81fb4b4fe4d4a258014e3ba.jpg"
    },
    {
        "podcast_id": 84066,
        "title": "On jase...",
        "description": "Jaser de marque et d’alimentation, soit, mais pourquoi? \nSimplement parce que nous avons à cœur d’offrir aux professionnels de cette industrie cruciale pour notre société et notre culture des discussions rafraîchissantes et permettant un regard neuf sur trois thèmes qui interpellent les consommateurs… tout en empêchant les marketeurs de dormir ! Des thèmes riches de par leur complexité, mais aussi en raison des enjeux qu’ils soulèvent. \n\nLes opinions exprimées dans les balados sont celles des intervenants et reflètent leurs opinions personnelles.",
        "language": "fr",
        "author_name": "ILOT stratégie + gestion de marque",
        "slug": "onjase",
        "cover": "20211125_071119_03aa5eb434a0c3023e8bdaf85fa0fbcd.jpg"
    },
    {
        "podcast_id": 84854,
        "title": "Daym After Dark",
        "description": " The most anticipated Podcast from the Food Titan himself, Daym Drops. Listen along as Daym shares stories and insight on Life, Love, Finances, Food and Entertainment. This will be an epic journey through the eyes of Daym Drops.",
        "language": "en",
        "author_name": "Daym Drops",
        "slug": "daymafterdark",
        "cover": "20211013_085815_e42f579081fa41dfb673a827728131e9.jpg"
    },
    {
        "podcast_id": 84900,
        "title": "The Spice of Life Podcast",
        "description": "Introducing “The Spice of Life Podcast”\nAll things culinary  \n\nI will be your host Taylor Duncan as we delve into all aspects of the culinary world, we will discuss food trends, upcoming local 757 food events, interviews with local farmers, personal trainers, local chefs and more!\n\nCheck us out for a NEW biweekly podcast!",
        "language": "en",
        "author_name": "Taylor J Duncan",
        "slug": "tsolpodcast",
        "cover": "20211013_153045_0fa90730324effc3c36e7ca688dd8e7a.jpg"
    },
    {
        "podcast_id": 86334,
        "title": "HABLAMOS CON",
        "description": "Toda la importancia, aquí la recibirán las personas. Sin tierra, ni normas, sin vino, ni bodegas; sólo las almas de las personas que nos hacen soñar. Descubriremos la historia y la opinión de aquellos que merecen, en nuestra humilde opinión, ser escuchados.",
        "language": "es",
        "author_name": "Alma Hoy",
        "slug": "almahoy-hablandocon-borjamatoses",
        "cover": "20211209_121250_c762efe576d94770f82b0b13e52b4a3f.jpg"
    },
    {
        "podcast_id": 87197,
        "title": "La sicurezza alimentare a portata d'orecchio",
        "description": "Ciao, sono Daniela Maurizi, una chimica esperta di sicurezza degli alimenti.\nCon i miei podcast ti spiegherò in maniera chiara e semplice come scegliere, conservare e cucinare gli alimenti.\n🌐https://danielamaurizi.it/\n💻https://www.linkedin.com/in/daniela-maurizi-6168383/?originalSubdomain=it",
        "language": "it",
        "author_name": "Daniela Maurizi",
        "slug": "danielamaurizi",
        "cover": "20211027_093957_282d3f0edb6e01b51821da0a6b70871d.jpg"
    },
    {
        "podcast_id": 87467,
        "title": "WTF Am I Drinking?",
        "description": "This is a podcast + blog series born out of conversations about how literally every single one of us who enjoy craft beer, hard seltzer, cider, wine spritzers, canned cocktails, hard teas, hard kombuchas--you name it--is operating at a different level of knowledge. Some of us are connoisseurs, some of us are newbies. Some of us want to reach expert status, some of us really don’t care how the sausage, or seltzer, is made as long as it tastes good--but so we do want to know how and why a particular seltzer does indeed taste good.\n\nWTF Am I Drinking? is an explainer series that will dive into different topics like what a certain beer or wine style is, how a hard kombucha gets made, what the difference is between a stout and a porter--things like that. It’s educational and informational but in the most fun way possible--consider it the perfect thing to do while you sip your favorite beverage. You’ll learn a thing or two, and no doubt develop a deeper appreciation for drink X, Y, or Z. Basically, we all get to geek out a little, and dish on the beverages we love.",
        "language": "en",
        "author_name": "TapRm",
        "slug": "wtfamidrinking",
        "cover": "20211027_191553_bfe480b59f2923938e67717dac3d3fb1.jpg"
    },
    {
        "podcast_id": 87899,
        "title": "What R You Drinking? The pod on alcohol.",
        "description": "<p>Welcome to What R You Drinking? The pod on alcohol (WRYD) the ultimate podcast for all alcohol enthusiasts. Join our charismatic host, Raquel Richards, as she takes you on a journey through the world of spirits, cocktails, beer, mocktails, and more.</p><p>Raquel evaluates a wide range of alcohol products, providing detailed insights and honest opinions that will help you make informed choices for your next libation.</p><p>The fun doesn't stop there. WRYD goes beyond the glass to bring you the latest Boozy News and fascinating stories behind your favourite brands.</p><p>Who better to guide you through this intoxicating world than Raquel Richards? With an impressive 23-year career in the Canadian alcohol industry, Raquel brings a wealth of expertise to the table. She honed her skills at the LCBO for 10 years (Liquor Control Board of Ontario), where she served as the Spirits Ambassador, Beer Ambassador, and VQA Expert.</p><p>She also worked at The Wine Shop (Peller Estates Winery), and was a senior copywriter on the agency side for French and Italian wines. Her passion for alcohol reviews led her to create a popular column called \"Sinful Sips\" in a music magazine she owned. Additionally, Raquel holds certifications as a bartender from The Bartending School of Ontario and is Smart Serve certified.</p><p>If you’re <em>not</em> a connoisseur, but an enthusiast eager for fresh inspiration, \"What R You Drinking?\" is your gateway to a world of bevvies.</p><p>Join Raquel Richards and get ready to sip, savour, and discover!</p>",
        "language": "en",
        "author_name": "Raquel Richards",
        "slug": "whatryoudrinking",
        "cover": "20230707_090705_fa6ca203ed5e6bafff57fd1a9daa9d4e.jpg"
    },
    {
        "podcast_id": 90409,
        "title": "Meat Based",
        "description": "Josh (from South Africa) and Nicole (from California) are what you would call \"meat based\". Their diet consists of mostly eating meat, but there is so much more to living a meat based life than just that. Join us for authentic discussions around what it is to be meat based, our experience and benefits from following meat-based diet, some taboo topics in health, and the journey of living in a foreign country while staying physically active and practicing mindfulness. \n",
        "language": "en",
        "author_name": "Meat Based",
        "slug": "meatbased",
        "cover": "20211113_084857_b985705c8d3a4803116462e148db0992.jpg"
    },
    {
        "podcast_id": 91028,
        "title": "Snyder & Friends",
        "description": "From the Woods and Water to the Mountains yonder, a podcast of personal stories, unscripted and natural in conversation.  We meet people and talk about what makes us tick.  Subjects could range but not limited to, fishing, hunting, water conservation, sustainable living, real estate, human condition, music, crypto, smoking meat & cooking. 100% Original music. \n",
        "language": "en",
        "author_name": "Christopher Snyder",
        "slug": "snyder",
        "cover": "20211117_024348_5f1a2352fb7df3a5f90f4899a428c1c2.jpg"
    },
    {
        "podcast_id": 91493,
        "title": "Shaking the Pod at Them",
        "description": "Shake shake, shake shake, what's that? It's the Pod; Bringing you restaurant recommendations, thorough evaluations of milk, movie reviews and more!",
        "language": "en",
        "author_name": "Nicholas Abraham",
        "slug": "shakingthepodatthem",
        "cover": "20211119_133639_b8a2d03d2539a4131cb1c04e300bc2b1.jpg"
    },
    {
        "podcast_id": 94800,
        "title": "EKKERT RUSL",
        "description": "Ruslið okkar kemur upp um okkur segja sérfræðingarnir. EKKERT RUSL er að vonum skemmtilegt og lifandi hlaðvarp um umhverfismál í umsjón Lenu Magnúsdóttur, sem hefur verið umhverfissinni frá fæðingu og Margréti Stefánsdóttur, sem er ekki beint umhverfissinni en er öll af vilja gerð að læra. Við fáum til okkar skemmtilega og jafnvel óvenjulega gesti í samhengi við umhverfismál sem og viðmælendur sem þekkja hvað best til málanna.  Umhverfisvernd er heita kartaflan í dag – flestir hafa eitthvað til málanna að leggja, eða vilja það að minnsta kosti. Það er ekki nóg að kaupa Teslu og telja sig umhverfisverndarsinna - það þarf víst aðeins meira til. Kannski slæðast nokkrir fræðslumolar með inn á milli í þessu hlaðvarpi til þess að hjálpa venjulegum íslenskum heimilum að bæta sig í umhverfisvernd. Við sitjum víst öll í sömu súpunni og þurfum að hysja upp um okkur. Við getum þetta saman.\n",
        "language": "is",
        "author_name": "EKKERT RUSL - Lena og Margrét",
        "slug": "ekkert-rusl",
        "cover": "20211209_081209_20cf6f4ee84e902a58f514d3cb32561b.jpg"
    },
    {
        "podcast_id": 95340,
        "title": "The Barry Way ",
        "description": "<p>Barry Flo, a Sales Professional by day shares his keen appreciation for music, cuisines and expertise in lifestyle finesse. You get an inside look on how Barry discusses various topics with friends that he brings on as his personal guests to the show. Topics include the existing climate in music, nightlife, personal life experiences, relationships, FOOD and much more that you THINK you already know! #TheBarryWay</p>",
        "language": "en",
        "author_name": "Barryflo",
        "slug": "barryflo",
        "cover": "20211212_121203_c5040738cfaee6ae3f4f073b17c895e7.jpg"
    },
    {
        "podcast_id": 95654,
        "title": "My Romelier: the Rome and Wine Experience",
        "description": "Meet Daniele, a passionate architect and sommelier, a true Roman local and follow him exploring the unexpected in matching wines with music, art, movies and literature.\nThe Eternal city is the scenery of this storytelling experience, a pleasant way to travel with your five senses...",
        "language": "en",
        "author_name": "Daniele Meledandri",
        "slug": "myromelier",
        "cover": "20211216_011209_8e9a2c663f653555f244b0f7251767f9.jpg"
    },
    {
        "podcast_id": 96010,
        "title": "Eating Habits ",
        "description": "The restaurant industry today is drastically different from the one Top Chef Alum Jamie Lynch stepped into 30 years ago. Follow along as he discusses the current climate of the industry alongside various food and beverage professionals.",
        "language": "en",
        "author_name": "Chef Jamie Lynch ",
        "slug": "eatinghabits",
        "cover": "20220208_090201_46d3066290b4461d4d115773ae4105f8.jpg"
    },
    {
        "podcast_id": 96632,
        "title": "The Bryan Texas Taco Trail Podcast",
        "description": "The Taco Trail podcast is your guidebook to the Bryan Taco Trail, a culinary journey featuring some of the best food our community has to offer. Listen along as Shane and William guide you across town to over forty great places you have to try for yourself!\n\nFor more information on the taco trail: https://www.destinationbryan.com/eat-drink/tacos/\n",
        "language": "en",
        "author_name": "Shane & William",
        "slug": "btxtacotrail",
        "cover": "20211220_021229_31120a81fd00cd283449ec4c60f66d52.jpg"
    },
    {
        "podcast_id": 97374,
        "title": "Superfood Sundays with Chef Lynnette",
        "description": "Join Superfood School founder Chef Lynnette Astaire for candid kitchen conversations with some of the most prominent plant-based people on the planet.\n\nLearn more at superfoodschool.org",
        "language": "en",
        "author_name": "Superfood School",
        "slug": "superfoodsundays",
        "cover": "20211226_091238_d8537a194b214821eec4d0b9a97e698c.jpg"
    },
    {
        "podcast_id": 97513,
        "title": "הכל על תזונת ילדים",
        "description": "רוצים לגדל ילדים שאוכלים בהנאה אוכל בריא? מחפשים מידע אמין ובגישה שפויה ומאוזנת בנושא התזונה המשפחתית? מתעניינים בנושאים הקשורים לאוכל וגדילה? רוצים לדעת מה כדאי לעשות כדי לעזור לילדים לשמור על אכילה מאוזנת ומשקל תקין ללא מאבקים וללא ״דיאטות״? בכל אלו ובנושאים מגוונים נוספים נדון בפודקאסט, המוקדש כולו לתזונת ילדים, החל מהינקות ועד סוף גיל ההתבגרות. \nהפודקאסט בהנחיית יעל חן-רביע וענת תבור, דיאטניות ילדים ומשפחה מעל 25 שנה ואימהות לילדים בעצמן. בעלות קליניקה פרטית לתזונת ילדים, מרצות ומרכזות את הקורס ״טיפול בהשמנת ילדים״ לדיאטניות קליניות בעמותת עתיד (עמותת הדיאטניות).\nלאתר של יעל כנסו ל- www.yaelchenrabih.com.\nלאתר ולבלוג של ענת כנסו ל- www.tavoranat.com.\n",
        "language": "he",
        "author_name": "ענת תבור ויעל חן רביע",
        "slug": "all-about-pediatric-nutrition",
        "cover": "20211227_031201_44591374020a6f3d49813e2246d43e26.jpg"
    },
    {
        "podcast_id": 99827,
        "title": "No Bad Reviews: A Coffee Podcast",
        "description": "<p>Every other week three friends, coworkers, and coffee industry professionals humorously explore topics in history, culture, and business using coffee as inspiration. Then, using their professionally trained palates, they try the coffee and commit to giving no bad reviews.</p><p>Hosted by Jenni Trilik, Marcus Contaldo, and Stephanie Motenko.</p><p>Sponsored by Modest Coffee</p>",
        "language": "en",
        "author_name": "No Bad Reviews: A Coffee Podcast",
        "slug": "nobadreviewspod",
        "cover": "20220518_050504_1606a670d7191c05771536e63117d631.jpg"
    },
    {
        "podcast_id": 100931,
        "title": "Libation Nation ",
        "description": "Join us Cody and Megan as we travel the nation to visit your favorite local places.    We are looking for the best happy hour, cocktail, appetizer, main, and dessert.  Meet the owners and staff that make up the menu and serve you memories as we share a story or two.  So what's your favorite place?",
        "language": "en",
        "author_name": "Cody and Megan ",
        "slug": "libationnation",
        "cover": "20220125_120100_d8995863b5797e91654b64f97b897499.jpg"
    },
    {
        "podcast_id": 102955,
        "title": "Poddy Time",
        "description": "Do you like structure, order, and knowing what's going to happen next? If so, please do not listen to this podcast, I would like to spare you the anxiety. Do you like banter, vulnerability, deep thoughts, ponderings, video games, and snacks? You're in the right place, buddy. Have a seat on your favorite toilet, it's Poddy Time baybeeeeee.",
        "language": "en",
        "author_name": "JP & Rae",
        "slug": "poddytime",
        "cover": "20220123_010144_4a0e97efb9dc4a7e5c8642919702676c.jpg"
    },
    {
        "podcast_id": 103341,
        "title": "Ma première tite frette!",
        "description": "Tite Frette vous propose une discussion à l'entour d'un sujet bien populaire... la bière!  \n\nUne présentation de Birre & Co.\nUn podcast de l'équipe Tite Frette\nwww.birreco.com / www.titefrette.ca",
        "language": "fr",
        "author_name": "Karl Magnone",
        "slug": "titefrette",
        "cover": "20220818_050815_58f22677938501c60fb6c88902dcdc37.jpg"
    },
    {
        "podcast_id": 104899,
        "title": "En résidence - le balado du club de vin",
        "description": "En résidence est le club de vin de l'idéal - bar & contenus, à Montréal. \nSon balado est animé par la sommelière Frédérique-Anne Brosseau qui présente avec amour et humour un vin méticuleusement choisi. Se joignent à elle sporadiquement ses acolytes Florence et Eugénie, ainsi que des amatrices, amateurs, vigneron-nes, importatrices et importateurs de vin. \n\nLe club de vin est une idée originale de Florence Gagnon ~\nLe balado est une conception et réalisation de Eugénie Lépine-Blondeau ~\nProduit par le Studio idéal ~\nDesign: Florence Gagnon et Carolyne De Bellefeuille ~\nThème musical: Camille Poliquin / KROY\n---\nPour nous suivre\nInstagram: @lidealmtl\nFacebook: / lidealmtl\n",
        "language": "fr",
        "author_name": "Studio idéal",
        "slug": "enresidence",
        "cover": "20220131_050133_1cf38786d943b4db2aa7cece36da30b8.jpg"
    },
    {
        "podcast_id": 106096,
        "title": "Fala Comigo!",
        "description": "<p>Olá, meu nome é Gabrielen Alexandrino, e eu criei esse podcast para ouvir histórias e compartilhar com vocês! Espero que gostem!</p>",
        "language": "pt-br",
        "author_name": "Gabrielen Alexandrino",
        "slug": "episodiotania",
        "cover": "20230406_060452_b3ad3c00990367a62dcf618419a6485c.jpg"
    },
    {
        "podcast_id": 106804,
        "title": "What I Love About Bell with Hillary Cole",
        "description": "<p>Hillary Cole, Director of Sales at Bell Wine Cellars, discusses her passion for wine in general and specifically what sets Bell Wine Cellars apart. Hillary started out as a military linguist and counter-terrorism analyst in the Washington, DC area, during which time she also had the opportunity to visit vineyards in Italy fairly regularly. The serenity and romance of the vineyards were a stark contrast to her Intelligence career and she felt at home every time she stepped foot on one. After leaving the Intelligence field, she moved to Sacramento to learn how to fly fixed-wing aircraft. She intended to be here for two years and then to fly airlifts in Africa, but gravitated instead to the wine industry via restaurant management as the General Manager and Sommelier for three Sacramento-area restaurant groups after finishing her MBA studies and Intro Sommelier exam. Her final position on the restaurant side of wine was running the wine program at Ella Dining Room and Bar in Sacramento. Hillary has completed several wine certification programs, her favorites among which include French Wine Scholar, Champagne Master Level, Napa Valley Wine Expert, and The Business of Wine. She has loved having the opportunity to maximize her backgrounds in business, wine, and leadership via her position as Director of Sales Manager at Bell Wine Cellars.</p>",
        "language": "en",
        "author_name": "Bell Wine Cellars",
        "slug": "whatiloveaboutbell",
        "cover": "20220206_050228_9ee9599189a489b987a356ae3a735bf3.jpg"
    },
    {
        "podcast_id": 108138,
        "title": "Heavy Smoke Podcast With Shiest Bubz",
        "description": "The Heavy Smoke Podcast  is all about  Fashion, Weed, Music and Culture . Our Host Shiest Bubz and his Co-Host Lisa B brings you an exciting platform from some of the most influential tastemakers in our culture. From the OG himself Shiest Bubz has experience his share of lifestyle and bring you the true love for why we do what we do in our culture everyday to set trends , shift culture and bring different flavors from all over .\n",
        "language": "en",
        "author_name": "Shiest Bubz",
        "slug": "theheavysmoke",
        "cover": "20220429_050403_0e4a28fd7b04c4549c90ffd33f63c3fc.jpg"
    },
    {
        "podcast_id": 108535,
        "title": "Walk-In Podcast ",
        "description": "<p>We are three guys with years of stories and insight about what its like to work in the restaurant industry. Any one who's worked in service is familiar with the random and unforgettably hilarious conversations in between taking tables and after close, over a pile of napkins and a bucket of silver ware. On this podcast we talk about what its like to wear the apron, and we bring it to you like we're just talkin' by the walk-in.</p>",
        "language": "en",
        "author_name": "Cameron Peppers",
        "slug": "walk-in-pod",
        "cover": "20230913_120930_107358479f23dd10cc0a87d16f543417.jpg"
    },
    {
        "podcast_id": 109051,
        "title": "A Thousand Miles ",
        "description": "A podcast about long distance relationships and culture. ",
        "language": "en",
        "author_name": "Jessica Zanatta",
        "slug": "athousandmiles",
        "cover": "20220328_050316_b5efde3c5f4f923ff864d023b21d20ac.jpg"
    },
    {
        "podcast_id": 109182,
        "title": "Agri-Insider",
        "description": "<p>Your Agri-Food for Thought Podcast unlocking exclusive industry insights from top key decision makers at the world's leading companies in agriculture and technology.</p>",
        "language": "en",
        "author_name": "Tridge Intelligence & Data",
        "slug": "freeonboardbytridge",
        "cover": "20230821_080801_9c51d8bb864f72050ce688998631575a.jpg"
    },
    {
        "podcast_id": 109234,
        "title": "HoppyCrew Podcast ",
        "description": "Rozmowy o piwie przy piwie. Posłuchaj piwowarów z browaru PINTA.",
        "language": "pl",
        "author_name": "Browar PINTA",
        "slug": "hoppycrewvibes",
        "cover": "20220216_010239_6cba97983962c89e82b622e3824a1a20.jpg"
    },
    {
        "podcast_id": 109626,
        "title": "Comer Fuera, historias pequeñas de migración y gastronomía",
        "description": "<p>Comer Fuera es un podcast sobre gastronomía y migración, en el que visitaremos restaurantes de comida migrante de Barcelona para conocer su gastronomía, pero también la historia de migración que tiene la persona que nos la prepara. El podcast se puede escuchar, pero también se puede leer. Cada capítulo tendrá una entrevista a los dueños de los restaurantes, pero también una crónica de la visita, para comer leyendo. En definitiva, un podcast para comer fuera de casa en todos los sentidos. El podcast y la crónica se pueden escuchar y leer en www.davidleonhimelfarb.com</p>",
        "language": "es",
        "author_name": "David León Himelfarb Schlensker",
        "slug": "comer-fuera-podcast",
        "cover": "20220217_110246_9479cd300fc9975b613f7304276cac9a.jpg"
    },
    {
        "podcast_id": 109684,
        "title": "El Cocinero Podcast",
        "description": "Bienvenidos a mi Podcast, Un lugar donde podré expresar todas mis anécdotas y experiencias de mi vida.",
        "language": "es",
        "author_name": "Alex Vargas ",
        "slug": "elcocineropodcast",
        "cover": "20220220_070238_7732443e800980842e07fbb740fdc6d2.jpg"
    },
    {
        "podcast_id": 110343,
        "title": "The No Eye Deer Podcast",
        "description": "Aaron and Adam talk about all things outdoors and conservation.  Filled with humor, learning, irrelevance, AND irreverence they will talk about things that just might surprise the hell out of you.  Episodes consist of just Aaron and Adam BSing but also  welcomes guests who add their own expertise to the vast world of the outdoors.",
        "language": "en",
        "author_name": "Aaron Sturgis",
        "slug": "noeyedeer",
        "cover": "20220221_020248_2b5f6cb8cbd1af91538877bc3ba6e63e.jpg"
    },
    {
        "podcast_id": 110507,
        "title": "Mambo vipi ?",
        "description": "<p>Urugendo mu kwihaza mu biribwa ni rurerure. Sangira natwe uburyo twahinga tukanorora ibidutunga. Ngwino dusangire amafunguro tuzatekera hamwe mu bivuye mubyo twahinze.</p>",
        "language": "en",
        "author_name": "Nilekast",
        "slug": "mambovipi",
        "cover": "20220227_020239_9e1d59bb78df4d4364272e878eaa87a5.jpg"
    },
    {
        "podcast_id": 111217,
        "title": "SA Winos - Wine Not",
        "description": "Wine Not is a podcast series where we will explore the monthly releases of the SA Winos wine club.  We will be exploring the history behind the varietals and estates, and taste these wines along with you whenever you're ready.  In the future we will be joined by the wine makers themselves to dive into the methods used to create the delicious wines.  If you're not yet a member of the club, head on over to SAWinos.com and sign up!",
        "language": "en",
        "author_name": "SA Winos",
        "slug": "winenot",
        "cover": "20220224_080254_04044b0a755e58e7cc65a9ec3bd71a8b.jpg"
    },
    {
        "podcast_id": 111816,
        "title": "CHAMPIONCHIP",
        "description": "<p>CHAMPIONCHIP is a weekly review of surprise bags of potato chips. Founded by Brodie AB at age 9, Championchip is an expedition from one bag to five in four categories. Joined by co-host and father, Alex, and Program Director, Mama Barrett, the ever-inquisitive Brodie reviews chips on things like appearance, accessibility, smell, and taste. The chips are a surprise to the hosts every week and they're purchased by friends and family. Special guests drop in every now and then to join in the fun. This show should inspire an openminded approach to your next chip selection. It should also entertain you! Throw us a follow on Instagram @championchip_podcast. We love you, Chip Champions!</p>",
        "language": "en",
        "author_name": "CHAMPIONCHIP",
        "slug": "championchip",
        "cover": "20220622_050634_23e80d36b3bc6cb9fc79381a7a801264.jpg"
    },
    {
        "podcast_id": 112019,
        "title": "The Honest Podcast",
        "description": "Tom Barton and Philip Eeles, co-founders of the British restaurant chain Honest Burgers reflect on the last 10 years of their journey from a tent in Brighton through to 40+ restaurants across the nation. Tune in to hear about the highs and lows of starting a national burger brand from scratch, with some great guests along the way.\n\nEver wondered about the secrets behind Honest? Or how we come up with the ideas for our Monthly Specials? Our Co-Founders, Tom and Phil, chat through the f**k ups, the story, Honest Farming and more in our 8-episode series of The Honest Podcast.",
        "language": "en",
        "author_name": "Honest Burgers",
        "slug": "honestpodcast",
        "cover": "20220927_010920_35cc157c550f19d427ba9102a425337a.jpg"
    },
    {
        "podcast_id": 112106,
        "title": "Grilling, smoking meat, and beer",
        "description": "Two guys talking about what they love. Grilling, smoking meat, and drinking beer. We talk about gear, styles of cooking, and anything else related to the above topics.",
        "language": "en",
        "author_name": "Shade Tree Chef's",
        "slug": "shadetreechefs",
        "cover": "20220228_100252_c384b2f7a7e0ff6a80bbe79bceae2e7b.jpg"
    },
    {
        "podcast_id": 112337,
        "title": "Literally Delicious Podcast",
        "description": "Hello, food nerds! Every week, we take a deep dive into some delicious dishes (and drinks) from classic works of literature. By exploring historical documents, recipes, and cookbooks, host Nick will take you into the culinary world of great fiction, making the same food enjoyed by some of literature's most beloved characters. With a new recipe in hand, Nick then takes you into his kitchen where he tries his best to make the narrative nosh as close as he can to the original. ",
        "language": "en",
        "author_name": "A Cooking Podcast",
        "slug": "literallydelishpod",
        "cover": "20220913_070913_8ba649ae71dea4305a1f9e10775b7add.jpg"
    },
    {
        "podcast_id": 113623,
        "title": "Very Terrible Podcast",
        "description": "It all started with a dream of radio, and led us here. Join us on an effort that can only be described as \"amateur-hour horse piss\", as two or more complete hacks try our best to entertain you and make it all the way to doing this on the air.",
        "language": "en",
        "author_name": "Jason Spinner",
        "slug": "veryterriblepodcast",
        "cover": "20220307_060349_1825975a8004a506bcafd88d837b595e.jpg"
    },
    {
        "podcast_id": 115270,
        "title": "The Christian Hansen Podcast",
        "description": "The Christian Hansen Podcast is a three-in-one podcast network that includes \"HFT Bets\", \"What's on the Menu?\", and \"Full Scale\" all hosted by Christian Hansen. \"HFT Bets\" is a sports analysis podcast that has discussion of a multitude of sports with an emphasis on sports picks. \"What's on the Menu?\" is a podcast focused on food discussion and looking at the history of different dishes and restaurant recommendations. \"Full Scale\" is a music podcast that is focused on appreciation of all types of music with analysis of different songs and artists.\n\nTwitter:\nThe Christian Hansen Podcast- @TheCHPod\nWhat's on the Menu?- @WOTMPod\nHFT Bets- @HftBets\nFull Scale- @FullScalePod\n\nInstagram:\nThe Christian Hansen Podcast- @TheCHPodcast\nWhat's on the Menu?- @WOTMPod\nHFT Bets- @HftBets\nFull Scale- @FullScalePod\n\nPatreon:\nhttps://www.patreon.com/TheCHPod",
        "language": "en",
        "author_name": "Christian Hansen",
        "slug": "hftbets",
        "cover": "20220315_060335_b88e96c3646a3113d8d24648717f35d9.jpg"
    },
    {
        "podcast_id": 116216,
        "title": "Never Ceasing",
        "description": "      Two life long friends talking about God ,life, and everything else.",
        "language": "en",
        "author_name": "Nathan and Tim",
        "slug": "never-ceasing",
        "cover": "20220319_040349_ad9a4040e66ca86b78b5e127d2290421.jpg"
    },
    {
        "podcast_id": 117032,
        "title": "Baking to the B Movies",
        "description": "Longtime friends Ashley & Stef have a lot of things in common- but nothing moreso than their love of bad horror movies and getting experimental in the kitchen. They've combined this passion to bring you 'Baking to the B Movies'- a deep dive into some of the best of the worst (or worst of the worst) horror movies and share recipes inspired by each film they suffer through.",
        "language": "en",
        "author_name": "Ashley & Stef",
        "slug": "bakingtothebmovies",
        "cover": "20220323_020356_0f5ea48c07d9c3bf5ad8e97bc4b84387.jpg"
    },
    {
        "podcast_id": 117866,
        "title": "Girls Who Drink Beer",
        "description": "Girls Who Drink Beer are here to laugh and foster friendships one cheers at a time.  Come hang out as Nat and Court talk all things beer - and the shenanigans that inevitably follow.  It's not just beer, it's a vibe.  Cheers!\n\nFollow on instagram @girls.who.drink.beer",
        "language": "en",
        "author_name": "Courtney Reeves and Natalie McKeever",
        "slug": "girlswhodrinkbeer",
        "cover": "20220326_050326_54cced73b6d82e1a26aa75f062908c1a.jpg"
    },
    {
        "podcast_id": 118170,
        "title": "Eat Gluten Free with Me",
        "description": "<p>Eat Gluten Free with Me is a health &amp; wellness account I started on TikTok (@eatglutenfreewithme) to create a close-knit gluten-free community. I was diagnosed with Celiac Disease, Crohn's Disease, &amp; IBS when I was 17 years old and I always struggled to find people that I could relate to and ask advice from when it came to living gluten-free. Instead of waiting to find my community, I built my own to help others in the same situation. I provide you with valuable knowledge to make living life with Celiac Disease, an autoimmune disease, or simply eating gluten-free something you no longer see as a task. You deserve freedom from your diagnosis. Subscribe to find your freedom and to join the gluten-free community. Follow me on TikTok - @eatglutenfreewithme, IG - @eat.glutenfreewithme to see my daily tips &amp; tricks or YouTube @eatglutenfreewithme for more in depth videos on Celiac Disease! YOU ARE MORE THAN YOUR DIAGNOSIS.</p>",
        "language": "en",
        "author_name": "Lauren Murawski",
        "slug": "eatglutenfreewithme",
        "cover": "20220913_070952_6b5ba2da3592ff3fb2cd570c84b62a97.jpg"
    },
    {
        "podcast_id": 118357,
        "title": "Overcaffeinated With Attitude ",
        "description": "Two sassy females talking about coffee, food and all things pop culture. ",
        "language": "en",
        "author_name": "Overcaffeinated With Attitude ",
        "slug": "overcaffeinatedwithattitude",
        "cover": "20220403_110429_2c499f25c5f7a686b67d3044455a3481.jpg"
    },
    {
        "podcast_id": 118620,
        "title": "Eat, Drink, and Do Good by Studio ATAO",
        "description": "Original thought pieces from emerging writers at the intersection of food, beverage, hospitality (FBH) and social justice. Past issues have covered everything from gift economies and food apartheid, to healthcare discrimination and ableism. This podcast is a continuation from our monthly newsletter of the same name. Read all the past pieces at https://www.studioatao.org/newsletter.",
        "language": "en",
        "author_name": "StudioATAO",
        "slug": "studioatao",
        "cover": "20220510_030539_4ef858e65a4f1d008f02eca8e51de1e3.jpg"
    },
    {
        "podcast_id": 119070,
        "title": "Hotel & Restaurant Times - Chef Table Podcast",
        "description": "Join us as we talk to some of Ireland's top chefs about career influences, Michelin Stars, food trends, hospitality careers and much more.\nEpisode #1 John Fareed and James Chappell from Horwath HTL - Hotel, tourism, leisure, post-pandemic.\nEpisode #2 Gary Rogers - Team work in the Carton House kitchen.\nEpisode #3 Oliver Dunne - It's not all about Michelin Stars.\nEpisode #4 Alberto Rossi - The Italian Job from InterContinental Dublin.",
        "language": "en",
        "author_name": "Cyril McAree",
        "slug": "hotelandrestauranttimes",
        "cover": "20220706_030746_2e3e42f64c2ef6030939743eeba22c39.jpg"
    },
    {
        "podcast_id": 119330,
        "title": "The Emman and Jan Show",
        "description": "Hello everybody! This is our first podcast and on here we plan on talking about our random adventures, random life lessons, interviews with our friends, etc. We hope to make some type of impact on people's life, encourage everyone to just be them selves and to enjoy the beauty of life. ",
        "language": "en",
        "author_name": "Emmanuel and Janet Calva",
        "slug": "theemmanandjanshow",
        "cover": "20220921_050904_1926257a3858394489f5d61fdc2fedda.jpg"
    },
    {
        "podcast_id": 121890,
        "title": "Konsten att bara vara JAG",
        "description": "Vårt mål med den här Podden är att \nSprida glädje, peppa dig som lyssnar till att samla mod till att våga vara DIG själv, följa DIN väg på DITT sätt. \n\nVi kommer prata om hur vi tog oss dit vi är idag, modet att våga, skönhetsideal, hur samhället påverkar oss, prata och öppna upp ämnen som idag ses som TABU i dagens samhälle, kvinnokroppen, stress & sociala medier.  Vi kommer vara brutalt öppna och ärliga och bolla åsikter i oändlighet tillsammans med er!",
        "language": "sv",
        "author_name": "Konsten att bara vara JAG ",
        "slug": "konstenattbaravarajag",
        "cover": "20220413_080443_83fd23377605efbf68a1005b16da1a3d.jpg"
    },
    {
        "podcast_id": 122026,
        "title": "Los estudiahambres ",
        "description": "Buscamos los mejores lugares para comer cumpliendo siempre con las tres S Sabroso Servido Y Sin gastar tanto.\n Si tu como nosotros eres fan de la comida pero con presupuesto de estudihambre te invitamos a escucharnos",
        "language": "en-us",
        "author_name": "Ximena Verdín ",
        "slug": "los-estudihambres",
        "cover": "20220414_040433_58c25a3cd4d074da0d14994a313abee0.jpg"
    },
    {
        "podcast_id": 122261,
        "title": "The weekly running recipe",
        "description": "Food and running...",
        "language": "en",
        "author_name": "Ewan Parker",
        "slug": "weeklyrunningrecipe",
        "cover": "20220415_060407_e909dd5b3586936125fecfef92363c8f.jpg"
    },
    {
        "podcast_id": 123529,
        "title": "Irma Brizi - Nocciola italiana",
        "description": "Il primo canale podcast dedicato alla Nocciola Italiana\n#noccioladay #lavocedellanocciolaitaliana ",
        "language": "it",
        "author_name": "Irma Brizi",
        "slug": "irmabrizi",
        "cover": "20220719_020747_547d74bf75966bcf05e08ca6d7fff20b.jpg"
    },
    {
        "podcast_id": 124770,
        "title": "Weekend at Berckmans",
        "description": "Where we talk about everything and nothing",
        "language": "en",
        "author_name": "Michael Wroblewski",
        "slug": "weekendatberckmans",
        "cover": "20220427_020447_ff7ea5ea7c253fa45406a1356823a4c1.jpg"
    },
    {
        "podcast_id": 125440,
        "title": "Cream, eggs & Jam",
        "description": "We are Scotty and Elise, an interior designer and lawyer with a common passion for cooking, using all our senses and deeply understanding our food systems. We met as contestants on Masterchef Australia Season 13. \n\nJoin us and see who we can meet over a cup of tea and a slice of cake slathered with cream and jam!\n\nWe know there are other food nerds out there interested in eating beyond just for mere sustenance – You are our people. \n\nSend us your Show & Tell, tell us what Tips & Tricks you would like us to cover, or let us know what guests we should chat to on the show at scottyandelise@gmail.com",
        "language": "en",
        "author_name": "Elise Pulbrook & Scott Bagnell",
        "slug": "creameggsandjam",
        "cover": "20220430_020410_d4eb3898727773a84bd6b5d9c5f12110.jpg"
    },
    {
        "podcast_id": 125528,
        "title": "I’m Not Through",
        "description": "Discussions about eating disorders and life with and without them.\nAny addiction, issue, about how it’s effected your life, your relationships, opportunities, your health.",
        "language": "en",
        "author_name": "Katie Collins",
        "slug": "imnotthrough",
        "cover": "20220430_040417_bf4cf6db48ff4d13abd8b58d6c07edf1.jpg"
    },
    {
        "podcast_id": 125592,
        "title": "Men of Few Words Podcast",
        "description": "<p>Hosted by Ace Da Rebel.</p>",
        "language": "en",
        "author_name": "Limitless Studios LLC",
        "slug": "menoffewwordspodcast",
        "cover": "20220621_030638_70e97e1832a5df8487178fbb3e3e3083.jpg"
    },
    {
        "podcast_id": 125697,
        "title": "Bloom & Flow",
        "description": "Slow living for everyone.",
        "language": "en",
        "author_name": "Lara Autumn",
        "slug": "bloomandflow",
        "cover": "20221009_021013_c45f641b2e13f7d9a3da4f380e3ab8b9.jpg"
    },
    {
        "podcast_id": 126122,
        "title": "APERO TALK by Bernard-Massard",
        "description": "« Luxembourg, le plus petit pays possède tous les plus grands vins du monde ! » Selon notre sommelier, Eddy Rousseau, tel est bien le cas ! Pour chaque épisode de notre podcast sur le vin, Eddy invite une personnalité du Grand-Duché à une soirée apéritif décontractée pour présenter ses dernières découvertes. \nEn plus d’une bonne dose de divertissement, ce RDV vous apporte conseils et aussi des informations sur la scène du Food & Wine du Luxembourg.",
        "language": "fr",
        "author_name": "Eddy Rousseau",
        "slug": "apero-talk-by-bernard-massard",
        "cover": "20220504_070524_043201617958b48f3ca317409eb343ac.jpg"
    },
    {
        "podcast_id": 126710,
        "title": "A Second Helping Podcast ",
        "description": "Brother and sister team of Good Mood Food UK and JMS Nutrition bring you an original and delicious podcast, where we chew over all things food. From the our favourite recipes and time saving tips in the kitchen to making the food you love work for you and your health goals. ",
        "language": "en",
        "author_name": "Emily & James Sandom",
        "slug": "a-second-helping",
        "cover": "20220506_090558_dd0b5a47ca9c4b9f2923376d94d60267.jpg"
    },
    {
        "podcast_id": 129582,
        "title": "CASA VIDA",
        "description": "Centro Agroecológico de Saberes Campesinos, CASA VIDA. Somos un lugar de encuentro, para compartir y tejer saberes, prácticas, pensares y sabores. Es un lugar para  reconocernos, seguir caminando y cuidarnos entre nosotras, nosotros, nosotres, en armonía con la Madre Tierra, las plantas, los animales, el aire, el suelo, el agua y seres sintientes. Aquí la vida campesina dialoga con la agroecología, la economía solidaria, el buen vivir, el ecofeminismo, la salud, la espiritualidad  y la soberanía alimentaria.",
        "language": "es",
        "author_name": "Centro Agroecológico de Saberes Campesinos, CASA VIDA",
        "slug": "casavida",
        "cover": "20220521_060544_e3fce4f05044a697fcf525770c4809a8.jpg"
    },
    {
        "podcast_id": 130453,
        "title": "Paige & Emily Neuhauser Present: Babes & Bagels",
        "description": "Introducing Babes & Bagels Podcast! A weekly podcast featuring two babes/sisters Paige and Emily Neuhauser and two bagels! Our love for bagels and chatting has turned into a podcast! \n\nThanks for watching!\n\nFollow us on Instagram & Facebook!\n\nhttps://www.instagram.com/babesandbagelspod/\n\nhttps://www.facebook.com/Babes-Bagels-106242328730259",
        "language": "en",
        "author_name": "Paige & Emily Neuhauser",
        "slug": "babesandbagelspodcast",
        "cover": "20220526_040527_cc7aaefb985fcebf5d78d2116884dc28.jpg"
    },
    {
        "podcast_id": 130534,
        "title": "Satiky09_ Show",
        "description": "Chiaccheriamo insieme",
        "language": "it",
        "author_name": "Satiky09_",
        "slug": "satiky09",
        "cover": "20220526_040551_ef202e0959274f0e280a34fb1e45a7cb.jpg"
    },
    {
        "podcast_id": 131437,
        "title": "Alimentazione e merceologia ",
        "description": "<p>tecniche di cucina potenzialmente dannose e suggerimenti su come evitarle</p>",
        "language": "it",
        "author_name": "La Nina e il Tè",
        "slug": "laninaeilte",
        "cover": "20230607_060634_ef443a93dc8024ffea797a4221a976ac.jpg"
    },
    {
        "podcast_id": 133228,
        "title": "Pura Vida Obesidad",
        "description": "Este podcast es el audio de charlas en vivo que se da en zoom para pacientes de Pura Vida. En instagram: @puravida.obesidad Luego de la charla se abre a comentarios y opiniones pero ese espacio se extrae del podcast por respeto a los pacientes.\nEn este podcast te voy a ayudar a reconciliarte con tu cuerpo, con vos mism@ y con tu relación con la comida, para poder vivir en un cuerpo saludable y en paz con tu alimentación por el resto de tu vida.\nGracias gracias gracias y Pura Vida",
        "language": "es-mx",
        "author_name": "Lorena Serrano",
        "slug": "puravidaobesidad",
        "cover": "20220609_030609_2d9990fab09bab2a5d87300a20e036a4.jpg"
    },
    {
        "podcast_id": 134782,
        "title": "Bunch The Podcast",
        "description": "Conversations about big picture problems under the microscope of the Berkshires.",
        "language": "en",
        "author_name": "Josh Irwin",
        "slug": "bunchthepodcast",
        "cover": "20220620_090642_99a2f172626aa7ff078c83d4bd922331.jpg"
    },
    {
        "podcast_id": 136578,
        "title": "El Pipirín",
        "description": "Foodie Podcast",
        "language": "es-mx",
        "author_name": "El Pipirín - Foodie Podcast HMO",
        "slug": "pipirin",
        "cover": "20220625_080603_01ac1c1fc7bee6d34ad2037ddd1384f9.jpg"
    },
    {
        "podcast_id": 136881,
        "title": "Using My Degree",
        "description": "Weekly questions and answers about all things pastry! Follow CIA graduate Ollie as they and a weekly guest answer your questions, and narrow in on everyday ingredients and how to use them to the best of your ability. ",
        "language": "en",
        "author_name": "Ollie TheScribe",
        "slug": "usingmydegree",
        "cover": "20220626_110627_1ff2ee9384f1f63ecb9ee03361e5e240.jpg"
    },
    {
        "podcast_id": 137087,
        "title": "Kawfee With Klavi ",
        "description": "Learn about coffee and how to make it a part of your life. Klavier is a coffee enthusiast hoping to help others take their love of coffee to the next level or integrate coffee in a new ways in their life. Klavier loves to educate about coffee and help others find a love of coffee or deepen their passion!",
        "language": "en",
        "author_name": "Klavier Newshan",
        "slug": "kawfeewithklavi",
        "cover": "20220707_020738_e603e8283a9f8b2e950093cdd1b91d48.jpg"
    },
    {
        "podcast_id": 137177,
        "title": "Bierkultur Talks ",
        "description": "Unternehmergespräche mit Experten der Genusskultur aus Niederbayern und Oberösterreich",
        "language": "de",
        "author_name": "Alois Dorfner Markenberatung",
        "slug": "bernhard-sitter",
        "cover": "20220628_050607_72c6cc0d87d011e76ec7b9aade38af71.jpg"
    },
    {
        "podcast_id": 138556,
        "title": "Seafood Matters Podcast",
        "description": "Providing a voice for the UK fishing industry Jim Cowie speaks with fishermen, fisheries scientists and seafood industry leaders.",
        "language": "en",
        "author_name": "Jim Cowie",
        "slug": "seafoodmatterspodcast",
        "cover": "20220708_080700_cbbb3e56fb84fb4f455efd55e1729d19.jpg"
    },
    {
        "podcast_id": 139017,
        "title": "Colby's Room ",
        "description": "Colby's Room is a special podcast surrounding the life events of four very special gentlemen. Meeting through a chance encounter during their stints at a chicken restaurant, Josh, Ian, Joe, and Skyler instantly bonded and knew that they were destined for something astounding. The pod orbits their friendship, and the stories they tell allow any listener to feel as if they too were sitting, chilling with the boys. Inspired by an invisible fifth member, the mythical Colby, the lads decided to share their lives to the world through a podcast that, hopefully, you will enjoy!",
        "language": "en",
        "author_name": "Colbysroom ",
        "slug": "colbysroompod",
        "cover": "20220707_070743_6eda839047419e06d6c445a68dfc8e25.jpg"
    },
    {
        "podcast_id": 140047,
        "title": "Bear Down",
        "description": "Jared Martin and Sam Minton break down the Boston Bruins, the NHL and other sporting world happenings. And, maybe some other stuff if you catch us on a good day. Thanks for coming.",
        "language": "en",
        "author_name": "Jared Martin",
        "slug": "thebeardownpodcast",
        "cover": "20220712_090742_e24d52c05d837ef37813b87b4c81bd57.jpg"
    },
    {
        "podcast_id": 140366,
        "title": "Let's Chew Podcast",
        "description": "Welcome to the Let’s Chew Podcast, presented by Gulfood,The Largest Annual F&B Sourcing Event In The World. I am your host Juweyria Hersi bringing you compelling stories and insights into a wide range of topics in the food and beverage industry from farming, behind the scenes, to the culinary world, to foods we simply love to chew on.\n\nIn this podcast series, we talk to people, brands, and businesses across the food and drinks spectrum to find out more about why they do what they do and how in their way they are championing change and shifting the future of food and drink.",
        "language": "en",
        "author_name": "Gulfood",
        "slug": "letschewpodcast-gulfood",
        "cover": "20220720_100702_9fc4f30a65fb51ec66e13b929c276c22.jpg"
    },
    {
        "podcast_id": 140483,
        "title": "Crypto Confidential",
        "description": "il primo talk show di crypto e cucina condotto dal crypto chef Giorgio Gramegna e dal crypto nerd Alessio Cappuccio",
        "language": "it",
        "author_name": "Giorgio Gramegna & Alessio Cappuccio",
        "slug": "cryptoconfidential",
        "cover": "20220715_120721_964fcf669fd53a0dea853c92abfd35e3.jpg"
    },
    {
        "podcast_id": 141020,
        "title": "Chismosos ",
        "description": "A group of friends with similar trauma with one podcast. All kinds of mix generation-Americans gathering together to in finding their voices. ",
        "language": "en",
        "author_name": "Janette Arellano",
        "slug": "los-chismosos-live",
        "cover": "20220730_040701_49b52fc66d93deaa4feaa9d798da1594.jpg"
    },
    {
        "podcast_id": 141120,
        "title": "Bar-Fabric Presents",
        "description": "Welcome to Bar-Fabric Presents - the drinks podcast coming to you direct from us, the  Bar-Fabric UK Team.\n\nJoin Ali, Cam, Joseph, Dani, Michael, Charlotte, Matthew and a host of special guests as they explore areas of the drinks trade previously undiscussed on the air.\n\nWe hope you love it, and we hope you learn from it - cheers!\n\n*** You may only listen to this podcast if you are above the legal drinking age in your region. Drink responsibly and do not share with anyone under the legal drinking age ***",
        "language": "en",
        "author_name": "Bar-Fabric UK",
        "slug": "bar-fabricpresents",
        "cover": "20220718_030733_8c24562709dc2c5977a66c6b2ef7a546.jpg"
    },
    {
        "podcast_id": 141157,
        "title": "HUMANS",
        "description": "Ciao a tutti ragazzi e ragazze! Ecco il Trailer di HUMANS, il podcast che racconterà come il Fitness puó essere uno strumento per crescere sia nel corpo che nella mente.\n.\nIn questo Link puoi trovare anche la nostra pagina IG e i servizi attivi: https://linktr.ee/hu.ma.ns\n",
        "language": "it",
        "author_name": "Matteo Lamorte",
        "slug": "teamhumans",
        "cover": "20220718_070755_bebb21e42d33ed14f446d883c44d808f.jpg"
    },
    {
        "podcast_id": 141171,
        "title": "How I Cooked Today",
        "description": "Welcome to How I Cooked Today.   I am Marquita Moore.   Spend some time with me as I share how I’m feeding my body - sharing the recipes I love to cook, recipes I grew up on, and recipes I want to challenge myself to make (sometimes I nail these challenges, and sometimes… I don't) and how I'm feeding my soul - how I nurture my relationship with myself, others, and my spiritual life; the things I reflect and meditate on as I live life rooted in love and connected to Spirit.  It's all about inspiring, growing and healing on How I Cooked Today.",
        "language": "en",
        "author_name": "Marquita Moore",
        "slug": "howicookedtoday",
        "cover": "20220718_080731_90728abb751a31f845acc300dd7023e4.jpg"
    },
    {
        "podcast_id": 141328,
        "title": "Farming For the Future",
        "description": "A podcast aimed at people (especially young people) who want to learn more about, or enter, the farming industry but who are not from 'traditional' farming backgrounds. My aim is to have quick conversations with growers, business owners and inspiring individuals who have carved out interesting niches in the growing space!",
        "language": "en",
        "author_name": "Rose Brookfield",
        "slug": "farmingforthefuturepod",
        "cover": "20220719_040706_82f72a6ce95436615c500dd7687ddf6f.jpg"
    },
    {
        "podcast_id": 141724,
        "title": "Tiny Table Talk",
        "description": "Two tiny girls talking a lot of nonsense.. mostly about food. ",
        "language": "en",
        "author_name": "Tiny Table Talk",
        "slug": "tinytabletalk",
        "cover": "20220721_040757_7c60d55fcb9b99d72f3156dc1b23d415.jpg"
    },
    {
        "podcast_id": 141727,
        "title": "ME GUSTA DE NOCHE PODCAST",
        "description": "El podcast \"Me gusta de noche” es el primer podcast latenight que trae consigo segmentos de todo tipo, con la libertad de verlo desde donde te encuentres. \nJhoel López es el host y productor del mismo, quien se encargará de llevar el entretenimiento al siguiente nivel.\n",
        "language": "es",
        "author_name": "Me gusta de noche ",
        "slug": "me-gusta-de-noche-podcast",
        "cover": "20221021_081050_64dc574dfb2ac7fafe1f5645fc6acb91.jpg"
    },
    {
        "podcast_id": 143540,
        "title": "Passing Through A Vegan Door",
        "description": "Hi! My name’s Harry, and welcome to Passing Through A Vegan Door Podcast. \n\nVeganism is a growing idea that leaving animals alone can save the world. It can be quite scary to take those first steps and change life long habits, but it’s important to find a way to break those habits and understand that what we do to animals every day isn’t right. \n\nPassing Through A Vegan Door is a way for me to talk about the things I care about while offering an insight into the who's, the what's, the when's, the where's, the why's, and the how's of being vegan. This podcast is for everyone: whether you’ve got decades more experience than me in being vegan; or you just wish vegans would shut up and let you eat your steak in peace. I’m not the expert… I’m just here to pass on the word. Hopefully it can be somewhat entertaining as I do. \n\nI will cover a range of topics such as: the environment, society, health, politics, diet, the animals themselves, and more! I will be chatting to people who share a similar mindset, and a common goal of living a vegan lifestyle, but also people who couldn’t care less. Those are the people who have the power to make real change. Small changes do make a big difference, and I hope to show you how.\n\n“To be vegan, is to release your grip on the animal”\n\nThank you for reading, I hope whatever I can offer can be of help. Follow my instagram page @passingthroughavegandoor to keep up to date 🌱\n",
        "language": "en",
        "author_name": "Harry Morris",
        "slug": "passingthroughavegandoorpodcast",
        "cover": "20220731_100745_7c2800fcfa6dbd8362f7d803136c7c18.jpg"
    },
    {
        "podcast_id": 145764,
        "title": "The Delish Guestlist Podcast",
        "description": "The Delish Guestlist explores the stories of Hong Kong and Asia’s most captivating and game-changing hospitality legends, mixing our cocktails, cooking our food, and creating our dream experiences. Listen to what makes the region’s top mixologists, bartenders, chefs, operators, baristas, and sommeliers succeed! \n\nThis is a production of The Beat Asia, visit us online at www.thebeat.asia\n\n",
        "language": "en",
        "author_name": "The Beat Asia",
        "slug": "hongkongfeaturecast",
        "cover": "20221024_081057_4e398d4b17fa2b4de2a235023580f6dc.jpg"
    },
    {
        "podcast_id": 146167,
        "title": "ROUGH RIDER TALK RADIO ",
        "description": "<p>WE LIKE DISCUSSING CURRENT EVENTS, SPORTS, TRAVEL, LEISURE &amp; BIG FOOT</p>",
        "language": "en",
        "author_name": "Richard Angelotti",
        "slug": "roughriderpodcast",
        "cover": "20220910_030907_f6b32b795503b61789e5fd98a05086fd.jpg"
    },
    {
        "podcast_id": 148488,
        "title": "Who Closed Last Night",
        "description": "The restaurant business is a crazy one!  If you work in the customer service industry then you already know the crazy things you could see!  Who closed last night is a podcast by two bartenders, Jill and Steph, who share some of the wildest and craziest customer service stories and their opinions on the matter.",
        "language": "en",
        "author_name": "Stephanie Johnson & Jillian Schrader",
        "slug": "whoclosedlastnight",
        "cover": "20220824_050830_60d365c318143c2b7ee7a5517abd3fca.jpg"
    },
    {
        "podcast_id": 148879,
        "title": "Bite Size",
        "description": "Welcome to Bite Size! A podcast shared between two friends who unpack the weekly endeavors and happenings of their everyday lives. Whether the topic is restaurants, feline friends, or even science facts join your hosts Maggie and Mia as they navigate the world with hopes to bring laughter and joy along with them!  ",
        "language": "en",
        "author_name": "Maggie and Mia ",
        "slug": "bitesizepod",
        "cover": "20220825_080856_4836cc49f30027848612ace492b4795b.jpg"
    },
    {
        "podcast_id": 150508,
        "title": "Troublesome Conversationalists",
        "description": "Troublesome Conversationalists is a podcast with no real topic. We are a group of friends who use this as a passion project as a means for creative outlet. Don't forget to Leave a Review and drop a follow for new weekly content. Also checkout our socials for up to date information or to join the conversation. \n\n\nTwitch: TCpodcastLive\nYouTube: Troublesome Conversationalists\nDiscord: https://discord.gg/gXeNjNZT6C\nOfficial Subreddit: r/troublesomeconvos\nTwitter: @TC_Podcast69\n\nTroublesome Conversationalists is a proud partner of Dubby Energy! Dubby Energy makes energy drink and hydration flavor mix to make that pick-me-up THAT much better! DUBBY contains vitamins, amino acids, a nootropic, and 150mg caffeine. Go to Dubby.gg and pick out you favorite flavors, and products. Use code \"TCTalks\" for 10% off your purchase!",
        "language": "en",
        "author_name": "Troublesome Conversationalists",
        "slug": "troublesomeconversations",
        "cover": "20220914_030930_89543298a25c274f2f68af5c817cafc3.jpg"
    },
    {
        "podcast_id": 152002,
        "title": "Jezte s rozumem SPECIÁL",
        "description": "<p>Jezte s rozumem, to je oblíbený pořad z produkce Radia Čas, který se věnuje tématům z oblasti zdravého jídla, stravování, zdravého životního stylu a hubnutí. Moderátorka Eva Rigler je propagátorkou racionálního stravování a taky vášnivou kuchařkou. Pořad pro všechny, kterým není jedno, co jedí! Nyní i on-line prostřednictvím oblíbených stremovacích platforem.</p>",
        "language": "cs",
        "author_name": "Radio Čas",
        "slug": "jezte-s-rozumem",
        "cover": "20230817_110851_3b4fa4d06e23df9a6511f89d7270bbb4.jpg"
    },
    {
        "podcast_id": 152500,
        "title": "not that i'm anywhere",
        "description": "Podcast with semi-coherent ramblings about philosophy, beverages, fart jokes and terrible takes on society as whole. Most my friends are from entertainment or hospitality but some are just nerds. ",
        "language": "en",
        "author_name": "not that i'm anywhere",
        "slug": "notthatimanywhere",
        "cover": "20220910_040913_07aa9c20a60c1ef6cca9b3aa744f8725.jpg"
    },
    {
        "podcast_id": 154541,
        "title": "Dinner at Your Place? ",
        "description": "\"Dinner at Your Place?\" is brought to you by Boston based stand-up comedian Danny Killea from Hooker Boy Studios. He invites a guest over for their favorite meal from childhood and gets to know them through the stories and people behind it. ",
        "language": "en",
        "author_name": "Danny Killea",
        "slug": "dinner-at-your-place",
        "cover": "20220919_050928_97962e9c1f78f236d8e9da0d058cf105.jpg"
    },
    {
        "podcast_id": 154793,
        "title": "You Can't Bake Donuts",
        "description": "hi, i'm nathan and this is me",
        "language": "en",
        "author_name": "Nathan Granofsky",
        "slug": "ycbd",
        "cover": "20220920_050946_36f4ccb92892b5b0e6a58b1a1f685f1d.jpg"
    },
    {
        "podcast_id": 156852,
        "title": "CookBook Dissection",
        "description": "Cookbook Dissection is the cooking podcast created by home cookers for home cookers. My name is Cora and you're invited to come along with me while I try out different recipes from fun and unusual cookbooks. \n\nFor more content check out cookbookdisscention on instagram. If you have any questions feel free to email to me at cookbookdissection@gmail.com.",
        "language": "en",
        "author_name": "cora",
        "slug": "cookbookdissection",
        "cover": "20220929_070954_b0fafbdefb59f12e39baff8325f42c20.jpg"
    },
    {
        "podcast_id": 158172,
        "title": "Kahaniyaa ",
        "description": "<p> Naam hai mera RJ NEHA .. </p><p>Mysterious places always fascinate me as I started doing the same .. I found some interesting places for you with the background stories .. listen to it and upgrade your knowledge 👌</p>",
        "language": "hi",
        "author_name": "RJ NEHA TIPNIS",
        "slug": "mumbaimerijaanwithneha",
        "cover": "20230713_050732_1e78c7dd6c1978cb396da9b76fb1cfc8.jpg"
    },
    {
        "podcast_id": 158829,
        "title": "Six Inches",
        "description": "Welcome to Six Inches, a weekly podcast hosted by two, twenty-something year old best friends, Lily (5'7\") & Kat (5'1\"). Together, they have a difference of six inches &lt;3. Come join them in discussing life, careers, mental health, family & personal drama, boys, and children (our pets and plants). ",
        "language": "en",
        "author_name": "Lily & Kat",
        "slug": "sixinches",
        "cover": "20221015_061036_8084d26d498156fbc68ae4ba6c048b13.jpg"
    },
    {
        "podcast_id": 158879,
        "title": "South Florida Dining",
        "description": "This is South Florida’s premier dining blog.  Reviews from all over South Florida including Tampa, Orlando, West Palm Beach, Fort Lauderdale, Boca Raton, Miami, and Key West just to name a few.  We share tips and info on when to go and how to save.  The site is hosted by award-winning Chef Daniel Diaz, the original Cuban Chef.   #SoFloDining SoFloDining.com",
        "language": "en",
        "author_name": "Daniel Diaz",
        "slug": "soflodining",
        "cover": "20221008_041042_1472204912a8c43d44fd5be39bc53490.jpg"
    },
    {
        "podcast_id": 160179,
        "title": "Angie and Rene ",
        "description": "Join us every week as we talk about real life events and issues. A podcast where your voice can be heard. Tell us what you would like us to talk about and we will. ",
        "language": "en",
        "author_name": "Angie and Rene",
        "slug": "everythingpodcastllc",
        "cover": "20221013_081029_3fe65f5c7b618722034edec64de90cfe.jpg"
    },
    {
        "podcast_id": 160301,
        "title": "Peoncast",
        "description": "Charla distendida y peonzil que gira en torno al deporte y en el que todo cabe. ",
        "language": "es",
        "author_name": "Los Peonza Oficial",
        "slug": "lospeonzaoficial",
        "cover": "20221014_071022_3c07e8e90938c43ce2b61bd78bf4425c.jpg"
    },
    {
        "podcast_id": 160618,
        "title": "Texas Whiskey Crew",
        "description": "Join us on our distilled adventures through char and barrel as we explore the universe of bourbon and whiskey. ",
        "language": "en",
        "author_name": "Steve, Dave, Nick & Kevin",
        "slug": "texaswhiskeycrew",
        "cover": "20221015_051020_72c7e57161ebf2bac152da87f1d533af.jpg"
    },
    {
        "podcast_id": 160980,
        "title": "Off The Rip Podcast",
        "description": "We are just two bros who talk about random topics like top 5's, interviews, and news in the world. Just sharing our experiences and opinions on the world!",
        "language": "en",
        "author_name": "Deontay Martinez and Michael Ortega",
        "slug": "offtherippodcast",
        "cover": "20221017_041024_de640ac8dfeb81acfa3ea90ef06c4041.jpg"
    },
    {
        "podcast_id": 161524,
        "title": "The Millennial Somm Podcast",
        "description": "Tune in every week as Isis \"The Millennial Somm\" Daniel discusses everything wine; from food & wine pairings, wine education, personal wine story times and more. As a certified Level III w/ Merit WSET Sommelier, Isis Daniel is cultivating the next generation of wine lovers via education, entertainment and authenticity. The TMS Community is a safe space to learn and explore wine while having a great time. Turn your stereo up and grab a glass. It's time for The Millennial Somm Podcast!",
        "language": "en",
        "author_name": "Isis M Daniel",
        "slug": "tmspodcast",
        "cover": "20221019_011006_dac5850d1bb3284339dc151fd74a6ac6.jpg"
    },
    {
        "podcast_id": 161643,
        "title": "Food Family Tradition",
        "description": "Exploring our culinary roots one podcast at a time",
        "language": "en",
        "author_name": "Lauren Taylor",
        "slug": "foodfamilytradition",
        "cover": "20221019_021003_1a2ee660ab680d8b1943a61062ce00e8.jpg"
    },
    {
        "podcast_id": 161991,
        "title": "Con las Manos en la Masa",
        "description": "De la mano de tus Hosts Dani (foodiemprende) y Ale, vas a aprender cosas nuevas sobre emprendimiento, nuestras experiencias en torno a nuestros negocios, nuestra vida y nuestras aventuras en la cocina. Para ayudarte a emprender, crecer y aprender. ",
        "language": "es",
        "author_name": "Alebanfi & Foodiemprende",
        "slug": "conlasmanosenlamasa",
        "cover": "20221020_081011_45f1a50fad9ce9a6f5e7a1cabfbc49a4.jpg"
    },
    {
        "podcast_id": 162860,
        "title": "The Zennials",
        "description": "Just two girls in their 20s living life, having fun and doing something we both love which is talking lol .\nFollow us @the_Zennials on Instagram and @TheZennials on Twitter\nHosts: Damar and Thaniya\nTwitter:@damar_levy\nInstagram: @thaniyax @damar.levy\nGeneral enquiries: thezennials@outlook.com\nIntro beat by onlysoss_\nInstagram :@onlysoss_\nEmail:sakhem.levy@gmail.com",
        "language": "en",
        "author_name": "Damar & Thaniya",
        "slug": "thezennials",
        "cover": "20221024_071011_9bb700e0aaa0cd7923b037aefb1f649c.jpg"
    },
    {
        "podcast_id": 164145,
        "title": "Welp!",
        "description": "A podcast where we read restaurant reviews and comment on them from a service industry perspective. ",
        "language": "en",
        "author_name": "Miranda Marcum, Katie Sackel",
        "slug": "tothatwesaywelp",
        "cover": "20221030_031036_4ffcc5c9a3b35cd2370f1333c3651fec.jpg"
    },
    {
        "podcast_id": 164483,
        "title": "Nutrition Conversations",
        "description": "<p>The Podcasts from the Canadian Nutrition Society/la Société canadienne de nutrition (CNS/SCN) feature evidence-based information from healthcare providers and subject matter experts.</p>",
        "language": "en",
        "author_name": "The Canadian Nutrition Society",
        "slug": "cnspodcast",
        "cover": "20230421_070418_d6c19898b3ce407a25f26fc151c813b6.jpg"
    },
    {
        "podcast_id": 164672,
        "title": "I AM PODCAST",
        "description": "<p>Un espacio donde entraremos en nuestro corazón para sanar desde lo más profundo.</p>",
        "language": "es",
        "author_name": "Lucia Sedini",
        "slug": "iamexperience",
        "cover": "20230523_060529_2d1a4b7b8bcb0142dd0c5362e2b4f26c.jpg"
    },
    {
        "podcast_id": 165962,
        "title": "Butts and Stuff - A BBQ Podcast",
        "description": "Butt's and Stuff Podcast embraces the growing community of passionate backyard barbecue enthusiasts who wants to chat bbq, learn more about cooking techniques. grills and accessories.  We will share recipes and tips and tricks and well as cover videos seen on the NEWBQ Backyard BBQ and Grilling Youtube Channel. \n",
        "language": "en",
        "author_name": "Unhitched Media",
        "slug": "buttsandstuffpodcast",
        "cover": "20221108_051157_387ecee356f3990578020b2ec21481e3.jpg"
    },
    {
        "podcast_id": 166214,
        "title": "Bootie and Bossy Eat, Drink, Knit",
        "description": "Bootie and Bossy are two sisters who share a love of cooking and crafting. Please join us in our adventures and misadventures! We'll share our best recipes and make you feel better about your craft projects. Whatever you do, don't knit like my sister! For show notes and more, please visit Bootieandbossy.com",
        "language": "en",
        "author_name": "Bootie and Bossy",
        "slug": "bootieandbossy",
        "cover": "20221107_091116_39928d5ad74dbf5457fd2b0a5f8d9c10.jpg"
    },
    {
        "podcast_id": 166770,
        "title": "Munch Gang",
        "description": "<p>A podcast based in Redding, CA, hosted by Frankie Chaolee, that brings interesting guests such as skateboarders, artists, and much more.</p>",
        "language": "en",
        "author_name": "Munch gang",
        "slug": "munchgang",
        "cover": "20230201_060200_9763ff6a4d411ab1839378ee0ce75561.jpg"
    },
    {
        "podcast_id": 166982,
        "title": "On the go",
        "description": "Podcast dedicat a compartir experiències d’oci i gastronòmiques amb un punch sibarita. ",
        "language": "ca-es",
        "author_name": "Paula Martínez",
        "slug": "onthego",
        "cover": "20221110_081117_9960870fb855b4d29109ec5ea7a5a051.jpg"
    },
    {
        "podcast_id": 166996,
        "title": "Pot Luck Food Talks",
        "description": "<p>After 15 years of working in some of the best restaurants in the world, Phil &amp; Eric have a lot of stories to tell and things to set straight!</p><p><strong>Put Luck Food Talks</strong> are unfiltered, unapologetic conversations about food, the crazy stories inside Michelin Star kitchens, and anything involving the search for the most delicious dishes.</p><p>With these two experienced chefs, you'll discover some of the best places to eat, how to apply professional techniques at home and just some good old fashioned real talk amongst food-obsessed friends.</p>",
        "language": "en",
        "author_name": "Phil & Eric",
        "slug": "potluckfoodtalks",
        "cover": "20230409_070404_20ff0323ceb8d304f70d15015e2d4115.jpg"
    },
    {
        "podcast_id": 168406,
        "title": "Inside the Distillery at Cultivated Cocktails",
        "description": "Listen in as we chat about our history, becoming a craft distillery, and sip on a few excellent spirits. This is the Cultivated Cocktails story as we know it so far. Documenting where we have been and the pieces that make us who we are today, as well as what comes our way as we go along. Join us on our journey.\n\nAs true natives of the Asheville NC area, the Howard family have raised generations in WNC. In 2012, they decided to start what was to become Asheville's first proper distillery to distill gin and rum since prohibition. With careful planning, research & development, and a burning desire to see Asheville become not just a beer mecca, but a craft beverage mecca, a distillery that would beckon curious drinkers far and wide was born.\nA vision to bring a craft spirit with class to the table would soon become reality.\nOver the years the vision has expanded to share the Cultivated Lifestyle. A new way to enjoy the distillery experience was created. From grain to garnish, Cultivated Cocktails takes you from the distillation process through the cocktail creation.",
        "language": "en",
        "author_name": "Cultivated Cocktails Distillery",
        "slug": "cultivatedcocktailsdistillery",
        "cover": "20230111_060106_aa15c3b12219fb81a519624c9826a14b.jpg"
    },
    {
        "podcast_id": 168483,
        "title": "Let’s Talk Flavor With Chef T ",
        "description": "Flavor By Chef T brings you behind the scenes with their podcast . Your host MJ interviews Chef T over a variety of topics including questions from listeners , recipes , cooking tips and in depth conversations behind flavor and cooking . \n\nChef T has a passion for creating southern fusion meals that elevate comfort foods to newer heights with his culinary techniques mixed with old school methods . \n\nFollow along in the journey as they embark opening Flavor By Chef T in Lampasas, Texas . ",
        "language": "en",
        "author_name": "MJ",
        "slug": "lets-talk-flavor-with-chef-t",
        "cover": "20221116_091158_bf61c55316323077ea4eb7f702994059.jpg"
    },
    {
        "podcast_id": 170409,
        "title": "The Food Jawn Podcast",
        "description": "Join hosts Mills & P for a pure, honest, and unadulterated ride discussing their culinary journeys. Offering insight, tips, and general banter. ",
        "language": "en",
        "author_name": "Mills & P",
        "slug": "thefoodjawnpodcast",
        "cover": "20221125_021139_59d63af864761278d4e1e962ceac0d92.jpg"
    },
    {
        "podcast_id": 170908,
        "title": "Mid-South Menu",
        "description": "Hello, and welcome to Mid-South Menu. I’m your host Georgia Coles, and as a Memphian, I think our region’s food culture is so rich yet so underrated. Memphis truly reflects a commitment to an artisanal view of the food and drink crafted here. I have interviewed industry professionals and experts in their craft to get their perspectives on everything from gourmet coffee to fire stone beer to barbecue competition culture. I hope to share this with you. Memphis’s culinary offerings are unique and unparallelled, offering a wide variety of artisanal products. Join me on a tour unpacking the art and science of the 901’s food and drink culture, Memphis’s best, the Mid-South Menu.\n\nMy goal with this podcast is for each episode to answer engaging questions you may have always had about the craft and creation of high-quality food and drink. Thus, at the beginning of each episode I’ll name a few questions you can trust will be answered by the end.\n\nIntro Music: \"Past Sadness\" Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/\n\nOutro Music: \"Isolated\" Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
        "language": "en",
        "author_name": "Georgia Coles",
        "slug": "mid-southmenu",
        "cover": "20221128_031131_3e29e09c82e76c484a4b6cedefdfb403.jpg"
    },
    {
        "podcast_id": 171045,
        "title": "2 Hard Heads Eat Pasta",
        "description": "Two new friends come together as '2' fellow Calabrese (hence the Hard Heads) '2' fellow lovers of pasta, and especially '2' humans that love to eat. Pound per pound, the best pasta eaters around. Restaurants beware, as we are coming to try your best pasta dishes, and no holds barred, we will tell it like it is! Don't forget that pasta is what we do !!",
        "language": "en",
        "author_name": "Tony DeMichele and Lino Galluci",
        "slug": "2hardheadseatpasta",
        "cover": "20221128_051109_a3148ededfc7bc2172b58fc33065f222.jpg"
    },
    {
        "podcast_id": 171453,
        "title": "Kat the Baker",
        "description": "Chef Kaybee talks about her life and career as a pastry chef, why she got into baking to begin with, and some intense kitchen-chef stories and situations. Her aim is to inspire by her constant goal to be the best chef that she can be, and to live her best life within that.",
        "language": "en",
        "author_name": "Chef Kaybee",
        "slug": "katthebaker",
        "cover": "20221130_041122_493968c45d44bd6e76a49394dd25df57.jpg"
    },
    {
        "podcast_id": 171858,
        "title": "Conversations In The Oven | Fil Kitchen",
        "description": "<p>Casual discussions and conversations about food, cuisine, culture, histories and the whole F&amp;B and hospitality industry. Aiming to educate, entertain and share insightful stories &amp; issues with various guests…</p>",
        "language": "en",
        "author_name": "Bashar Alaeddin",
        "slug": "filkitchen",
        "cover": "20221201_061251_77bcebb4a41e9281ce149c0f03f975e5.jpg"
    },
    {
        "podcast_id": 172704,
        "title": "Restaurantes con Alma",
        "description": "<p>Siempre he creído que los buenos restaurantes tienen \"alma\". Algo difícil de describir, pero que se suele entender cuando conoces a la(s) persona(s) que hay detrás. En este podcast voy a intentar entrevistar semanalmente a los emprendedores detrás de los restaurantes más conocidos del país: Desde emblemas clásicos hasta cadenas más modernas.</p>",
        "language": "es",
        "author_name": "Alberto Bonhomme",
        "slug": "restaurantesconalma",
        "cover": "20230501_080554_29752bbc5535085aa7ce9b90f29f70a3.jpg"
    },
    {
        "podcast_id": 173991,
        "title": "Feed the Bean",
        "description": "An exhausted father cooks gourmet-ish foods for his picky toddler, Beanie. As he chronicles this sometimes frustrating but often hilarious process, insights about cuisine, family, and parenthood are realized.",
        "language": "en",
        "author_name": "Andrew Dufont",
        "slug": "feedthebean",
        "cover": "20221215_121242_1b9465ec896a0ab8b175db393ee570da.jpg"
    },
    {
        "podcast_id": 174436,
        "title": "Kansas City Food Memories",
        "description": "This is a conversation among friends sharing cherished memories. Many of our best memories involve food. An amazing thing about hearing these stories is that they will breath life back into long forgotten memories of your own. You can call into the radio, post online or even shoot us an email to share on the next show. \n",
        "language": "en",
        "author_name": "Robert Duensing",
        "slug": "kansascityfoodmemories",
        "cover": "20221214_061248_afa8fdd93227193b33582c346f3a02fc.jpg"
    },
    {
        "podcast_id": 175079,
        "title": "Schmackofatz!",
        "description": "Moooin neue Lieblingsfans!\n\nWeil über Essen nicht genug geredet werden kann, gibt es jetzt einen neuen Podcast, auf den die Welt gewartet hat.\n\nJede zweite Woche spricht Thies mit Freund*innen über eines der schönsten Beschäftigungen im Leben: Essen. Jede Folge dreht sich um eine andere Art von Schmackofatz. \n\nAlso macht euch bereit, holt eure Gabeln, Löffel und Teller raus und dann wird geschmackofatzt.\n\nEssen ist fertig!\nGuten Appetit.\n\nFragen, Anregungen und Schmackofatz-Empfehlungen schickt Ihr uns am Besten über Insta",
        "language": "de",
        "author_name": "Thies Loose",
        "slug": "schmackofatz",
        "cover": "20221218_101247_06d3ef18d49bc15fbe9b1b5a9e6732ab.jpg"
    },
    {
        "podcast_id": 175992,
        "title": "PlanEET B",
        "description": "In de nieuwe podcast PlanEET B zoekt culinair journalist Laura de Grave naar de verhalen achter ons bordje avondeten. Laat je via acht afleveringen inspireren door verschillende gasten met elk hun eigen expertise. Kom alles te weten over het verduurzamen van ons bordje avondeten.",
        "language": "nl",
        "author_name": "MakerDistrict",
        "slug": "makerdistrict",
        "cover": "20221223_021212_2143f6fc4ecbc48082cd244813dc6318.jpg"
    },
    {
        "podcast_id": 176560,
        "title": "Tertulias Gastronómicas El Podcast",
        "description": "Bienvenidos a Tertulias Gastronómicas, un Podcast para hablar de algo que nos gusta mucho, la comida. Entorno a su significado, rituales, historia, origen, evolución y uno que otro chisme...\n\nTenemos contenido adicional para ti, búscanos en patreon.com/tertulias_gastronomicas\n\nSíguenos en todas nuestras redes:\n\nhttps://www.tiktok.com/@tertuliasgastronomicas\n\nhttps://www.instagram.com/tertuliasgastronomicaspodcast/\n\nhttps://www.facebook.com/tertulias gastronomicas el podcast\n\nhttps://www.youtube.com/@tertuliasgastronomicas\n\nVisita nuestra página oficial:\n\nhttps://www.tertuliasgastronomicas.mx/",
        "language": "es-mx",
        "author_name": "Tertulias Gastronómicas",
        "slug": "tertuliasgastronomicaselpodcast",
        "cover": "20230120_010105_db7f0aed06e78c200349f8f026529b23.jpg"
    },
    {
        "podcast_id": 176782,
        "title": "Dinner For Breakfast",
        "description": "Wes and Bailey discuss/debate all things food. Listen in as the guys try surprise snacks sent to each other every week. ",
        "language": "en",
        "author_name": "Dinner for Breakfast",
        "slug": "dinnerforbreakfast",
        "cover": "20221228_081201_0ff4523c2dce00d85dd9c7e57bb1dfdc.jpg"
    },
    {
        "podcast_id": 177014,
        "title": "TAKEAWAY PLUG",
        "description": "Welcome to Takeaway Plug, the hilarous and entertaining podcast all about the world of chicken shops and beyond! Join host Lefke as he chats with some of the biggest food influencers and industry insiders about all things fried and flavorful. But it's not just about the chicken - this show also tackles some of the hottest and most relevant topics in the food world. Manchester Based Takeaway Plug covers it all. So grab a bucket of tendies and tune in for some seriously crispy and thought-provoking fun! ",
        "language": "en",
        "author_name": "LEFKE",
        "slug": "takeawayplug",
        "cover": "20221229_111211_91508d1fecc7e4bebb43b34c5dbd6259.jpg"
    },
    {
        "podcast_id": 177069,
        "title": "Portland Beer Club Podcast",
        "description": "<p>Portland craft beer lovers talking to craft beer lovers about the love of craft beer while drinking craft beer. What do we yack about... Beer News, Homebrew/Homebrewing, Hops &amp; Yeast, Breweries, Beer Styles, Beer Festivals, etc. We are Portland, Oregon based, focus on west coast/NW regions, but definitely go national to international when the challenge arises. We are the #1 Podcast called the Portland Beer Club Podcast. It's basically like having an online bottleshare. -Fartcus, Beef, Nooner, &amp; Shitz</p>",
        "language": "en-us",
        "author_name": "The Guys ",
        "slug": "portland-beer-club-podcast",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 177625,
        "title": "MicroKast il podcast di Marco Ilardi storie di food marketing seo e tecnologia",
        "description": "<p><a href=\"https://marcoilardi.it/microkast/\">MicroKast </a>è un podcast multi tematico creato nel 2023 da <a href=\"https://marcoilardi.it\">Marco Ilardi </a>che parla di <strong>marketing food </strong>e <strong>tecnologia</strong>.</p><p>Su MicroKast troverete le ultime notizie di <strong>digital marketing</strong> con argomenti come la <strong>comunicazione digitale</strong>, il mondo del <strong>food </strong>ed interviste con alcuni importanti personaggi della <strong>comunicazione</strong>, del food, della <strong>tecnologia </strong>e della attualità.</p>",
        "language": "it",
        "author_name": "Marco Ilardi",
        "slug": "marcoilardi",
        "cover": "20230602_060610_736a11dcf7d583a8294c8933b9f8bfb1.jpg"
    },
    {
        "podcast_id": 177797,
        "title": "Ratings Podcast",
        "description": "Ratings Podcast where the name of the game is giving our takes! You will hear about life, food, drinks, and some of our favorite things! \n\nHost: Brett Westover and Jake Oelke\n\n\nBrett Westover comes from the world of reviewing supplements and producing the best product videos out there!\n\nJake Oelke the content KING, he comes from the business world creating for massive brands and raking in millions of views!\n\nWe hope you enjoy the podcast of us making tier list, trying new snacks, and reviewing products we use everyday!\n",
        "language": "en",
        "author_name": "Ratings Podcast",
        "slug": "ratingspodcast",
        "cover": "20230103_010122_e41b69d26788f61c883f401cb4f1045d.jpg"
    },
    {
        "podcast_id": 178627,
        "title": "The Hometown Fresh Podcast",
        "description": "Welcome to the Hometown Fresh Podcast, the show that talks all things grocery, customer service, career development, agriculture, and more! Episodes will be posted semiweekly and we look forward to providing our listeners with entertaining and educational content as often as possible. If you're tuning in for the first time, we're so glad you're here. Feel free to send any future questions or comments to gpatterson@harpsfood.com. ",
        "language": "en",
        "author_name": "Harps Food Stores",
        "slug": "thehometownfreshpodcast",
        "cover": "20230106_040110_dc4e27338826fa2445735bc1dcd23880.jpg"
    },
    {
        "podcast_id": 180584,
        "title": "Chef Life by Cottage Foods",
        "description": "Join us on our journeys across some of the UKs best restaurants and eateries. We talk with some of the best chefs in the country about their food, favourite dishes, what inspires them along with life on the UK food scene in 2023. ",
        "language": "en",
        "author_name": "Alistair Cullen",
        "slug": "cheflifebycottagefoods",
        "cover": "20230114_060144_e8cc30df81a91c2a480c9d1225d77862.jpg"
    },
    {
        "podcast_id": 181741,
        "title": "No Life 'Til Lager",
        "description": "A Bourdain worthy beer show focusing on new American lagers and the world's best selling beverage. Hosted by Advanced Cicerone® Adam Zuniga.",
        "language": "en",
        "author_name": "Adam Zuniga",
        "slug": "nolifetillager",
        "cover": "20230119_020129_8106c82904ee9fcc7b09cfa1fc1e511d.jpg"
    },
    {
        "podcast_id": 182699,
        "title": "Man The House",
        "description": "Man The House is hosted by Celebrity Cake Artist & Owner of Flour House Cakes & Co., L. Alexander. This podcast series is dedicated to cake artists and wedding industry professionals. He's talking about everything from celebrity events, behind the scenes exclusives, cake trends, business tips, industry ups and downs, Q&A, to featured guests including international industry pros.",
        "language": "en",
        "author_name": "L. Alexander",
        "slug": "manthehouse",
        "cover": "20230123_040124_573f0bc2406398b86c49c6fcc9917e8b.jpg"
    },
    {
        "podcast_id": 185500,
        "title": "WGWP Podcast",
        "description": "<p>Whats good Whats POPPIN we are group of friends that love to chat! We talk about games, relationships, food, movies or we have debates. Come hang out with us! If you want to discuss any of the topics follow us on <a href=\"https://discord.com/invite/P4eGpRcGKT\">discord</a>: https://discord.com/invite/P4eGpRcGKT</p>",
        "language": "en",
        "author_name": "WGWP crew",
        "slug": "wgwppodcast",
        "cover": "20230201_080202_c5f1e0b41caf0eafa6be3402481d2513.jpg"
    },
    {
        "podcast_id": 186602,
        "title": "Friendly Veg | Vegan Tips",
        "description": "<p>Being vegan comes with SO many questions. What if I eat something non-vegan? Why am I always tired? How do I deal with criticism from family members? Join Serena -- a vegan of 12 years and former ex-vegan -- as she answers these questions, and more! If you're looking for a welcoming, non-judgemental show with pragmatic tips, then this podcast is for you. // @friendlyvegpodcast. <a href=\"https://www.friendlyveg.com\">friendlyveg.com</a></p>",
        "language": "en",
        "author_name": "Serena",
        "slug": "friendlyveg",
        "cover": "20230521_070516_741f1a7ea26985bf033dabbf9021e743.jpg"
    },
    {
        "podcast_id": 187067,
        "title": "Two Beers and a Mic",
        "description": "<p>Jake and Stone sit down and review all different types of beer brands! We also discuss news and debate random categories and many more! If you have any local Dallas food/beer recommendations, email us at: twobeersandamic@gmail.com. Follow us on YouTube and TikTok: @twobeersandamic</p>",
        "language": "en",
        "author_name": "Jake Stone",
        "slug": "twobeersandamic",
        "cover": "20230320_100333_d9b49f5ac15d3c5d106b61b07d12b77d.jpg"
    },
    {
        "podcast_id": 187169,
        "title": "MUST or MASH",
        "description": "A podcast where we ask which is best: wine or beer? Each episode, the husband and wife cohosts break down a situation provided by a listener and debate which beverage should win. Nobody goes home until there's a winner. It's part humor - part education - and a whole lot of nerdy wine and beer talk.",
        "language": "en",
        "author_name": "Colleen Allerton-Hollier & Danny Hollier",
        "slug": "mustormash",
        "cover": "20230206_100210_c5b2b06687fd811cf9489e6ea99963d3.jpg"
    },
    {
        "podcast_id": 187998,
        "title": "Grab A Drink With A Swiss Chef",
        "description": "<p>Switzerland's Chefs As You've Never Heard Them Before. Grab A Drink With A Swiss Chef is an unfiltered journey into the remarkable stories of the chefs that have defined Swiss food culture, achieved greatness and created stories worth listening. So grab yourself a drink, alcoholic or none alcoholic depending on your preference, and come join us as we talk all things chefy on Grab A Drink With A Swiss Chef.</p>",
        "language": "en",
        "author_name": "Daniel &",
        "slug": "theswisschef",
        "cover": "20230209_110250_48d23605834ba2f5a97a8cc30555340e.jpg"
    },
    {
        "podcast_id": 188045,
        "title": "RICETTE SENZA",
        "description": "\"Ricette senza\", un podcast con chiacchiere di cucina, alimentazione sana e ricette senza, alternativamente: glutine, latticini, carne o pesce, con tante alternative sane e gustose alle ricette classiche. Schede specifiche di alimenti o ingredienti ancora poco conosciuti. Per un' alimentazione adatta a tutti ed attenta ad intolleranze e allergie. Consigli ed idee di cucina per tutti.\n",
        "language": "it",
        "author_name": "Beatrice Bello",
        "slug": "ricettesenza",
        "cover": "20230209_030256_11041e27a1fea66b070786bb53754b02.jpg"
    },
    {
        "podcast_id": 188734,
        "title": "Naria Le Mire Show",
        "description": "<p>Let's start with basics of weight management. If you're looking to lose weight but are not sure where to start, this episode is for you! Too often we are in a rush and was results TODAY! But when pursuing your weight loss journey, patience and consistency are key, today we review a few things to consider before starting.</p>",
        "language": "en",
        "author_name": "Naria Le Mire",
        "slug": "narialemirenutrition",
        "cover": "20230212_020246_1dde7a84501adf6a6b1457931c067d7e.jpg"
    },
    {
        "podcast_id": 188831,
        "title": "Your own healer",
        "description": "Este podcast es un espacio para entender mejor a tu cuerpo y obtener el conocimiento en nutrición que te ayude a balancear bienestar y felicidad ",
        "language": "es",
        "author_name": "Ximena Cobos",
        "slug": "httpsyourownhealer",
        "cover": "20230212_010254_75a2fbdb416de85b0616b6b9cc272568.jpg"
    },
    {
        "podcast_id": 190014,
        "title": "Beantown Bites",
        "description": "Come with us as we explore food around Boston!\n\n\nPowered by Suffolk in the Hub",
        "language": "en",
        "author_name": "Lauren & Grace",
        "slug": "beantownbitespod",
        "cover": "20230216_010241_d26f8b7849d4aa9937628c65f69c5971.jpg"
    },
    {
        "podcast_id": 190067,
        "title": "Chords, Vines & Dines",
        "description": "<p>A weekly visit with musical artists, authors, chefs, winemakers and the like hosted by Kat Ellis and Tom Plant.</p>",
        "language": "en",
        "author_name": "ChordsVinesDines",
        "slug": "chordsvinesdines",
        "cover": "20230313_090320_320a373c718b107ea32bf22a1a992026.jpg"
    },
    {
        "podcast_id": 190363,
        "title": "Out There A Minute on WXDU",
        "description": "<p>Weekly Jazz Show</p>",
        "language": "en",
        "author_name": "Out There A Minute on WXDU",
        "slug": "outthereaminutewxdu",
        "cover": "20230217_080252_b22e33762b114351755d4571714975a8.jpg"
    },
    {
        "podcast_id": 190652,
        "title": "Bite-Sized Cinema Podcast",
        "description": "<p><strong>The podcast where we discuss a film and cook a food from that film. For visual content, find us on </strong><a href=\"https://www.instagram.com/bitesizedcinema/\"><strong>Instagram</strong></a><strong>, </strong><a href=\"https://www.tiktok.com/@bitesizedcinema\"><strong>TikTok</strong></a><strong>, or </strong><a href=\"https://www.youtube.com/@bitesizedcinema\"><strong>YouTube</strong></a><strong>. </strong></p>",
        "language": "en",
        "author_name": "Myra Hongola",
        "slug": "bitesizedcinema",
        "cover": "20230219_030228_7545dde2937c504563752e009b5693a4.jpg"
    },
    {
        "podcast_id": 192920,
        "title": "Chef Char Chats",
        "description": "<p>Chef Char loves to chat and hailing from Canada’s famed seafood East Coast PEI, she knows how to spin a yarn or two.</p><p>Join Celebrity Chef Charlotte Langley as she shares her passions for Seafood, Ocean Stewardship, Start up Culture, CPG and Entrepreneurship and more featuring the innovators, the disruptors and the change makers that create positive impact on the daily.</p><p>This is, Chef Char Chats</p>",
        "language": "en",
        "author_name": "Charlotte Langley",
        "slug": "chefcharchats",
        "cover": "20230227_050234_4706d68da01602db1d110c379683d5ef.jpg"
    },
    {
        "podcast_id": 192924,
        "title": "HEARD- an industry podcast",
        "description": "<p>Hosted by Ryan Pittenger (bartender at Hilltop Tavern) and Sara Matthieu (owner of The Cranky Buzzard restaurant). </p><p>Listen to interviews from a diverse cross-section of the chefs. bartenders, and restauranteurs who serve the Chippewa Valley. \"HEARD\"- your go-to podcast for all things food, drink, and hospitality. </p>",
        "language": "en",
        "author_name": "Sara Matthieu ",
        "slug": "heardthepodcast",
        "cover": "20230227_050225_e31e4c0631d5c6a648e070907ff67fa9.jpg"
    },
    {
        "podcast_id": 193105,
        "title": "Wine(d) Up",
        "description": "<p>The official MTGA podcast. We release an episode every Wednesday to tackle all things wine, winemaking, hospitality and more. Be sure to leave a \"like\" and subscribe for new episodes. Have questions that you want answered? Leave them in the comments and we will dive into them on the last Wednesday of each month!</p>",
        "language": "en",
        "author_name": "Mike Anderson",
        "slug": "winedup",
        "cover": "20230228_060203_e05fa0fb45c507501aa695dc6e114ed2.jpg"
    },
    {
        "podcast_id": 193652,
        "title": "Navigating Adventure Travel Presents: Wandering Adventures",
        "description": "<p>Welcome to Wandering Adventures. We cant wait to talk all things TRAVEL related with you! Join us every Wednesday and don't forget to grab your favorite food or drink of choice while we discuss different Disney News, Universal News, Beaches and anything &amp; everything in between.  Plus you never know when a bonus episode will drop with some of your most random but fun travel adventures. </p><p>We cant wait to take help you go on your next adventure!</p>",
        "language": "en",
        "author_name": "Navigating Adventure Travel ",
        "slug": "wandering-adventures",
        "cover": "20230302_020320_45df4ee2fa4f54017221458d53f3719f.jpg"
    },
    {
        "podcast_id": 193748,
        "title": "AZIENDA BIOFARM (ARNIA SMART).",
        "description": "<p>COPIONE E REGIA REALIZZATA DA:</p><p><strong><em>Francesco Dello Margio &amp; Vittoria Gianniello</em></strong></p><p>AUTORI:</p><p><strong><em>Lucariello Mariapia - Tirozzi Carolina - Schettini Salvatore</em></strong></p><p>CON LA PARTECIPAZIONE DI:</p><p><strong><em>Barretta Luca - Tirozzi Nicola - Leccia Pasquale - Tessitore Giovanni</em></strong></p><p>IN COLLABORAZIONE CON:</p><p><strong><em>VISA - DHL - MASTERCARD- THE SEA OF DESTINY</em></strong></p>",
        "language": "it",
        "author_name": "The Sea Of Destiny",
        "slug": "azienda-biosmart-arnia-smart-the-sea-of-destiny",
        "cover": "20230302_120336_707b92ac91e9af71b1797e02f506ffc3.jpg"
    },
    {
        "podcast_id": 195795,
        "title": "\"Did You Know?\" with Joe & Joe",
        "description": "<p>Are you ready to learn something new about the spirits industry? Then you won't want to miss our bourbon-inspired audio podcast, <a href=\"https://suburbanbourbon.net/did-you-know-w%2F-joe-%26-joe\"><strong><em>\"Did You Know?\" with Joe &amp; Joe!</em></strong></a> Hosted by the dynamic duo of Joe Vitale and Joe Gumeny, from the video podcast of <a href=\"https://suburbanbourbon.net/\"><strong><em>Suburban Bourbon</em></strong></a>, this 30-minute show is a deep dive into the world of spirits, answering your most burning questions from the experts we interview. From restaurateurs to owners of taverns and leaders in the spirit industry, we're bringing you the insights and knowledge you've been craving. </p><p>Unlike our video podcast, <a href=\"https://suburbanbourbon.net/\"><strong><em>Suburban Bourbon</em></strong></a>, this audio-only experience allows you to take in the knowledge while on-the-go or when you want to give your eyes a break from the screen. Whether you're a seasoned industry pro or a curious beginner, <a href=\"https://suburbanbourbon.net/did-you-know-w%2F-joe-%26-joe\"><strong><em>\"Did You Know?\" with Joe &amp; Joe</em></strong></a> is the perfect blend of entertainment and education.  Whether you've always wondered how your favorite restaurant got its start or you're interested in the latest trends in the spirits world, our audio podcast is the perfect way to get the scoop straight from the experts. </p><p></p><p>So sit back and get ready to hear the answers to the questions you've always wanted to ask. From behind-the-scenes stories to industry secrets and everything in between, our podcast is your all-access pass to the world of hospitality and spirits. Join us as we explore this exciting and ever-evolving industry together!</p>",
        "language": "en",
        "author_name": "Suburban Bourbon",
        "slug": "didyouknowwithjoeandjoe",
        "cover": "20230309_100323_d291f7037c8ca0e0cd7b5bf4ea580d97.jpg"
    },
    {
        "podcast_id": 195880,
        "title": "Deliciously Lit",
        "description": "<p>Deliciously Lit is the perfect podcast for foodies, bookworms, and adventurers alike! Join us as we explore stories from all over the world that bring together books, food, drinks and more. Learn about how cultures intersect with flavors, discover new recipes and ingredients to try at home, and be inspired by unique conversations between experts in the culinary field. Our podcast opens up a whole new way to appreciate literature and travel right from your living room. Come join us on our journey of discovery - it's sure to be Deliciously Lit!</p>",
        "language": "en",
        "author_name": "Dr. Felicia J. Lindsey",
        "slug": "deliciouslylit",
        "cover": "20230310_090357_6d93f795c9eb6371b2973580df7123f9.jpg"
    },
    {
        "podcast_id": 196277,
        "title": "Fly Girls Who Dine",
        "description": "<p>“EAT WELL, DRESS BETTER.”</p><p>A traveling food podcast for the fly foodie, where hosts Dali J &amp; Ciara Dawn, meet up with their favs to discuss dining experiences, food reviews, fashion, and everything in between.</p>",
        "language": "en",
        "author_name": "Dali J & Ciara Dawn",
        "slug": "flygirlswhodine",
        "cover": "20230312_050355_66a8e0f8938a62c3903ba30ffc8cfdb0.jpg"
    },
    {
        "podcast_id": 198381,
        "title": "Gastro Shakers ",
        "description": "<p><strong>¡Te presentamos “Gastro Shakers”, el nuevo Podcast de BCH!</strong></p><p>A través de una serie de diálogos con los principales players que están revolucionando el panorama gastronómico y alimentario actual, abordaremos temas como la innovación alimentaria, la evolución de la figura del chef, cómo es de impactante la comunicación gastronómica hoy en día o la gestión de éxito en proyectos tanto empresariales como de restauración que han escalado a lo más alto</p>",
        "language": "es",
        "author_name": "Gastro Shakers ",
        "slug": "gastro-shakers-episodio-0",
        "cover": "20230321_120344_845b83e7dd0564bf895bae47c96e7349.jpg"
    },
    {
        "podcast_id": 198865,
        "title": "Irreverent Kids Podcast",
        "description": "<p>Knock! Knock! Ya estamos aquí, The Irreverent Kids. Novedades o gama base? Cerveza artesana o independiente? Estás cuestiones y alguna más son la que nos ocupan en el inicio de esta aventura cervecera.</p>",
        "language": "es",
        "author_name": "Irreverent Kids Beer Collective",
        "slug": "irreverentkidspodcast",
        "cover": "20230323_030316_061c03d6adbd1536bfddc75900833a85.jpg"
    },
    {
        "podcast_id": 200241,
        "title": "The Food Safety Dish",
        "description": "<p>The Food Safety Dish is a production dishing on all things food safety, brought to you by National Farmers Union's Local Food Safety Collaborative. We talk with farmer and expert voices on their subject specialties: sharing practical advice, wisdom, and how to incorporate good food safety practices into your own growing operation.</p>",
        "language": "en",
        "author_name": "Local Food Safety Collaborative",
        "slug": "thefoodsafetydish",
        "cover": "20230330_040326_9f6f6d2d74ebc00dbf7a4a26ed6be3fa.jpg"
    },
    {
        "podcast_id": 203158,
        "title": "Jorge Guglietta",
        "description": "<p><strong>¿Alguna vez has soñado con emprender tu propio negocio gastronómico o mejorar la gestión de tu establecimiento actual?</strong></p><p>El podcast que te llevará de la mano en el fascinante mundo de la gerencia gastronómica. Soy Jorge Guglietta, y después de más de 30 años de experiencia en el apasionante universo de la gastronomía y los alimentos y bebidas, estoy aquí para compartir contigo todo mi conocimiento y consejos prácticos acompañado de expertos en el área.</p><p>Este es el lugar perfecto para ti., exploraremos juntos las estrategias, las tendencias y los secretos detrás del éxito en la industria de la gastronomía.</p><p>Te llevaré a un viaje lleno de sabores, innovación y oportunidades. Descubrirás valiosos consejos gastronómicos, desde la creación de menús irresistibles hasta la gestión eficiente y la optimización de tus operaciones.</p>",
        "language": "es",
        "author_name": "Jorge Guglietta",
        "slug": "jorgeguglietta",
        "cover": "20230626_010656_bea792172246c5135795c2cd40a520d8.jpg"
    },
    {
        "podcast_id": 203422,
        "title": "Welcome To Manassas (A Classy Variety Show)",
        "description": "<p>Host and local bar fly, Jamie Kifonidis, hosts this irreverent and sometimes crazy variety interview show.  Focusing on interviewing bartenders and hearing their wild and almost unbelievable anecdotes of life in the bar business, Jamie brings his own style to the interview and getting the info out of them.  Check it out but strap in first.</p>",
        "language": "en",
        "author_name": "Wylde Style Network",
        "slug": "welcometomanassas",
        "cover": "20230415_060443_c67c7d4af0202fa3c8d587e7c6e79ba1.jpg"
    },
    {
        "podcast_id": 205724,
        "title": "What You Got Baking Over There? ",
        "description": "<p>Come on in and sit down with author, celebrity cake and cookie artist, and nosy content creator, Malek Binns to hear unique stories from creators everywhere! This is a space for guests to share their business and for viewers to listen! </p><p>Learn how they started their journey and then some, including some controversial topics! Grab a seat and learn the good, bad, funny, and maybe even the ugly! </p><p>Follow Malek on all social platforms! @frostedbymalekbinns</p>",
        "language": "en",
        "author_name": "Malek Binns",
        "slug": "wygbot",
        "cover": "20230426_060448_992d0772b38e19d6541e67b1185c78a4.jpg"
    },
    {
        "podcast_id": 206459,
        "title": "Eating Fresh on Bainbridge",
        "description": "<p>Joe Pulicicchio, Director of Promotions &amp; Produce and Floral for Town &amp; Country Markets joins us for our monthly podcast called ‘<strong>Eating Fresh on Bainbridge</strong>’ that explores the ever-changing array of quality fresh fruits and vegetables that make their way to the produce shelves here on Bainbridge Island.</p><p>We’ll also be exploring the various challenges of weather and other conditions that can directly affect availability and quality of our produce on a week-to-week, month-to-month basis.</p>",
        "language": "en",
        "author_name": "Robert W Ross",
        "slug": "eating-fresh-on-bainbridge",
        "cover": "20230430_050447_ec9d02d2e4bef5e1a59ad44d927d317f.jpg"
    },
    {
        "podcast_id": 207029,
        "title": "Drinks In Trade  Behind the bar with industry experts",
        "description": "<p>Franklin &amp; Sons celebrates the remarkably independent and vibrant hospitality industry with the launch of its new vodcast series ‘Drinks In Trade.’ The vodcast series, which visits a different city in each episode, features open and honest conversations with industry legends and local drinks businesses, spanning several topics from developing careers within hospitality, cocktail concepts and methods, mental well-being, to challenges facing these fiercely independent businesses.</p>",
        "language": "en",
        "author_name": "Franklin & Sons ",
        "slug": "drinks-in-trade-franklin-and-sons",
        "cover": "20230503_090540_c1cb339f1272792d4d2767b13c4f2910.jpg"
    },
    {
        "podcast_id": 207965,
        "title": "Sandwichcast ",
        "description": "<p>A Podcast About All Things Sandwich</p>",
        "language": "en",
        "author_name": "Kendall Lawrence Holmes",
        "slug": "sandwichcastpod",
        "cover": "20230508_040536_c42db7dd662caeb1488d7aae85521557.jpg"
    },
    {
        "podcast_id": 208777,
        "title": "Oído Cocina con Foodtic 🍏",
        "description": "<p>¿Eres hostelero? 🛎️ ¿Quieres escuchar a profesionales como tú?👌 ¡Oído Cocina es tu podcast! Entrevistas, tips y mucha gastronomía en un programa de Foodtic 🍏 Expertos en TPV y autocomanda en mesa 📲</p>",
        "language": "es",
        "author_name": "Foodtic",
        "slug": "otrarondafoodtic",
        "cover": "20230614_020629_2b0c83d537168664a306ac3ac1c3ce63.jpg"
    },
    {
        "podcast_id": 209607,
        "title": "El Señor del Sombrero",
        "description": "<p>El Señor del Sombrero es un podcast que lleva a tus sentidos las voces de los actores y actrices de las cocinas más innovadoras de Quito y sus alrededores. Yo, Santiago Estrella, abro el micrófono y traslado los sabores a las palabras para que más comensales conozcan sobre este mundo gastronómico.</p><p>Una producción de Grupo EL COMERCIO, presentado por Santiago Estrella. Edición de Oscar Álvarez.</p><p>Puedes contactarnos en ⁠⁠⁠⁠⁠<a href=\"mailto:podcast@elcomercio.com\">podcast@elcomercio.com</a> ⁠⁠⁠⁠⁠</p><p>Gracias por escuchar este podcast.</p><p>Más info: <a href=\"https://www.elcomercio.com/podcasts/el-senor-del-sombrero\">https://www.elcomercio.com/podcasts/el-senor-del-sombrero</a> </p>",
        "language": "es-mx",
        "author_name": "EL COMERCIO de Ecuador",
        "slug": "el-senor-del-sombrero",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 209811,
        "title": "In Defense of Food",
        "description": "<p>In Defense of Food seeks to help us all rethink our relationship with food by arming our listeners with the information needed to make better consumer decisions in the market, try new foods and explore things they've never considered before.</p>",
        "language": "en",
        "author_name": "Tani & Dr. Kuribo",
        "slug": "indefenseoffood",
        "cover": "20230518_010511_b85b540749eb347c4200dfdc99988886.jpg"
    },
    {
        "podcast_id": 210002,
        "title": "Verified Wines Podcast",
        "description": "<p>Join us as we talk about wines, beer, and food from around the world.</p>",
        "language": "en",
        "author_name": "Luis F. Miranda Villeda",
        "slug": "verifiedpodcast",
        "cover": "20230520_070510_39a373ad5ec6d59d622c2970f0214752.jpg"
    },
    {
        "podcast_id": 211237,
        "title": "Best Buds Podcast ",
        "description": "<p>Come by, Get high with your best buds</p><p>Check out our socials </p><p>YT- <strong>@itsJorji</strong></p><p>Insta- @its_jorji_</p>",
        "language": "en",
        "author_name": "Jorji ",
        "slug": "best-buds-podcast",
        "cover": "20230524_050518_8abdcf532074e3c5487f615d1e0f8b8d.jpg"
    },
    {
        "podcast_id": 212219,
        "title": "Último Relevo",
        "description": "<p>¡Bienvenido a tu podcast Último Relevo! Descubre la esencia y las historias detrás del maravilloso mundo del queso artesano. En cada episodio, nos sumergiremos en entrevistas apasionantes con los máximos expertos en queso, quienes compartirán sus conocimientos y experiencias únicas. Desde maestros queseros hasta afinadores y productores apasionados, exploraremos las técnicas ancestrales y modernas de elaboración, y desvelaremos cómo el queso se entrelaza con la cultura y la gastronomía. ¿Te apuntas?</p><p>Déjate cautivar por las historias que se esconden detrás de estos manjares lácteos. Permítenos compartir contigo la magia y el encanto del queso artesano, mientras te sumerges en una experiencia que deleitará tu paladar y enriquecerá tu conocimiento. ¡Prepárate para disfrutar de la pasión y el sabor del queso en cada episodio!</p>",
        "language": "es",
        "author_name": "Mauro y Andrés García",
        "slug": "ultimorelevo",
        "cover": "20230604_060617_5aa6990f85aeabede037467d9d01bd2a.jpg"
    },
    {
        "podcast_id": 212314,
        "title": "Talloor D'Amour  ",
        "description": "<p>5130 ton voedsel wordt wereldwijd per minuut geconsumeerd. In sterrerenrestaurants maar ook in opa's keuken wordt elke dag met veel liefde gekookt. Van kroketten in de laagste landen tot Salteña in de hoogste stad; iedere cultuur eet anders. Hoe zit dat bij ons? Wat eten jullie graag? Dromen jullie van dessertenbuffets of een kleintje met stoofvleessaus? In deze podcast interview ik mensen en neem ik de tijd om heel diep in te gaan op hun lievelingseten, waarna ik het zo authentiek mogelijk klaar maak in hun keuken.</p><p>Welkom bij Talloor D'amour, ik ben Christiaan en ik wil weten wat jullie eten!</p>",
        "language": "nl",
        "author_name": "Christiaan Vansteenkiste",
        "slug": "taloordamour",
        "cover": "20230530_070520_b5fb528d4af1e42de1e941b361524914.jpg"
    },
    {
        "podcast_id": 212385,
        "title": "Issues VBEE",
        "description": "<p>:)</p>",
        "language": "es",
        "author_name": "Juan",
        "slug": "juanshong33",
        "cover": "20230531_030529_e198ff47d1690db356108694902ee789.jpg"
    },
    {
        "podcast_id": 212414,
        "title": "Te cuento mientras cocino que",
        "description": "<p>En este podcast contaremos curiosidades mientras hacemos la comida del día</p>",
        "language": "es",
        "author_name": "Estrella Martínez Martín",
        "slug": "tecuentomientrascocinoque",
        "cover": "20230531_100555_c09fa93b8ce62718ab848feb5fa41367.jpg"
    },
    {
        "podcast_id": 212874,
        "title": "Foodie Files",
        "description": "<p>Join Nik and Mumma Trace to talk all things food. They both love to cook and eat, especially if its delicious</p><p>email us at <a href=\"mailto:foodie.files.info@gmail.com\">foodie.files.info@gmail.com</a></p><p>to contact Nik for </p><p>Cakes - <a href=\"http://www.nvcakes.com.au\">www.nvcakes.com.au</a></p><p>FoodTruck - <a href=\"http://thefatfork.com.au\">thefatfork.com.au</a></p><p>to follow Foodie Files</p><p>instagram       @foodiefiles_au</p><p>facebook         Foodie Files</p><p></p>",
        "language": "en",
        "author_name": "Nik & Mumma Trace",
        "slug": "foodie-files",
        "cover": "20230603_010628_053f503a056ab76ea7b63c49e89a2f1f.jpg"
    },
    {
        "podcast_id": 213851,
        "title": "transtornos alimenticios ",
        "description": "<p>animo .</p>",
        "language": "es",
        "author_name": "Fernanda González, Paola santos , Juan angel, Fátima Cecilia ",
        "slug": "transtornos",
        "cover": "20230608_030640_5375525a3efc9138cea622e0e67ca00d.jpg"
    },
    {
        "podcast_id": 214763,
        "title": "Pizza Pals",
        "description": "<p>Join three friends talk about topics that may be useful to your everyday life. From relationship advice to out of pocket comedy </p>",
        "language": "en",
        "author_name": "Pizza Pals",
        "slug": "pizzapals",
        "cover": "20230612_080617_6610210d9d0d5d7edf41f71cc8b10856.jpg"
    },
    {
        "podcast_id": 215066,
        "title": "Los Oscarines",
        "description": "<p>Podcast entre amigos</p>",
        "language": "es",
        "author_name": "Ricardo Lira",
        "slug": "los-oscares",
        "cover": "20230615_040639_305052b7693171b87d990ab09103550d.jpg"
    },
    {
        "podcast_id": 215074,
        "title": "Livvin for Food with Olivia Bria",
        "description": "<p>Hi! I’m Olivia Bria, but my friends call me Liv— and you can too! I’m a foodie, journalist and celebrity interviewer with a love for travel, fitness, entertainment, and of course, food! And trust me when I say, I love talking with people. Throughout my career, I’ve interviewed your favorite celebrity chefs, entrepreneurs, television personalities, creators and more for editorial content (ever heard of Alton Brown, Guy Fieri, or Rachael Ray?). Now I’m bringing those conversations to life, so that you can receive the culinary tea about your favorite cooking shows, the best kitchen tips and tricks, and honest opinions from well-known culinary faces on viral food trends—all at the same time I am! If you’re lucky enough, guests may even give a restaurant recommendation or two that you can add to your dinner wishlist. So walk with me, eat with me, and most importantly—cook with me—as the Livvin for Food podcast digs deep into diverse cultural food backgrounds and divulges on the newest recipes that you just <em>have</em> to try. I know I will be!</p>",
        "language": "en",
        "author_name": "Olivia Bria",
        "slug": "livvinforfoodpod",
        "cover": "20230614_030607_4947bbfeb7cda2c1981e3205cc38e7f8.jpg"
    },
    {
        "podcast_id": 216190,
        "title": "Yummy Food = Happy Kids",
        "description": "<p>6th graders in Elkhart, IN made a podcast discussing school lunch and the changes they would like to see.</p>",
        "language": "en",
        "author_name": "6th Summerscape Students",
        "slug": "yummyfoodhappykids",
        "cover": "20230622_120608_e8a8bb71414a9a75739cb5ef1737a8ee.jpg"
    },
    {
        "podcast_id": 216251,
        "title": "Cake Designer",
        "description": "<p>Beauty of cake</p>",
        "language": "en",
        "author_name": "Sadaf",
        "slug": "cakedesigning",
        "cover": "20230621_110639_fbae9a6e95067e88a8d3d474fe2ab924.jpg"
    },
    {
        "podcast_id": 216629,
        "title": "AGRO MUNDO",
        "description": "<p>TRABAJO DE INTEGRACIÓN MULTIDISCIPLINARIA</p><p>ASIGNATURAS: BIOLOGÍA, COMPUTACIÓN Y GEOGRAFÍA</p><p><strong>Integrantes</strong></p><p><strong><em>Cad IV. LAUTARO GONZÁLEZ RETA</em></strong></p><p><strong><em>Cad IV ALEXANDER CASTILLO</em></strong></p><p><strong><em>Cad. IV MICAELA LUCERO</em></strong></p><p><strong><em>Cad. IV BRUNO RATTI</em></strong></p>",
        "language": "es",
        "author_name": "Cad IV. LAUTARO GONZÁLEZ RETA Cad IV ALEXANDER CASTILLO Cad. IV MICAELA LUCERO Cad. IV BRUNO RATTI",
        "slug": "agromundo",
        "cover": "20230624_110623_6028ab6bd5d61f70e0e4597a691d7963.jpg"
    },
    {
        "podcast_id": 216646,
        "title": "Motherhood",
        "description": "<p>Motherhood is a beautiful and complex journey that has been celebrated and explored throughout the ages. It is a journey that is unique to each woman who embarks on it, yet it is also a shared experience that connects mothers across the world. Being a mother is a role that comes with great responsibility, sacrifice, and love. The moment a woman becomes a mother, her life changes forever. She is no longer just responsible for herself, but also for the life of her child. The bond between a mother</p><p>and her child is one of the strongest and most enduring relationships in the world. It is a connection that begins before birth and lasts a lifetime. A mother is the first person a child looks to for comfort, safety, and guidance. Motherhood is a journey that is filled with many challenges. From sleepless nights to the terrible twos, raising a child can be a rollercoaster of emotions. Mothers often have to juggle multiple roles, including being a caregiver, teacher, nurse, and friend. They have</p><p>to be patient, understanding, and compassionate, even when they are exhausted and frustrated. Despite the challenges, motherhood is also a journey that is filled with joy and love. The first smile, the first word, and the first steps are all milestones that fill a mother's heart with pride and happiness. Mothers have the opportunity to watch their children grow and develop into unique individuals with their own personalities and dreams. Motherhood is also a journey that is marked by sacrifice.</p><p>Mothers often put their own needs and desires aside to prioritize the needs of their children. They give up their time, energy, and resources to ensure that their children have everything they need to thrive. This selflessness is a testament to the depth of a mother's love. In conclusion, motherhood is a journey that is both beautiful and complex. It is a journey that is unique to each woman who embarks on it, yet it is also a shared experience that connects mothers across the world. Being a mother</p><p>is a role that comes with great responsibility, sacrifice, and love. It is a journey that is filled with challenges, but also with joy and love.</p>",
        "language": "en",
        "author_name": "Motherhood",
        "slug": "motherhoodbyrons",
        "cover": "20230624_020646_ce0da351ee64338efd2e72681f5f28b5.jpg"
    },
    {
        "podcast_id": 216673,
        "title": "AGRO MUNDO 2024",
        "description": "<p>TRABAJO DE INTEGRACIÓN MULTIDISCIPLINARIA</p><p>ASIGNATURAS: BIOLOGÍA, COMPUTACIÓN Y GEOGRAFÍA</p><p><strong>Integrantes</strong></p><p><strong><em>Cad IV. LAUTARO GONZÁLEZ RETA</em></strong></p><p><strong><em>Cad IV ALEXANDER CASTILLO</em></strong></p><p><strong><em>Cad. IV MICAELA LUCERO</em></strong></p><p><strong><em>Cad. IV BRUNO RATTI</em></strong></p>",
        "language": "es",
        "author_name": "Agro Mundo",
        "slug": "agromundo2024",
        "cover": "20230624_060651_c782002ef934fe7e9bdc44c531e23b6a.jpg"
    },
    {
        "podcast_id": 216726,
        "title": "ดีแน่แค่กินผัก",
        "description": "<p>ดีแน่แค่กินผัก</p>",
        "language": "th",
        "author_name": "โครงการพัฒนาองค์ความรู้ บูรณาการงาน เสริมสร้างเครือข่าย ร่วมขับเคลื่อนนโยบายส่งเสริมการบริโภคอาหารเพื่อสุขภาวะ ในกทม.",
        "slug": "healthy-balanced-diet",
        "cover": "20230625_080638_354b826ef18705c32aca1eed3e84ae20.jpg"
    },
    {
        "podcast_id": 216946,
        "title": "Haute Conversations and Cuisine",
        "description": "<p>Conversations with great chefs and entrepreneurs along with tips, tricks, and recipes for you to try out!</p>",
        "language": "en",
        "author_name": "What does your Protein look like?",
        "slug": "hauteconversationsandcuisine",
        "cover": "20230626_110612_93819e7fb95bca4e4d498af517879f49.jpg"
    },
    {
        "podcast_id": 217063,
        "title": "Doughboys Double",
        "description": "<p>The podcast about chain restaurants.</p>",
        "language": "en",
        "author_name": "Mike Mitchell and Nick Wiger",
        "slug": "doughboys-double",
        "cover": "20230627_050646_19d679fab32034409e3b8761347c6c7b.jpg"
    },
    {
        "podcast_id": 217638,
        "title": "The World Food Experience",
        "description": "<p>The world food experience, delves into foods from across the globe, from how different cultures eat everyday to guests food adventures across the globe.</p>",
        "language": "en",
        "author_name": "Kale leech",
        "slug": "theworldfoodexperience",
        "cover": "20230706_060745_387762a9ba62e65ca135d39ef5d052b8.jpg"
    },
    {
        "podcast_id": 217682,
        "title": "Takeaways",
        "description": "<p>Comedy, pop culture &amp; food, all covered by two Kiwis living in London</p>",
        "language": "en",
        "author_name": "Alex's Kitchen Story & Emma Caughey",
        "slug": "takeawayspod",
        "cover": "20230702_060739_d46814864245b8deb5ceea7df830f732.jpg"
    },
    {
        "podcast_id": 217855,
        "title": "Foodie Fusion: Uniting Flavors From East To West",
        "description": "<p><strong>Welcome to our HOLY LAND’S HEAVENLY HOLIDAYS PRESERVING CULTURE THROUGH DESSERTS cookbook. Do you ever wonder why certain recipes have been passed down in cultures and families for generations? Or why something as wonderful as a delicious dessert, can bring a sense of comfort, discovery, and bonding? Food provides sustenance for our bodies, but it's so much more than that.</strong></p><p><strong>Having lived in the Holy Land, I wanted to create this unique cookbook for the 2 million Christians whom, each year, perform pilgrimages to Bethlehem, Nazareth, and Jerusalem. There, they can celebrate the importance and joy of perpetuating and discovering the historical cultural rituals and traditions of cooking, baking, and eating. The recipes are not only delicious, but they also serve as a way to connect with one’s Christian heritage and preserve a piece of our important history.</strong></p><p><strong>Through baking desserts and also learning about the spices, fruits, vegetables which are of major authenticity, we can learn about our ancestors, their traditions, and the stories behind the meals they enjoyed. Upon returning home from a journey to the Holy Land, pilgrims can also create new memories with loved ones by gathering in the kitchen and working together to create something special.</strong></p><p><strong>Throughout human history, food has the power to bring people closer together, to create a sense of community and belonging. Sharing a new dessert you've never tried baking before, is an experience that will be cherished.</strong></p><p><strong>So, come explore the cultural significance of desserts in the Holy Land, especially those enjoyed during the Easter and Christmas celebrations. Baking and eating the scrumptious goodies will bring joy, connection, and meaning to connecting with one’s Christian hertiage.</strong></p><p><strong>To purchase a copy of each episode’s recipe, stories, and photos, or, to purchase the entire book, Contact :  </strong><a href=\"mailto:Joeygalata@gmail.com\"><strong>Joeygalata@gmail.com</strong></a><strong> </strong></p>",
        "language": "en",
        "author_name": "Joseph Galata",
        "slug": "holylands-cookbook",
        "cover": "20230703_050700_24ff187136d0d4a1b3f2f8d1bbd26088.jpg"
    },
    {
        "podcast_id": 217880,
        "title": "The Future of Foods - A series of podcasts",
        "description": "<p>Alex and guests discuss the Food Evolution, cellular agriculture, and novel foods.</p><p>Consider leaving a <strong>DONATION </strong>to<strong> FoF</strong> to help spread the word further and faster.</p><p><a href=\"https://www.paypal.com/donate/?hosted_button_id=ABYF9L6UY3A5Y\">https://www.paypal.com/donate/?hosted_button_id=ABYF9L6UY3A5Y</a></p><p>If you have any questions or comments, or wish to discuss collaboration, sponsorship or other, please contact me at <a href=\"mailto:crisplexmail@gmail.com\">crisplexmail@gmail.com</a></p>",
        "language": "en",
        "author_name": "Alex Crisp",
        "slug": "alexcrisp-futureoffood",
        "cover": "20230710_040720_c367ba5fde577f203d8e9276e90bbfb4.jpg"
    },
    {
        "podcast_id": 217918,
        "title": "Booze, Bros and Cars",
        "description": "<p>We talk about all things booze and car related.</p>",
        "language": "en",
        "author_name": "Booze, Bros and Cars",
        "slug": "booze-bros-and-cars",
        "cover": "20230704_010714_087e6419771932f292abb199029bab4b.jpg"
    },
    {
        "podcast_id": 218019,
        "title": "Inform Your Consumerism",
        "description": "<p>Consumers around the world are inherently disconnected to the things that they consume every single day. In this podcast, we aim to unveil what goes on behind the scenes from the beginning of product's life cycle to the moment it meets us, the shopper, at the shelf. How does something start from a crop, or animal, on a farm, and turn into a product that's readily available for consumption? How are the planet and its people impacted along the way?</p><p>Our hope is that by informing consumerism during each episode, our listeners can make decisions that are more in alignment with their environmental and social values.</p>",
        "language": "en",
        "author_name": "Christina Lampert",
        "slug": "informyourconsumerism",
        "cover": "20230704_070741_24ce156d56eb27a7fd1a71d3635ce8b5.jpg"
    },
    {
        "podcast_id": 218228,
        "title": "Podcaster show notes",
        "description": "<p>All about xyz shows and podcasts</p>",
        "language": "en",
        "author_name": "Elvis Otieno",
        "slug": "otieno",
        "cover": "20230706_070717_48093535e650c37bf88568467bf6bd73.jpg"
    },
    {
        "podcast_id": 218509,
        "title": "Drescos theme 2",
        "description": "<p>Yeah</p>",
        "language": "en",
        "author_name": "Nonex",
        "slug": "aaha",
        "cover": "20230708_070751_e77a5b493e8f76cef067bc08404f8b5f.jpg"
    },
    {
        "podcast_id": 218659,
        "title": "The Full Proof Truth Bourbon Podcast",
        "description": "<p><strong>The Full Proof Truth Bourbon Podcast</strong></p><p>Join Jeff and Mike as they give the full proof truth on bourbon and the \"man moment\".</p><p>Check us out on <a href=\"https://www.facebook.com/profile.php?id=100093685757628&amp;mibextid=ZbWKwL\">Facebook</a></p><p>OR email us at <a href=\"mailto:TheFullProofTruthPodcast@gmail.com\">TheFullProofTruthPodcast@gmail.com</a></p><p> *<em>NEW EPISODES COMING IN SEPTEMBER</em>*</p>",
        "language": "en",
        "author_name": "Jeff Goral",
        "slug": "thefullprooftruthpodcast",
        "cover": "20230709_060704_2dc9e46f6b4941ef16062ab12c3badbf.jpg"
    },
    {
        "podcast_id": 218698,
        "title": "hip culinary podcast.",
        "description": "<p>Delicious hip ideas and recipes that compliment your hip lifestyle. Where style and taste meet.</p>",
        "language": "en",
        "author_name": "hip culinary group",
        "slug": "hip-podcast",
        "cover": "20230726_010741_4898b25ffdfc65ad613249594e2a5156.jpg"
    },
    {
        "podcast_id": 218819,
        "title": "Slikministeriet",
        "description": "<p>I Slikministeriet tager Anders og Andreas temperaturen på et vildt slikmarked og dykker ned i slikposen, når de tænder mikrofonerne med en anmeldelse, reportage eller andet godt fra slikverdenen. Tryk play og få seneste nyt fra de to slikministre.</p>",
        "language": "da",
        "author_name": "Andreas Findling-Rottem og Anders Høst",
        "slug": "slikministeriet",
        "cover": "20230808_050832_eda41ab01556f6c936d732bf3f638881.jpg"
    },
    {
        "podcast_id": 218982,
        "title": "I love Dosa Chutney",
        "description": "<p>HAHA</p>",
        "language": "en",
        "author_name": "Dosa Singh",
        "slug": "dosa",
        "cover": "20230711_040701_5d93ac988a269cd6d4d4cc6fa74367c2.jpg"
    },
    {
        "podcast_id": 219200,
        "title": "Food: A Luxury?",
        "description": "<p>With millions affected by the cost-of-living crisis, this podcast talks about its affects on food and people's diets.</p>",
        "language": "en",
        "author_name": "Shreeyashi Ojha shreeyashiojha096@gmail.com",
        "slug": "foodpoverty",
        "cover": "20230716_090715_f292323c5ffbb7a12f12466cb85dcccb.jpg"
    },
    {
        "podcast_id": 219274,
        "title": "Test",
        "description": "<p>One morning, when Gregor Samsa woke from troubled dreams, he found himself transformed in his bed into a horrible vermin. He lay on his armour-like back, and if he lifted his head a little he could see his brown belly, slightly domed and divided by arches into stiff sections. The bedding was hardly able to cover it and seemed ready to slide off any moment. His many legs, pitifully thin compared with the size of the rest of him, waved about helplessly as he looked. \"What's happened to me?\" he thought. It wasn't a dream. His room, a proper human room although a little too small, lay peacefully between its four familiar walls. A collection of textile samples lay spread out on the table - Samsa was a travelling salesman - and above it there hung a picture that he had recently cut out of an illustrated magazine and housed in a nice, gilded frame. It showed a lady fitted out with a fur hat and fur boa who sat upright, raising a heavy fur muff that covered the whole of her lower arm towards the viewer. Gregor then turned to look out the window at the dull weather. Drops</p>",
        "language": "en",
        "author_name": "Alicia",
        "slug": "testpod31",
        "cover": "20230713_110731_edc7597fa7e57dc6d4d6a31e3fc17ec8.jpg"
    },
    {
        "podcast_id": 219282,
        "title": "Podcasts about best Smoker Grill Combos",
        "description": "<p>A podcasts explaining why These 9 are the grills <a href=\"https://favegrills.com/best-smoker-grill-combo/\">best Smoker Grill combos</a> By faveGrills</p>",
        "language": "en",
        "author_name": "Fave grills",
        "slug": "bestsmokergrills",
        "cover": "20230713_120739_010b6005544f0324ec21848975655b18.jpg"
    },
    {
        "podcast_id": 219294,
        "title": "Red and Riled Up",
        "description": "<p>Welcome to \"Red and Riled Up,\" the hilarious podcast hosted by Tank and Dirty, two fiery gingers who met in college and decided to spread laughter across the airwaves.</p><p>Tank and Dirty, share a passion for comedy and entertainment. With their fiery red hair and infectious energy, they bring a unique perspective to every episode, leaving listeners in stitches.</p><p>Join them as they dive into absurd topics, dissect everyday occurrences with their witty banter, and embark on outrageous adventures. Tank and Dirty explore the lighter side of life, always ready to get riled up about the silliest things.</p>",
        "language": "en",
        "author_name": "Tank & Dirty",
        "slug": "redandriledup",
        "cover": "20230713_010752_e5d0dc05d57367ceaa4b10e8bc62391a.jpg"
    },
    {
        "podcast_id": 219388,
        "title": "The Tipsy Two",
        "description": "<p>Welcome to the Tipsy Two Podcast with your Hosts</p><p>Rebecca Edwards &amp; Jen Harper!</p>",
        "language": "en",
        "author_name": "Rebecca Edwards & Jen Harper ",
        "slug": "thetipsytwo",
        "cover": "20230714_010705_4526315a09662b8d8af0279ea9da82f4.jpg"
    },
    {
        "podcast_id": 219739,
        "title": "Food Complex",
        "description": "<p>Dive into the history and cultural impact of different dishes that we all love and enjoy. Grab yourselves a plate and fill up.</p>",
        "language": "en",
        "author_name": "Marco + Andrew",
        "slug": "foodcomplex",
        "cover": "20230716_090731_a07f2a0103a33eeb66110193e4969d54.jpg"
    },
    {
        "podcast_id": 219773,
        "title": "Swad Ka Safar",
        "description": "<p>In this show I will be sharing simply delicious homemade food recipes, using common ingredients that are typically found in every household's kitchen. I sincerely hope that you enjoy this podcast.</p>",
        "language": "en",
        "author_name": "Preeti Sharma",
        "slug": "swad-ka-safar",
        "cover": "20230717_030710_f64186215c0c691a03eaf090a70c14e1.jpg"
    },
    {
        "podcast_id": 220324,
        "title": "History Between Bites ",
        "description": "<p>Join home cook Birdie and historian Sam as we discuss all the weird and quirky histories of food!</p>",
        "language": "en",
        "author_name": "Sam and Birdie",
        "slug": "historybetweenbites",
        "cover": "20230720_040720_0c52b51f3521e18d6d0083c0b90e25b2.jpg"
    },
    {
        "podcast_id": 220488,
        "title": "We went for Ice Cream",
        "description": "<p>We went for Ice Cream with Joseph and Tyler! Tyler and Joseph! We talk about movies, the cooking world, climbing and all sorts of fun stuff! I hope we can entertain you!</p>",
        "language": "en",
        "author_name": "We went for Ice Cream",
        "slug": "wewentforicecream",
        "cover": "20230721_020703_86afbee065c5cb07cd6fcde61ce67cb7.jpg"
    },
    {
        "podcast_id": 220552,
        "title": "The Heart of Rural America",
        "description": "<p>Welcome to the Heart of Rural America podcast. I’m your host, Amanda Radke ​-- a South Dakota cattle rancher, wife, mom of four, children’s book author, and motivational speaker.</p><p>I started this show with a simple goal in mind -- to share the untold stories of the often-overlooked independent farmer and rancher. On this program, We’ll discuss the challenges that face rural America and the anti-animal agriculture agenda that seeks to eliminate our way of life. But in the face of these ongoing battles, we’ll explore impactful solutions and meaningful pathways to profitability in order to keep producers on the land, to safeguard our private property rights, and to keep meat, dairy, and eggs on the dinner table.</p><p>And in stark contrast to the ugly, divisive headlines in today’s mainstream media, \"The Heart of Rural America\" will celebrate the faith, family values, patriotism, and work ethic of the incredible people I meet in my travels as an agricultural speaker. I hope you’ll be inspired by these agricultural entrepreneurs and rural families, just as I am.</p><p>Now let’s hit the dusty trail together as we uncover The Heart of Rural America. - Amanda</p>",
        "language": "en",
        "author_name": "Amanda Radke",
        "slug": "theheartofruralamerica",
        "cover": "20230721_120711_9e9aca6c34a695a18f2c5785aa46eb5b.jpg"
    },
    {
        "podcast_id": 220655,
        "title": "Best Ready to eat food",
        "description": "<p><a href=\"https://mogulkitchen.com/\">Mogul Kitchen</a>'s ready to eat food is a delicious and convenient way to enjoy authentic Indian cuisine in the comfort of your own home. Made with high-quality ingredients and traditional spices, these succulent chicken pieces are marinated in creamy yogurt and grilled to perfection. Simply heat and serve for a delicious meal that will transport your taste buds to the streets of Lahore.</p>",
        "language": "en",
        "author_name": "Mogul Kitchen",
        "slug": "mogul-kitchen",
        "cover": "20230722_080737_6d218d702b233a9331521499d099725a.jpg"
    },
    {
        "podcast_id": 221229,
        "title": "Soil to Table Podcast",
        "description": "<p>Welcome to the Soil to Table Podcast, a show all about sharing our experiences growing in a variety of green spaces.</p><p>Each episode we'll discuss a different growing theme and interview new guests that'll help you in your soil to table journey. From growing in a variety of locations, working with a particular practice or exciting ways to use your harvest, we'll share our experience and knowledge through new conversations every two weeks.</p>",
        "language": "en",
        "author_name": "Gregory Muldoon",
        "slug": "soiltotable",
        "cover": "20230726_010728_cf601f0ba866ede9b4006e677c43291a.jpg"
    },
    {
        "podcast_id": 221248,
        "title": "Dirty Dial",
        "description": "<p>The \"Dirty Dial\" dives into all kinds of topics, from mastering new skills</p><p>and fostering resilience to honing leadership qualities and navigating challenges!</p><p>Each episode offers actionable takeaways to ensure that you can immediately apply the principles you learn to your career.</p><p>Whether you're tuning in during your morning commute, relaxing at home, or seeking a break from your hectic day, \"The Dirty Dial\" promises to be a hilarious and enriching addition to your podcast playlist.</p>",
        "language": "en",
        "author_name": "Dirty Hands",
        "slug": "dirtydial",
        "cover": "20230726_040729_601a1b6ee122c13ffc7cf8d40dc8d9e3.jpg"
    },
    {
        "podcast_id": 221508,
        "title": "Crónicas al carbón. Un podcast con mucha carnita",
        "description": "<p>Reunimos a algunas de las personas más relevantes en el panorama gastronómico de México. En esta primera temporada titulada <strong>De chile, mole y pozole</strong>, conversamos con las y los chefs que se dieron cita en las competencias que definieron a los representantes de México en algunos de los concursos más importantes de la cocina y la pastelería a nivel mundial.</p><p>Hablamos de todo con ellas y ellos... descubre su trayectoria e historia, sus sueños y fracasos...</p><p>¡Bienvenidos a la primera temporada!</p>",
        "language": "es",
        "author_name": "Carla González Canseco",
        "slug": "cronicas-al-carbon",
        "cover": "20230728_050740_21393a800aab669e352a79e592eb07b3.jpg"
    },
    {
        "podcast_id": 221699,
        "title": "Готовим и говорим | Подкаст |",
        "description": "<p>Иногда не только готовим, но еще и говорим об этом.</p>",
        "language": "ru",
        "author_name": "Evgeniy Petrushin",
        "slug": "thepetrushin",
        "cover": "20230729_050749_64fad7ab3245e5271dff83af04cd98e0.jpg"
    },
    {
        "podcast_id": 221966,
        "title": "Last Hobos Ramble",
        "description": "<p>John and Adam, the Last Hobos, ramble about contemporary topics related to east Texas music, food, events and fun, providing reviews and editorial opinions in a humorous and entertaining way.</p>",
        "language": "en",
        "author_name": "John Strickland and Adam Kelley",
        "slug": "lasthobosramble",
        "cover": "20230731_040757_328989bdd0fdd9c6e5421e7e581a6293.jpg"
    },
    {
        "podcast_id": 222031,
        "title": "Stacked Off The Menu",
        "description": "<p>Talking about restaurant life, a behind the scenes look and why we are in this crazy business. Talking to local Noyes Street merchants, Northwestern personal (athletes, coaches, professors, admin staff), Evanston officials (council members, government officials) and anything about local Evanston business.</p>",
        "language": "en",
        "author_name": "Chris Rimer",
        "slug": "stacked-and-folded-off-the-menu",
        "cover": "20230801_120849_1a5db15b610d71bb729a76fcc8cf540e.jpg"
    },
    {
        "podcast_id": 222083,
        "title": "this is a podcast🤣",
        "description": "<p>this is a podcast lol</p>",
        "language": "ru",
        "author_name": "sjsjks sjaooa",
        "slug": "n1-gg4",
        "cover": "20230801_090851_9c850f08d368226c13ea16c9f7593d67.jpg"
    },
    {
        "podcast_id": 222124,
        "title": "No Mo Burns",
        "description": "<p>This is the introduction into change. Casting my net on the other side.</p>",
        "language": "en",
        "author_name": "Chef no BS",
        "slug": "no-mo-burns",
        "cover": "20230809_050815_a8f8c107feb9c03335556a92486fc10a.jpg"
    },
    {
        "podcast_id": 222748,
        "title": "Hydrogenated Oil Is Good Or Bad",
        "description": "<p>In this podcast I will show you how the hydrogenated oil is being used for making food yes it is. Do you know how it's harmful to our health do you know in this podcast you will know about how it's good or bad</p>",
        "language": "hi",
        "author_name": "DHR PODCAST ",
        "slug": "dhr-podcast-2007",
        "cover": "20230806_030835_1b9acd304b78fcee6cbb2315b5d1d5f7.jpg"
    },
    {
        "podcast_id": 223192,
        "title": "Dejando una huella en tu paladar By Baja Bites",
        "description": "<p>Bienvenido Baja Bites, unete a nosotros y sumérgete en una experiencia gastronómica única con nuestro apasionante podcast que combina las mejores recomendaciones culinarias con una misión educativa. Si te encanta explorar nuevos sabores y descubrir los secretos detrás de los platillos más exquisitos, este es el lugar perfecto para ti. Te llevaremos a un viaje gastronómico lleno de emocionantes recomendaciones y descubrimientos culinarios. Nuestro equipo compartirá contigo de los mejores restaurantes, cafeterías y locales de comida callejera, Ensenada Food Edition.</p>",
        "language": "es",
        "author_name": "Baja Bites",
        "slug": "bajabites",
        "cover": "20230808_100843_28dbd2fe1748b8a06add848d436cb6f8.jpg"
    },
    {
        "podcast_id": 223557,
        "title": "We are Vanmam Podcast",
        "description": "<p>This podcast is the wanna-be Tea kadai conversations that we have everyday with our friends, with a wide range of topics from films, lifestyle, sports, crime and other random stuff. Let us know your honest opinions on our Instagram page. </p><p><a href=\"https://www.instagram.com/wearevanmampodcast/\">https://www.instagram.com/wearevanmampodcast/</a></p>",
        "language": "ta",
        "author_name": "We are Vanmam",
        "slug": "wearevanmampodcast",
        "cover": "20230811_060831_9f902d0390b16aa58f72f47de2d55893.jpg"
    },
    {
        "podcast_id": 223679,
        "title": "Pizza and Profanity",
        "description": "<p>Two best friends that share a love of pizza and a bit of profanity..</p>",
        "language": "en",
        "author_name": "Jamal Austin , Chelsea Waggoner",
        "slug": "pizzaandprofanity",
        "cover": "20230812_120807_3bd4eaf006e940199ee506b6f4c22858.jpg"
    },
    {
        "podcast_id": 224108,
        "title": "woodsslackk",
        "description": "<p>dfji9hkji9fdhki9</p>",
        "language": "en",
        "author_name": "flyx",
        "slug": "flyx",
        "cover": "20230815_120820_db9711d500cc3178aee3077ee27e12af.jpg"
    },
    {
        "podcast_id": 224125,
        "title": "Two Friends Eat",
        "description": "<p>Giuseppe and Peter talk about food and restaurant related news, recaps of the Two Friends Eat food review web series, featured podcast topics, occasional special guests, and fan letters.</p>",
        "language": "en",
        "author_name": "Giuseppe DiMarca",
        "slug": "twofriendseat",
        "cover": "20230819_050852_72662a95150d6beb47c397eb4cbb380d.jpg"
    },
    {
        "podcast_id": 224284,
        "title": "遊酒生活",
        "description": "<p>每集輕輕鬆鬆暢談清酒、日常生活的清談節目。</p><p>為繁忙的生活中加點喘息的時間。</p>",
        "language": "zh",
        "author_name": "Alex",
        "slug": "sakeandlife",
        "cover": "20230816_050851_caa0f390e8002e6da8327efd3fd03f25.jpg"
    },
    {
        "podcast_id": 224290,
        "title": "tubers93hugefan",
        "description": "<p>hehehe</p>",
        "language": "en",
        "author_name": "comets",
        "slug": "cometss",
        "cover": "20230816_050858_13db08f0bf7ea62da8f37a2c53b5561a.jpg"
    },
    {
        "podcast_id": 224588,
        "title": "tubers93 irl",
        "description": "<p>in real life.</p>",
        "language": "en",
        "author_name": "IRL TALK",
        "slug": "tubers93irl",
        "cover": "20230817_100828_fb3b2282deb27aa6e54665e1c77eac63.jpg"
    },
    {
        "podcast_id": 224737,
        "title": "Seasoned test",
        "description": "<p>Test test</p>",
        "language": "en",
        "author_name": "Emma",
        "slug": "theseasonedsnackers",
        "cover": "20230818_090816_5d922f3afd798d8f392878545019324f.jpg"
    },
    {
        "podcast_id": 224782,
        "title": "Texas Wine Scene",
        "description": "<p>Texas Wine Scene is an information-based podcast about Texas wineries and events happening throughout the state. Information will include occasional interviews with wine industry leaders such as wine makers, viticulturalist and media personalities.</p>",
        "language": "en",
        "author_name": "Mike Cole",
        "slug": "texaswinescene",
        "cover": "20230819_030838_c297f4d08e282cc2958525c93e751dda.jpg"
    },
    {
        "podcast_id": 225133,
        "title": "The Plastic Planet podcast",
        "description": "<p>Introduction to the host and the concept of the podcast </p>",
        "language": "en",
        "author_name": "Dr Refilwe Mofokeng",
        "slug": "plastic-planet",
        "cover": "20230821_060826_d1bb15ba9f1ff6eda78b993305d8e673.jpg"
    },
    {
        "podcast_id": 225351,
        "title": "WHY TIM HORTONS IS POPULAR",
        "description": "<p>in addition, the business has started fundraising campaigns to help organizations that aid in disaster relief, food banks, and children's hospitals. This has promoted a feeling of goodwill among clients and helped the business establish a positive reputation.</p><p><a href=\"https://timhortons-menu-canada.info/\">https://timhortons-menu-canada.info/</a></p><p><a href=\"https://timhortons-menu-canada.info/tim-hortons-coffee-menu/\">Tim Hortons Coffee Menu</a></p><p><a href=\"https://timhortons-menu-canada.info/tim-hortons-breakfast-menu/\">Tim Hortons Breakfast Menu</a></p><p><a href=\"https://timhortons-menu-canada.info/tim-hortons-lunch-menu/\">Tim Hortons Lunch Menu</a></p><p><a href=\"https://timhortons-menu-canada.info/tim-hortons-toronto-menu/\">Tim Hortons Toronto Menu</a></p><p><a href=\"https://timhortons-menu-canada.info/tim-hortons-breakfast-hours/\">Tim Hortons Breakfast Hours</a></p><p>Lastly, a major factor in Tim Hortons' success has been its branding and marketing initiatives. Canadians have grown accustomed to the chain's distinctive red and white logo and catchy jingles, and its Roll Up the Rim to Win promotion has grown to be a much-anticipated yearly event. The corporation has been able to solidify its reputation as a cherished Canadian institution because of the frequent inclusion of Canadian themes and cultural allusions in its marketing efforts.</p><p><strong>ABOUT WHY TIM HORTONS IS POPULAR?</strong></p><p>Tim Hortons is a well-known Canadian fast-food restaurant chain that primarily serves coffee and doughnuts, along with a variety of other food and beverage items. Here are some key points about Tim Hortons in Canada:</p><p><strong>Founding and History</strong>: Tim Hortons was founded in 1964 by Tim Horton, a former NHL hockey player, and Jim Charade. The first store opened in Hamilton, Ontario. The chain quickly grew in popularity and expanded across Canada.</p><p><strong>Iconic Products</strong>: Tim Hortons is famous for its coffee and doughnuts, especially its \"Timbits\" – bite-sized doughnut holes. Other popular items include breakfast sandwiches, bagels, muffins, and soups.</p><p><strong>Double-Double</strong>: One of the most well-known aspects of Tim Hortons is its coffee customization options. \"Double-double\" refers to a coffee with two creams and two sugars, but customers can order their coffee to specific preferences.</p><p><strong>Canadian Cultural Icon</strong>: Tim Hortons holds a special place in Canadian culture and is often considered a symbol of Canadian identity. It's a common meeting place for friends and family, and the brand is often associated with hockey and community gatherings.</p><p><strong>Expansion and International Presence</strong>: While Tim Hortons has a strong presence in Canada, it has also expanded internationally, including locations in the United States, the Middle East, Europe, and Asia. However, its identity as a Canadian icon has sometimes been a subject of debate, especially as the chain expanded beyond Canada.</p><p><strong>Ownership Changes</strong>: In 2014, Tim Hortons merged with Burger King to form the Restaurant Brands International (RBI) company. RBI is a Canadian multinational fast-food company that manages both the Tim Hortons and Burger King brands.</p><p><strong>Controversies and Challenges</strong>: Over the years, Tim Hortons has faced various controversies, including disputes with franchisees over issues like pricing, product quality, and revenue-sharing. These disputes have occasionally sparked public attention and debate.</p><p></p>",
        "language": "en",
        "author_name": "sergio reus",
        "slug": "why-tim-hortons-is-popular",
        "cover": "20230822_060805_d4bfdc54f9191468b77eb5bb5c0eb583.jpg"
    },
    {
        "podcast_id": 225529,
        "title": "-ing in LA",
        "description": "<p>What can we say about LA?! A LOT! -ing in LA is brought to you by @NativCollectiv and @theNativLA and is out NOW with new episodes dropping every Wednesday! Discuss-ing all things everyone is do-ing in LA, both socially and professionally, from the perspective of LA natives. Hosts hail from Compton and Inglewood, and produced by a Ladera Heights native. Join us!</p>",
        "language": "en",
        "author_name": "-ing in LA",
        "slug": "nativcollectiv",
        "cover": "20230824_120805_532d7d52decd8bad0a9f052471d790bd.jpg"
    },
    {
        "podcast_id": 226250,
        "title": "The Coffee Kick",
        "description": "<p>A podcast based in Lincoln, Nebraska, where my guests and I review coffee and talk about random things! Join us for stupid conversations and really good drinks!</p>",
        "language": "en",
        "author_name": "Paige Trutna",
        "slug": "the-coffee-kick",
        "cover": "20230828_070827_4c79c637565711772c8635394445c850.jpg"
    },
    {
        "podcast_id": 226251,
        "title": "Soulfood",
        "description": "<p>excellent soul food</p>",
        "language": "en",
        "author_name": "Annyg",
        "slug": "annyg",
        "cover": "20230828_070804_37071d84b346af4bf66000fd96dc5425.jpg"
    },
    {
        "podcast_id": 226478,
        "title": "Test",
        "description": "<p>Test</p>",
        "language": "en",
        "author_name": "Test",
        "slug": "dnagenotektest",
        "cover": "20230830_120803_024888d18edf9fe6abace7a5d6ec698b.jpg"
    },
    {
        "podcast_id": 226643,
        "title": "Sports & entertainment ",
        "description": "<p>Talking about mainly sports (basketball) and any random shit people want</p>",
        "language": "en",
        "author_name": "Timothy Johnson",
        "slug": "tjwym",
        "cover": "20230831_010843_e8dd1e0abe45d8ca78921cc0964ab3a5.jpg"
    },
    {
        "podcast_id": 226669,
        "title": "damn you foodie.",
        "description": "<p>Hi beautiful people.</p><p>You are here for self-care, food, love, and support. Join me as we explore these meaningful topics and discover how they shape our lives.</p><p>love u all</p>",
        "language": "en",
        "author_name": "Viktoria ",
        "slug": "damnyoufoodie",
        "cover": "20230831_050840_dcf7073d69b875282366f24c993f014d.jpg"
    },
    {
        "podcast_id": 226837,
        "title": "Hospitality on a Plate",
        "description": "<p>Welcome to our latest Podcast series. In this series we meet some of the industries leaders, who give an insight to what attracted them to the sector and how they see the industry performing now and how it has evolved since they began their careers.</p><p>Thanks to Guestline, Technology Solutions to the Hospitality sector, who are the sponsors of this series.</p>",
        "language": "en",
        "author_name": "Cyril McAree",
        "slug": "hospitality-on-plate",
        "cover": "20230914_080952_d3c7e9bcb5f23d813adaa6e56db50c5b.jpg"
    },
    {
        "podcast_id": 226958,
        "title": "MADE BY TOOBERS93HUGEFAN",
        "description": "<p>ok</p>",
        "language": "en",
        "author_name": "c00l",
        "slug": "c00l",
        "cover": "20230902_050949_c8b0e6187e2cf35639a08f5f80a31428.jpg"
    },
    {
        "podcast_id": 227044,
        "title": "Welcome to the pod 🌞",
        "description": "<p>Welcome to the podcast that we have wanted to start for the longest time and finally decided to do it while sat in a park 🌞 Chit chat and discussing our wholesome weekend :)</p>",
        "language": "en",
        "author_name": "Ellie and Evie",
        "slug": "ellieandevie",
        "cover": "20230903_120925_acc77f887150f02060150e66aa04fd94.jpg"
    },
    {
        "podcast_id": 227078,
        "title": "Finding Bangalore",
        "description": "<p>Welcome to Finding Bangalore! Here we find hidden gems in Bangalore that truly express it's culture and lifestyle.</p>",
        "language": "en",
        "author_name": "Finding Bangalore",
        "slug": "ffinding-bbangalore",
        "cover": "20230903_050927_cfb61287faedd26ad575e5a167827d83.jpg"
    },
    {
        "podcast_id": 227149,
        "title": "YumChief",
        "description": "<p>Удовлетворите свое кулинарное любопытство с помощью нашего восхитительного канала подкастов! Присоединяйтесь к нам, чтобы отправиться в ароматное путешествие, исследуя искусство кулинарии - от вечных рецептов до инновационных техник. Эксперты-повара, энтузиасты кулинарии и специальные гости делятся своим мнением, превращая каждый выпуск в увлекательное исследование гастрономии. Этот канал создан при поддержке информационного портала про еду <a href=\"https://yumchief.com/\">https://yumchief.com/</a></p>",
        "language": "ru",
        "author_name": "yumchief",
        "slug": "yumchief",
        "cover": "20230904_080931_bc87816513465df4bef8e3174fc84f14.jpg"
    },
    {
        "podcast_id": 227162,
        "title": "NottsNight",
        "description": "<p>Celebrating great places to drink in and around Nottingham</p>",
        "language": "en",
        "author_name": "Kevin Stanley",
        "slug": "nottsnight",
        "cover": "20230904_120927_58aeeaa49fa34a0323ae209aa7e4f8c7.jpg"
    },
    {
        "podcast_id": 227403,
        "title": "Humanities Podcast",
        "description": "<p>In this podcast we will be talking about our suburb Wasteago</p>",
        "language": "en",
        "author_name": "Lyan Dev",
        "slug": "lyan-developers",
        "cover": "20230906_010931_1b0c43436b7045b55935da01da537e9b.jpg"
    },
    {
        "podcast_id": 227447,
        "title": "Nutricione (URBAN FM)",
        "description": "<p>Podcasti Nutricione me Vala Pupovcin ka për qëllim zhvillimin e diskutimeve të ndryshme lidhur me shëndetin e njeriut, me fokus në ndikimin e të ushqyerit në shëndetin. Do të diskutohen tema shumë interesante lidhur me zhvillimet më të reja të kësaj fushe, gjithmonë duke u bazuar në hulumtime shkencore, dhe jo në eksperienca apo mendime personale. Do të ketë të ftuar nga profesione të ndryshme shëndetësore, përfshirë mjekë, farmacistë dhe psikologë, me qëllimin e dhënies së informatave të sakta nga profesionistët e fushës.  </p><p>Çdo të premte prej orës 10:30 - 11:30 me Vala Pupovcin në Urban FM 103.5/105.5FM</p><p><a href=\"http://radiourban.fm\">radiourban.fm</a> </p>",
        "language": "en",
        "author_name": "URBAN FM",
        "slug": "urbanfmnutricione",
        "cover": "20230906_110950_7af16fa416d5c62b11100ea94b1c0141.jpg"
    },
    {
        "podcast_id": 227608,
        "title": "Kindness with Amy",
        "description": "<p>We discuss ethics, health and everything else in between with special guests. Brought to you by Generation Vegan.</p>",
        "language": "en",
        "author_name": "Kindness with Amy",
        "slug": "kindnesswithamy",
        "cover": "20230907_100916_02761fc7edbe730d1c30ea99551e6063.jpg"
    },
    {
        "podcast_id": 228294,
        "title": "vplayed podcast",
        "description": "<p>vplayed podcast</p>",
        "language": "en",
        "author_name": "vplayed podcast",
        "slug": "vplayed-podcast",
        "cover": "20230912_050945_4c35c360acd4a7752b3cc45580d7100f.jpg"
    },
    {
        "podcast_id": 228496,
        "title": "BoredIn- Bored IP Podcast ",
        "description": "<p>Bored IP Podcast Twitter space</p><p>Ape support ape, supporting the BAYC community and the Made by Apes IP ecosystem in building together.</p>",
        "language": "en",
        "author_name": "BoredIn- Bored IP & Made By Apes Talks",
        "slug": "boredin",
        "cover": "20230913_010955_048ec553c935f204ee3ee52769adcfd9.jpg"
    },
    {
        "podcast_id": 228843,
        "title": "Nature for Nutrients",
        "description": "<p>Do you want to create a more balanced and healthy lifestyle? Then don't look any further because this is your to-go to podcast show! Together with your host and natural medicine therapist Mickey you'll learn more about yourself and about what works well for you. For any questions you can reach out to <a href=\"mailto:naturefornutrients@gmail.com\">naturefornutrients@gmail.com</a> or visit Nature for Nutrients on Instagram. </p>",
        "language": "en",
        "author_name": "Mickey",
        "slug": "naturefornutrients",
        "cover": "20230915_070933_943bc6fd038925edcea0ceadcda51bfe.jpg"
    },
    {
        "podcast_id": 228933,
        "title": "Songs That Should be on Streaming Services",
        "description": "<p>Songs I think should be on spotify, youtube, etc</p>",
        "language": "en",
        "author_name": "Tally Hall",
        "slug": "bananamansong",
        "cover": "20230916_020901_4dea5a975bd7f3642306d934a8406ade.jpg"
    }
]