[
    {
        "podcast_id": 4188,
        "title": "Eagle News Podcasts",
        "description": "<p>~our viewpoint on many different topics~</p>",
        "language": "en",
        "author_name": "Eagle News Staff",
        "slug": "eaglenews",
        "cover": "20210920_134410_2d9915e49f8a4c8952aff936d29607ef.jpg"
    },
    {
        "podcast_id": 6467,
        "title": "Running Wild with Richard Rose",
        "description": "An award-winning author, Richard Rose will conduct interviews with engaging guests, entertain with amusing anecdotes and introduce music that may be new (by being old) to some people — and we'll have fun in the process. He will also keep listeners posted about his novels and screenplays.",
        "language": "en",
        "author_name": "Richard Rose",
        "slug": "richardroseonline",
        "cover": "20200226_234713_cc18b0042c2923a76b8430c67560f35e.jpeg"
    },
    {
        "podcast_id": 11446,
        "title": "Opus Theos D&D",
        "description": "In a modified world of Theros, where gods interfere in the lives of mortals to advance their own agendas, six adventurers uncover mysteries and prophecies in the wake of the death of the world's greatest hero. Features popular streamers playing together in-person, including TrumpSC, Jaycgee, DKane, JellyPeanut, YungLlama, Selkie_Smooth, and RazorATX.\n\nThis podcast features recordings of actual play sessions recorded live on twitch.tv/RazorATX on Tuesdays at 6 PM Pacific time.\n\nPlease excuse poor audio in early episodes. Our audio equipment has improved as the show has gone on!",
        "language": "en",
        "author_name": "Nicholas Galinski",
        "slug": "opustheosdnd",
        "cover": "20200817_043153_ff4da72ce6b39877ae7bb29ac4b87ea4.jpg"
    },
    {
        "podcast_id": 11652,
        "title": "Stories from a Chinese studio",
        "description": "Interesting tales from China's past and present",
        "language": "en",
        "author_name": "Tianqi Luo",
        "slug": "chinastories",
        "cover": "20200824_030208_e214012ee3ed2a85ce6ffaea618d9cf0.jpg"
    },
    {
        "podcast_id": 13165,
        "title": "Raconteur Collection",
        "description": "The Raconteur Collection is hosted by brothers Charlie and Jack. The two talk about childhood experiences, games, music and just about anything else!",
        "language": "en",
        "author_name": "Raconteur Collection",
        "slug": "raconteurcollection",
        "cover": "20210803_163339_ea0f8c179372272b1136cd011293909b.jpg"
    },
    {
        "podcast_id": 13248,
        "title": "The Ned Natter Show",
        "description": "\"Well ‘Ello me lovelies - it’s me Ned Natter with the famously unpasteurized and unfiltered Ned Natter Radio Show - ready to brighten your day! \nFirst up it’s great to be here with you again - thanks for your lovely comments and messages - it’s time for a good old natter – but remember I don’t chat about the regular news and current affairs – oh no, I’m here to give you a break from it all - a good laugh - with all 100 Episodes of my Monologues to date posted here so you can listen to all the shows again, yep they’re all saved for you as podcasts at Ned Natter dot com - Yep okay well put everything down - NO everything - I mean YOU too - come on - it’s time for The Ned Natter Show – and ya can’t miss this!\"",
        "language": "en",
        "author_name": "Ned Natter",
        "slug": "the-ned-natter-show",
        "cover": "20201008_211705_a9ac8020dd56178ca6c0eaef9ec368e3.jpg"
    },
    {
        "podcast_id": 15534,
        "title": "Selma Lagerlöf-podden",
        "description": "Selma Lagerlöf-podden produceras av Selma Lagerlöf-sällskapet. Sällskapet bildades 1958 och arbetar för att sprida kännedomen om Selma Lagerlöf och hennes verk.",
        "language": "sv",
        "author_name": "Selma Lagerlöf-sällskapet",
        "slug": "selmalagerlof",
        "cover": "20201126_103659_002f64e0508edee0de74bb379e45d78c.jpg"
    },
    {
        "podcast_id": 17243,
        "title": "Μουσική στο Celluloid",
        "description": "Ένα podcast για τον κινηματογράφο, την τηλεόραση και γενικότερα την 7η τέχνη! Τις Πέμπτες στις 22:00 ο taleporos μας ταξιδεύει σε κινηματογραφικά μονοπάτια στο Nikostereo Radio.\n\nwww.nikostereo.com",
        "language": "el",
        "author_name": "taleporos",
        "slug": "mousiki-sto-celluloid",
        "cover": "20201205_203642_7878e381517f9c7b686106ba235d2bb8.jpg"
    },
    {
        "podcast_id": 18646,
        "title": "Station Sidospåret",
        "description": "Hej och välkomna till Johannes och Eriks podcast!\n\nHär pratar vi om allt mellan himmel och jord på djupet, våran ända önska är att ni följer med på denna resa! Inga biljetter behövs!",
        "language": "sv",
        "author_name": "Erik & Johannes",
        "slug": "stationsidosparet",
        "cover": "20201213_221545_5b37d417479eb0a4331d58c9e056493f.jpg"
    },
    {
        "podcast_id": 21466,
        "title": "Fairytale Fandango",
        "description": "A comedy podcast involving fairytales, folklore, and tomfoolery.",
        "language": "en",
        "author_name": "Jennifer Mori",
        "slug": "fairytalefandango",
        "cover": "20201231_232850_34b98e68396914be3c3c6d1486a42175.jpg"
    },
    {
        "podcast_id": 24341,
        "title": "Honey Colored Glasses ",
        "description": "A weekly poetry podcast. Written & Read by Rachel Dixon. Cover art by Deema Turkomani. ",
        "language": "en",
        "author_name": "Rachel Dixon",
        "slug": "honeycoloredglasses",
        "cover": "20210119_233644_7caeb256995422b53cdc166dbf26a4bd.jpg"
    },
    {
        "podcast_id": 25403,
        "title": "Breakfast With Gilgamesh",
        "description": "Every day we wake up and tell a new part of our story, hoping in some small way to become immortal, be remembered, do some good for the world. It starts, of course, with breakfast.\n\nMy name is Z.K. Leverton, and I love stories. I write them, read them, watch and listen to them. Stories are important. They teach us things, help us understand that always elusive other, remind us of what’s important. Before we built the first great cities, reaped our first harvest, or listened to our first podcast, we were telling stories. Stories about us, the world we lived in, and the gods above. we used them to remember where we come from and to wonder where we might be going.\n\n Twice a month I’ll be here, telling you a story. It might be a myth, a folktale, or something else entirely, but it will always be in my words, with a slant towards accessibility and fun. Come to learn, come to enjoy, come as you are to my table, as we meet heroes, monsters, gods, and everyone in-between, for Breakfast with Gilgamesh.\n",
        "language": "en",
        "author_name": "Z. K. Leverton",
        "slug": "breakfastwithgilgamesh",
        "cover": "20210117_234839_1d903a0031084b3de4883a6afd087205.jpg"
    },
    {
        "podcast_id": 28521,
        "title": "Dice and Consequences",
        "description": "Be careful when rolling those dice! The results always have consequences... Dice and Consequences is another Dungeons & Dragons actual play podcast hosted by a group of friends rotating through two different, simultaneous campaigns! Featuring the DM(s) Jake Guidi and Austin Woodyard joined by Savannah Baldwin, Kyrsti Hamilton, and Chris Ward.",
        "language": "en",
        "author_name": "Savannah Baldwin, Jake Guidi, Kyrsti Hamilton, Austin Woodyard, and Chris Ward",
        "slug": "diceandconsequences",
        "cover": "20210302_190203_6063660dbf7ab3e2c7383e51e674e9c0.jpg"
    },
    {
        "podcast_id": 30500,
        "title": "HogsRead",
        "description": "Join myself and our talented readers as we transport you into the fantastical wizarding world of Harry Potter!\n\nJoin us on Facebook at HogsRead. Share your experience with the beloved series. Share your Patronus! Share your House! Love and respect!\n\nOh, and I know how some of y'all feel about J.K. Rowling, so I'll say this; #TransRightsMatter\n\nIf you would like to support the Family With Benefits Team, you can become a Patron on Patreon at www.patreon.com/familywithbenefits",
        "language": "en",
        "author_name": "With Benefits LLC",
        "slug": "welcometohogsread",
        "cover": "20210525_161948_b51817331a4f25e67e944e4d86780b3d.jpg"
    },
    {
        "podcast_id": 42178,
        "title": "Varjoton",
        "description": "Tosielämän rikoksia, sekä erilaisia mysteerejä läheltä ja kaukaa. Tervetuloa kuuntelemaan!\n\nJaksotoiveita, palautetta, sekä muita ajatuksia podcastiin liittyen voit laittaa instagramissa, facebookissa tai sähköpostilla:\n\nInstagram & Facebook: @varjotonpodcast\nSähköposti: varjotonpodcast@gmail.com\n\nLisäksi Varjoton löytyy Tiktokista, käyttäjänimellä @varjotonpodcast !\n\nMusiikki ja äänisuunnittelu: Tuomo Hokka\nPodcastin kansikuva: @simonaxk / @createdbysimona (instagram)\n",
        "language": "fi",
        "author_name": "Varjoton",
        "slug": "varjotonpodcast",
        "cover": "20220210_080226_3de577da94d6d3de71cb3003baee1bd7.jpg"
    },
    {
        "podcast_id": 46451,
        "title": "R&B Reviews",
        "description": "Review channel\n\nMarvel, \nDC, \nPopular Shows, \nAnime, \n& Suggestions, ",
        "language": "en",
        "author_name": "Brinder & Rizzy",
        "slug": "rbreviews",
        "cover": "20210403_024821_3d816783447f626f40b19e8d68ff75ab.jpg"
    },
    {
        "podcast_id": 46837,
        "title": "Děsivé příběhy od CreepyStalka",
        "description": "<p>Ahoj, jsem Stalk - vypravěč,Předplatné/Bonusový Kontent: <a href=\"https://herohero.co/creepystalk\">https://herohero.co/creepystalk</a></p>",
        "language": "cs",
        "author_name": "Creepy Stalk",
        "slug": "creepystalk",
        "cover": "20210502_145040_aca89a555860cf3cac947903d53432ed.jpg"
    },
    {
        "podcast_id": 47453,
        "title": "River Walk Tales of Terror",
        "description": "Episodic short stories narrated by Author and Actor Joshua Lee Diaz. \nInstagram: @joshualeediaz Cash donations welcomed via PayPal: chaisondiaz@gmail.com",
        "language": "en",
        "author_name": "@joshualeediaz",
        "slug": "riverwalktalesofterror",
        "cover": "20220725_080729_6e5b453948b1f206cc23ffe492ce71fe.jpg"
    },
    {
        "podcast_id": 48174,
        "title": "Potion Sword Run!",
        "description": "Videogames, Cats and Harsh Realities!",
        "language": "en",
        "author_name": "Original Seed",
        "slug": "potionswordrun",
        "cover": "20210409_204151_3331cdcdc653f3a57aa0f6c9a545483e.jpg"
    },
    {
        "podcast_id": 48907,
        "title": "Express Yo Shelf ",
        "description": "In this podcast we want to talk all about the our favourite medium.  We will be talking books all genres and topics relating to books from the perspective of two black women living in London. Books are so important as they can help us to understand the human condition, how we perceive/navigate through the world, our own subjectivity and experience, how they can challenge us and get us out of comfort zone but they can also reconfirm your biases...\n",
        "language": "en",
        "author_name": "Express Yo Shelf Podcast",
        "slug": "expressyoshelfpodcast",
        "cover": "20211018_125223_9dfc34120c91fc08a406c739e176ae6d.jpg"
    },
    {
        "podcast_id": 50897,
        "title": "The Dystopian Republic",
        "description": "<p>The Dystopian Republic is an ongoing podcast series where Raul tells stories that depict residents from a nation like and unlike the United States.</p><p>Every episode that Raul publishes will add depth to the nation and its history. Some of his stories will take place closer to the present while others will happen farther from it.</p><p>His stories will be gripping, thoughtful, sinister and painstakingly written. If you enjoy storytelling, you will love “The Dystopian Republic”.</p><p>DISCLAIMER: All stories in this podcast are fictitious. Any similarity with actual persons is coincidental.</p>",
        "language": "en",
        "author_name": "Raul Guerrero",
        "slug": "thedystopianrepublic",
        "cover": "20210420_203829_af2b79980420b09dbe62d7234ddd3389.jpg"
    },
    {
        "podcast_id": 56754,
        "title": "Jav & Charles Talk Comics",
        "description": "Jav & Charles Talk Comics is a podcast where they discuss comic arcs they suggest to each other.\n\nJav makes Charles read comics he missed in the 80's and Charles lets Jav experience the blossoming of the comic book art form over the last 20 years. Charles wrote this description with no input from Jav.",
        "language": "en",
        "author_name": "Charles Herring & Javier Gonzalez",
        "slug": "javandcharlestalkcomics",
        "cover": "20210514_180217_4104676e6358664153462bc069de3b49.jpg"
    },
    {
        "podcast_id": 57670,
        "title": "Stinklings",
        "description": "It's the Bad Fantasy Genre Fiction Podcast, hosted by John (unpublished author wannabe) and Laura (aspiring author and artist)! If you're leery about putting stock in the opinions of two unpublished authors to comment on these subjects, you probably won't be encouraged by our reading of John's teenaged disastrous attempts at high fantasy.",
        "language": "en",
        "author_name": "The Stinklings",
        "slug": "thestinklings",
        "cover": "20210518_203241_dd2bbeb4f00d1758f5f32cf65172480f.jpg"
    },
    {
        "podcast_id": 61505,
        "title": "Coffee and Quill",
        "description": "<p>The Coffee and Quill podcast is a literature-focused podcast that explores the world of books, writing, and the publishing industry. It is a platform where book enthusiasts, aspiring authors, and established writers come together to share their passion for literature and engage in thought-provoking conversations.</p>",
        "language": "en",
        "author_name": "Kasey Long",
        "slug": "coalescencepublishing",
        "cover": "20230413_010451_64c8ccb9c20f5243b2eb941a54040a24.jpg"
    },
    {
        "podcast_id": 66798,
        "title": "Glasser Series Audiobooks - A Death Worse Than Dying",
        "description": "Draper’s Girl is attempting to fall off the grid, but time off or ‘personal time’ doesn’t exist within the Organization. Additionally, her secret sabbatical and therapy sessions are working … bringing up long buried memories and horrors of her childhood. With a trove of data she’s acquired from Draper, she flirts with the idea of Accelerating - the method Jack Glasser uses in his research - in an attempt to make sense of it all.\n \nConcurrently, Amin suffers a devastating loss in Atlanta, pulling in Luke, Chas and Quan in an attempt to unravel two mystery deaths. Slowly and painfully, they peel back layers of a larger conspiracy to defraud a church … a plan crafted by Organization members.\n \nWhen Draper’s Girl’s trail leads back to Atlanta as well, once again she finds her fate intertwined with the Glassers and their employees. For Amin and Draper’s Girl, closure seems distant, but with each body that drops, they come closer to the truth.",
        "language": "en",
        "author_name": "Dana Hillman",
        "slug": "danahillman",
        "cover": "20220320_040326_81e75e3fa34d9ba2730de808f98a4e2a.jpg"
    },
    {
        "podcast_id": 74530,
        "title": "Cryptic Cases",
        "description": "The official Cryptic Cases podcast were we venture into the most mysterious stories and legends this world has to offer.",
        "language": "en",
        "author_name": "Daniel Potter",
        "slug": "deathbyhorrorpodcast",
        "cover": "20220311_020357_f146cf3fe157d213a9b6d8f4a7efb118.jpg"
    },
    {
        "podcast_id": 75184,
        "title": "Little Sleep//Much Reading",
        "description": "Aliza and Marissa are two Creative Writing Grads from Pratt Institute who LOVE books! Pratt gave us years of experience discussing books and being able to really identify the things we like or don't like. Our goal each week is not to find super amazing books we absolutely love, although that would be a nice treat. Our goal is to present new books to our listeners (and oftentimes ourselves) that they may not have had the opportunity to know about. Of course, we will throw in popular titles sometimes and keep up with the trends, because at the end of the day, we really just want to talk about Books! So join us weekly to discuss two new titles, maybe you'll discover something new, or maybe we will open your mind about an old favorite, either way we would love to have you!",
        "language": "en",
        "author_name": "Marissa Belmonte and Aliza Pelto",
        "slug": "littlesleepmuchreading",
        "cover": "20210823_185851_0077ed634dab1d98466e443ee068a03b.jpg"
    },
    {
        "podcast_id": 75213,
        "title": "Duérmete Niño",
        "description": "13 historias de terror de autores mexicanos que exploran a veces lo sobrenatural, y a veces lo temible de lo cotidiano. Ideal para ser escuchado en la oscuridad de la noche, justo antes de dormir.\n\n©2020 MQN501 (P)2020 MQN501",
        "language": "es",
        "author_name": " Eduardo Albornoz, Clauzzen Hernández, Jorge Vargas, Lucero Hernández, Joel Bello, Angélica Olivares",
        "slug": "duermetenino",
        "cover": "20210823_205459_82d68df28f6d4577a59f9ab77ffc7f0e.jpg"
    },
    {
        "podcast_id": 75215,
        "title": "Planeta Crimen",
        "description": "Investigación periodística que explora a los criminales más famosos de México y el mundo. Cada episodio cuenta un caso lamentablemente real, por más inverosímiles que pudieran parecer los detalles.\n©2020 MQN501 (P)2020 MQN501",
        "language": "es",
        "author_name": " Ricardo Ribón, Mariana Perusquía",
        "slug": "planetacrimen",
        "cover": "20210823_210120_bd31d51abafca068409fce952f4fcbc5.jpg"
    },
    {
        "podcast_id": 75219,
        "title": "Tacos de Ñáñaras",
        "description": "Teorías de la conspiración, leyendas urbanas, chismes. O como Humberto Ramos les conoce: canasta básica. Conoce la amistad entre Víctor y Humberto, el primero un hombre sensato y escéptico, el segundo un conspiranóico en esteroides que lo cree absolutamente todo y siempre trata de convencer a los demás de que hay un mundo observándonos\n©2020 MQN501 (P)2020 MQN501",
        "language": "es",
        "author_name": "Humberto Ramos, Víctor Hernández, Kyria Montoya",
        "slug": "tacosdenanaras",
        "cover": "20210823_211431_848dd813124ddbceb855bf27d745f3f6.jpg"
    },
    {
        "podcast_id": 77320,
        "title": "Aspects of History",
        "description": "<p>History Editor Ollie Webb-Carter interviews historians and authors on the past - from the ancient world right up to the modern day. In each episode, Ollie seeks to get to the bottom of a story or scrutinise a figure from history, but in a light-hearted way. There are bonus episodes too, on current events and anniversaries to the Aspects of History Film Club.</p>",
        "language": "en",
        "author_name": "Oliver Webb-Carter",
        "slug": "aspectsofhistory",
        "cover": "20220225_020224_bfbd86e42a673204384f75aeb64c5e9d.jpg"
    },
    {
        "podcast_id": 78218,
        "title": "Radio-Fear",
        "description": "The horror podcast not afraid to cover all mediums of the genre. Hosted, edited, uploaded, and cursed by the eternally exhausted Brandon, and co-hosted by Tony and Justin.",
        "language": "en",
        "author_name": "Radio-Fear Macabre",
        "slug": "radiofear",
        "cover": "20220601_050613_e72c5678e50be55f2ede3ab511a7a513.jpg"
    },
    {
        "podcast_id": 78830,
        "title": "The Black Pass",
        "description": "A Horror Audio Drama about a young reporter who has been sent to cover a vampire film festival deep in the heart of Transylvania. She hears about a secret party that closes the festival, a wild and hedonistic evening of unrestrained pleasures, and sets her target on getting herself a ticket. ",
        "language": "en",
        "author_name": "Paul Appleby",
        "slug": "theblackpass",
        "cover": "20220130_120109_ceb86974cb4310b4399eb716d9f15939.jpg"
    },
    {
        "podcast_id": 78975,
        "title": "Ne anlatıyoruz biz?",
        "description": "Galaksinin en ücra köşesinden yayın yapmaya çalışan Nasuh'un amansız ve bir o kadar saçma mücadelesi ilk defa kayıt altına alınıyor. Arkanıza yaslanın ve bulamaç olmuş eğlencenin-saçmalıkların içinde anlamlı bir şeyler bulmaya çalışın.",
        "language": "tr",
        "author_name": "Nasuh",
        "slug": "neanlatiyoruzabibiz",
        "cover": "20210913_113522_9b61cf638f7251965171a44e4042eab6.jpg"
    },
    {
        "podcast_id": 98400,
        "title": "Tangenetic",
        "description": "Just Three Aussie Blokes talking about movies, games and anything pop culture. Come join our journey and passion on numerous topics that have made us who we are today.",
        "language": "en",
        "author_name": "Tangenetic",
        "slug": "tangenetic",
        "cover": "20220806_060829_d9eb2264ebe0e6f7a5e8cfe0fec736d5.jpg"
    },
    {
        "podcast_id": 99222,
        "title": "The Mid Podcast",
        "description": "<p>We’re a mother and son duo, that love to talk about Geek stuff, Wrestling ,and love talking about random stuff</p>",
        "language": "en",
        "author_name": "Brendan Reed ",
        "slug": "midpodcast",
        "cover": "20220119_100126_3aca3e05d220b963d75e111c068425f5.jpg"
    },
    {
        "podcast_id": 103134,
        "title": "Randomness Podcast ",
        "description": "Hi Y’all,\n\nWelcome to the Weirdness! A random podcast about scary things and nerdy things. And everything in between because I am a hot mess that loves a lot of different things. Hope you enjoy! ",
        "language": "en",
        "author_name": "Dmariescary",
        "slug": "dmariescarypodcast",
        "cover": "20220123_090144_1c051a4bb8ed25ffb48094753d44ded0.jpg"
    },
    {
        "podcast_id": 113770,
        "title": "The Sacred and Superstitious",
        "description": "Your resource for rituals, folklore, and supernatural creatures from around the world. Each week we do a deep dive on a variety of topics that are often unknown and unheard of. ",
        "language": "en",
        "author_name": "Daphne Fama",
        "slug": "thesacredandsuperstitious",
        "cover": "20220308_080324_a105e0797c0d343903d7ec41ff80e24e.jpg"
    },
    {
        "podcast_id": 117352,
        "title": "The Et Omnia Trilogy: Adahy ",
        "description": "Join author Justin Eggen as he reads \"The Et Omnia Trilogy: Adahy\". Each episode will contain a chapter from the book. This is effectively an audio book. \n\nIn the summer of 1773, Adahy embarked in search of his father's blood brother Major Thomas Young of Boston, per his mother's dying wish. Equipped with a beautiful black mare named Raven and an arsenal of weapons with the skill set to wield them, he quickly finds the atmosphere across the thirteen colonies is not how he remembered in his youth. The quick-tempered half-native, half-English young man encounters friends, enemies, lovers, drunkards, and powerful elites on his fortuitous journey. Soon he inadvertently uncovers the truth about his past and the ominous secrets history has hidden away from civilization.",
        "language": "en",
        "author_name": "Justin Eggen",
        "slug": "adahy",
        "cover": "20220324_010357_e56db1d19906bea59dfa2c6b8426a5f0.jpg"
    },
    {
        "podcast_id": 118309,
        "title": "The Dark Word",
        "description": "An AudioHopper Podcast about Horror Writing, hosted by <a href=\"https:// pfracassi.com\">Philip Fracassi</a>. Produced by <a href=\"https://www.audiohopper.com\">AudioHopper</a> and <a href=\"https://www.bookandfilmglobe.com\">Book and Film Globe</a>.",
        "language": "en",
        "author_name": "AudioHopper",
        "slug": "thedarkword",
        "cover": "20220527_120554_5731c093fa2e33c9d0af0c86471941f8.jpg"
    },
    {
        "podcast_id": 121560,
        "title": "Battles & Brews",
        "description": "A D&D podcast of friends trying to cure the weekly work life with adventure, brews, and laughs.",
        "language": "en",
        "author_name": "Battles&Brews",
        "slug": "battlesnbrews",
        "cover": "20220626_120642_31c53898ef436f3be5139ba805735827.jpg"
    },
    {
        "podcast_id": 121775,
        "title": "The Fallen Reality",
        "description": "Explanations of backrooms levels, entities, recourses, and more! Get a deep dive into the Backrooms alternate reality.",
        "language": "en",
        "author_name": "caz & OHL",
        "slug": "thefallenreality",
        "cover": "20220413_010427_ce555b56f4e6fe889c247c4dc0178018.jpg"
    },
    {
        "podcast_id": 122375,
        "title": "Bookmark It",
        "description": "What's between those sheets? Find out with Hannah K and Maleah M as they get into the pages of fantasy fiction novels. They've spent most of their literate lives indulging in the written word of elaborate worlds and thought it high time to talk to each other and fantasy lovers everywhere about their continuing obsession. You're going to want to bookmark it!",
        "language": "en",
        "author_name": "Hannah K & Maleah M",
        "slug": "bookmarkit",
        "cover": "20220415_080443_046ff48ae49000fe671c804a163c71b0.jpg"
    },
    {
        "podcast_id": 122938,
        "title": "Drowsy",
        "description": "<p>The best podcast to fall asleep to.</p>",
        "language": "en",
        "author_name": "Evelyn Carter",
        "slug": "drowsy",
        "cover": "20220418_080432_3573e2d2fabb205898d6da0ed59fed44.jpg"
    },
    {
        "podcast_id": 124748,
        "title": "The Midnight Candle",
        "description": "THE MIDNIGHT CANDLE presents Classic and Timeless Tales of Crime, Mystery, the Occult, Suspense, and all things Supernatural with its own unique production to provide the listener with a fully immersive audio experience. \n\n",
        "language": "en",
        "author_name": "Junken Rom",
        "slug": "themidnightcandle",
        "cover": "20220502_120547_10f9a4b277e5f1e0c6edb410a13caa1d.jpg"
    },
    {
        "podcast_id": 127035,
        "title": "BookTalk",
        "description": "Reading is just the beginning........\nJoin our community and have place to just chat about all our favorite stories!\n\n\nFollow us on Instagram!\nbooktalk.podcast\nHosted by Lexie B. and Alaina T. ",
        "language": "en",
        "author_name": "Lain & Lex",
        "slug": "booktalk",
        "cover": "20220508_010550_74937cec01a5db6acd1bea85e9a58d38.jpg"
    },
    {
        "podcast_id": 127636,
        "title": "Hysterical Punchline",
        "description": "A group of friends having fun talking about stuff we want to. ",
        "language": "en",
        "author_name": "HPunchline",
        "slug": "hpunchline",
        "cover": "20220511_020553_40ff30cd576c4a95b0a45c5acf2e44d6.jpg"
    },
    {
        "podcast_id": 130880,
        "title": "Vegas Dead End - Chino & Tonto Mystery   ",
        "description": "Our little drama doesn’t have much to do with Las Vegas, New Mexico’s past, except it is the past that brings our hero to the current day Las Vegas.  Tyee Chino is a modern-day man, college educated, computer wizard, who has lived much of his life in the ugly past of being a native American—in his case Apache.  \n\nSummoned to Las Vegas, New Mexico, to deal with an inheritance, he is fairly sure he does not want, he stumbles onto a old mystery and a new murder.  \n",
        "language": "en",
        "author_name": "Ted Clifton and Dylan Carrillo",
        "slug": "vegaswhere",
        "cover": "20220608_060638_1f3d71a544662012f4814926cc5fa215.jpg"
    },
    {
        "podcast_id": 131743,
        "title": "Unacknowledged Podcast Product",
        "description": "UPP is a podcast product by the people, for the people - brought to you by a robot.",
        "language": "en",
        "author_name": "UPP",
        "slug": "uppp",
        "cover": "20220602_040652_fa5ad960082cafca6dba6b9c69f30034.jpg"
    },
    {
        "podcast_id": 131793,
        "title": "Kinross Kids Podcast 1",
        "description": "This is our first ever Junior School podcast. Relax, go shopping, listen to me in your car or take me anywhere as we talk about songs, books, the weather, a surprise guest singer and much much more! From the KWS Kids.",
        "language": "en",
        "author_name": "Kinross Kids",
        "slug": "kinrosspodcast",
        "cover": "20220616_020636_c078d24d95121f1f664dfe47cb96cbfd.jpg"
    },
    {
        "podcast_id": 131864,
        "title": "Evermore Poe: The Turbulent Youth of Edgar Allan Poe ",
        "description": "Evermore Poe follows the untold story of Edgar Allan Poe's teen years as he navigates a dysfunctional foster family, a disturbing love of gothic horror, juvenile vices and his obsession with a married woman twice his age. \n\nAge 13 and up. Parental Guidance Suggested. \nThemes: Halloween | Serial | Horror | Spooky | Supernatural | Coming-of-age | Antebellum South  \n\n*Now a Top Halloween pick from Fiction Horizon!!*\nhttps://fictionhorizon.com/best-halloween-podcasts/\n\n",
        "language": "en",
        "author_name": "Kris Kosach",
        "slug": "evermorepoe",
        "cover": "20220924_120956_ed9fdd7000384d0034156f994d0a5e4a.jpg"
    },
    {
        "podcast_id": 131994,
        "title": "Escribe Tu Libro Ya",
        "description": "<p>Bienvenido. ¿Quieres escribir un libro? Hazlo ya. Te comparto en este podcast mi diario de experiencias como escritor. He desarrollado un espacio de creación llamado Casa de Escritores. El objetivo es formar una tribu para acompañarnos mientras desarrollamos nuestra obra. Abrazo fuerte 📌 Envíame tus preguntas y recomendaciones a https://casadeescritores.wordpress.com/acerca-de/. 📌 Sígueme en en Instagram: @Joaquin.Escribe. 📌 Déjame 5 estrellas en tu reseña. Compártelo con alguien a quien pueda serle útil. 📌 Beca a un tallerista por el valor de un café: https://www.buymeacoffee.com/CasaDEscritores. 📌 Visita nuestro site: CasadeEscritores.WordPress.com. 📌 Escríbeme un email: casadeescritor@gmail.com. 📌 Escríbeme un wasap: 0034691348051. 📌 Talleres 📌 Asesoría 📌 Corrección</p>",
        "language": "es",
        "author_name": "Joaquín Pereira",
        "slug": "escribetulibroya",
        "cover": "20230501_100538_3f4dd29452b6025ac984986eeadce897.jpg"
    },
    {
        "podcast_id": 132167,
        "title": "90% Bullshit",
        "description": "Me (Tipstep) having conversation with people who are interesting to me some long time friends and some may be strangers that become friends. Talking about all topics!",
        "language": "en",
        "author_name": "TipStep",
        "slug": "90bullshit",
        "cover": "20220915_010929_0cc1f92d338dbb45b2e02e285859f382.jpg"
    },
    {
        "podcast_id": 132825,
        "title": "Story's ",
        "description": "Hi this is my first  podcast  and I want to do story's and read  books or make my own story and talk about other stuff too 😊 ",
        "language": "en",
        "author_name": "ALONDRA ",
        "slug": "lupita12",
        "cover": "20220719_110739_7ba4f1bd6c25b203d707edc00f98dfdf.jpg"
    },
    {
        "podcast_id": 133557,
        "title": "De Todo Un Mucho",
        "description": "Martha Higareda y Yordi Rosado. Una actriz de cine y un conductor de televisión. Una mexicana viviendo en Estados Unidos. Un mexicano viviendo en México. Dos culturas diferentes compartiendo diferentes ideas. Un hombre y una mujer hablando... de todo un mucho.",
        "language": "es",
        "author_name": "De Todo un Mucho",
        "slug": "dtum",
        "cover": "20220611_120641_9ea75ce4ec969a956bc890e3df14a6fc.jpg"
    },
    {
        "podcast_id": 134707,
        "title": "The London Magazine Podcast",
        "description": "<p>A monthly podcast with The London Magazine team and the brilliant writers, poets and essayists that contribute to the UK's oldest literary journal. Each show features an interview with a writer published in the magazine as they discuss their work, inspirations and career so far. We also invite our writers to share their best tips and advice in our Literary Clinic, with dilemmas sent in by our readers. Subscribe to The London Magazine now for just £35 a year https://www.thelondonmagazine.org/subscription/ Grab a copy of our latest issue to support the magazine https://www.thelondonmagazine.org/product/single-issue/ Send us your Literary Dilemmas https://bit.ly/3xVhPaN</p>",
        "language": "en",
        "author_name": "The London Magazine",
        "slug": "thelondonmagazine",
        "cover": "20220616_110624_48eec823a621036bde6609037dd33211.jpg"
    },
    {
        "podcast_id": 136288,
        "title": "Subscriptions for Authors",
        "description": "<p>We help authors make money with subscriptions. Every week, we sit down with authors pioneering new ways to monetize their fiction and build reader communities.</p><p>We share novel marketing ideas, new platforms/technologies, and game-changing strategies at the cutting edge of publishing. Our goal is to help more authors write full-time and build sustainable, recurring revenue from their superfans.</p><p><strong>Join our free community of 2400+ authors for weekly subscription insights at: </strong><a href=\"https://www.subscriptionsforauthors.com\">https://www.subscriptionsforauthors.com</a></p><p><strong>And join Ream, the only subscription platform by fiction authors for fiction authors:</strong> <a href=\"https://reamstories.com/\">https://reamstories.com/</a></p>",
        "language": "en",
        "author_name": "Emilia Rose and Michael Evans",
        "slug": "subscriptionsforauthors",
        "cover": "20220623_080638_b263d4d1804198423155717e5e3ec3c9.jpg"
    },
    {
        "podcast_id": 137117,
        "title": "TableTopics",
        "description": "Table Topics is a podcast about table top roleplaying games where we try out new tabletop systems and tell you about them! We also table talk about concepts that are important to every TTRPG.\nNew Episodes are available on the first Tuesday of every month.",
        "language": "en",
        "author_name": "Anas Al-Rawi, Caleb Cote, Christian Musters and Santiago Carrillo",
        "slug": "tabletopicspodcast",
        "cover": "20220628_100630_d6c53295c6d6625b9548fbf56fee3956.jpg"
    },
    {
        "podcast_id": 139940,
        "title": "Stories of Yore",
        "description": "<p>Exploring folktales, myths and legends from South East Asia – and beyond. </p><p>Come and join me, Natalie Sia, (around the imaginary campfire) as we discover stories that have passed the test of time, from various cultures.</p>",
        "language": "en",
        "author_name": "Natalie Sia",
        "slug": "storiesofyore",
        "cover": "20230126_100156_1f1106abe817375974e25ac3738a2c33.jpg"
    },
    {
        "podcast_id": 140836,
        "title": "DND: The Children of Azathoth",
        "description": "An actual play podcast of everyone's favorite TTRPG, Dungeons and Dragons. Listen to The Children of Azathoth (us), a group of ameture DnD newbies try out our very first homebrew campaign written by our DM, Nick who will take the players on a magical adventure. Support us on Patreon at patreon.com/tcoadnd.",
        "language": "en",
        "author_name": "tcoadnd",
        "slug": "tcoadnd",
        "cover": "20220716_110708_668f47276c0c65fba6be836d81e84fbf.jpg"
    },
    {
        "podcast_id": 141674,
        "title": "Historias y Relatos Especiales",
        "description": "Portal auditivo, donde la imaginación los pensamientos e incluso los SUEÑOS nos harán recordar temas que nos gustan, atemorizan o que simplemente compartimos por la experiencia emocional de ese día que se te fue el internet; cuando NO había luz para ver tu serie favorita o incluso al calor de una FOGATA,  en tu vehículo camino a casa muy de madrugada, acompañado de AMIGOS o conocidos \nAcompáñanos, comparte y escucha \nHistorias y Relatos Especiales",
        "language": "es-mx",
        "author_name": "SANTIAGO YAÑEZ SANCHEZ ",
        "slug": "cuentosyrelatosespeciales",
        "cover": "20220725_040740_708e324f2f26fe215048604692bf7592.jpg"
    },
    {
        "podcast_id": 144402,
        "title": "The Chase",
        "description": "A fan-made project by a solo producer, sound engineer, and composer, ThaTricksta.\nDive in and join Officer TRK in ThaTricksta’s all-new fictional audio series, The Chase, where he and his team tackle various crimes within the city of Los Santos and the state of San Andreas (from Rockstar Game’s Grand Theft Auto V). \n\nFeaturing professional-level production such as original sound design, soundtracks/music, voice acting, and surround sound, this action-packed series will ensure you have the best immersive experience with The Chase.",
        "language": "en",
        "author_name": "ThaTricksta",
        "slug": "thatricksta",
        "cover": "20220817_100859_c679671e474d427349f7b14aa16e2b7e.jpg"
    },
    {
        "podcast_id": 148553,
        "title": "The Good, The Bad & The Haunted",
        "description": "Ever wonder what happens when two Australians get together, drink, & talk about murder, occult & hauntings? \nIf true crime, spooky stories & occult gatherings interests you then, Buckle up & come on this journey with Cassie & Daniel",
        "language": "en",
        "author_name": "Cassandra Phillips & Daniel Constantine",
        "slug": "thegoodthebadandthehaunted",
        "cover": "20220830_120850_19ac312f97c4d958a3ade901496ca8f7.jpg"
    },
    {
        "podcast_id": 148968,
        "title": "Baby Got Stacks",
        "description": "<p>Welcome to our bookish podcast! We're Ashlee and Mel, best friends who love books and reading. We buddy read a new book each week and this is your invitation to join us! You can expect new episodes every Sunday at noon (PST). We chat about the story, our thoughts and other reviews (with our random tangents mixed in) so grab your book and read with us!</p>",
        "language": "en",
        "author_name": "Baby Got Stacks",
        "slug": "babygotstackspodcast",
        "cover": "20221024_111009_49a41b2b1b4b44d66fad5420cdac93b3.jpg"
    },
    {
        "podcast_id": 149443,
        "title": "Weird & Curious Tales: Strange Stories for a Midnight Listen",
        "description": "Weird & Curious Tales is a channel dedicated to narrating classic horror and dark fantasy writings. \n-----\nWant to listen to the newest episode early? All episodes are posted to the Weird & Curious YouTube channel before their release. Also check out our TikTok for exclusive super short-form content that is made to be 3 minutes or less!\n-----\nYouTube: https://www.youtube.com/channel/UCvdR8EenJzGD5gFkHdQy18Q\nTikTok: @WeirdCuriousTales\nTwitter: @WeirdCurious_\nEmail: WeirdCuriousTales@gmail.com\n-----\nAll stories are either public domain and can be accessed through a variety of resources. Stories that are not public domain have received permission from the author or publisher to narrate. All audio recreations and narrations are protected by copyright and may not be used without explicit permission by the narrator (me).",
        "language": "en",
        "author_name": "Cameron Townsend",
        "slug": "weirdcurioustales",
        "cover": "20220828_110804_13522b9fbed8fe5cf73ad9904473a2c6.jpg"
    },
    {
        "podcast_id": 152096,
        "title": "Farssipajan Kauhupodcast",
        "description": "<p>Tervetuloa Farssipajan kauhupodcastin pariin, kuten nimestä voi päätellä tässä podcastissä kuulet erilaisista kauhuun liittyvistä aiheista kuten urbaaneista legendoista, historiallisista kauhuista, myyttisistä olennoista ja kuuntelioiden omia tarinoita. </p><p>Tarinoita ja palautetta pysty helposti lähettämään meidän sähköpostiin <a href=\"mailto:farssipaja@gmail.com\">farssipaja@gmail.com</a></p><p>Löydymme myös lähes kaikilta muilta alustoilta, kuten twitch, youtube, tiktok, facebook ja instagram. </p>",
        "language": "fi",
        "author_name": "Taistelutatti ja Legaso",
        "slug": "farssipajan-kauhupodcast",
        "cover": "20220908_050932_ebaf80d04cf83ed8519e397353a1c5c2.jpg"
    },
    {
        "podcast_id": 152714,
        "title": "Readers on Writers",
        "description": "Audiobook narrator Ferdelle Capistrano interviews female authors she has narrated for. We dive into the mind of the writer to impart inspiration and knowledge to other young readers, fans and future writers. Sharing more stories to those of us who love to read and love to write.",
        "language": "en",
        "author_name": "Ferdelle Capistrano",
        "slug": "readersonwriters",
        "cover": "20220911_070921_f0983a7362f5020b2edcddd8bd85c56a.jpg"
    },
    {
        "podcast_id": 153418,
        "title": "Exposing Your High School Reading List",
        "description": "a podcast dedicated to unpacking and improving the high school English curriculum",
        "language": "en",
        "author_name": "EYRL Podcast",
        "slug": "eyrl",
        "cover": "20220914_030916_bf6e3157208da605671925b9f1ebe6ea.jpg"
    },
    {
        "podcast_id": 155717,
        "title": "The Honored Ones Podcast",
        "description": "Home of the Honored Ones Podcast. \n\n\"The Honored Ones Podcast\" is an anime, manga and Youtube Podcast hosted by anitubers Kreams and Broken Ronin! \n\nWe speak about Anime and Manga, the industry at large as well as how we fit into the greater anitube creator economy! Additionally we also review weekly chapters of \"Jujutsu Kaisen\", \"My Hero Academia\" , \"Black Clover\" and More! \n\nLet us know what you think and if there are any topics you would like to see us cover in the future !\n\nCheck Out Our Channels Here 👇👇\nKreams: https://www.youtube.com/c/Kreamsy\nBroken Ronin: https://www.youtube.com/c/BrokenRonin\n\nAlso Follow Us on Twitter! \nKreams : https://twitter.com/KreamsY\nBroken Ronin: https://twitter.com/TheBrokenRonin\n\n",
        "language": "en",
        "author_name": "The Honored Ones Podcast",
        "slug": "thehonoredonespodcast",
        "cover": "20220925_120956_f34ce1e4f4f78d8b0beaf0488fc9d8e2.jpg"
    },
    {
        "podcast_id": 157212,
        "title": "The I Know What You Did Last Podcast",
        "description": "A place to enjoy the story telling side of true crime, horror stories and urban legends. \nTake a step away from your day and listen to a short, scary story and let your imagination take the front seat. New episodes every other Sunday, to leave a comment about any episodes, interact with the community or get podcast updates; follow the pod on insta @theikwydlpodcast\n\n",
        "language": "en",
        "author_name": "James Hynes",
        "slug": "theikwydlpodcast",
        "cover": "20221001_031059_3b85f7e9165c0eea98082796759e6f4c.jpg"
    },
    {
        "podcast_id": 157637,
        "title": "Spore Module",
        "description": "Creativity can be as difficult as it is liberating. One moment you're on a roll and engrossed in the euphoric experience of pure creation, the next you've hit the wall and you can't see a way around. In this podcast, we get to discuss the good and the bad with some truly wonderful individuals and look at some tools and tips to help you in your creative journey.",
        "language": "en",
        "author_name": "Zack Leach",
        "slug": "sporemodule",
        "cover": "20221103_091117_dcc88d9bca73c2066f04ed104769967a.jpg"
    },
    {
        "podcast_id": 159065,
        "title": "The Haunted Hall",
        "description": "Happy 30th! \n\nLauren from The Haunted Hall narrates some of the stories held within its walls.",
        "language": "en",
        "author_name": "Lauren Lange",
        "slug": "thehauntedhill",
        "cover": "20221019_021046_e94bc77de5e21303a00993fc1e99a2fb.jpg"
    },
    {
        "podcast_id": 159143,
        "title": "House of Books",
        "description": "<p>Book talk about fiction, cozy mystery, fantasy, and a little memoir; we'll help you find your new old favorites.</p>",
        "language": "en",
        "author_name": "Catherine Beeman",
        "slug": "house-of-books",
        "cover": "20230917_070951_f6bb535b308bfeb462a8f38754383010.jpg"
    },
    {
        "podcast_id": 159908,
        "title": "The power of the historical novel to explore gospel themes",
        "description": "Why is the historical novel such a great means of exploring epic themes like freedom and spirituality.",
        "language": "en",
        "author_name": "Mike Clements",
        "slug": "meclements",
        "cover": "20221110_031143_9c9915d72afa94c6dbe662b1bbea42be.jpg"
    },
    {
        "podcast_id": 161168,
        "title": "Songwoven: A D&D Actual Play",
        "description": "We are a small but mighty group of three playing 5e D&D! Join Claude and Cecilia as they journey together along the Road of Twines in our first campaign: The Lanya Expedition. Our actual play podcast uses the audio of our Twitch livestream. You can catch us on Twitch live every Sunday at 8 PM Eastern!",
        "language": "en",
        "author_name": "Tim Tran, Emma Romasco, and Genny Sherard",
        "slug": "songwoven",
        "cover": "20221017_111056_0d33768079e0a500b0bd2a1eb9fac434.jpg"
    },
    {
        "podcast_id": 161880,
        "title": "The Kinsmen Die Podcast",
        "description": "<p>Welcome to the Kinsmen Die podcast, home of fantasy fiction based on Norse mythology that’s written and read by me, Matt Bishop.</p><p>I’ve written two novels – <a href=\"https://www.amazon.com/stores/Matt-Bishop/author/B073NK4HDC\"><em>Kinsmen Die</em> and <em>Dark Grows the Sun</em></a>. They are the first two books in my series called And the Heavens Burn. In this podcast I read my first book, Kinsmen Die, chapter by chapter. </p><p>I believe I’ve done something unique when it comes to the retelling those old stories. The point of view characters in my books are the characters from the myths themselves: Odin and Frigg. Vidar. Hodr. Loki. And, because the dude is awesome and has a really tough name to pronounce: Vafthrudnir.</p><p>Everything you’ll hear is based on my interpretation of the two main source materials – the <em>Poetic Edda</em> and the <em>Prose Edda</em>, along with a stack of books that discuss the myths … and another stack of academic articles that do the same.</p><p>Kinsmen Die has 92 chapters. Dark Grows the Sun is about half that. So, this is gonna take a while. I truly hope you enjoy the journey.</p>",
        "language": "en",
        "author_name": "Matt Bishop",
        "slug": "fensalirpodcast-kinsmendie",
        "cover": "20221027_081004_e2df286e7ca556c7a1a040600bf88dc2.jpg"
    },
    {
        "podcast_id": 162009,
        "title": "Historias en un Podcast",
        "description": "Sean bienvenidos a historias en un podcast en donde contaremos relatos, anécdotas, y sucesos que te estremecerán....\n\nTodos los jueves tendremos nuevo contenido!\n",
        "language": "es",
        "author_name": "HistoriasEnUnPodcast",
        "slug": "historias-en-un-podcast",
        "cover": "20221020_091015_aef1f94f30ba47c769a8cb1fb62879f5.jpg"
    },
    {
        "podcast_id": 162307,
        "title": "The Write Turn",
        "description": "Have you ever asked yourself questions like these: When do I show, when do I tell? What does effective dialogue sound like? How do I tell my readers about my awesome worldbuilding?! Author Jordan M. Griffin takes you through the ins and outs of writing powerful stories, shares her experience navigating the tricky world of publishing, and even reads some of your stories, all with a side of humor that make the lessons fun and digestible.\n\nJordan M. Griffin is an author and fiction editor. Her stories have been published in Night Picnic Press, Planet Scumm Magazine, and Embark Literary Journal, among others. She has been shortlisted for the 2022 Lascaux Flash Fiction Contest and longlisted for the 2021 Novel Slices Summer Contest. She is also an associate fiction editor with The Northwest Review. You can find more at https://jordanmgriffin.com/",
        "language": "en",
        "author_name": "Jordan M. Griffin",
        "slug": "writeturn",
        "cover": "20221111_081134_d1eb1e200e31fcde1ade762de12566cd.jpg"
    },
    {
        "podcast_id": 163325,
        "title": "moderate.",
        "description": "In everything you do, do it in moderation.",
        "language": "en",
        "author_name": "moderate.",
        "slug": "moderate",
        "cover": "20221026_021014_57b7074d402e5dace2f44b878ff32a2b.jpg"
    },
    {
        "podcast_id": 163329,
        "title": "Bizzo's Holiday Secret",
        "description": "Bizzo’s Holiday Secret is the magical story of a dog matriarch, Bizzo, and her two young companions, Bindi and Crikey.  In winter, during the time of the white fluff, legend tells of a supernatural two-legger who leaves toys and treats for animals everywhere on one special night.  After encountering this magical being, Bizzo begins a fantastical journey of discovery, leading to an incredible holiday secret she can share.  ",
        "language": "en",
        "author_name": "Bonzer Productions™",
        "slug": "bizzosholidaysecret",
        "cover": "20221026_021030_0084cafc1f5d7b728dc0ba84859efee2.jpg"
    },
    {
        "podcast_id": 163380,
        "title": "Skrivelyst podcast",
        "description": "Podcasten for dig der godt kan lide at lytte til noveller og kortprosa. En gang om måneden kan du lytte til oplæsning af vores egne noveller og vores refleksioner over skriveprocessen, som de er blevet til i. Hver gang har vi et nyt emne, som vi begge skriver om, og hver gang mødes vi og læser novellerne op for hinanden. Vi har også altid sprog-gaver med til hinanden - pakket ind naturligvis. \nFølg os også på Facebook @skrivelystpodcast og Instagram @skrivelyst _podcast\nVi håber, I vil lytte med \nKærlig hilsen\nJannie og Malene ",
        "language": "da",
        "author_name": "Jannie og Malene",
        "slug": "skrivelystpodcast",
        "cover": "20221026_071017_9e96a8b79e7af0b86bef45920d0e0851.jpg"
    },
    {
        "podcast_id": 163776,
        "title": "Terriloquus - Podcast horreur",
        "description": "Bienvenue sur Terriloquus, votre rendez-vous hebdomadaire angoissant.\n\nDécouvrez avec nous des fictions effrayantes, des histoires d'horreur et autres creepypastas glanées en ligne ou encore des légendes urbaines qui viennent du monde entier... N'hésitez pas à vous abonner pour ne manquer aucun de nos contenus !\n\nInstallez-vous confortablement et laissez-vous porter par notre narration dans ce podcast d'horreur. Frissons garantis ;)\n\n#histoires #horreur #angoisse #creepypasta #paranormal #fantome #mystere - Tout y est !",
        "language": "fr",
        "author_name": "Terriloquus",
        "slug": "terriloquus",
        "cover": "20221028_101054_acea55301380c8265147444d5b9030e0.jpg"
    },
    {
        "podcast_id": 168886,
        "title": "They Watch At Night",
        "description": "<p>A spooky scary skeleton podcast that delves into all things that go bump in the night. Our three intrepid investigators; Joe, Tyler, and Ben are going to examine and explore movies, cryptids, and other sources of the frightfully mysterious. Sit back and don't relax, welcome to They Watch at Night.</p>",
        "language": "en",
        "author_name": "Joseph Kauffman, Tyler Callaway, and Ben Ŗ̴̧̟̝͈̟͐̉̈́͊͑̉͘͠ä̸̼͉́̌̿̌͊̀̅v̴̯̠̩͍̭͍̰̜̝͚̤̖͚̈́͊͐͝ë̷͈͎̱̩̔̄͐̈̕̚n̷͔̱̜͔̺̩̝̹͋͜s̴̗͚̰̤̩̥͔̟̤̟̑́̌̈̑̑́̓̀̽̕͠l̸̥̞̠̬̀̄̓̽͑̒̈́̋̿͝͝a̸̧̛̯̤͈̘̻̬̗͎͎̣͜͝͝i̸̧̡̳̱̬͚̘͙̼̝͚͇̞̪͌̈́͌͒͗ͅŗ̴̢̘̦̮̮͔̣̥̬̘̼͋̽͂̅̏̍͊̚ͅ",
        "slug": "theywatchatnight",
        "cover": "20221118_031137_81c2e1e381040205b310678774226534.jpg"
    },
    {
        "podcast_id": 171263,
        "title": "NODO SUR",
        "description": "<p>LA HISTORIA DE SOLARI TRAS UNA DECEPCION</p>",
        "language": "es-mx",
        "author_name": "SOLARI",
        "slug": "nodosur",
        "cover": "20221129_051123_3885ce4ee7f830ef87c29827057ca154.jpg"
    },
    {
        "podcast_id": 171288,
        "title": "The Idle Ink Podcast",
        "description": "Idle Ink is an online magazine which publishes the best in weird fiction on a monthly basis. On this podcast, editor J.L. Corbett chats to some of the writers whose work has appeared in Idle Ink the past, and attempts to get to know them as people, not just as writers. \n\nwww.idleink.org",
        "language": "en",
        "author_name": "J.L. Corbett",
        "slug": "idleink",
        "cover": "20221129_061150_ea11276afd0e48348341a716bfb1358c.jpg"
    },
    {
        "podcast_id": 171472,
        "title": "Comic Book Cinema",
        "description": "<p>Bringing YOU the Best Comic Book Movie Content!</p>",
        "language": "en",
        "author_name": "Comic Book Cinema",
        "slug": "comicbookcinema",
        "cover": "20221130_031118_45013a2abfffd94a85f99903af826fe4.jpg"
    },
    {
        "podcast_id": 174741,
        "title": "Far Out Dudes",
        "description": "<p>Welcome to Far Out Dudes! A Podcast born from a joke around a dinner table where your hosts Joseph, Paul and Jacob each bring a subject to discuss, question and put our own twist on. New episodes weekly - Do you have a favorite conspiracy, personal story or far out subject? Send us an email and tell us more, it may be on the next podcast! faroutdudespodcast@gmail.com</p>",
        "language": "en-us",
        "author_name": "Far Out Dudes",
        "slug": "faroutdudes",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 175792,
        "title": "Historias que escuché por ahí",
        "description": "Una recopilación de historias que he escuchado a lo largo de los años, algunas de ellas dejarán un mensaje a tu vida, algunas otras solo te harán pasar un buen rato",
        "language": "es",
        "author_name": "Jona Vargas",
        "slug": "historias-que-escuche-por-ahi",
        "cover": "20221222_061232_0a475ad0a141cc8c4b95d432a14fc285.jpg"
    },
    {
        "podcast_id": 176594,
        "title": "The Worldsinger's Guide to the Cosmere ",
        "description": "A podcast discussing books from Brandon Sanderson's Cosmere Universe. Come here for everything from where to start reading, to who would win in a Contest of Champions, and everything in between. We will be discussing The Stormlight Archive, Mistborn, and everything Cosmere. Expect spoilers ahead",
        "language": "en",
        "author_name": "Jason and Gigi",
        "slug": "theworldsingersguide",
        "cover": "20221228_071214_bbe7983229caccf1bbe862b93b24087b.jpg"
    },
    {
        "podcast_id": 177531,
        "title": "Festered Thoughts",
        "description": "<p>Join two sisters and their brother, two gen Z's and one millennial, every Wednesday as one passes on their chosen ghastly topic to the other for the day. The topics vary in everything from creepypastas, murders, anything paranormal, urban legends, and cold cases.</p>",
        "language": "en",
        "author_name": "Festered Thoughts",
        "slug": "festeredthoughts",
        "cover": "20230822_010809_0ce4ea74782b9299dcfe2af2fd91c42a.jpg"
    },
    {
        "podcast_id": 178479,
        "title": "The SmutHub Podcast",
        "description": "Two content creators (Lemonade Stxnd and Sageafterdark) talk fanfic, fantasy, and creativity with our friends and fellow creatives from the world of fandom.",
        "language": "en",
        "author_name": "Michelle Turner",
        "slug": "smuthub-podcast",
        "cover": "20230105_090124_9a08f02bef83fa61d9c94f2f01f11d01.jpg"
    },
    {
        "podcast_id": 178881,
        "title": "Infinitely Distracting",
        "description": "<p>Each Sunday, tune in for the next chapter of \"Infinitely Distracting\", written and read aloud by Peter Loveday, writer and singer-songwriter. (Cover photo by Bleddyn Butcher. All other photos and music by Peter Loveday.)</p>",
        "language": "en",
        "author_name": "Peter Loveday",
        "slug": "infinitelydistracting",
        "cover": "20230117_080116_09c78b8eccb4b3024cc172a113d64f7e.jpg"
    },
    {
        "podcast_id": 183218,
        "title": "Poor Man's Lore ",
        "description": "<p>Hey All, my name is Kevin Cote and I'm creating a podcast where I discuss magic lore in a fairly casual, easygoing way, it is what it is, tune in if you want to learn more!</p>",
        "language": "en",
        "author_name": "Kevin Cote",
        "slug": "poormanslore",
        "cover": "20230316_050337_6e5a4a12735a7c2ffe3e03d36a91a54c.jpg"
    },
    {
        "podcast_id": 186259,
        "title": "Three Men In A Kitchen Wireless Hour ",
        "description": "Words, Music and Breathing",
        "language": "en",
        "author_name": "Wylderbeats Stories",
        "slug": "threemeninakitchen-wireless-hour",
        "cover": "20230203_050233_6b20f6aa301b83f6b7a47ad571f3e29c.jpg"
    },
    {
        "podcast_id": 191092,
        "title": "Smutty Scriptures",
        "description": "<p>Welcome to the \"Smutty Scriptures\" podcast, hosted by three best friends and avid readers Blue Cromwyll, ACuddlefish, and Purple_spacecat. </p><p>With their sharp wit and infectious humor, these three book-loving buddies take a lighthearted approach to their discussions, tackling everything from steamy love scenes to ridiculous plot twists with equal parts enthusiasm and laughter. Along the way, they'll share their favorite moments, poke fun at the genre's more outlandish elements, and offer plenty of hot takes and hilarious commentary on the \"Sacred Texts\" that are all things fantasy. </p><p>Whether you're a die-hard fan of fantasy romance or just looking to dip your toes into the genre, this podcast is the perfect companion for any reader. So grab a cup of tea, cozy up with a good book, and join the conversation with \"Smutty Scriptures\"!</p>",
        "language": "en",
        "author_name": "Blue Cromwyll, ACuddlefish, & Purple_Spacecat",
        "slug": "smuttyscriptures",
        "cover": "20230220_080250_7a8abb276b78a3d59f136628446a0d24.jpg"
    },
    {
        "podcast_id": 193202,
        "title": "Spaghetti Launchers: A worldbuilding podcast",
        "description": "<p>This is Spaghetti Launchers, a worldbuilding podcast where we throw spaghetti at the wall and it’s up to you what sticks. Each episode we go in-depth on an element of fictional worlds, breaking it down and developing unique examples live on the fly to give you ideas you can copy, steal, or be inspired by. Whether you’re a writer, a GM, or an all-around nerd goblin just looking to indulge your imagination, we’ve got you covered.</p><p>Music credit: Danijel Zambo</p>",
        "language": "en",
        "author_name": "SLAWPY",
        "slug": "spaghetti-launchers",
        "cover": "20230228_040252_879a03055254964db28f6da5dea0e757.jpg"
    },
    {
        "podcast_id": 193957,
        "title": "Tales From The Forest",
        "description": "<p>A TTRPG podcast centered around new and interesting stories.</p>",
        "language": "en",
        "author_name": "Eli Hatcher",
        "slug": "talesfromtheforest",
        "cover": "20230303_040333_b02569b3c5795f86e4425254d6f8d367.jpg"
    },
    {
        "podcast_id": 194055,
        "title": "Storm King's Thunder",
        "description": "<p>The Scarlet Bard regales the tale of the Storm King's Thunder.</p>",
        "language": "en",
        "author_name": "Ross Camsell Voiceover",
        "slug": "dainorsskt",
        "cover": "20230303_010322_8e4e897cde7a32ebe43b4d8186119212.jpg"
    },
    {
        "podcast_id": 196055,
        "title": "The Tome Travelers",
        "description": "<p>Welcome to The Tome Travelers! A monthly Sci-Fi/Fantasy book club podcast.</p>",
        "language": "en",
        "author_name": "The Tome Travelers",
        "slug": "thetometravelers",
        "cover": "20230311_010318_5751169b4122c585fb412f763a3f7d63.jpg"
    },
    {
        "podcast_id": 198269,
        "title": "The Morning J Show",
        "description": "<p>The Morning J Show</p>",
        "language": "en",
        "author_name": "Bussey ",
        "slug": "morningjshow",
        "cover": "20230321_010321_34e5a58e3a1e912ea02d7f945ce22bdb.jpg"
    },
    {
        "podcast_id": 198704,
        "title": "The Age of the Rings, audio companion",
        "description": "<p>Audio Companion designed to be enjoyed alongside the Silmarillion and the Unfinished Tales.</p><p>The is not associated, commissioned or endorsed by the Tolkien Estate. This is a fan-creation for, and only for, those who own a legal copy of the Silmarillion AND Unfinished Tales, or the respective audio books.</p><p><a href=\"https://discord.gg/pk6fvcrUz4\">https://discord.gg/pk6fvcrUz4</a></p><p>Credits -----------------</p><p>Showrunners/Writing - <strong>Soronúmë, SEMZYIRI</strong></p><p>Narration - <strong>Moth Mercer, Azaram, Callmewitchking, and SEMZYIRI</strong></p><p>Composition - <strong>ISILME</strong></p>",
        "language": "en",
        "author_name": "Soronúmë, SEMZYIRI",
        "slug": "theageoftherings",
        "cover": "20230322_080313_f5d2a40a2a515722012b4663e1ecd0d5.jpg"
    },
    {
        "podcast_id": 200182,
        "title": "¿por qué lloran las cebollas?",
        "description": "<p>Lloremos, digo oremos, digo ¡hola! Estás entrando a un experimento social... veremos qué tanto me aguanta la sociedad con esta nueva aventura con llanto, crisis, risas y muchos muchos fun facts.</p>",
        "language": "es",
        "author_name": "Dante Prado",
        "slug": "porquelloranlascebollas",
        "cover": "20230330_070307_cc5a070ac06606b4a7bc407b1adcd19c.jpg"
    },
    {
        "podcast_id": 200271,
        "title": "Misterios en la hoguera",
        "description": "<p>Acércate al calor del fuego y déjame contarte una historia sobre sociedades secretas, extraños misterios, lugares ocultos y áreas prohibidas. Aunque debo avisarte de que lo que escuches no te dejará indiferente. Vivimos entre aliens? ¿Cuánta verdad hay en la historia? existió de verdad la edad media? Si quieres saber lo que ocurrió, quédate y escucha atentamente los misterios en la hoguera.</p>",
        "language": "es",
        "author_name": "Cristina",
        "slug": "misteriosenlahoguera",
        "cover": "20230330_030317_ec1fdcd5bea898b9ab3e7db66f44e788.jpg"
    },
    {
        "podcast_id": 202225,
        "title": "La Stanza Dell Horror (creepypasta ITA)",
        "description": "<p>benvenuti in questo nuovo podcast, godetevi le creepy e spaventatevi </p>",
        "language": "it",
        "author_name": "Andrea La Stanza Del Horror",
        "slug": "lastanzadellhorror",
        "cover": "20230409_080455_a1276281209b2fcd01a84aa5d1edfb9c.jpg"
    },
    {
        "podcast_id": 204104,
        "title": "The Wiccan Rede - Discover the Magic Within",
        "description": "<p>Welcome to \"The Wiccan Rede\" podcast, the enchanting platform where we \"Read the Magic\" and unveil the hidden wisdom of Wiccan philosophy through the spellbinding art of storytelling. Your mystical guide, Celeste Ravenshadow, transports you into a realm of myth and magic with each captivating episode, shedding light on the wonders and mysteries of the Craft.</p><p>In collaboration with <a href=\"http://www.thewiccanrede.com\"><strong>www.thewiccanrede.com</strong></a>, your gifted authors share their mesmerizing short stories, brought to life by Celeste's captivating narration. Whether you're a curious seeker or a seasoned practitioner, \"The Wiccan Rede\" podcast is your gateway to the magical world of Wicca, helping you connect with the rhythms of nature one enthralling tale at a time.</p><p>Why join us on this mystical journey? Here are the benefits you'll enjoy:</p><ul><li><p>Discover ancient wisdom through spellbinding storytelling</p></li><li><p>Enhance your spiritual practice with practical insights</p></li><li><p>Connect with a like-minded community of Wiccan enthusiasts</p></li><li><p>Explore the hidden depths of Wiccan philosophy and its day-to-day applications</p></li><li><p>Immerse yourself in the enchanting world of myth and magic</p></li></ul><p>Embrace the magic as you light a candle, sip a warm cup of tea, and immerse yourself in the ancient wisdom woven throughout each episode. Subscribe to \"The Wiccan Rede\" on your favorite podcast platform and become a part of our mystical community on social media, where we delve even deeper into the lore and lessons of Wiccan wisdom.</p><p>So, are you ready to embark on this mesmerizing adventure? Join Celeste Ravenshadow and allow the magic of \"The Wiccan Rede\" podcast to whisk you away into a world of wonder and enchantment.</p><p></p>",
        "language": "en",
        "author_name": "Celeste Ravenshadow",
        "slug": "thewiccanrede",
        "cover": "20230419_060452_5edcce8f7072fb2cb18271445871a396.jpg"
    },
    {
        "podcast_id": 208594,
        "title": "Crann Bethadh Stories and Poetry",
        "description": "<p>A weekly podcast where I read stories and poetry I gather from writers around the world. Stories about scary things, daring do and ancient heroes. I throw in a little gael and Irish music to make it feel more like a Irish seanchai telling stories under the digital village oak tree.</p>",
        "language": "en",
        "author_name": "T. O'Domhnaill",
        "slug": "the-crann-bethadh-podcast",
        "cover": "20230914_050958_e679042c57640b7c8c9a2c7ed816b25e.jpg"
    },
    {
        "podcast_id": 211353,
        "title": "Fate Points - Audio Book",
        "description": "<p><strong>Fantasy AUDIOBOOK with Full Cast Narration.</strong></p><p>5 episodes per week.</p><ul><li>60 hours of content already written with 1.5 to 2 hours published weekly.</li><li>Novel has over 3 million views on Royal Road and 1000s of reviews.</li><li>Each episode is produced by the author and the characters reflect my vision</li><li>The entire multiple book series will be published a hundred percent for free.</li><li></li></ul><p><strong>Synopsis.</strong></p><p><strong>The fate of humanity did not rest on Tom, but it sure felt like it. Then again, despite their numbers all the chosen felt the same way.</strong></p><p>The trial, the tutorial, or whatever you wanted to name it, was over. After forty long solitary years spent mastering the system, Tom, with his abilities reset was going to have to do it all again to save humanity.</p><p>The cost of failure would have an unimaginable impact on his friends and family. His sacrifices had propelled him into the top million, giving him the opportunity to make a difference. And he had a risky plan to do so.</p><p>Against their will, humanity had been chosen, and all Tom could do was to work with the system.</p><p>Universe spanning gods ran a regular competition on a world called Existentia where they pitted seven species from different universes all of whom have dominated their home planet against each other.</p><p>But a straight-out fight would be too simple. Existentia is a living, breathing, impossibly large, magical world with existing empires, secrets, dungeons and trials. The seven races in the current iteration of the competition have their own unique advantages to exploit, but first they have to survive long enough to show their worth.</p><p>Fate points is a third person single POV litrpg with a unique system and mechanics and strong, complicated side-characters.</p><p>Voices are AI powered but you can barely tell.</p><p>If you want to support me advanced chapters are available on patreon</p><p><a href=\"https://www.patreon.com/FatePointsAudio\">https://www.patreon.com/FatePointsAudio</a></p><p>Or if you want to tip me/ buy me a coffee you can do it via Ko-fi</p><p><a href=\"https://ko-fi.com/fatepoints\">https://ko-fi.com/fatepoints</a></p>",
        "language": "en",
        "author_name": "Allan Greenwood",
        "slug": "fate-points",
        "cover": "20230813_090806_0c67fcdd77e30fdfddf75130c4d3dd2a.jpg"
    },
    {
        "podcast_id": 215389,
        "title": "Liquid Lineage ",
        "description": "<p>A lot happens between wealth, war, and the forest line. Slide down the solid gold rabbit hole and what do you find? In this mystical mystery of sacrilege and sacrifice, you may just stumble upon more questions than answers.</p><p>Liquid Lineage is written by Cassidy Cook.</p><p>All rights reserved.</p>",
        "language": "en",
        "author_name": "Cassidy Cook",
        "slug": "liquidlineage",
        "cover": "20230615_090644_03edce65da5c6e1aca985a93f8214c39.jpg"
    },
    {
        "podcast_id": 215398,
        "title": "Farsighted ",
        "description": "<p>1979 was the beginning of a four year long downwards spiral for Ed, a high-ranking rookie researcher for SRI-International. Unbeknownst to everyone around him, his obsessions are slowly consuming him, or should I say, obsession. </p>",
        "language": "en",
        "author_name": "Cassidy Cook",
        "slug": "farsighted",
        "cover": "20230615_100656_14f3c517837fcd0bd59b20591e6d0d3b.jpg"
    },
    {
        "podcast_id": 215517,
        "title": "Technomancers: A D&D podcast",
        "description": "<p>Welcome to Technomancers, the thrilling Dungeons and Dragons podcast set in the mesmerising City of Everlight! Join us on an unforgettable journey as we delve into a world where magic and technology coexist in perfect harmony (or will it?). Led by our Dungeon Master - Ivan Brett</p>",
        "language": "en",
        "author_name": "Elastacloud Limited",
        "slug": "technomancers",
        "cover": "20230814_030850_04203815f457b886eb5eaf50f1be7d95.jpg"
    },
    {
        "podcast_id": 216976,
        "title": "Uduak Isong Podcast",
        "description": "<p>Podcast by <a href=\"https://www.uduak-isong.com/\">Uduak Isong</a></p><p>Award winning filmmaker &amp; screen writer.</p>",
        "language": "en",
        "author_name": "Uduak Isong",
        "slug": "uduak-isong",
        "cover": "20230627_030616_c9f6626ef4034be833fb362287749fb4.jpg"
    },
    {
        "podcast_id": 217266,
        "title": "Freakultura",
        "description": "<p>Toda la actualidad friki también en nuestro pódcast.</p>",
        "language": "es",
        "author_name": "Pau Hernández",
        "slug": "freakultura",
        "cover": "20230727_050707_914ca0898e1da41fc0ab762fe4799a23.jpg"
    },
    {
        "podcast_id": 217293,
        "title": "VO Nonsense",
        "description": "<p>A podcast where stories leap off the page and straight into your ears. Steven Daniel brings together talented actors and immersive sound effects to create audio dramas that transport you straight into the heart of the narrative.</p><p>Each season of 'VO Nonsense' resurrects the golden age of radio plays with a modern twist. From well-loved books and gripping graphic novels to compelling scripts, we breathe life into a diverse range of stories. Our audio dramas encompass a spectrum of genres, from mystery to romance, from fantasy to sci-fi, ensuring there's something for every listener.</p><p>We aim to create a rich, auditory experience that engrosses you in the plot and makes you feel part of the story. Our audio dramas are designed to stimulate your imagination, evoke emotions, and create a cinematic soundscape that makes every tale an unforgettable journey.</p><p>Join me on 'VO Nonsense' as we spin tales and paint worlds using the power of sound and the art of storytelling. Whether you're a fan of radio plays, an avid book reader, or just someone who enjoys good stories, this is your ticket to a world of auditory adventure.</p>",
        "language": "en",
        "author_name": "AP&M Group",
        "slug": "vononsense",
        "cover": "20230629_100611_06b60d9bf2049bba2912cdc18bb93657.jpg"
    },
    {
        "podcast_id": 217713,
        "title": "കാലം പറഞ്ഞ കഥകള്‍! | Malayalam Mystery & Horror Podcast | By JoeFos | foSTORY",
        "description": "<p>Mystery | History | Psychology | Science | Fiction | Stories | Horror</p><p>By JoeFos</p>",
        "language": "ml",
        "author_name": "JoeFos",
        "slug": "fostory",
        "cover": "20230702_040737_75af4a8867c557eb58b1730a0d983310.jpg"
    },
    {
        "podcast_id": 217845,
        "title": "Short Story Today ",
        "description": "<p>A weekly podcast hosted by Jon DiSavino. It celebrates the enduring and compact literary form known as - you guessed it - the short story. But more importantly, it gives listeners an opportunity to hear the work of some of the best emerging writers of today. Each episode begins with an interview with the week's guest author, and ends with a professional audiobook production of a story by that author.</p>",
        "language": "en",
        "author_name": "John DiSavino",
        "slug": "shortstorytoday",
        "cover": "20230703_040700_9273a92af641851c3134e52ed2e6e285.jpg"
    },
    {
        "podcast_id": 218774,
        "title": "Du Bout des Lèvres (DBDL)",
        "description": "<p>Du Bout Des Lèvres est un podcast où l'on ne parle pas de poésie ou de théâtre. On laisse parler le théâtre, les mots, en espérant qu'en atteignant vos oreilles, ils touchent votre coeur.</p><p>Voici des mots écrits il y a fort longtemps ou peu de temps. Par des hommes, par des femmes. Des mots écrits pour être dits, pour être entendus, pour être vécus. Des mots doux, des mots forts. Des mots qu'on a envie de prononcer juste du bout des lèvres.</p><p>Crédits : <em> Logo : STUDIO RAPPEL </em> Mixage : Benjamin Storey <em> Jingle arrangements : Kahina Lamblin </em> Jingle Fredonnement (voix) : Lise Ruault <em> Jingle interprétation (piano) : Benjamin Storey </em> Réalisation, production et voix : Léa Mounier</p>",
        "language": "fr",
        "author_name": "Léa Mounier",
        "slug": "duboutdeslevres-dbdl",
        "cover": "20230710_010755_9c27b651d4c119daff423c2290743a9b.jpg"
    },
    {
        "podcast_id": 219329,
        "title": "Short Change Stories",
        "description": "<p>Short Change Stories are fiction and nonfiction, humanist, raw, and inspired by music. Narrator \"Frida Kegel\" invites you into her mind's eye and heart.</p>",
        "language": "en",
        "author_name": "Frida Kegel",
        "slug": "fridakegel",
        "cover": "20230713_060709_56642a6a94d1b8defdc3e2db9a4531e4.jpg"
    },
    {
        "podcast_id": 219916,
        "title": "قصه های کوتاه از هیربد هیومن",
        "description": "<p>من هیربد هستم و قصد دارم به صورت کاملا نامنظم و حسی بخشی از مجموعه قصه های کوتاهم را در این پادکست برای فارسی زبانان سرار دنیا منتشر کنم. امیدوارم بتوانم با استفاده از قدرت تخیل خودم و شما اوقات خوبی را برایتان فراهم کنم</p><p>خوشحال میشوم از طریق وبسایت یا شبکه های اجتماعی مجازی نظرات شما را بشنوم و بخوانم</p><p><a href=\"https://linktr.ee/hirbod\">دسترسی به وبسایت</a></p>",
        "language": "fa",
        "author_name": "Hirbod Human",
        "slug": "hirbod",
        "cover": "20230718_030757_a8640ec678eba71d51ca6095c2129807.jpg"
    },
    {
        "podcast_id": 220848,
        "title": "Untrue Crime",
        "description": "<p>Love true crime but don't love the \"true\" bit? Maybe it's that you are unsettled by it being fact. Maybe you don't like the dramatization of traumas real people suffered. Untrue Crime is a perfect fit for you!</p><p>We tell fictional stories in a variety of settings and times of murder, mystery, and intrigue. Whether you are looking for magical misdemeanors, sci-fi white collar crime, or something more realistic, we have stories to tell you.</p>",
        "language": "en",
        "author_name": "Alexandria Parker and Belle Dewing",
        "slug": "untruecrime",
        "cover": "20230817_020826_474edea6eb60d77a85a775d9c8e7465a.jpg"
    },
    {
        "podcast_id": 221116,
        "title": "Sea Of Stars",
        "description": "<p>A universe of worlds where anything is possible, and all stories can be told. An actual play podcast feed. Currently running weekly episodes of the 'Risk and Reputation' saga!</p>",
        "language": "en",
        "author_name": "Andy Lou Media",
        "slug": "seaofstars",
        "cover": "20230725_050756_8026720bdf0b06e4ae038482356766a7.jpg"
    },
    {
        "podcast_id": 222146,
        "title": "Céleste - Ne dormez pas la nuit",
        "description": "<p>Céleste, de son vrai nom, Caelestia, est décédée de manière atroce. Elle s’est noyée dans une rivière alors qu’elle n’avait que 23 ans. Pendant son agonie, elle fit la rencontre d'une entité démoniaque qui lui a donné des pouvoirs maléfiques. Depuis, elle possède des hommes et des femmes pendant leur sommeil.</p>",
        "language": "fr",
        "author_name": "Le Sombre Messager",
        "slug": "lesombremessager",
        "cover": "20230803_120818_fc0f697bd422edea42d39f8914b91685.jpg"
    },
    {
        "podcast_id": 222168,
        "title": "Komasan Theme",
        "description": "<p>Komasan Theme from Yo-Kai Watch lol</p>",
        "language": "en",
        "author_name": "Maya",
        "slug": "komasan",
        "cover": "20230801_090854_b271e56496b51272492bd72de811a30f.jpg"
    },
    {
        "podcast_id": 222373,
        "title": "L'appartement 69",
        "description": "<p>Le Sombre Messager vous raconte l’histoire d’un couple qui emménage dans un appartement avec des entités qui ne souhaitent pas les avoir pour compagnie.</p>",
        "language": "fr",
        "author_name": "Le Sombre Messager",
        "slug": "le-sombre-messager-appartement-69",
        "cover": "20230803_100801_c53758adb30b244afbdf6306dd03d85d.jpg"
    },
    {
        "podcast_id": 222424,
        "title": "La roulette Russe - Des vacances pas comme les autres",
        "description": "<p>Le Sombre Messager vous raconte l’histoire d’un groupe d’amis qui part en voyage. Un voyage où une histoire dramatique se profilera peu à peu pour ceux qui voulaient jouer leurs vies sur le fil du rasoir.</p>",
        "language": "fr",
        "author_name": "Le Sombre Messager",
        "slug": "le-sombre-messager-roulette-russe",
        "cover": "20230822_110836_bf6b03a828d241da69ae9a6dcbbb9461.jpg"
    },
    {
        "podcast_id": 222866,
        "title": "Moonlit Alley",
        "description": "<p>We are Moonlit Alley, and in our Genshin Impact podcast we whisk you away to the beautiful world of Teyvat. Through rich prose and narration we take you on leisurely walks or invite you to sit and observe the beautiful scenery we bring to life, offering a moment of reprieve and calm in your day-to-day life.</p>",
        "language": "en",
        "author_name": "moonlitalleycast",
        "slug": "moonlit-alley",
        "cover": "20230814_090856_e56fc3d5adea2b62f3acf665017cfc3d.jpg"
    },
    {
        "podcast_id": 224167,
        "title": "Radio Razaloo",
        "description": "<p>رازآلو، پادکستی با محوریت داستان است. اما نه هر داستانی! آن داستان‌هایی که به‌اصطلاح بهشان داستانِ ژانر می‌گوییم. همان داستان‌هایی که دیو و پری تویشان کله‌معلق می‌زند. اسب‌های تک‌شاخ آرزوها را برآورده می‌کند و سیمرغ، زال و رستم را از دل خطر بیرون می‌کشد. در رازآلو قرار است با داستان‌های فانتزی همراه بشویم، آن‌ها را بشناسیم و حتی از این داستان‌ها تکه‌هایی بشنویم.</p>",
        "language": "fa",
        "author_name": "محمد فائزی فرد",
        "slug": "razaloo",
        "cover": "20230817_010843_8bd3ac472e645de7d3d21a08cbafff4b.jpg"
    },
    {
        "podcast_id": 224179,
        "title": "Binge worthy banter💫",
        "description": "<p>Hey guys! This is Zoha and Diksha this side. A few months back, in Ramadan, a show about fairy tales,prince,princess and their love story got us together!</p><p>This season we wanna record everything we feel about it and so here we are.</p><p>Join us and listen to us fangirl about Farjaad and Umeed from Fairytale currently! 🌺❤</p>",
        "language": "en",
        "author_name": "Zoha Sadaqat, Diksha Gupta",
        "slug": "bingworthybanter",
        "cover": "20230815_020837_f4c135c69abf70f56c5c56aeae81200f.jpg"
    },
    {
        "podcast_id": 224474,
        "title": "TAMonster Reads",
        "description": "<p>I read stuff, and react to it. Pretty fun. Come join me in the next adventure!</p>",
        "language": "en",
        "author_name": "The Accidental Monster",
        "slug": "tamreads",
        "cover": "20230817_060837_ced2bba2849be0aead1c4bca9436e346.jpg"
    },
    {
        "podcast_id": 224583,
        "title": "youtubers93s",
        "description": "<p>about a youtuber with 93 assets.</p>",
        "language": "en",
        "author_name": "you",
        "slug": "youtubers93s",
        "cover": "20230817_100824_7d7b0e4795cc3aba76994f746db13d72.jpg"
    },
    {
        "podcast_id": 224980,
        "title": "Where’s My Lit?",
        "description": "<p>Instagram : @srirachaontoast</p><p><a href=\"https://www.etsy.com/shop/maiartgarden\">Etsy store for my art:</a></p>",
        "language": "en",
        "author_name": "Mai",
        "slug": "wheresmylit",
        "cover": "20230820_060815_c693d3fc40cdd5f3092ca9606abaac8c.jpg"
    },
    {
        "podcast_id": 225504,
        "title": "Los Libros Ausentes",
        "description": "<p>Audiolibros maravillosos que no suelen incluirse en podcast: Literatura (Cuento y Novela, Aventuras, Biografías, Ciencia Ficción), Ensayos, Ciencia, Historia, Educación, Sociedad y muchos temas más. Cualquier comentario, duda, petición, reclamación y lo que nos quieran decir civilizadamente, pueden hacerlo a cosmos02@yahoo.com</p>",
        "language": "es",
        "author_name": "Leticia y Luis Manuel",
        "slug": "loslibrosausentes",
        "cover": "20230823_050835_a04b67b2b28e4147f67ecf525fbe36a4.jpg"
    },
    {
        "podcast_id": 225897,
        "title": "Kyros Reborn",
        "description": "<p>Recordings of our game</p>",
        "language": "en",
        "author_name": "Neko",
        "slug": "kyrosreborn",
        "cover": "20230908_110907_cbeb7283711e0d29a713ad3a74e07fe7.jpg"
    },
    {
        "podcast_id": 225924,
        "title": "TheWriter'sMuse ",
        "description": "<p>\"Welcome to The Writer's Muse Podcast, where inspiration and creativity intertwine to ignite your literary journey. Join us as we delve into the minds of authors, poets, and wordsmiths, unraveling the threads of their creative process and the sources of their artistic inspiration. Whether you're a seasoned writer or a budding wordsmith, this podcast is your sanctuary for insights, prompts, and captivating conversations that will breathe life into your writing endeavors. Tune in to explore the depths of imagination, learn from literary luminaries, and discover your own writer's muse. Unleash your creativity with The Writer's Muse Podcast.\"</p>",
        "language": "en",
        "author_name": "Isah Abdulssamad",
        "slug": "thewritersmuse",
        "cover": "20230826_100859_63654069603f57325a4afed1e76f36c6.jpg"
    },
    {
        "podcast_id": 227324,
        "title": "Victoria Rose Black Podfic",
        "description": "<p>Just a voiceover beginner finding my footing by reading fanfiction. The world needs more recorded fic anyways.</p>",
        "language": "en",
        "author_name": "Victoria Rose Black",
        "slug": "victoriaroseblackpodfic",
        "cover": "20230905_030909_ba6a171fd8ff597d3a0959fe9fe1e071.jpg"
    },
    {
        "podcast_id": 227489,
        "title": "salil al sawarim",
        "description": "<p>great podcast</p>",
        "language": "en",
        "author_name": "swords",
        "slug": "arabswords",
        "cover": "20230906_050905_a699fa823799cf0446dd1ad8cd290af9.jpg"
    },
    {
        "podcast_id": 229079,
        "title": "Wouldn't Dream of It",
        "description": "Wouldn't Dream of It tells the stories of my dreams and their interpretations. Throwing in some superstitions, omens, and some not-so-serious astrology rounds out a sort of paranormal comedy show.",
        "language": "en-us",
        "author_name": "Eliza Jones",
        "slug": "wouldnt-dream-of-it",
        "cover": "podcast_cover.jpg"
    }
]