[
    {
        "podcast_id": 8181,
        "title": "Lava's Communist Propaganda",
        "description": "Podcast about how capitalism is failing the US economy as a whole and is unjust towards the working class. ",
        "language": "en",
        "author_name": "Lavanya Athmaram",
        "slug": "lavascommunistpropaganda",
        "cover": "20200426_083320_c0a8b6537f588cfa47db651458274d66.jpeg"
    },
    {
        "podcast_id": 144392,
        "title": "Pillai Center Podcast",
        "description": "<p>Welcome to Pillai Center's Official Podcast The goal of this podcast is to help people awaken their inner power, live a life full of abundance and joy and eradicate suffering from all areas of life, be it your relationship, finances, career etc. Dr. Baskaran Pillai is an international teacher, spiritual leader, humanitarian and scholar-mystic. Through his educational and humanitarian initiatives, Dr. Pillai’s mission is to alleviate human pain and suffering in all forms. Put simply, Dr. Pillai's practical teachings and techniques has helped tens of thousands of people change their life. Don't forget to subscribe to the podcast and be the first to know whenever we release a new episode.</p>",
        "language": "en",
        "author_name": "Dr. Pillai",
        "slug": "pillaicenterpodcast",
        "cover": "20220804_050807_88c82f7110245f6c91671ec7233c55d6.jpg"
    },
    {
        "podcast_id": 173054,
        "title": "One Purpose with Brajsundar Das",
        "description": "<p>Brajsundar Das is on a mission to spread the ancient wisdom of Bhagavata purana and Bhagavad Gita to a wider audience. His One Purpose podcast offers revealed knowledge from the Vedas, the oldest and most widely recognized source of transcendental science in the world. Listeners can tune in to the latest episodes on alternate days from anywhere they get their podcasts.</p><p>The podcast offers practical learning from our rich history, drawing real-life lessons from the examples set by great personalities throughout time. Whether you're looking to deepen your spiritual understanding or simply seeking inspiration to live a more fulfilling life, One Purpose has something for everyone.</p><p>With Brajsundar as your guide, you can explore the profound wisdom of the Vedas and discover how it can help you navigate the challenges of modern life with greater ease and grace. Tune in to One Purpose today and start your journey towards greater spiritual growth and understanding!</p>",
        "language": "en",
        "author_name": "Brajsundar Das",
        "slug": "onepurpose",
        "cover": "20230307_040337_0783879da8f431918a500752a061ec18.jpg"
    },
    {
        "podcast_id": 175636,
        "title": "SaiBaba win Sathya Vakku ",
        "description": "Tamil spiritual motivation/Shirdi SaiBaba Tamil/Omsairam ",
        "language": "ta",
        "author_name": "Sindhulakshmi",
        "slug": "saibaba-win-sathya-vakku",
        "cover": "20221221_101258_21098b5c93e38ea72c180d3a22002fcd.jpg"
    },
    {
        "podcast_id": 175814,
        "title": "Awakening: Tripura Rahasyam",
        "description": "<p>Join this spiritual podcast to listen to Smt. Malladi Lakshmi Prasanna, as she reads త్రిపురా రహస్యము (Tripura Rahasyam) and discusses the inner meanings of these sacred texts with perspectives for practical living. Language: Telugu</p><p>Image Credit: Original Tanjore Art by Mrs. Madhavi Vemuri</p>",
        "language": "en",
        "author_name": "Smt. Malladi Lakshmi Prasanna",
        "slug": "mlp",
        "cover": "20221222_101207_4be8f74d6cda3480eea27881e82d51d4.jpg"
    },
    {
        "podcast_id": 177739,
        "title": "Reliving old India using poems from Indian poets",
        "description": "Hello Listeners, I welcome you on my podcast. India has given many things to the world and yet we are not known when it comes to poetry. This Podcast is an effort to exactly that. Here I will be reading and then will do my best to explain poems written by many great poets. If this succeeds then I will start another podcast to do an English translation as well. ",
        "language": "hi",
        "author_name": "Shabd Aur Sitare",
        "slug": "shabdaursitare",
        "cover": "20230102_100106_86ce6952fec62d96723dd00fb1f1911b.jpg"
    },
    {
        "podcast_id": 180993,
        "title": "10 Min Dharma ",
        "description": "10 Min Dharma is a weekly journey into Hinduism, comparative religion, philosophy and spirituality in 10 mins... give or take.  ",
        "language": "en",
        "author_name": "Bhavin Prajapati",
        "slug": "10mindharma",
        "cover": "20230124_120138_783bca4552e1a4dd2e07f6857040213e.jpg"
    },
    {
        "podcast_id": 189569,
        "title": "Awakening: Shankaaraavamu by Master EK (Bhagavad Gita)",
        "description": "<p>Join this spiritual podcast to listen to Smt. Malladi Lakshmi Prasanna as she reads శంఖారావము Shankaaraavamu (Bhagavad Gita) by Master EK and discusses the inner meanings of this sacred text with perspectives for practical living. Language: Telugu</p>",
        "language": "en",
        "author_name": "Smt. Malladi Lakshmi Prasanna",
        "slug": "mlp-shankaaraavamu",
        "cover": "20230830_040840_87cbf8e8fcf8f26c310953cddea77602.jpg"
    },
    {
        "podcast_id": 194740,
        "title": "श्रीमद् भागवत सुधासागर ",
        "description": "<p>श्री श्रीमद राधा गोविंद दास गोस्वामी श्रील ए.सी. भक्तिवेदांत स्वामी प्रभुपाद जी के कृपा पात्र शिष्य है | श्रील ए.सी. भक्तिवेदांत स्वामी प्रभुपाद इस्कॉन (अंतर्राष्ट्रीय कृष्णभावनामृत संघ) के संस्थापक आचार्य है।</p><p>श्री श्रीमद राधा गोविंद दास गोस्वामी श्री वृंदावन धाम के निवासी हैं, और श्रीमद् भागवतम के सबसे प्रसिद्ध और उत्कृष्ट कथावाचक हैं।</p>",
        "language": "hi",
        "author_name": "श्री श्रीमद राधा गोविंद दास गोस्वामी",
        "slug": "sudhasagar",
        "cover": "20230306_070324_0ae1b5b6fa80647e0511217386e390e4.jpg"
    },
    {
        "podcast_id": 194747,
        "title": "भागवत वाणी ब्रजसुन्दर दास के साथ ",
        "description": "<p>ब्रजसुंदर दास भगवत पुराण और भगवद गीता के प्राचीन ज्ञान को व्यापक दर्शकों तक फैलाने के मिशन पर हैं। उनका वन पर्पज पॉडकास्ट वेदों से प्रकट ज्ञान प्रदान करता है, जो दुनिया में पारलौकिक विज्ञान का सबसे पुराना और सबसे व्यापक रूप से मान्यता प्राप्त स्रोत है। श्रोता वैकल्पिक दिनों में कहीं से भी नवीनतम एपिसोड में ट्यून कर सकते हैं, जहां से उन्हें अपना पॉडकास्ट मिलता है। पॉडकास्ट हमारे समृद्ध इतिहास से व्यावहारिक शिक्षा प्रदान करता है, जो पूरे समय में महान हस्तियों द्वारा निर्धारित उदाहरणों से वास्तविक जीवन की सीख देता है। चाहे आप अपनी आध्यात्मिक समझ को गहरा करना चाह रहे हों या बस एक अधिक पूर्ण</p>",
        "language": "hi",
        "author_name": "Brajsundar Das",
        "slug": "bhagavata-vani",
        "cover": "20230307_050309_3c421f556708b19335d94fced3a2dcfc.jpg"
    },
    {
        "podcast_id": 207740,
        "title": "Why do we fail even after writing SMART Goals?",
        "description": "<p>Through this podcast i am sharing 3 easy and simple techniques to ensure that we achieve our SMART goals</p>",
        "language": "en",
        "author_name": "Nisha Srikanth",
        "slug": "nisha-srikanth-podcast",
        "cover": "20230507_040539_bc1f102ea5bff19a6c878a7a6070f913.jpg"
    },
    {
        "podcast_id": 212009,
        "title": "सरळ आणि सोप्पी भगवद गीता | Roma's Voice Library",
        "description": "<p>नमस्कार. सरळ आणि सोप्पी भगवद गीता ह्या सिरीज मधे आपल्या सगळ्यांचं स्वागत. भगवद गीता हा एक संवाद आहे; जो भगवान श्रीकृष्ण आणि त्यांचा भक्त अर्जुन, ह्यांच्यात झाला होता. ह्या सिरीजच्या माध्यमातून गीतेला आपल्या समकालीन जीवनाशी जोडण्याचा प्रयत्न करूया .</p><p>आपण ह्या सिरीजचे एपिसोडस Youtube वर देखील बघू शकता : <a href=\"https://www.youtube.com/@romasvoicelibrary/featured\">Roma's Voice Library</a></p><p>धन्यवाद.</p>",
        "language": "mr",
        "author_name": "Roma Abhyankar",
        "slug": "saralanisoppibhagavadgita1",
        "cover": "20230905_010930_ba3cc8beb04e61ee0de499896c894c09.jpg"
    },
    {
        "podcast_id": 218244,
        "title": "Spider-man India x She's homeless",
        "description": "<p>Mashup by <strong>Fable </strong>not me</p>",
        "language": "en",
        "author_name": "Fable",
        "slug": "spidey",
        "cover": "20230706_100707_425516275fe1292842914090488eec1e.jpg"
    },
    {
        "podcast_id": 219742,
        "title": "Gajendra Moksham",
        "description": "<p>Gajendra Moksham By Garikapati Narasimha Rao</p>",
        "language": "te",
        "author_name": "Garikipati Narasimha Rao",
        "slug": "gajendramoksham",
        "cover": "20230716_100712_e5d3c5ae1e26d58a2f963b4da2ce7ca4.jpg"
    },
    {
        "podcast_id": 223737,
        "title": "Urdhvaretas Vidyalaya",
        "description": "<p>Urdhvaretas Vidyalaya</p>",
        "language": "en",
        "author_name": "Dr. Tejaswi, PhD",
        "slug": "urdhvaretas-vidyalaya",
        "cover": "20230814_020803_2b755c47acb5c2364499adbf41ddd6f8.jpg"
    },
    {
        "podcast_id": 224463,
        "title": "Uday Talks",
        "description": "<p>I talk what i see </p>",
        "language": "en",
        "author_name": "Uday Gurram",
        "slug": "udaytalks",
        "cover": "20230817_050845_e0e6215f310155fc2e6e78d37d208463.jpg"
    },
    {
        "podcast_id": 224916,
        "title": "श्री बागेश्वर महादेव मन्दिर",
        "description": "<p>श्री बोगेश्वर महादेव मन्दिर नारनोल द्वारा -- सुबह 5 से 8 बजे तक व शाम को 5 बजे से रात को 8 बजे तक ..भगवान भोलेनाथ, भगवान राम ,भगवान कृष्ण के विशेष भजनो , स्तुतियों व आरती आदि का लाईव ओडियो प्रसागण किया जाता है</p><p>अगला भजन दोपहर 12 बज कर 56 पर होगा</p>",
        "language": "en",
        "author_name": "sbmmn",
        "slug": "sbmm",
        "cover": "20230820_060816_bb83789b045775528d6888a225a00d71.jpg"
    },
    {
        "podcast_id": 226525,
        "title": "The Arun Pandit Show",
        "description": "<p>Introducing #TheArunPanditShow, where ancient Vedic science meets the blueprint for modern success. Hosted by Arun Pandit, a distinguished astrologer and renowned occult practitioner, each episode is meticulously crafted to add value to your life. Here, we embark on an unending quest for self-improvement, offering you everything from spiritual guidance and career advice to life-altering wisdom.</p><p>We engage in profound conversations with some of the world's most spiritually aligned and successful individuals. Think of each episode as a goldmine of practical wisdom, drawn from the lives and experiences of our esteemed guests. From spiritual luminaries to groundbreaking entrepreneurs, we explore how spirituality can be the cornerstone of unparalleled success.</p><p>This isn't just surface-level chatter; we dig deep to unearth the rich lessons and insights that have molded our guests. So if your aim is not just to succeed but to do so while nourishing your spiritual self, #TheArunPanditShow is your ultimate guide. Tune in to unlock a wealth of wisdom that's as essential for your soul as it is for your worldly achievements. Welcome to India's most spiritually enriching podcast.</p>",
        "language": "hi",
        "author_name": "Astro Arun Pandit",
        "slug": "thearunpanditshow",
        "cover": "20230830_100807_92ea1cdf7516bfbb2bb06d7b01f94d0e.jpg"
    },
    {
        "podcast_id": 226532,
        "title": "Bhagavata Mahatmiyam -The Glory of Srimad Bhagavatam",
        "description": "<p>This is in continuation of my podcast series that was circulated earlier by a different streaming application.</p>",
        "language": "en",
        "author_name": "Subi Subramanian",
        "slug": "guruji",
        "cover": "20230830_120809_b2feadc5007f441dc4d964724e177687.jpg"
    },
    {
        "podcast_id": 227053,
        "title": "Acharya Kribha",
        "description": "<p>Dive deep into the world of spirituality with us. Explore the teachings of Ramanuja, revere the Alwars, chant sacred slokas, decipher their meanings, relive the epics of Ramayana and Mahabharata, and unravel captivating myths. Join our journey to enlightenment. 🙏📖🌟</p>",
        "language": "ta",
        "author_name": "K A VAIDEHI",
        "slug": "acharya-kribha",
        "cover": "20230903_020932_ed4bdc9a09a461d34c9c16caac88465a.jpg"
    }
]