[
    {
        "podcast_id": 644,
        "title": "The Howie Silbiger Show",
        "description": "The Howie Silbiger Show is a weekly talk show that airs LIVE Monday - Thursday from 10-11 pm and on truetalkradio.com. It deals with moral, religious and political topics. \n\nLike 'The Howie Silbigter Show' on Facebook for information on live airing times and download The True Talk Radio Network app from your favorite app store.",
        "language": "en",
        "author_name": "Howie Silbiger",
        "slug": "howiesilbigershow",
        "cover": "5c6adc882b2af.png"
    },
    {
        "podcast_id": 6279,
        "title": "Transformative Torah",
        "description": "Transformative Torah seeks to transmit the teachings and spiritual path of the hasidic masters to the modern seeking Jew.",
        "language": "en",
        "author_name": "Batya Hefter",
        "slug": "transformativetorah",
        "cover": "20200216_221730_d27a2a84577d522f8fbb42af4d6b57a3.jpeg"
    },
    {
        "podcast_id": 9512,
        "title": "The Makom Salon",
        "description": "Intimate Jewish Conversations with Intriguing Voices.\nEducators, activists and intellectuals share their insights and wisdom on timely and timeless topics for Jews the world over. The first season is comprised of Coronavirus Conversations in the new global language - Zoom-ish. Host Jonny Ariel and guests provide food for thought as they unfold their human experiences of being both local and global in these complex times.\nProduced by Makom - The Education Lab of the Jewish Agency for Israel.\n",
        "language": "en",
        "author_name": "Makom: The Jewish Agency for Israel Education Lab",
        "slug": "themakomsalon",
        "cover": "20200611_103530_3953355a181d602ca9bfec9cc9591387.jpeg"
    },
    {
        "podcast_id": 13504,
        "title": "The Schrift - Ancient Jewish Wisdom for Modern Times",
        "description": "It is time that we see philosophy as something rebellious and therapeutic rather than boring and esoteric.\nUsing humor, personal anecdotes, and much hubris, the Schrift provides fresh and unexpected answers to life's most tricky and fateful questions.\nThe anchor of the Schrift is the weekly reading of the Torah. These passages are analyzed not as religious dogma but as brilliant pieces of literature and anthropology which bring ancient wisdom back into our lives. \nThe greatest philosophers and writers of the German canon also weigh in on these questions during the Schrift. \nFinally the lectures incorporate Buddhist teachings and the practice of Yoga to bring together East and West, body and mind, eternity and the moment.\nAnd the Schrift will always give you a \"life tip\" to carry with you along the way.\n\nIG: stevehead0001\ns.t.weinberg@gmail.com",
        "language": "en",
        "author_name": "Steven Toby Weinberg",
        "slug": "theschrift",
        "cover": "20201225_090413_07e45c264e3fac7977deeb75d7a91562.jpg"
    },
    {
        "podcast_id": 13768,
        "title": "TBA Now!",
        "description": "Temple Beth Avodah is a vibrant reform congregation in Newton, Massachusetts, comprised of great people doing extraordinary things in the world. Our members, and the people who they are connected to, have tremendous stories about their passions, their work, and their lives. TBA Now! is an opportunity to meet our neighbors, learn about their adventures, and feel inspired from their experiences. \n\nSend us your feedback or an idea for a future podcast via email at tbanowpodcast@bethavodah.org. \n\nCredits: TBA Now! is produced by Amy Tonkonogy with Kligerman Productions. ",
        "language": "en",
        "author_name": "Rabbi Keith Stern",
        "slug": "bethavodah",
        "cover": "20201129_185443_5dec9a2ba2294ad8be29d2c711f7f2cd.jpg"
    },
    {
        "podcast_id": 18308,
        "title": "Mystikcenter ",
        "description": "Author Lauri Matisse of 'no more dark days' acclaimed by Princess Diana and showcased on Sid Roth's 'It's Supernatural' offers... Spirituality based on Hebrew Roots of Faith in Messiah Jesus. In Depth Teachings,  Inspiration, Testimonies, and Insight into Current Events according to Biblical Truth.",
        "language": "en",
        "author_name": "Lauri Matisse",
        "slug": "hanukkah-podcast-audio",
        "cover": "20201212_014249_4f186a5da9f50448f4cc554443fca53a.jpg"
    },
    {
        "podcast_id": 18831,
        "title": "Kol Jeshurun ",
        "description": "<p>Welcome to Kol Jeshurun, the podcast of Temple B’nai Jeshurun, a vibrant and flourishing reform Jewish community in Short Hills, New Jersey. This podcast is a place to engage with teachings and music from our clergy, staff, and guest speakers, as we strive to bring a sense of meaning and hope into our world. If you would like to learn more about our congregation, please visit us at www.tbj.org and follow us on Facebook @tbjnewjersey and on Instagram @tbj_nj . Transcriptions available at www.tbj.org/podcast#</p>",
        "language": "en",
        "author_name": "Temple B'nai Jeshurun ",
        "slug": "koljeshurun",
        "cover": "20230415_080409_9acedb84bf45f7df2403d92f8d1790c0.jpg"
    },
    {
        "podcast_id": 32567,
        "title": "Joy and Conversation",
        "description": "Joy and Conversation is a podcast about Jewish history and culture. It is propelled by curiosity and a passion for teaching and learning. Eclectic but accessible, it is like looking into a kaleidoscope and seeing the vibrant colors, complex shapes, and rich dimensions of Jewish life and identity--but for your ears. It illuminates Jewish diversity by focusing on under-told stories. It emphasizes vitality and dynamism by showcasing humanity and creativity. Centered on asking questions and dedicated to sharing knowledge, Joy and Conversation breaks silences, crosses borders, cultivates understanding, and encourages compassion. Finding joy in conversation is a mitzvah. \nTo learn more, visit joyandconversationpodcast.com or Twitter @JandCpodcast. ",
        "language": "en",
        "author_name": "Daniel Osborn",
        "slug": "joyandconversationpodcast",
        "cover": "20210525_162656_63e8d23e1ee4d63b4e5e14609ea0e40e.jpg"
    },
    {
        "podcast_id": 34056,
        "title": "Daily Tanya",
        "description": "Daily Tanya recordings by Master Tanya Teacher, Mrs. Tsyrl Turen. Spiritual growth through mindful meditations and G-dly awareness. Tap into your G-dly soul every day and emerge as a transformed person.",
        "language": "en",
        "author_name": "Mrs. Tsyrl Turen",
        "slug": "dailytanya",
        "cover": "20210219_013730_a2960336a78dc57d4aa93a814e4d5a71.jpg"
    },
    {
        "podcast_id": 34841,
        "title": "Tanya Tools",
        "description": "Short inspirational messages empowering your soul. Messages from the Tanya in bite-size. Easy to incorporate into your daily life for a transformed and elevated existence. ",
        "language": "en",
        "author_name": "Mrs. Tsyrl Turen",
        "slug": "tanyatools",
        "cover": "20210221_052049_e080bd0841786a90a107005d186f4a1e.jpg"
    },
    {
        "podcast_id": 34852,
        "title": "Daily Chumash",
        "description": "Daily Chumash recording with Mrs. Tsyrl Turen.",
        "language": "en",
        "author_name": "Mrs. Tsyrl Turen",
        "slug": "dailychumash",
        "cover": "20210221_055933_a38c71a340e525db169e115380558008.jpg"
    },
    {
        "podcast_id": 41515,
        "title": "How Do You Jew?",
        "description": "For Jews and the Jew-curious, we are here to talk about it all - relationships and rituals, holidays, tips and tricks, questions, challenges, and a deep + fun exploration of all things Jewish (and Jew-ish). We want to know: How do you Jew?",
        "language": "en",
        "author_name": "Samantha Vinokor-Meinrath, Yael Herooty",
        "slug": "howdoyoujew",
        "cover": "20210314_235107_82567385160ecc96ac4fe50785d2183b.jpg"
    },
    {
        "podcast_id": 48426,
        "title": "J-TV Podcasts ",
        "description": "<p>Welcome to J-TV Podcasts! We feature weekly segments on Jewish wisdom, Current Affairs and entertainment! Click \"Subscribe\" now to stay updated! Please consider supporting us so we can continue to grow - http://paypal.me/JTVChannel</p>",
        "language": "en",
        "author_name": "J-TV: Jewish Ideas. Global Relevance.",
        "slug": "jtv",
        "cover": "20210602_152229_53cc7f41bbd78a54ea7498f1f6d62d5d.jpg"
    },
    {
        "podcast_id": 81866,
        "title": "דינמיקה של עץ החיים בקבלה",
        "description": "ברוכים הבאים!\nבסדרה זו שנכתבה על ידי רבי סטיבן כתריאל פיסדל זצ\"ל נלמד את יסודות הבסיס של השתלשלות הבריאה לפי הקבלה ואת תהליך הבריאה עצמו לפי עץ החיים, המודל שמתאר את הבריאה בכל רגע ורגע ברמה הקוסמית וברמת האדם.\nבברכת שלום וברכה",
        "language": "he",
        "author_name": "Tomer Drori",
        "slug": "treeoflife",
        "cover": "20210927_221758_0552bfed8c094509ceedad89ca71c8e0.jpg"
    },
    {
        "podcast_id": 88232,
        "title": "ישיבת יפו ",
        "description": " הסכתים בנושאים תרבות ,חברה ונפש מתוך מבט בית מדרשי מעמיק",
        "language": "he",
        "author_name": "ישיבת יפו ",
        "slug": "yafo",
        "cover": "20211102_093508_171e0743c9db4a903ce12ecc26e10def.jpg"
    },
    {
        "podcast_id": 89564,
        "title": "Schmuckboys",
        "description": "<p>Schmuckboys is the hottest new jewish podcast in town. Hosted by the dynamic duo, Libby Walker and Marla Friedson, this show will take you on a journey through the complexities of Jewish identity and how it affects our everyday lives.</p><p>Whether you're a young professional trying to navigate your career path or struggling to find love in the Jewish dating world, this podcast is for you. Expect to hear juicy personal updates from the hosts about their dating lives and get insider tips from a diverse range of guests from various Jewish communities.</p><p>So buckle up, grab a drink, and get ready for some real talk on all things Jewish, dating, career, social media, and more! This is \"Schmuckboys,\" and we're bringing the heat.</p><p>New episodes every other Wednesday! Brought to you by the Jewish Journal.</p>",
        "language": "en",
        "author_name": "Marla Friedson, Libby Walker",
        "slug": "schmuckboys",
        "cover": "20230628_070611_4659db24b613aeff1b0616ed276102a0.jpg"
    },
    {
        "podcast_id": 91359,
        "title": "Jewish Gentile Couples",
        "description": "Every Jewish and Gentile couple has a unique story of the pressures and challenges they have faced being in a cross-culture relationship. Listen now to real couples like you share their stories of how they found spiritual harmony.",
        "language": "en",
        "author_name": "Tuvya Zaretsky",
        "slug": "jewishgentilecouples",
        "cover": "20211118_204945_c7952e1eb5ceb403d3e2e5c9316a22f4.jpg"
    },
    {
        "podcast_id": 96952,
        "title": "TBE Richmond Podcast",
        "description": "Follow Rabbi Michael Knopf’s sermons, lectures, and conversations with special guests, Cantor Dara Sage Rosenblatt’s music and teachings, and so much more from virtual gatherings of Temple Beth-El in Richmond, Virginia. Temple Beth-El is committed to leading people into growing relationships with Jewish community, wisdom, and practice that help them thrive intellectually, emotionally, and spiritually and that inspire them to build a more compassionate, just, and peaceful world. TBE Richmond Podcast is produced by Benjamin DaCosta-Kaufman. Our theme music is composed and produced by Stephen Frost. Learn more about our dynamic, warm, and passionate congregation, affiliated with the United Synagogue of Conservative Judaism, at www.bethelrichmond.org.",
        "language": "en",
        "author_name": "Rabbi Michael Knopf",
        "slug": "tberichmondpodcast",
        "cover": "20211222_051249_488ba02ec69c2a983904d45b82af34ef.jpg"
    },
    {
        "podcast_id": 106671,
        "title": "Parsha With (the other) RBG",
        "description": "Listen here for relevant, insightful and provocative takes on the weekly Parsha from Rabbi Barry Gelman.",
        "language": "en",
        "author_name": "Barry Gelman",
        "slug": "theotherrbg",
        "cover": "20220206_030216_b09697cae2d55c1c37ecfc692beade17.jpg"
    },
    {
        "podcast_id": 108460,
        "title": "Mitzvah Girl",
        "description": "Planning bat-mitzvahs for our older selves to redefine our sense of womanhood and in the process exploring the experience coming of age as Orthodox Jews.",
        "language": "en",
        "author_name": "Bracha Eisenstat",
        "slug": "mitzvahgirl",
        "cover": "20220213_050231_aba0b9a66d551b13ae6cb3c6aea8feb2.jpg"
    },
    {
        "podcast_id": 121817,
        "title": "Jewish Trivia for Kids",
        "description": "Some fun trivia questions around Jewish holidays, customs, and of course, FOOD! ",
        "language": "en",
        "author_name": "Ross Wolman",
        "slug": "jewishtriviaforkids",
        "cover": "20220413_060457_5df7fb0c63729dcc53cd79896bcc9522.jpg"
    },
    {
        "podcast_id": 132589,
        "title": "ללמוד תניא מההתחלה עם שחר טנג׳י",
        "description": "ללמוד תניא מההתחלה עם שחר טנג׳י",
        "language": "he",
        "author_name": "Tanya ",
        "slug": "tanya",
        "cover": "20220607_060608_bac90ce7ef0885bcb604a93f90b0c89f.jpg"
    },
    {
        "podcast_id": 141977,
        "title": "Reb Shlomo Freifeld Shiurim",
        "description": "Rabbi Shlomo Freifeld (1925–1990) was an influential figure in the world of Orthodox Judaism who established Yeshivas Shor Yoshuv and helped build the Jewish community of Far Rockaway. He influenced tens of thousands of students and was a key figure in the US-based Baal Teshuva movement which brought a massive wave of secular Jews back to Orthodox Judaism throughout the seventies and eighties. The Orthodox Union's tribute lionized him as \"one of the founders of the Baal Tshuva movement.",
        "language": "en",
        "author_name": "Yoel Halpern",
        "slug": "rsfshoryoshuv",
        "cover": "20220722_110744_e239d8f41da03c550f98e86ff2acab10.jpg"
    },
    {
        "podcast_id": 142211,
        "title": "Divrei Torah for the Growth-Oriented Jewish Teen",
        "description": "<p>A series of shiurim focusing on different aspects of religious growth, given to alumni of Baer Miriam seminary but relevant for Jewish teens throughout the world. DT4tGOJT will feature weekly Parsha schmoozes, with quick-hitting, thought-provoking Divrei Torah to help paint an overall picture of the parsha, as well as a series on classic mussar works, such as Mesillas Yesharim. The podcast is hosted by Rabbi Zvi Herman, who has been teaching in post-high-school yeshivas and seminaries in Israel for over fifteen years.</p>",
        "language": "en",
        "author_name": "Rabbi Zvi Herman",
        "slug": "divrei-torah-for-the-growth-oriented-jewish-teen",
        "cover": "20220724_090720_7d0f04c8a2321bc916c04762d4fe4014.jpg"
    },
    {
        "podcast_id": 143846,
        "title": "Daily Inspiration by Rabbi Moshe Scheiner",
        "description": "Enjoy a daily message on the current Torah portion, always with an inspiring message from Rabbi Moshe Scheiner, founding Rabbi of Palm Beach Synagogue.\n",
        "language": "en",
        "author_name": "Rabbi Moshe Scheiner ",
        "slug": "rabbimoshescheiner",
        "cover": "20220802_120802_4f66b4b675e0dc65018c9139b7cd18e5.jpg"
    },
    {
        "podcast_id": 147109,
        "title": "Behind the Notes",
        "description": "Behind the Notes podcast is produced by Neranenah, a concert and cultural event series based in Atlanta with roots in Jewish culture and musical traditions. The conversations and music featured in our episodes will explore Jewish contributions to American arts and culture. ",
        "language": "en",
        "author_name": "Neranenah Concert & Culture Series",
        "slug": "behindthenotes",
        "cover": "20220817_060845_d9683d047f7b1462e6bcc64300cfb14b.jpg"
    },
    {
        "podcast_id": 152373,
        "title": "What Jews Really Believe About Jesus",
        "description": "Inspired by a question from a listener, this multi-episode series is a no-holds-barred conversation about the hardest issue for Jews and Christians to discuss. If you've ever wondered how Jews view Jesus, how they read the Bible and why that leads them to still wait for the messiah.",
        "language": "en",
        "author_name": "Dave McGarrah & Harold Berman",
        "slug": "theteacherandthepreacher",
        "cover": "20220928_090947_e7209904da00b1fd039ddd2375b7c8b0.jpg"
    },
    {
        "podcast_id": 153006,
        "title": "Walking in the Footsteps of the Messiah",
        "description": "Walking in the Footsteps of the Messiah are weekly messages from Kehilat Sar Shalom, a Messianic congregation in St Louis Park, MN.  It is our hope to understand the Scriptures with the same understanding as Yeshua and his disciples and to walk in that understanding.",
        "language": "en",
        "author_name": "Kehilat Sar Shalom",
        "slug": "sar-shalom",
        "cover": "20220912_090933_4409ca84df4496a871bd16a123211782.jpg"
    },
    {
        "podcast_id": 156878,
        "title": "Hot Girl Torah",
        "description": "Hot Girl Torah demands authenticity. Each episode, Dara and Emily explore Jewish wisdom the only way they know how: through the lens of a hot girl lifestyle. As young, contemporary, Jewish scholars, living their lives in big cities like Washington, DC, and Allentown, PA, you don't want to miss out on their Judaic hot takes. Listen here and listen well: Hot Girl Torah will change your life (or maybe just your perspective).",
        "language": "en",
        "author_name": "Dara Molotsky and Emily Kolodney",
        "slug": "hotgirltorah",
        "cover": "20221020_021022_8c45759cd17161d780bd7759d3dd093b.jpg"
    },
    {
        "podcast_id": 161934,
        "title": "Parsha Pick-Me-Up",
        "description": "Take a few minutes to study the parsha with Rabbi Sprung on Thursdays from Bereshit to V'Zot Habracha. Find the Parsha Pick-Me-Up on Apple Podcasts, Spotify, Stitcher or wherever you get your podcasts.",
        "language": "en",
        "author_name": "Yitzchak Sprung",
        "slug": "parshapickmeup",
        "cover": "20221020_031026_cd509491f565315f20612e23cb8c1148.jpg"
    },
    {
        "podcast_id": 162174,
        "title": "Shiurim From Rabbi Dovid Regensberg",
        "description": "Rabbi Dovid Regensberg is a Alumni of Telz Chicago and Torah Ohr in Yerushalayim. He currently is a beloved Rebbe in Yeshivas Matisyahu under Rabbi Fischer Shlita. The shiurim presented here were given over 30 years and are a collection of deep insight and a wide encompassing knowledge of Chazal acquired over years of incredible hasmadah.",
        "language": "en",
        "author_name": "Rabbi Dovid Regensberg",
        "slug": "rabbidovidregensberg",
        "cover": "20221021_051008_be4fb59d04ac14d70689b6594dc53c2c.jpg"
    },
    {
        "podcast_id": 163352,
        "title": "The Sounding Jewish Podcast",
        "description": "<p>What does Jewish identity sound like, and why have scholars from around the world devoted their careers to studying it? The Sounding Jewish Podcast features host Dr. Samantha M. Cooper in conversation with global musicologists, ethnomusicologists and sound studies scholars who specialize in the music and sound of Jewish experience. Each episode highlights a guest’s area(s) of academic interest, preferred research methodologies, and decision to study music and sound. Our goal is to better understand what it means to be a twenty-first century Jewish music studies scholar.</p>",
        "language": "en",
        "author_name": "Dr. Samantha M. Cooper",
        "slug": "soundingjewish",
        "cover": "20221026_041047_775e2fa13b4d11c61f6cf70c538df3df.jpg"
    },
    {
        "podcast_id": 166977,
        "title": "Hashem Runs The World",
        "description": "Be'h this podcast is to spread words of inspiration through the Torah. Hashem is so great and we need to recognize it on a daily basis. #ThankYouHashem #HashemLovesUs\n\nInspiration for creating this podcast is from Gedale Fenster and Isaac J. Kassin.",
        "language": "en",
        "author_name": "DANIEL TEBELE",
        "slug": "hashemrunstheworld",
        "cover": "20221110_071137_9d55dc4d68e79e3348b67f9598b2bc3a.jpg"
    },
    {
        "podcast_id": 171627,
        "title": "Jonathan Benshimol - Podcast",
        "description": "Jonathan Benshimol is \"obsessed with spreading positivity and encouraging spiritual growth\". Finding true meaning and purpose in the modern-day era is a feat difficult for many. He specializes in bringing Torah teachings and connecting them to modern-day problems that we all face in order to promote a new way of thinking and unravel a deeper connection to G-d. Jonathan will inspire those listening to make a real change in their lives to acquire real success in all aspects of life. No single approach is the right one for any individual, however, Jonathan has a way of connecting to all walks of life and finding favor in the eyes of his peers.",
        "language": "en",
        "author_name": "Jonathan Benshimol",
        "slug": "jonathanbenshimol",
        "cover": "20221130_071122_6d6d32fd31d4c690bbf3f2b6732ac425.jpg"
    },
    {
        "podcast_id": 172723,
        "title": "נגיסי אמונה עם יובל אבידני",
        "description": "לעבור את הגשר הצר של העולם הזה עם דברי תורה קצרים לחיזוק הנפש מאת יובל אבידני",
        "language": "he",
        "author_name": "Yuval Avidani - יובל אבידני",
        "slug": "emunuggets",
        "cover": "20221206_061223_cff775c1ce5fb58b0a713fc2b720584a.jpg"
    },
    {
        "podcast_id": 172724,
        "title": "מעשה הגדולים - סיפורי צדיקים מספרו של חכם עלוואן שמעון אבידני זצוק״ל",
        "description": "סיפורי צדיקים על פרשות השבוע, מלוקט מחיבורו של חכם עלוואן שמעון אבידני זצוק״ל, ״מעשה הגדולים״. הקראה: יובל אבידני (נין הרב)",
        "language": "en",
        "author_name": "Yuval Avidani - יובל אבידני",
        "slug": "rabbiavidani",
        "cover": "20221206_061224_79774e59ee15f91f4bf91744554d7168.jpg"
    },
    {
        "podcast_id": 173139,
        "title": "Yachad Podcast",
        "description": "On Yachad Podcast, college students explore key aspects of Judaism with a different Rabbi every week. As a Baal Teshuva (Eitan Davidov) and a FFB (Yehuda Jian), the hosts provide unique perspectives on each topic based on their contrasting experiences.",
        "language": "en",
        "author_name": "Eitan Davidov and Yehuda Jian",
        "slug": "yachadpodcast",
        "cover": "20221222_071216_60d75626c4278c2fd2a5c2e82d6bb3a0.jpg"
    },
    {
        "podcast_id": 176447,
        "title": "The Magic Shul Bus",
        "description": "Shalom brothers & sisters,\n\nMy name is Michael Colasanti.  I am a practitioner of high-dose Psilocybin, LSD & DMT.\nI am a Jew by choice.\nI am traveling the United States in a school bus with my two dogs, searching for freedom, love & transcendence.\n\nThis is a deep-dive into psychedelics, Judaism, consciousness and everything in-between.",
        "language": "en",
        "author_name": "Michael Colasanti",
        "slug": "tmsb",
        "cover": "20221227_021244_83f259e8745972b3d3d1df8095a6acd5.jpg"
    },
    {
        "podcast_id": 179310,
        "title": "GYE Chizuk Boost",
        "description": "As any normal human who walks the streets and browses the internet in the 21st century, we all face the challenge of keeping our eyes pure. GYE Boosts are 2-5 minute audio clips to help you start your day insulated and empowered to be the person you really want to be!",
        "language": "en",
        "author_name": "Guard Your Eyes",
        "slug": "gye",
        "cover": "20230109_060145_62ff94a80b695112f0e628cdd5b21d74.jpg"
    },
    {
        "podcast_id": 180149,
        "title": "weekly with chana ",
        "description": "living with the times, bringing the past to the present.\nweekly with chana is a refreshing new way of seeing ourselves within the parsha and how we can use these lessons to live happier more meaningful lives today.\nhappy listening :)",
        "language": "en",
        "author_name": "Chana Hirschowitz",
        "slug": "weeklywithchana",
        "cover": "20230112_110137_91b4ad080ba8444c65eee0e963a42919.jpg"
    },
    {
        "podcast_id": 180863,
        "title": "Chiesa Cristiana Evangelica ADI Brindisi",
        "description": "Ascolta i nostri culti in differita attraverso il programma Rewind, in onda ogni lunedì alle ore 07.00. Dio ti benedica!",
        "language": "it",
        "author_name": "ADIBRINDISI",
        "slug": "adibrindisi",
        "cover": "20230115_100118_4a7f9f986e562062eabe50c0f04082b5.jpg"
    },
    {
        "podcast_id": 182478,
        "title": "Jewish Disability Services - Together, We Make An Impact Podcast ",
        "description": "Welcome to the Jewish Disability Services Together We Make An Impact Podcast with your hosts Adam Roth and Rose Greenblatt. The goal of this podcast is to expose and explore real issues facing the disabled community. During each episode Adam and Rose will connect our listeners with experts in the field, from academia to lived experiences, to shed light on our topic, while exploring meaningful disability resources from local professionals.\n\nMeet your Cohosts: \n\nAdam Roth M.B.A. M.Ed. (he/him) is currently the Director, Special Needs at the Jewish Federation of Southern New Jersey. Adam is a former public school educator, case manager, and program coordinator who spent over a decade and a half focused on educational and work-based learning impacts for the disabled community. Adam received his MBA in Corporate Communications from Fairleigh Dickinson University and his MEd in Special Education and Elementary Education from Holy Family University.\n\nRose Greenblatt OTD, OTR/L (she/her) is currently an occupational therapist who splits her time between her role as a clinician and her passion for helping to develop emerging practice areas in OT, specifically related to community health and advocacy. Rose received her Doctorate in Occupational Therapy from the Washington University School of Medicine in St. Louis.\n\nIf you’d like to learn more about the JDS Podcast, disability inclusion in our community, or would like to connect with Adam and Rose you can reach us directly at: jdspodcast@jfedsnj.org\n",
        "language": "en",
        "author_name": "Adam Roth & Rose Greenblatt",
        "slug": "jewish-disability-services-together-we-make-a-difference-podcast",
        "cover": "20230131_090112_18256f12cf21e9dcefaae7e2c530dbf6.jpg"
    },
    {
        "podcast_id": 182895,
        "title": "Heretics Standing at Sinai",
        "description": "<p>Each time Jewish thinkers pushed beyond the bounds of ideas from the past, they were labeled heretics or apostates. But the word, \"heretic\" comes from the Latin meaning, \"to choose,\" and is \"an opinion which disagrees with or conflicts with those who generally accept something as being authoritative, proper, or correct.\" In other words, a Heretic is a person who has applied their own intellect and experience of the world to emerge with a Truth that explains the Universe. This is a long-winded way of stating that, at Heretics Unite!, we explore that space which may diverge from the teachings of your childhood Sunday School teacher about the God, traditions, myths and purpose of Judaism. Join us each episode and listen with an open mind to see what feels right and what is still not quite there for you. Better yet, reach out to Rabbi Jay TelRav to join him on an upcoming episode to discuss the ideas together.</p><p>Cover art by Dr. Julie TelRav</p>",
        "language": "en",
        "author_name": "Rabbi Jay TelRav",
        "slug": "hereticsstandingatsinai",
        "cover": "20230217_090218_e954220ee244f848a3a5a68363152ff6.jpg"
    },
    {
        "podcast_id": 185257,
        "title": "OU D.C. Shmooze",
        "description": "Want to know more about our elected leaders, their policy ambitions, and their connections to our community? Our new series, D.C. Shmooze, just launched. Join us as we interview representatives and key policymakers.",
        "language": "en",
        "author_name": "Nathan Diament",
        "slug": "dcshmooze",
        "cover": "20230131_040133_2ed2f5e243e6eee898014b97ee307136.jpg"
    },
    {
        "podcast_id": 186802,
        "title": "Sacred Realms - Sci-fi and Fantasy through a Jewish lens",
        "description": "<p><strong>Science Fiction and Fantasy through a Jewish lens.</strong></p><p>Rabbi Lindsey Healey-Pollack and Rabbi Andrew Pepperstone discuss the intersection between Judaism and a wide range of sci-fi and fantasy books, movies, and television shows. Each episode, Rabbi Lindsey and Rabbi Andrew discuss what they have been watching or reading recently, do a deep dive into a main topic, bring out from \"the Geniza,\" something from the not-that-distant past, and more.</p><p>Cover art generated by Dall-E (https://labs.openai.com/).</p>",
        "language": "en",
        "author_name": "Rabbi Andrew Pepperstone and Rabbi Lindsey Healey-Pollack",
        "slug": "sacredrealmspodcast",
        "cover": "20230205_060215_a2d5335ce1d166c1700d8b64b76c9d39.jpg"
    },
    {
        "podcast_id": 188918,
        "title": "כלים לתכלית החיים בראי הקבלה",
        "description": "ברוכים הבאים לסדרה של שלושה מפגשים בנושא תכלית החיים.\nנבחן מה הגדרה של תכלית החיים ונצלול אל תוך אותו עולם שבו נוכל להתחבר לתכלית החיים האישית שלנו. חובר על ידי הרב סטיבן כתריאל פיסדל ז\"ל",
        "language": "he",
        "author_name": "Tomer Drori",
        "slug": "lifepurpose",
        "cover": "20230212_080233_15f2cab95ee704a63848695c044d1503.jpg"
    },
    {
        "podcast_id": 194132,
        "title": "Search for Daas ",
        "description": "<p>Search for Daas calls on great minds from the Jewish tradition to unlock meaningful lessons, explore challenging ideas and reveal personal journeys. </p>",
        "language": "en",
        "author_name": "Tyler Godoff",
        "slug": "searchfordaas",
        "cover": "20230303_080302_f78f1a4b4422e8da276e2612042da7ba.jpg"
    },
    {
        "podcast_id": 194179,
        "title": "Holy Sparks Podcast ",
        "description": "<p><strong>Our Mission is To Illuminate the brightest lights in the Jewish world and beyond so that we elevate the Holy Sparks within us and make the world around us a better place.</strong></p><p><strong>About your host: Saul Kaye is an internationally touring music artist with 10 CDs out. He has produced 8 for other artists. He has written three books. After his last book of interviews with rising Jewish Music Artists, he decided to launch the Holy Sparks Podcast to shine more light on some incredible humans in the Jewish World. you can find out more about Saul, his music, and his work at </strong><a href=\"http://www.saulkaye.com\"><strong>www.saulkaye.com</strong></a></p>",
        "language": "en",
        "author_name": "Saul Kaye",
        "slug": "holysparkspodcast",
        "cover": "20230329_040319_752049bb68c7fd39998e06de1b0ff8aa.jpg"
    },
    {
        "podcast_id": 194536,
        "title": "Weekly Haftorah with Tehilla",
        "description": "<p>Welcome the first unique space for every Jewish woman to explore the weekly Haftarah, its relationship with the parsha, and how it pertains to our lives. New shiurim are posted every Thursday.</p><p><a href=\"https://chat.whatsapp.com/FEYsr4Udc1fD8bC8E6mHPJ\">Join our WhatsApp group for shiurim delivered straight to your phone today!</a> This group is for women only.</p>",
        "language": "en",
        "author_name": "Tehilla Shapiro ",
        "slug": "haftorahwithtehilla",
        "cover": "20230305_100329_69ef825873204710316e29e020a1eab4.jpg"
    },
    {
        "podcast_id": 196314,
        "title": "The Jewish Diasporist",
        "description": "<p>Join us to explore the political, cultural and social implications of life in diaspora. We will explore a wide variety of topics which approach the world from a socialist diasporist perspective which raises the voices of the marginalised and strives to fix the world.</p><p>Get in touch at contact@jewishdiasporist.com!</p>",
        "language": "en",
        "author_name": "Ben Yanowitz and Zach Smerin",
        "slug": "diasporist",
        "cover": "20230401_040423_706fc53adb4c8575c933a10943992417.jpg"
    },
    {
        "podcast_id": 196368,
        "title": "The Source: G-d's Answers to Life's Hard Questions with Aliza Davidovit",
        "description": "<p>With warmth and insight Rebbetzin Aliza makes Biblical teachings relevant and applicable to our day and age. The wisdom of the Torah has lasted for thousands of years and its light is the key to the longevity and success. Aliza Davidovit is a journalist, author and commentator and has interviewed some of the most famous and powerful people in the world. </p>",
        "language": "en",
        "author_name": "Aliza Davidovit",
        "slug": "alizadavidovit",
        "cover": "20230312_090336_7fce720c6f9995125a029cbfec4791b2.jpg"
    },
    {
        "podcast_id": 199419,
        "title": "Curso Intensivo de Judaísmo | Somos Noájidas",
        "description": "<p>Cristianos, católicos y todo aquel que desee aprender sobre fe judía puede hacerlo, pues la FE JUDÍA es para todos!😉</p><p>Esta es la primer clase de varias sobre un estudio Intensivo sobre FE JUDÍA PARA NO JUDÍOS. ¡Mucho éxito!</p>",
        "language": "es",
        "author_name": "Israel Meíri",
        "slug": "somosnoajidas",
        "cover": "20230326_100320_4286e3dafafee7de7946ed896aba972a.jpg"
    },
    {
        "podcast_id": 201278,
        "title": "Daily Morning Class",
        "description": "<p><strong>Rabbi Meyer Yedid- </strong>Torah classes that inspire. This is the home of the Daily Morning Class, the weekly class series and more!</p>",
        "language": "en",
        "author_name": "Rabbi Meyer Yedid",
        "slug": "rabbiyedid",
        "cover": "20230720_040703_d147ee1c2334d95d8ef1712d135295be.jpg"
    },
    {
        "podcast_id": 204453,
        "title": "יראת אדני ואהבת אדני",
        "description": "<p>סדרת שיעורים ותרגולים מרבי סטיבן כתריאל פיסדל ז\"ל בה אנו למדים מהי יראה, חשיבותה ואיך היא קשורה לאהבה.</p><p> נלמד את היחס ביננו לבין הבורא וכיצד ליצור את אותו קשר.</p><p>מתוך כתבי המהר\"ל מפראג, רבי נחמן מברסלב והזהר</p>",
        "language": "he",
        "author_name": "Tomer Drori",
        "slug": "aweandlove",
        "cover": "20230420_050421_4f73bfdd9022b6b33e795232f0c43db1.jpg"
    },
    {
        "podcast_id": 206658,
        "title": "La Cábala Con Rab Moshe Bendahan ",
        "description": "<p>Canal Dedicado al crecimiento espiritual según la Cábala. Expliciones y Disertación del Rabino Moshe Bendahan ,Rabino principal de las comunidades Israelitas de España.</p><p>Disfruta de nuestros cursos gratuitos de zoom. Inscríbete en el correo Por favor enviar su número de WhatsApp y nombre <a href=\"mailto:crecerencabala@gmail.com\">crecerencabala@gmail.com</a></p><p>YouTube: https://www.youtube.com/@LaCabalaconRabMosheBendahan</p>",
        "language": "es",
        "author_name": "Rab Moshe Bendahan ",
        "slug": "la-cabala-con-rabmoshebendahan",
        "cover": "20230709_110739_aae8d533dd411d3ca9e2e457d503ea4f.jpg"
    },
    {
        "podcast_id": 206882,
        "title": "Zera Shimshon-Rabbi Dovid Goldwasser",
        "description": "<p>A daily zera shimshon podcast</p><p>For questions or sponsorships, please contact fayge18@gmail.com</p>",
        "language": "en",
        "author_name": "Rabbi Goldwasser",
        "slug": "rabbi-goldwasser-zera-shimshon",
        "cover": "20230502_070542_6629875561361f237d592b5467e773a9.jpg"
    },
    {
        "podcast_id": 211148,
        "title": "B'nai Shalom Erev Shabbat",
        "description": "<p>Join Monte Judah every week for a special Erev Shabbat broadcast as he explores the deep and rich traditions of the Jewish faith. In this podcast, you will learn about the history, customs, and significance behind the weekly Shabbat celebration. Monte will also dive into the Scriptures and provide insightful teachings on how to apply these ancient traditions and principles to our modern lives. Tune in every week to join Monte Judah and a community of like-minded believers as they come together to honor and celebrate the Sabbath.</p><p><a href=\"https://www.bnaishalom.tv/watch-live\">https://www.bnaishalom.tv/watch-live</a> </p><p><a href=\"https://lionandlambministries.org/\">https://lionandlambministries.org/</a></p><p><a href=\"https://lionandlambministries.org/resources/torah-cycle-readings\">https://lionandlambministries.org/resources/torah-cycle-readings</a> </p><p><a href=\"https://llgive.com\">https://llgive.com</a></p>",
        "language": "en",
        "author_name": "Lion and Lamb Ministries",
        "slug": "bnaishalomerevshabbat",
        "cover": "20230524_050529_2659f24be35786e892c3ce047282fc94.jpg"
    },
    {
        "podcast_id": 211151,
        "title": "Messianic World Update",
        "description": "<p>Welcome to the Messianic World Update, a weekly podcast hosted by Monte Judah from Lion and Lamb Ministries. Join Monte as he provides a detailed update on the latest news from Israel and other nations around the world.</p><p>As we approach the end of the ages, we are called to watch and stay alert. Monte serves as your guide, offering insight and analysis on the current events that matter most to the Messianic community.</p><p>Tune in each week to stay up-to-date on the latest news and developments from Israel and beyond. This is the Messianic World Update, and we're glad you're here to join us on this journey. Shalom!</p><p>For more information: </p><p>Your Donations make this show possible: <a href=\"https://www.messianicworldupdate.com/ambassador-level\">https://www.messianicworldupdate.com/ambassador-level</a> </p><p>See the full video at: <a href=\"https://www.messianicworldupdate.com/\">https://www.messianicworldupdate.com/</a> </p><p>Get the End Time Prophecies Fulfilled DVD: (click donate) <a href=\"https://www.llgive.com/spring-23-offer\">https://www.llgive.com/spring-23-offer</a> </p><p>Newest DVD Teaching by Monte Judah: <a href=\"https://www.messianicmarketplace.org/products/spring-feasts\">https://www.messianicmarketplace.org/products/spring-feasts</a> </p><p>Register for the feast of Tabernacles today: <a href=\"https://www.tabernaclesevent.com\">https://www.tabernaclesevent.com</a> </p><p>Other Monte Judah Links: </p><p><a href=\"https://thegreaterexodus.com/\">https://thegreaterexodus.com/</a> <a href=\"https://www.messianicmarketplace.org/collections/monte-judah\">https://www.messianicmarketplace.org/collections/monte-judah</a> </p><p>Other Lion and Lamb Links: <a href=\"https://www.lionandlambministries.org/\">https://www.lionandlambministries.org/</a></p><p><a href=\"https://www.messianicmarketplace.org/\">https://www.messianicmarketplace.org/</a> </p><p><a href=\"https://www.yavohmagazine.com/\">https://www.yavohmagazine.com/</a> </p><p><a href=\"https://www.campyeshua.com/\">https://www.campyeshua.com/</a> </p><p>Contact Us at: <a href=\"mailto:info@lionlamb.co\">info@lionlamb.co</a></p>",
        "language": "en",
        "author_name": "Lion and Lamb Ministries",
        "slug": "lionlambmessianicworldupdate",
        "cover": "20230524_050518_0584a96874c9ab34413d2208884ad9c3.jpg"
    },
    {
        "podcast_id": 213687,
        "title": "סיפורים מהאגדות עם חיים באר",
        "description": "<p>אם תרצו - הרי זו אגדה.</p><p>'סיפורים מהאגדות' עם הסופר חיים באר, הוא פודקאסט של יהדות-ישראלית העוסק במה שאנחנו יכולים ללמוד מאגדות חז\"ל במאה ה-21.</p><p>בכל פרק מארח הסופר חיים באר נשות ואנשי רוח ומעשה בחברה הישראלית, לדיאלוג אישי, לימודי ומשמעותי.</p><p>הצטרפו אלינו למסע מרתק, המשלב בין העבר, ההווה והעתיד שלנו, מסע שיוצא מכותלי בית המדרש ומגיע אל הפודקאסט של ימינו.</p><p>מנחה: חיים באר.</p><p>הפקה: מרכז ספיר לתרבות ולחינוך יהודי</p>",
        "language": "he",
        "author_name": "מרכז ספיר לתרבות ולחינוך יהודי",
        "slug": "siporim-mehaagadot",
        "cover": "20230607_090622_12a4e39b09686f16bd1a02a97617bf8d.jpg"
    },
    {
        "podcast_id": 215503,
        "title": "Parsha Shmuz with Rav Yitchak Berkovits",
        "description": "<p>From the beis midrash of Aish, Rav Yitzchak Berkovits shares each week an insight on the parsha. He discusses a variety of topics of a broad range including character development, learning, and emunah (faith).</p>",
        "language": "en",
        "author_name": "Rabbi Berkovits",
        "slug": "rabbiberkovits",
        "cover": "20230616_020651_95c090939426686d18afe1748cb92c20.jpg"
    },
    {
        "podcast_id": 216022,
        "title": "From Sunday To Sabbath",
        "description": "<p>From Sunday to Sabbath is a podcast of Epic Life Church in Terrell Texas and their journey to discovering the Sabbath. Once a Sunday church now a Sabbath, Torah observant community who's soul purpose is to discover the life they were created to live. Be inspired, encouraged and challenged as we navigate God's word and how all of it still applys today.</p>",
        "language": "en",
        "author_name": "Epic Life Church",
        "slug": "theepiclife",
        "cover": "20230621_010604_df8f588e0241c57d529ffbdf379febfd.jpg"
    },
    {
        "podcast_id": 216026,
        "title": "Antediluvian Revelations: A Poetic Retelling of The Book of Enoch, The Prophet, Season One",
        "description": "<p><em>Antediluvian Revelations </em>is a series of podcasts that presents the ancient <em>Book of Enoch</em> in a poetic format. The first episode is the introduction to the series, which explains the origination of the text and the poetic concept applied to retelling the story. Although it may actually predate the writings of Moses, <em>The Book of Enoch</em> was not included in the canonized Holy Bible, the most well-known religious text in the world, but the text has been considered one of the Kabbalah texts, which is ancient sect of Judaism that professed the existence of extraterrestrial life.</p><p>There are five parts of the poem, and each part is followed by a discussion episode that provides the literary analysis and critical thinking of the author about the poetry and its content. The full text may be available for download as a PDF in the near future for paid subscribers, and this podcast version is based upon the third edition of the manuscript dated 1 March 2023. Episodes will be released weekly. The final episode of Part One will be released on 5 August. Including the introduction episode, the total number of episodes will be 21: Season One is Part One with six episodes, Season Two is Part Two with six episodes, Season Three consists of Part Three, Four, and five with nine episodes. The third season has shorter episodes than the first two seasons, so the three parts will run consecutively instead of being separated into different seasons.</p><p>Be sure to follow or subscribe to receive notifications of newly released episodes as they become available. (Notes updated on 8/11/2023).</p><p>Thank you for listening!</p><p>Content descriptors: Religion, Extraterrestrial Encounters, Prophecy, Epic Poetry, Avant Garde, Apocalypse, History, and Unsolved Mysteries.</p>",
        "language": "en",
        "author_name": "Michael Inacloud",
        "slug": "michaelinacloud",
        "cover": "20230620_120638_7e4be72f63459125864ee690565a8471.jpg"
    },
    {
        "podcast_id": 216721,
        "title": "קריאת גמרא",
        "description": "<p>קריאת הגמרא של הרב יהושע ליבוביץ באתר קול הלשון</p>",
        "language": "he",
        "author_name": "הרב יהושע ליבוביץ",
        "slug": "keriatgemara",
        "cover": "20230625_070605_43c2df1bdcfbfa6af7bb4a2ca00dcef9.jpg"
    },
    {
        "podcast_id": 216834,
        "title": "הזהרה מלאה",
        "description": "<p>hazhara</p>",
        "language": "he",
        "author_name": "מר הזהרה",
        "slug": "hazhara",
        "cover": "20230626_070619_ba8351ff2d3ee8e0ac6dc0413aa89bdc.jpg"
    },
    {
        "podcast_id": 217202,
        "title": "Aliya Yomi",
        "description": "<p>Learn an Aliya a day in 10 minutes.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "aliyayomi",
        "cover": "20230628_030640_f1047d11369840dbae16825f15b42b38.jpg"
    },
    {
        "podcast_id": 217223,
        "title": "Nach Yomi",
        "description": "<p>Learn all the 742 chapters of Nach at 10 minutes a day.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "nachyomi",
        "cover": "20230628_070619_346c76225389b9369fc0170f95449afe.jpg"
    },
    {
        "podcast_id": 217235,
        "title": "Epilogues - Understanding the Weekly Haftorah",
        "description": "<p>Take. few minutes to understand the most overlooked part of our Shabbos morning.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "epilogues",
        "cover": "20230628_080601_744fe9d9def2686502487e5dd99bfd57.jpg"
    },
    {
        "podcast_id": 218170,
        "title": "The Weekly Class",
        "description": "<p>The Weekly Shiurim Series</p>",
        "language": "en",
        "author_name": "Rabbi Meyer Yedid",
        "slug": "dmca",
        "cover": "20230705_100705_1836168f5efd26df8919bc0c03506d4d.jpg"
    },
    {
        "podcast_id": 219377,
        "title": "TorahWeb Live Events",
        "description": "<p>Videos of these shiurim are available at <a href=\"https://vimeo.com/torahweb\">https://vimeo.com/torahweb</a> . This podcast consists of recordings of our in-person events (yemei iyun), which pay special attention to contemporary religious and social issues. Our speakers include Rabbi Hershel Schachter, Rabbi Mayer Twersky, Rabbi Aryeh Lebowitz, Rabbi Ahron Lopiansky, Rabbi Mordechai Willig, and Rabbi Michael Rosensweig.</p>",
        "language": "en-us",
        "author_name": "TorahWeb.org",
        "slug": "torahweb-live-events",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 219844,
        "title": "Abby & Eli's Spiritual Journey",
        "description": "<p>Come join us as we share wisdom and insights about healing, life, and spirituality.</p><p>Thanks to Reuven Lerman for the microphone!</p><p>Photo by Micaeli Engel</p><p>Logo by \"Diddy's Designs\"</p>",
        "language": "en",
        "author_name": "Eliezer & Avigail Sapir",
        "slug": "sapir",
        "cover": "20230724_080743_e82f275b04e0ea6bf538ab5c60e2dd27.jpg"
    },
    {
        "podcast_id": 220419,
        "title": "Sihot Series",
        "description": "<p>Sihot given to Bnei Torah</p>",
        "language": "en",
        "author_name": "Rabbi Meyer Yedid",
        "slug": "sihot",
        "cover": "20230720_040724_f3e148635cee93a331cc44f93c7b70a2.jpg"
    },
    {
        "podcast_id": 222374,
        "title": "The Meta Shtetl",
        "description": "<p>Interviewing today's Yiddishists at the frontier of using technology to proliferate the Yiddish language and culture worldwide.</p><p>Follow along with the English translation at <a href=\"http://www.themetashtetl.com\">www.themetashtetl.com</a> </p>",
        "language": "en",
        "author_name": "Eitan Binstock",
        "slug": "themetashtetl",
        "cover": "20230803_010810_992f0b6fa5a236ce5a068247195d04f7.jpg"
    },
    {
        "podcast_id": 222451,
        "title": "A Jew Perspective",
        "description": "<p>Welcome to A Jew Perspective Podcast, where we dive deep and explore Jewish topics, people, and places!</p>",
        "language": "en",
        "author_name": "Dylan Vermeire",
        "slug": "jewperspective",
        "cover": "20230803_040831_5c4289e6b35e6dbba11b26e3d3a7a142.jpg"
    },
    {
        "podcast_id": 222554,
        "title": "Antediluvian Revelations: A Poetic Retelling of the Book of Enoch, The Prophet, Season Two",
        "description": "<p>This second season of the podcast series is the continued presentation of <em>Antediluvian Revelations: A Poetic Retelling of the Book of Enoch, the Prophet, PART TWO</em>. As explained in the introduction episode of the first podcast series by the same name and author, there are five parts of the epic poem. The first part of the epic poem presents the ancient testimony of Enoch who describes his extraterrestrial abduction experience and the reason for it to have occurred two generations before the birth of Noah. Enoch was the seventh man from Adam, and he was Almighty God's first prophet.</p><p>Season Two of this podcast series will cover the parables of Enoch, which are Enoch's presentation of additional, prophetic messages to future generations that might endeavor to read and understand his book. Because the original <em>Book of Enoch</em> may have actually been memorized in poetic format and spoken aloud from one generation to the next, this poetic retelling is being presented in oral fashion by reading it aloud.</p><p>Listeners can listen to the second season of this series for free with advertising on all the usual platforms, but early release and advertising free listening are available on Apple Podcasts.  The entire production will be available as an audiobook or PDF with an estimated release date in December 2023.</p><p>Please visit our Associated Author's website!</p>",
        "language": "en",
        "author_name": "Michael Inacloud",
        "slug": "antediluvianrevelations-part2",
        "cover": "20230804_100821_1206876a8f1a652b6e6ca891798f6611.jpg"
    },
    {
        "podcast_id": 223154,
        "title": "Shaar HaBitachon - Das Tor des Vertrauens zu HaShem ",
        "description": "<p>Shaar HaBitachon - Das Tor des Vertrauens zu HaShem - Einleitung, das Vorwort</p><p>In den heiligen Kapiteln von Shaar Habitachon, dem leuchtenden \"Tor des Vertrauens\", aus der Feder des geschätzten Weisen Rabbeinu Bachya ibn Pekuda aus Spanien aus dem elften Jahrhundert, liegt eine heilige Weisheit. Während die Welt in Aufruhr ist, umhüllt von Stürmen der Ungewissheit und ungesehenen Pfaden, suchen unsere Herzen Zuflucht vor der unerbittlichen Kadenz unserer sterblichen Tage, die voll von Mühsal, Angst und dem Unbekannten sind. Wie können wir unsere Seelen in den heftigsten Stürmen in einem ruhigen Hafen verankern? Wie kann man inmitten der Wirbelstürme des Lebens die Zuflucht der Gelassenheit suchen? Das \"Tor des Vertrauens\" winkt uns und führt unsere Seelen auf eine göttliche Odyssee zu einem unerschütterlichen Vertrauen in die allmächtige und barmherzige Umarmung von Haschem. In diesem ehrwürdigen Buch wird uns der Weg gezeigt, wie wir die unvorhersehbaren Gezeiten des Lebens mit einem dauerhaften und tiefen Vertrauen in den Allmächtigen meistern können.</p><p>(Live Mitschnitte meines Unterrichts - gestreamt u.a. von dem Jüdischen Bildungszentrum Chabad Berlin.)</p><p>English:</p><p>In the hallowed pages of Shaar Habitachon, the luminous \"Gate of Trust\", penned by the esteemed eleventh-century sage, Rabbeinu Bachya ibn Pekuda of Spain, there lies a sacred wisdom. As the world convulses, enshrouded in tempests of uncertainty and paths unseen, our hearts seek refuge from the relentless cadence of our mortal days, replete with toil, trepidation, and the unknown. How might we anchor our souls in serene harbor during the fiercest of storms? How does one seek the sanctuary of serenity amidst the maelstroms of life? The \"Gate of Trust\" beckons us, guiding our souls on a divine odyssey towards an unwavering trust in the omnipotent and merciful embrace of Hashem. Immersed in this revered tome, we are shown the way to navigate life's unpredictable tides with an enduring and profound trust in the Almighty.</p><p>(Live recordings of my classes - streamed by the Jewish Education Centre Chabad Berlin, among others).</p>",
        "language": "de",
        "author_name": "Noach Ebel",
        "slug": "shaar-habitachon---das-tor-des-vertrauens-zu-hashem",
        "cover": "20230809_040825_97ec4adc528e098aacf7888590bb02d7.jpg"
    },
    {
        "podcast_id": 223168,
        "title": "Das Buch Tanya / Lessons in Tanya",
        "description": "<p>In den heiligen Kammern unserer heiligen Traditionen liegt der Tanya - ein Edelstein des jahrhundertealten Erbes von Chabad. Dieses Werk, das sowohl mystischen Charme als auch praktische Weisheit ausstrahlt, ist das Vermächtnis von Rabbi Schneur Zalman von Liadi (1745-1812), dem leuchtenden Stern der Chabad-Lubawitsch-Konstellation. Der Kern des Tanja spiegelt die tiefe Frage der Menschheit wider: Wer sind wir inmitten der immer stärker werdenden und schwindenden Gezeiten des Glaubens? An manchen Tagen tanzen unsere Seelen zu den melodischen Rhythmen des Judentums und der Spiritualität, und an anderen Tagen finden sie Trost in den einfacheren Freuden des Lebens. Man kann sich fragen, wie ein vom göttlichen Funken berührtes Herz jemals nach irdischen Sehnsüchten verlangen kann. Mit Anmut leuchtet der Tanya in das komplizierte Geflecht unserer Seele und enthüllt unser dualistisches Wesen. Durch ihre Weisheit navigieren wir durch die weiten Meere der täglichen inneren Auseinandersetzungen. Auch wenn unser geschätzter Kodex des jüdischen Gesetzes den Bauplan des Lebens akribisch skizziert, bleibt eine tiefere Sehnsucht. Unsere Handlungen mögen die göttlichen Weisungen widerspiegeln, doch es besteht eine Kluft: eine unberührte Distanz zwischen unserem inneren Selbst und unserer heiligen Tora. Wie ein meisterhafter Architekt baut der Tanya eine Brücke zwischen der Seele und ihren frommen Bestrebungen. Sie formt unsere Tora und Mitzvot zu einer echten Reflexion unseres Wesens und ermöglicht es dem Herzen, wirklich mit dem Puls der jüdischen Identität zu schwingen. Aber wenn Sie sich auf den Weg machen, sollten Sie diese heiligen Wahrheiten bedenken: Der Tanja ist keine bloße Schriftrolle, die man leichtfertig durchblättert - sie verlangt Konzentration, Ehrfurcht und Hingabe. Er ist kein bloßes Gefäß für flüchtige Inspiration, ohne Geschichten oder wöchentliche Parscha-Perlen. Die Reise durch den Tanya ist keine flüchtige Eskapade - sie erfordert aufrichtiges Engagement, eine ernsthafte Wanderung. Mehr als Worte ist der Tanya - ein Herzschlag, der jede Tora-Schriftrolle und jede Mitzwa rhythmisch mit Leben füllt.</p><p>Live Mitschnitte meines Unterrichts - gestreamt u.a. von dem Jüdischen Bildungszentrum Chabad Berlin.</p><p> </p><p>English: In the hallowed chambers of our sacred traditions, lies the Tanya — a gemstone of Chabad’s age-old legacy. This opus, radiant with both mystic charm and practical wisdom, is the legacy of Rabbi Schneur Zalman of Liadi (1745–1812), the luminous star of the Chabad-Lubavitch constellation.The Tanya's core echoes with humanity’s profound query: Who are we amidst the ever-waxing and waning tides of faith? Some days, our souls dance to the melodic rhythms of Judaism and spirituality, and on others, they find solace in life's simpler pleasures. One may wonder, how can hearts touched by divine spark ever crave earthly desires?With grace, Tanya shines its guiding light upon our soul's intricate tapestry, unveiling our dualistic essence. Through its wisdom, we navigate the vast seas of daily internal skirmishes.While our cherished Code of Jewish Law meticulously sketches life's blueprint, there remains a deeper yearning. Our actions might mirror divine directives, yet there exists a chasm: an untouched distance between our inner self and our sacred Torah. Tanya, like a masterful architect, crafts a bridge between the soul and its devout aspirations. It molds our Torah and mitzvot into a genuine reflection of our essence, allowing the heart to genuinely resonate with the pulse of Jewish identity.  More than words, the Tanya is a heartbeat, rhythmically infusing life into every Torah scroll and mitzvah.</p><p>Live recordings of my classes - streamed by the Jewish Education Centre Chabad Berlin.</p>",
        "language": "de",
        "author_name": "Noach Ebel",
        "slug": "das-buch-tanya--lessons-in-tanya",
        "cover": "20230808_070853_a649ef9ec33050e445544086366718cf.jpg"
    },
    {
        "podcast_id": 223170,
        "title": "Likkutei Sichot - Deutsch",
        "description": "<p>In den heiligen Schriften unserer Zeit steht \"Likkutei Sichos\" (hebräisch: ליקוטי שיחות) wie ein leuchtender Wandteppich, der die Essenz und Weite der Lehren des verehrten Lubawitscher Rebben, Rabbi Menachem Mendel Schneerson, zusammenwebt. Von tiefgründigen theologischen Überlegungen bis hin zu den Feinheiten der jüdischen Philosophie, von den geflüsterten Erzählungen der Tora und des Talmuds bis hin zu den mystischen Pfaden der Kabbala - Likkutei Sichos führt Sie durch die unzähligen Dimensionen unseres Glaubens. Verwurzelt in der gesprochenen Weisheit, die Rabbi Schneerson über die Jahreszeiten und heiligen Momente hinweg geteilt hat, umspannen diese Essays die weite Landschaft unserer Tage, angeordnet in Übereinstimmung mit den wöchentlichen Tora-Lesungen und den strahlenden Meilensteinen des jüdischen und chassidischen Kalenders. Während der geweihten Versammlungen - den Farbrengen - am Schabbat und an den Festen, inmitten des rhythmischen Kalenders von Chabad Lubawitsch, teilte Rabbi Schneerson seinen endlosen Fluss der Weisheit, der stundenlang in aller Ruhe fließt. Unter den unzähligen Echos seiner Worte fanden diejenigen, die am tiefsten nachhallten und die das Fundament seiner spirituellen Vision bildeten, ihren geschätzten Platz in den Likkutei Sichos. Diese Worte, die ursprünglich wöchentliche Pergamente zierten, trugen die akribische Handschrift des Rebben, als er sie überprüfte und verfeinerte, bevor er sie der Welt schenkte. Rabbi Schneersons Vermächtnis, ein krönendes Juwel im Wandteppich der chassidischen Geschichte, verkörpert den Zenit des chassidischen Strebens: die verjüngenden Quellen des Chassidus weit und breit zu verbreiten und sie nahtlos mit den unzähligen Schattierungen des Judentums zu verweben. In Likkutei Sichos findet man eine destillierte Essenz der Vision des Rebben, ein Zeugnis ihrer tiefen Tiefe und ihres Aufrufs zum Handeln.</p><p>Live Mitschnitte meines Unterrichts - gestreamt u.a. von dem Jüdischen Bildungszentrum Chabad Berlin.</p><p>In the sacred annals of our age, \"Likkutei Sichos\" (Hebrew: ליקוטי שיחות) stands as a luminous tapestry, weaving together the essence and expanse of teachings from the venerated Lubavitcher Rebbe, Rabbi Menachem Mendel Schneerson. This collection serves as a beacon, illuminating Rabbi Schneerson's unparalleled insights into Judaism and the intricate dance of the universe.From profound theological ponderings to the intricacies of Jewish philosophy, from the whispered tales of the Torah and Talmud to the mystic trails of Kabbalah, Likkutei Sichos navigates the myriad dimensions of our faith. Rooted in the spoken wisdom shared by Rabbi Schneerson across seasons and sacred moments, these essays span the vast landscape of our days, arranged in alignment with the weekly Torah readings and the radiant milestones of Jewish and Hasidic calendars. It was during the sanctified gatherings – the farbrengens – on Shabbat and the festivals, amidst the rhythmic calendar of Chabad Lubavitch, that Rabbi Schneerson would share his endless river of wisdom, flowing unhurriedly for hours on end. Amongst the myriad echoes of his words, those that resonated most deeply, that formed the bedrock of his spiritual vision, found their cherished place in the Likkutei Sichos. These words, initially gracing weekly parchments, bore the Rebbe's meticulous touch as he reviewed and refined them before bestowing upon the world Rabbi Schneerson's legacy, a crowning jewel in the tapestry of Hasidic history, embodies the zenith of the Hasidic quest: to spread the rejuvenating springs of Chassidus far and wide, intertwining them seamlessly with the myriad hues of Judaism. In Likkutei Sichos, one finds a distilled essence of the Rebbe's vision, a testament to its profound depth and its beckoning call to action.</p><p>Live recordings of my classes - streamed by the Jewish Education Centre Chabad Berlin.</p>",
        "language": "de",
        "author_name": "Noach Ebel",
        "slug": "likkutei-sichot---deutsch",
        "cover": "20230808_080843_27db8933436463bccb2d734dfb3acbc7.jpg"
    },
    {
        "podcast_id": 223177,
        "title": "Rebbe und Chassid",
        "description": "<p>Rebbe und Chassid</p><p> </p><p>Im Herzen eines Chassid liegt eine tiefe Verbundenheit mit seinem Rebbe, ein Anker tief im weiten Ozean der chassidischen Tradition. Viele in der breiteren jüdischen Welt nehmen diese Verbindung mit einem getrübten Blick wahr. Denn so wie die ätherischsten Wahrheiten des Judentums oft in einem Schleier der Rätselhaftigkeit tanzen, so bleibt auch die Rolle eines Rebben für manche ein geflüstertes Geheimnis, eine oft falsch gehörte oder ganz und gar nicht gesungene Melodie. Wer also ist der Rebbe? Ein Tzaddik, der in Rechtschaffenheit erstrahlt? Eine Koryphäe im riesigen Universum der Tora? Ein Leuchtfeuer, das die Seelen entzündet, das lenkt, erleuchtet und Trost spendet in den Prüfungen des Lebens, sowohl des Geistes als auch des Herzens? Der Rebbe verkörpert all dies und geht doch darüber hinaus. Kein noch so großer Strauß von Lobpreisungen kann die Essenz eines Rebben wirklich einfangen. Denn ein Rebbe ist ein Gefäß, das mit göttlichem Licht überströmt, ein seltenes Juwel, das der Allmächtige in unsere Mitte stellt, Generation für Generation, und das ein Portal zu spirituellen Aussichten jenseits des gewöhnlichen jüdischen Horizonts bietet. In seinem Herzen hegt ein Rebbe keine irdischen Sehnsüchte, außer der Umarmung des Göttlichen, dem Streben nach den Geboten der Tora und der Führung der Seelen auf diesem heiligen Pfad. Das unterscheidet ihn selbst von den am meisten verehrten Tora-Gelehrten. Obwohl der Wandteppich der Chassidim reich und vielfältig ist, gewebt aus einzigartigen Traditionen und Bräuchen, gibt es einen goldenen Faden, der sie alle verbindet: das unnachgiebige Band zwischen den Chassidim und ihrem Rebbe. Aus Angst vor Parallelen zu anderen Glaubensrichtungen haben sich einige Juden, vielleicht aus Unwissenheit, manchmal von ihnen abgewandt oder sogar tiefe Wahrheiten, die in ihrem eigenen Erbe verwurzelt sind, in Frage gestellt. Wie, so fragen sie sich, kann ein Sterblicher in unserem direkten Bund mit dem Göttlichen eine so verehrte Stellung einnehmen? Missverständnisse über dieses heilige Band, das Bündnis zwischen Rebbe und Chassid, und seine Bedeutung in der großen Erzählung des Judentums können zu falschen Vorstellungen führen. Das Ziel dieses Bandes ist es, diesen Nebel zu vertreiben und das Vermächtnis und die überragende Rolle eines Rebben in der jüdischen Odyssee sowie seine tiefe Verwandtschaft mit seinen Schülern zu beleuchten.</p><p>Live Mitschnitte meines Unterrichts - gestreamt u.a. von dem Jüdischen Bildungszentrum Chabad Berlin.</p><p>In the heart of a Chassid, there lies a profound bond with their Rebbe, an anchor deep within the vast ocean of Chassidic tradition. Many, in the wider Jewish tapestry, perceive this tie with a clouded gaze. For just as the most ethereal truths of Judaism often dance in veils of enigma, so too does the role of a Rebbe remain a whispered secret to some, a melody often misheard or altogether unsung. So who, then, is the Rebbe? A tzaddik, resplendent in righteousness? A luminary of Torah's vast universe? A beacon who kindles souls, who steers, enlightens, and provides solace in life's trials, both of spirit and of heart? The Rebbe embodies all these and yet transcends them. No bouquet of praises, however grand, can truly capture the essence of a Rebbe. For a Rebbe is a vessel overflowing with Divine light, a rare gem that the Almighty sets amidst us, generation after generation, offering a portal to spiritual vistas beyond the ordinary Jewish horizon. ... Misunderstandings of this sacred bond, the Rebbe-chassid alliance, and its significance in Judaism's grand narrative can breed misconceptions. This tome's quest is to dispel these mists and shine a luminous beacon on the legacy and paramount role of a Rebbe in the Jewish odyssey and his deep kinship with his disciples.</p><p> </p><p>Live recordings of my classes - streamed by the Jewish Education Centre Chabad Berlin.</p>",
        "language": "de",
        "author_name": "Noach Ebel",
        "slug": "rebbe-und-chassid",
        "cover": "20230808_080839_a8e22824125a3b2af038bf491a271cc8.jpg"
    },
    {
        "podcast_id": 224329,
        "title": "Elevate Within - An Elul Journey",
        "description": "<p>The month of Elul is here! 💪 🆙 😁</p><p>Join us on this 4️⃣0️⃣ day journey as we explore mind-shifting ideas on Teshuva and practical steps to reaching our higher selves 🧗‍♂ ♾ 🙌 🤩</p><p>Every day I’ll be posting another 5 minute sound bite. Please follow along on this transformative journey 🙏</p><p>Make sure to subscribe to this podcast to receive them daily.</p><p>They will also be posted daily in our WhatsApp group here: <a href=\"https://chat.whatsapp.com/IZgBg8s1Gs66OY7GuUEYIK\">https://chat.whatsapp.com/IZgBg8s1Gs66OY7GuUEYIK</a></p><p>Join our Halacha podcast here: <a href=\"https://podcasts.apple.com/au/podcast/the-source-halacha-shiur/id1697785423?i=1000624357555\">https://podcasts.apple.com/au/podcast/the-source-halacha-shiur/id1697785423?i=1000624357555</a></p>",
        "language": "en",
        "author_name": "Ezra Balsam",
        "slug": "elevatewithin",
        "cover": "20230816_010849_404e62e19111548cd7b6b2cf820a0291.jpg"
    },
    {
        "podcast_id": 225048,
        "title": "Elul Reflections",
        "description": "<p>Short ideas to get into Elul and Yomtov with R' Danny Eisenberg and R' Yaakov Einstein of the Sydney Kollel.</p>",
        "language": "en",
        "author_name": "Danny Eisenberg",
        "slug": "elul-reflections",
        "cover": "20230821_120806_ba2feb9d8eb01652830318179058a7f8.jpg"
    },
    {
        "podcast_id": 227674,
        "title": "Conscious Judaism",
        "description": "<p>Weekly lectures on the Baal Shem Tov</p>",
        "language": "en",
        "author_name": "Yakov kKirsh",
        "slug": "consciousjudaism",
        "cover": "20230907_060942_e7d9e4b997ebe4b83ee5a4f33f4f3d1f.jpg"
    },
    {
        "podcast_id": 227836,
        "title": "VHP quick guides ",
        "description": "<p>Welcome to the VHP quick guides, your go-to place for quick and accessible insights into Halacha. In each shuir, we break down complex Halachic concepts and practical applications in just a few minutes. Whether you're a busy professional, a student, or anyone interested in deepening your understanding of Halacha. </p><p>Shuir by Rav Ami Merzel, head of the Virtual Halacha Program </p><p>To learn more about the Virtual Halacha Program, see our website https://vhalacha.com/</p>",
        "language": "en",
        "author_name": "Virtual Halacha Program ",
        "slug": "virtualhalacha",
        "cover": "20230908_080907_22b2498ccd8abc5ee12a491192dfeb51.jpg"
    },
    {
        "podcast_id": 227916,
        "title": "Unveiling Divine Purpose: The Creation of Christianity and Islam\"",
        "description": "<p>In this episode of Noahide Insights, we embark on a profound journey to uncover the divine purpose behind the creation of two major religions: Christianity and Islam. Join us as we delve into the teachings of Maimonides, seeking to understand the higher spiritual reasons for these monumental events in human history.</p>",
        "language": "en",
        "author_name": "NOAHIDE INSIGHTS",
        "slug": "rabbialex",
        "cover": "20230909_010955_6d2fa3c5158dbb9910a91999902219aa.jpg"
    },
    {
        "podcast_id": 228574,
        "title": "Oy Vey, What Would Bubbe Say?!",
        "description": "<p>Your Jewish guides through womanhood, college life, dating jewish - or not, and so much more! Every week Bree and Sammi will bring you a new topic and some hot takes to leave you wondering, \"Oy vey, what would Bubbe say?!\"</p><p>- Xoxo, Love you lox!</p>",
        "language": "en",
        "author_name": "Bree and Sammi",
        "slug": "oyveywwbs",
        "cover": "20230913_100919_560590c8345819eebf2a297ba2daa59a.jpg"
    }
]