[
    {
        "podcast_id": 8208,
        "title": "ABA Wizard",
        "description": "The ABA Wizard podcast is your weekly dose of research. Keep up with current literature in the field of applied behavior analysis as Kylan Heiner, BCBA takes the mic and interviews authors of current journal articles. ",
        "language": "en",
        "author_name": "ABA Wizard",
        "slug": "abawizard",
        "cover": "20200426_234543_8da91562fe67034ee6df5bcf9475b9b9.jpeg"
    },
    {
        "podcast_id": 9014,
        "title": "Made in India SLP",
        "description": "A podcast aimed at bringing the global Indian SLP community together to make a difference one word and swallow at a time.",
        "language": "en",
        "author_name": "Made in India SLP",
        "slug": "madeinindiaslp",
        "cover": "20200523_050939_e941968dc5ede8c57d10968beff37bad.jpeg"
    },
    {
        "podcast_id": 9024,
        "title": "En İlginç Anı",
        "description": "Hayatımızda yaşadığımız en ilginç anları paylaşıyoruz. Deneyimlerimiz bizleri daha güçlü yapıyor. Heeey! Ne duruyorsun be, at kendini denize...",
        "language": "tr",
        "author_name": "Aykut Aslantaş",
        "slug": "enilgincani",
        "cover": "20200523_144857_11c6f6ed0fad625e30674772e722576c.jpeg"
    },
    {
        "podcast_id": 10235,
        "title": "Neural Compass",
        "description": "A neuroscience major from the University of Chicago exploring the intersections of neuroscience, psychology, and our daily lives. ",
        "language": "en",
        "author_name": "Stephen Sinicrope",
        "slug": "neuralcompass",
        "cover": "20200703_001138_a392be7b2992f68c963f49f77924ed15.jpg"
    },
    {
        "podcast_id": 10906,
        "title": "The Nameless Program",
        "description": "JAEJA discuss various topics.",
        "language": "en",
        "author_name": "JAEJA",
        "slug": "thenamelessprogram",
        "cover": "20200728_031310_3812a31f2517712d7afc1399359a0f46.jpg"
    },
    {
        "podcast_id": 11006,
        "title": "Auf a Bierli mit Trixi und Pepi ",
        "description": "De Trixl und I sind gsessen zamman im Heifl und hom übers Lebm gred da hamma uns dacht herst des suitn amoi de jungan Leit hean. Vü Spoß gell",
        "language": "de",
        "author_name": "Leon Hoffmann-Ostenhof",
        "slug": "pepiundtrixi",
        "cover": "20200731_111225_7926d55b0079e9dcb875146c8741d4b2.jpg"
    },
    {
        "podcast_id": 11422,
        "title": "Seas the World",
        "description": "I am an undergraduate student studying marine biology at the University of Hawaii at Manoa and I want to create this platform to allow other students, grad and undergrad, as well as professors and researchers to be able to showcase their research and give advice. ",
        "language": "en",
        "author_name": "Leanne De Leon",
        "slug": "seastheworld",
        "cover": "20200816_032957_3ce5e732c1e2c029688a165f929a4692.jpg"
    },
    {
        "podcast_id": 13130,
        "title": "Huevo & Milo",
        "description": "<p>Podcast de nuestros hosts Huevo y Milo sobre temas varios, teorías conspirativas, tecnología, seguridad informática, la vida y lo que se les atraviese.</p>",
        "language": "es",
        "author_name": "Huevo & Milo",
        "slug": "huevomilo",
        "cover": "20230818_020850_2fd1f2b68c607dc91ab0d091b30b6f2b.jpg"
    },
    {
        "podcast_id": 14035,
        "title": "Lady Scientist Podcast",
        "description": "Lady Scientist Podcast brings you into conversations with scientists. Academic research is often siloed in tough-to-read academic journals. This podcast strives to introduce you to new voices and to break down barriers, along with striking a note of positivity in an often-negative world. \n \nSupport the podcast through patreon.com/ladyscientistpodcast\nAll links are available through our website, ladyscientistpodcast.com\n",
        "language": "en",
        "author_name": "Jocelynn Pearl",
        "slug": "ladyscientistpodcast",
        "cover": "20210708_140307_a1908e28c90fd587484971a4a007ab25.jpg"
    },
    {
        "podcast_id": 14139,
        "title": "Mix Circles Podcast",
        "description": "Welcome to the Mix Circles Podcast. Here, I and those who appear on this podcast throw all titles, all skin colour, everything away, and focus on the least focused on part of life; Genuine conversation. Like the groups of older generations meeting at your local coffee shop, having a calm debate between two humans of different backgrounds… different upbringings… different perspectives. \nNow, for me “Mix”, I’m just an idiot, only trying to make it through life, one day better then the last one, one day at a time. I’m a Millennial, not by choice, but because I’m swept into that pile. I come from a cadet background (Royal Canadian Air Cadets), and I DO NOT back down to those who challenge my views/beliefs. BUT, I am just a licensed bodyman from Canada, with possibly some mental disconnections. Honestly, just a nobody that has surprised himself as to how he has gotten this far in his life, when people used to tell him the cliché terms like you’re “no good”, “worthless”, “stupid”, “weirdo”; that you’re just stupid and will not succeed. Battling himself, trying to find the “meaning of life”. If you’re like me, you often find yourself alone, asking. ”What is the correct way to think/interact? Why are humans here? How did we come to be? What is the REAL TRUTH? Is it Science, Is it Religion? Where are we going? Who will lead us? Who will lead us humans to greatness? But, aren’t we all just that? Human. So why not come along for the ride, be human, come join my discussion circle, have a coffee or tea, and let’s talk; Shall we?\nSome of you, are probably asking, but WHO is this guy? For privacy reasons, I wish for my identity to stay private. I do not wish for fame. YES I DO NOT WISH FOR FAME. I don’t wish to be worldwide know. I just want people to LISTEN TO THE PODCAST. I am merely just using this platform as all AMAZING podcasters do (on this amazing service), Just as a meeting point, to discuss views and have a good discussion, to take a step back from life (stop to smell the roses), just relax, have a conversation about whatever comes to mind and not have to worry about \"Nae-Sayers\". Focus on genuine conversation between two humans. \n",
        "language": "en",
        "author_name": "Mix Circles",
        "slug": "mixcirclespodcast",
        "cover": "20201103_154211_1420827f7aa167ecfcc44bad749eb0f8.jpg"
    },
    {
        "podcast_id": 14524,
        "title": "Довколаботаніка",
        "description": "Подкаст про ботаніку та інші природничі науки",
        "language": "uk",
        "author_name": "Oleksii Kovalenko",
        "slug": "dovkolalabotanika",
        "cover": "20201112_124058_e33ef75097a3d68091d92ea2d09562fe.jpg"
    },
    {
        "podcast_id": 15988,
        "title": "The Slutty Scientist Podcast",
        "description": "Not your middle school sex education course!  Join Brooke and her special guests as they break stigmas surrounding sexual experiences with scientific and medical insight.  She provides facts and resources to help normalize and educate about these taboo and socially stigmatized topics, while providing first-hand insight and experiences.  Buckle up and wrap your willy because this is going to be one hell of a ride. ",
        "language": "en",
        "author_name": "The Slutty Scientist",
        "slug": "thesluttyscientistpodcast",
        "cover": "20220112_040145_b98698f0bd2e8951910b00a19d10f1e6.jpg"
    },
    {
        "podcast_id": 21674,
        "title": "Medici Boni Podcast",
        "description": "Od mediků pro mediky, a všechny další zájemce, o světě medicíny přímo z první ruky. Trocha vyprávění, studií a rozhovorů na akademické půdě. O úskalích a slastech studia na lékařské fakultě, o zkušenostech ze zahraničí či o nejnovějších lékařských poznatcích. Bavilo nás pomáhat si jako medici navzájem a rádi bychom na to navázali právě tímto \"insiderem\" do světa medicíny, který snad nejen medikům, ale i všem dalším zájemcům, pomůže nakouknout více do úžasného světa klinické a laboratorní medicíny. Podcastem Vás provází MUDr. Jakub Hurych a MUDr. Roman Štícha z tvůrčí skupiny Medici Boni, autoři učebnice \"Lékařská mikrobiologie - repetitorium\".\n",
        "language": "cs",
        "author_name": "Medici Boni",
        "slug": "medicibonipodcast",
        "cover": "20210102_140303_e00faf83447382166b58c9a42efaa692.jpg"
    },
    {
        "podcast_id": 24420,
        "title": "The Curious Mind of Griff",
        "description": "Griff talks about whatever topic he's interested in with the experts that know!\n\n***We would love to hear from you!!!***\n\nI love all criticism, thoughts, notes, potential guests, whatever....please reach out!\n\nTwitter: @MindOfGriff\nEmail: TheCuriousMindOfGriff@gmail.com\n\n",
        "language": "en",
        "author_name": "Jeffrey Griffin",
        "slug": "thecuriousmindofgiff",
        "cover": "20210212_024121_03e5b49a9fbb23c5a7500f4affcb031f.jpg"
    },
    {
        "podcast_id": 25734,
        "title": "Bridge to the Bay with Dr. Veras",
        "description": "Bridge to the Bay is a podcast dedicated to chronicling Dr. Matt Veras' journey from Cambridge, Canada to the Bay Area in California. Along the way he picked up a Ph.D. in Physiology and Pharmacology that allowed him to get hired at Google's Life Sciences company Calico, where he is working on extending human lifespan. This podcast is meant to be a platform to have conversations with Dr. Veras' esteemed colleagues, friends, and more about how they got to their careers, the current state of the world, and how to change it for the better for generations to come.",
        "language": "en",
        "author_name": "Matthew Veras",
        "slug": "bridgetothebay",
        "cover": "20210119_034107_71a5f51add5c4bb64cf0298646a78403.jpg"
    },
    {
        "podcast_id": 30139,
        "title": "BlackPink.org presents... The Rhythm Notes of Health Podcast",
        "description": "BlackPink.org’s initiative to educate our community on health matters that affect Black people. We are here to take the intimidation out of your health concerns and your relationships with health professionals.  Moreover, I am excited to bring Health Equity to the forefront one dis-ease at a time.  BlackPink’s Advisory Team of Physicians address health and medicine in a holistic approach. ",
        "language": "en",
        "author_name": "Kai Ianta Burks, MPH - The Soul of Public Health",
        "slug": "bptherhythmnotesofhealth",
        "cover": "20210204_234135_8e5bcbebe7c499ae4ea02ec71975fcfe.jpg"
    },
    {
        "podcast_id": 31650,
        "title": "In Search of Insight",
        "description": "Meet your hosts Emiel and Erika, and prepare to take a deep dive into the science behind Nootropics Depot's industry-leading approach to health and nootropics.",
        "language": "en",
        "author_name": "Nootropics Depot",
        "slug": "nootropicsdepot",
        "cover": "20211026_184803_eeba886ca4c9f7c125b90b85b039f9b5.jpg"
    },
    {
        "podcast_id": 33005,
        "title": "Coffee and Cannabis",
        "description": "Coffee and Cannabis is a series of coffee-length conversations with professionals, researchers, and thought leaders in cannabis that helps bring you deeper insight into who these individuals are, and how they’re shaping the industry.",
        "language": "en",
        "author_name": "Alex Jean",
        "slug": "coffeecannabis",
        "cover": "20210326_030342_a61ca6997a319c78797bb32672e7597c.jpg"
    },
    {
        "podcast_id": 36174,
        "title": "The Dental Implant Podcast",
        "description": "<p>Welcome to the dental implant podcast, with your host, Pav Khaira. Your source of knowledge for all things relating to dental implants</p>",
        "language": "en",
        "author_name": "Dr Pav Khaira",
        "slug": "thedentalimplantpodcast",
        "cover": "20230413_020404_43590d9f569a6dfbe5315adbdedfc9f2.jpg"
    },
    {
        "podcast_id": 38962,
        "title": "WR: UR - The Unlimited Robotics Podcast",
        "description": "Welcome to WR:UR - we are Unlimited Robotics. \nThis podcast is designed for anybody who is interested in robotics and mechanics, including makers, software developers, data scientists, engineers and robot developers. \nWe host interesting guests from all across the board, discussing about, what we believe to be, fascinating topics in robotics and the interactions between humans and machines. \n\nUnlimited Robotics is a startups that develops an open platform that makes the entire robot development process easier and faster. On the other hand, we empower engineers to offer mechanical solutions for people in different industries, such as people with disabilities, hospitals, education, life saving organizations and more.\nPlease visit us on www.unlimited-robotics.com for more information or write us to: developers@Unlimited-robotics.com if you want to join our rapidly growing community of makers. ",
        "language": "en",
        "author_name": "Unlimited Robotics",
        "slug": "unlimitedrobotics",
        "cover": "20210824_150702_8d30ccb1cf97107b8c8fec6efbbd7117.jpg"
    },
    {
        "podcast_id": 42390,
        "title": "Lucyfer's Lair",
        "description": "A variety podcast about death, magick, kink, and more! Hosted by @LucyferOfficial live on twitch every 2nd Monday of the month at twitch.tv/lucyferofficial. Join the discord at linktr.ee/LucyferOfficial",
        "language": "en",
        "author_name": "Lucyfer",
        "slug": "thedemonandthebee",
        "cover": "20220805_060847_ec5af0dad15dfec0208843166e3923ed.jpg"
    },
    {
        "podcast_id": 44328,
        "title": "we4 Impact Academy Talk",
        "description": "Die Risiko- und Leistungsprüfung ist keine reine Wissenschaft, sondern auch eine Kunst – und darum richtig spannend, wenn neue Impulse und Denkanstöße auf die bisherige Praxis treffen. In unseren Academy Talks bringen wir Mediziner und Wissenschaftler, digitale Innovatoren und Experten aus der Versicherungsindustrie zusammen. Das Ziel: Neugierde wecken, Neues im Bekannten entdecken, die Zukunft besser meistern. Und natürlich wollen wir zur Diskussion anregen – immer entspannt, stets relevant und nie umsonst. Nur kosten tut es nichts.",
        "language": "de",
        "author_name": "Dr. Karsten Filzmaier & Dr. Laila Neuthor",
        "slug": "we4impactacademy",
        "cover": "20210801_155425_320bffb3f6d995c5437a11027cec9d5f.jpg"
    },
    {
        "podcast_id": 49475,
        "title": "Papers Aloud",
        "description": "This podcasts features readings of open-access (CC BY) primary research articles and reviews relevant to evolutionary and cell biology, environmental and clinical microbiology, symbiosis, geobiology, and bioinformatics. \n\n\nI avoid Methods sections, and sometimes Results (depending on how amenable it is to reading out loud). Abstract, Introduction, Discussion, and Conclusions are always included.\n\n\nIf you are an author of a research article and would like to have your work converted to an audio format, or send me an audio recording of your paper, please reach out to rkdgarber@gmail.com.",
        "language": "en",
        "author_name": "Arkadiy Garber",
        "slug": "audiolit",
        "cover": "20210415_073451_2d764e8f8254c03bc6e85ac462a67a36.jpg"
    },
    {
        "podcast_id": 49617,
        "title": "Kære Menneske",
        "description": "Du inviteres ind i et univers, hvor der er plads til at snuble og prøve sig frem. Hvor det sårbare hyldes, og erfaringer med menneskelivets mere skrøbelige sider er en fordel fremfor en ulempe. Hvor nærvær, nysgerrighed, ærlighed og mod danner rammen for samtalen. Denne podcast er til dig der gerne vil inspireres til at turde besøge alle livets facetter. Den er til dig, der somme tider føler dig alene i det svære. Den er til dig, der vil grine, græde og være nysgerrig sammen med os. Den er til dig, kære menneske. Velkommen.",
        "language": "da",
        "author_name": "Mette Odgaard Olsson & Mie My Tastesen ",
        "slug": "kaeremenneske",
        "cover": "20210427_075700_bd6a0e2498e02b0313c93e4782b3964b.jpg"
    },
    {
        "podcast_id": 49723,
        "title": "Conversaciones con Lilith",
        "description": "\"Conversaciones con Lilith\" es un programa dedicado al desarrollo personal y espiritual, ocultismo y parapsicología, así como las experiencias personales de su autora, Nathalie d'Arc.\nEn el encontraremos relatos personales, vivencias y enigmas, relatado desde la oscuridad, donde Natalia pudo encontrar su luz.\n\n Te invita a conocer y potenciar tu propia sombra-\n\nBienvenidxs a la realidad de Lilith",
        "language": "es",
        "author_name": "Nathalie d'Arc",
        "slug": "conversacionesconlilith",
        "cover": "20210417_125030_d5f74a5d9c3f33fe2a218de07975e8ca.jpg"
    },
    {
        "podcast_id": 51640,
        "title": "The Med-Tech Talent Lab",
        "description": "<p>Welcome to the Med-Tech Talent Lab the #1 catalyst for advancing careers and building high performing teams. Sponsored by The Anthony Michael Group…helping companies secure in demand talent in Regulatory Affairs, Quality, Clinical, Engineering, R&amp;D and Commercial areas for Medical Device, Digital Health, Diagnostics and other organizations across the US Life Sciences sector.</p>",
        "language": "en",
        "author_name": "Mitch Robbins",
        "slug": "medtechtalentlab",
        "cover": "20210504_211032_8550a43e54a9e82a4c706f4b9700f134.jpg"
    },
    {
        "podcast_id": 52726,
        "title": "Conservation Talk Story",
        "description": "Conservation Talk Story is a storytelling forum for conservationists in Hawaii. We host experts on topics covering every aspect of conservation science, including mitigating human impacts, protecting rare species, and improving public education. Our goal is not only to increase awareness regarding specific conservation issues in the state but also to provide correct information, backed by science, to our listeners so they are equipped to make decisions about sustainability and conservation in their own lives. Hosted by Emily Sesno and Max Bendes, Conservation Talk Story is brought to you by the Hawaii chapter of The Society for Conservation Biology (HISCB) with support from KTUH.",
        "language": "en",
        "author_name": "Max Bendes",
        "slug": "contalkstory",
        "cover": "20210428_033503_657810a74d62dd6f64651e8f7d52cda8.jpg"
    },
    {
        "podcast_id": 57608,
        "title": "Let's Talk Micro",
        "description": "Clinical Microbiology explained in simple terms, suitable for students and microbiologists alike. Hosted by Luis Plaza, a Medical Laboratory Scientist, he also talks about his experiences as a clinical microbiologist.",
        "language": "en",
        "author_name": "Luis Plaza",
        "slug": "letstalkmicro",
        "cover": "20210518_155452_ff250b3ba17c308e991c7f05c13c9848.jpg"
    },
    {
        "podcast_id": 57747,
        "title": "The Official Podcast of the WCD",
        "description": "The World Congress of Dermatology (WCD) will be held next in Singapore in 2023. We are all working hard to bring you an unforgettable congress and experience. Join us in this podcast as we keep up with Dermatology News and talk to dermatologists and skin researchers on their excited work leading up to the Congress.\n\nHosted by Dr Etienne Wang of the National Skin Centre, with Resident co-hosts Sashen Aponso and Ellie Choi.\n",
        "language": "en",
        "author_name": "Etienne Wang",
        "slug": "wcd2023singapore",
        "cover": "20210519_044311_1187f75b46b22fe6bb9a53f601917100.jpg"
    },
    {
        "podcast_id": 60014,
        "title": "Consults Over Coffee: Conversations About Health, Medicine and Living Well",
        "description": "Join Michael P. Jones, MD, a board certified physician in Gastroenterology and Internal Medicine who is a former Professor of Medicine at Virginia Commonwealth University with previous academic appointments at Northwestern University, the University of Cincinnati, Wright State University and Uniformed Services University of Health Sciences. Dr. Jones has over 35 years experience in patient care, research, teaching and administration. \n\nA wide variety of guests from the world of medicine, healthcare, fitness nutrition and the arts join us to discuss topics to help make your life healthier, happier, fuller and more balanced. \n\nOur well-being is our responsibility. In these challenging times, we need to promote community over divisiveness, nurture and support one another and do our best to maintain our health and well being to avoid becoming a casualty of the our for-profit health care system. Join us, and we'll help you do just that!",
        "language": "en",
        "author_name": "Michael P. Jones, MD",
        "slug": "physician-career",
        "cover": "20210530_214506_e3495ba17755ccdb9a1211265d9d4291.jpg"
    },
    {
        "podcast_id": 61657,
        "title": "We Know Some Stuff",
        "description": "Why do all your plants die? Will robots take over the world? Do squirrels like pizza? \n\nCurrent and recent graduate students have the answers to these questions. We certainly don't know everything, which is why you are listening to We Know Some Stuff ",
        "language": "en",
        "author_name": "Louis A. Colaruotolo",
        "slug": "weknowsomestuff",
        "cover": "20210608_044031_dab5a52f412a0aae8afbb048b930ee3c.jpg"
    },
    {
        "podcast_id": 61959,
        "title": "'Bone Up'",
        "description": "The first UK podcast about all matters of bone health. \n\nProf David Armstrong (MD) and Dr Richard Abel (PhD) will discuss bone health, bone disease and how we and our bones can live longer happier, and healthier lives.\n\nPatients, clinicians and scientists alike will all love the cast!\n\nCredits:\nJingle by Jonny Fitch BMus\nCover art by James Armstrong",
        "language": "en",
        "author_name": "Dr Richie Abel (PhD) and Prof David Armstrong (MD)",
        "slug": "boneup",
        "cover": "20210611_142116_456701f64d86fbf0b7ea1dcad4dcce19.jpg"
    },
    {
        "podcast_id": 62206,
        "title": "Is It All Just A Game? ",
        "description": "This is GoogliBearjr's podcast where they talk about reality and game design, and what the world would look like and change if the game was real! \n\nGoogli has a background in environmental studies and is currently studying for her master's in sustainability. She has been playing video games since she was little.",
        "language": "en",
        "author_name": "Googlibearjr",
        "slug": "googlitalks",
        "cover": "20210610_155248_76fa63c4a64c26624770318cb9d2db78.jpg"
    },
    {
        "podcast_id": 64637,
        "title": "DNA in the Bible",
        "description": "Is there a numbers code within the King James Bible?  Was it placed there by the authors, or is this evidence of the hand of God?  The Bible Code is a podcast covering the numbers God uses in the Bible to support doctrine found in the pages of scripture.  You will discover a book most dismiss as archaic is the most advanced book ever to be written.",
        "language": "en",
        "author_name": "The Bible Code",
        "slug": "dnainthebible",
        "cover": "20210623_220450_6d93d341f17fbf8a21a5c342eccb00c2.jpg"
    },
    {
        "podcast_id": 65178,
        "title": "Confronting Covid",
        "description": "Too often during the course of the COVID-19 pandemic we turn on the news and hear convoluted, vague or non-factual information in regards to multifaceted areas of the pandemic. This leaves the general public with unanswered questions about their bodies, science, finances, and overall way of life. How do vaccines work? What even is a coronavirus? What should I be doing to protect my livelihood and well-being? To answer these important questions and many more, join Layla Ahmadi, an aspiring physician and medical correspondent with a B.A. in Biochemistry and Global Health, to better understand the things about the COVID-19 pandemic they won't talk about on the news. Layla frequently collaborates with guest speakers on episodes who are experts in fields of medicine, public health, finance and many others. Tune in to have your burning questions about everything related to the COVID-19 pandemic answered.",
        "language": "en",
        "author_name": "Layla Ahmadi",
        "slug": "confrontingcovid",
        "cover": "20210627_054539_8b55453127318f306d5578c522171fd9.jpg"
    },
    {
        "podcast_id": 65609,
        "title": "The Zero (Half) Hour",
        "description": "Welcome to the Zero (Half) Hour brought to you by Zero Hour Health and Zedic! This is a podcast where we talk with leaders from across the foodservice industry and beyond about the pressing issues of the day - in 30 minutes or less! Our goal is to share ideas from diverse perspectives on a range of topics that matter to EVERY business in the current and post-COVID eras.",
        "language": "en",
        "author_name": "Zero Hour Health",
        "slug": "zero-half-hour",
        "cover": "20210629_172048_185c1173956db2da665f46fd0667e98a.jpg"
    },
    {
        "podcast_id": 65922,
        "title": "Camino a la fertilidad - Igenomix",
        "description": "¡Bienvenido al Podcast de Igenomix! \nSemanalmente, subiremos contenido sobre fertilidad, testimonios reales de luchadoras que consiguieron su sueño de ser madre, entrevistas con científicos, congelación de óvulos y mucho, mucho más. \nSuscríbite para estar informado y no perderte ningún episiodio. ",
        "language": "es",
        "author_name": "Igenomix.es",
        "slug": "igenomix",
        "cover": "20210701_080856_552fea1c2f0a12cd9207caa5b8d0aaee.jpg"
    },
    {
        "podcast_id": 68060,
        "title": "PubReading",
        "description": "Researchers would love if they can expand time to fit in that publication, article, or review of their topic of interest; if that were true, however, there is no end to bottomless scrolling and missing the important details. PubReading would read out the abstract, results, and discussions to allow hassle-free information and a chance to create connections with like-minded individuals.",
        "language": "en",
        "author_name": "Mando Mourad",
        "slug": "pub-reading",
        "cover": "20220604_120651_b1eb6c62ae4201ef92e04bdcecbaf143.jpg"
    },
    {
        "podcast_id": 76306,
        "title": "Making Synapses",
        "description": "Welcome to Making Synapses with Thomas, Co-Founder of Nice Supplement Co.;\nwhere we take on an enthusiasts deep dive into neuroscience, looking into how our brains work, and experiment with how to modulate them. ",
        "language": "en",
        "author_name": "Thomas (Nice Supplement Co.)",
        "slug": "making-synapses",
        "cover": "20210830_024154_de05e4f552eab9f57bf8a239da218871.jpg"
    },
    {
        "podcast_id": 76842,
        "title": "CrocKast Podcast",
        "description": "<p>In this podcast series, Nate and Matt interview the leading figures in field herping, reptile research, zoo work and captive reptile husbandry. Join us as we explore and learn from the best in the world!</p>",
        "language": "en",
        "author_name": "Nathanael Truax",
        "slug": "croc-kast-podcast",
        "cover": "20210901_205210_f82b8bb17dc9732c882dfa6afb81efe0.jpg"
    },
    {
        "podcast_id": 77084,
        "title": "Incoherent Thoughts",
        "description": "Just a first hand account of our daily thoughts, summarized in to brief episodes of non-sense. \nTrying to humanize and spill out thought-processes so that one might relate to the world we see through our lenses. ",
        "language": "en",
        "author_name": "Eddie T. & Bryan S.",
        "slug": "incohearant-thoughts-with-ed",
        "cover": "20210916_021234_ba0646e5aa8e82a4c2cdf412b6e28a0e.jpg"
    },
    {
        "podcast_id": 85383,
        "title": "Acting Out",
        "description": "A real-life ABA podcast. Our podcast explores the world of Applied Behavior Analysis with content to inform listeners of all backgrounds, and discusses the every-day issues of practitioners in the field. ",
        "language": "en",
        "author_name": "Elizabeth Bliss and Tyler Williams",
        "slug": "actingoutpod",
        "cover": "20211015_205436_fdb8a3688df10aa42577ab50419822e7.jpg"
    },
    {
        "podcast_id": 87137,
        "title": "The Canadian Breakpoint",
        "description": "A Canadian Infectious Diseases Podcast by Canadian Infectious Diseases Physicians. ",
        "language": "en",
        "author_name": "Dr. Rupeena Purewal",
        "slug": "thecanadianbreakpoint",
        "cover": "20211108_193436_ac1758ffb599ba8adff85450e235439a.jpg"
    },
    {
        "podcast_id": 89317,
        "title": "AJ PROFESSOR",
        "description": "<p>The Mentalist (Beyond your Mind)</p>",
        "language": "ta",
        "author_name": "AJ PROFESSOR ",
        "slug": "ajprofessor",
        "cover": "20220605_110633_9351bd1bdd54db1dfa6df12d4543dee0.jpg"
    },
    {
        "podcast_id": 92912,
        "title": "JOONAS - Jongeren en Ouders Ondersteunen NA Scheiding",
        "description": "“Wat is het belang van het kind? Wat is de rol van het parket bij een scheiding? Wat is levend verlies bij scheiding? Wat vertellen kinderen en jongeren aan AWEL over de scheiding van hun ouders? Maar ook .. wat zijn risico en beschermende factoren voor kinderen en jongeren? Wanneer en hoe zet je best bemiddeling in? Wat is ouderverstoting en hoe herken je het?\" Dat èn zoveel meer… \nIn JOONAS, de podcast waarmee we Jongeren en Ouders willen Ondersteunen NA Scheiding draait elke aflevering om één centrale vraag. Rond die centrale vraag gaan wij open, maar kritisch in gesprek met een deskundige uit hulpverlening en/of justitiële wereld èn getuigen ervaringsdeskundigen via geluidsfragmenten over hun ervaringen. \nJOONAS is een initiatief van psycholoog en psychotherapeut Vanessa Maes en familiaal bemiddelaar - advocaat Sophie Vanhemmens.\nHun doel? dat zit in de naam… jongeren en ouders ondersteunen na een scheiding… door erkenning en herkenning te bieden in de vele verhalen uit de 2 werelden: die van hulpverlening en die van justitie. \nWil je ook getuigen? Wil je ons helpen bij het maken van deze podcast? Tips? Reacties? Vragen?\nMeer weten of ons volgen? \nFacebookpagina: https://www.facebook.com/joonasdepodcast\nInstagrampagina: https://instagram.com/joonas_depodcast\nWil je ons steunen? \nDan mag dit integraal gaan naar AWEL. Voor onze kinderen en jongeren. Dit mag op het rekeningnummer: BE63 0689 3013 1108. Alvast bedankt!\n",
        "language": "nl",
        "author_name": "JOONAS",
        "slug": "joonas-aflevering0",
        "cover": "20211128_021142_e635d5d88c7077bbaded6f4c40dc54cc.jpg"
    },
    {
        "podcast_id": 93375,
        "title": "CGM First",
        "description": "A podcast for anyone who wants to learn about CGM technology, latest clinical evidence, and find a better way to manage diabetes. Whether you are living with diabetes, trying to navigate the complex environment of diabetes management, or a healthcare professional looking for ways to optimize your patients' treatment - this podcast is for you!",
        "language": "en",
        "author_name": "Dexcom Clinical Education",
        "slug": "cgmfirst",
        "cover": "20211130_111145_c3b4600d48202485cfa5cccc4d56c2c7.jpg"
    },
    {
        "podcast_id": 94570,
        "title": "Talking Country with Brad and Chancey",
        "description": "On our podcast we discuss things going on in the woods, on the creek banks, in the pastures and farms! Join life long friends, Brad and Chancey, as we discuss the things we love! Thank you for listening!",
        "language": "en",
        "author_name": "Brad Vaculin, Chancey Lewis",
        "slug": "talkingcountry",
        "cover": "20211208_041221_95d82fc3903d5aea14adb693dbfb1cee.jpg"
    },
    {
        "podcast_id": 95632,
        "title": "Biomedics Talk Ball ",
        "description": "\n\n3 Scientists. 3 Friends. 1 shared chemistry for the beautiful game. \n\nHosts: Carys (@AFC_Carys), Kevin (@KayW29) and Denzel (@SYZNERGY). \n\nContact:\n+ btb-enquiries@outlook.com",
        "language": "en",
        "author_name": "Biomedics Talk Ball ",
        "slug": "biomedics-talk-ball",
        "cover": "20211213_071256_20240d51813b89d893ff1c3b49d048ea.jpg"
    },
    {
        "podcast_id": 96911,
        "title": "O.R. Insights",
        "description": "In the operating room, you need to make critical decisions in real-time about which tools and techniques to use, decisions that can impact patient recovery and the hospital’s bottom line. \n\nO.R. Insights is the new podcast series from Baxter’s Advanced Surgery designed to slice through the surface for a deeper understanding of the issues surgeons confront every day. ",
        "language": "en",
        "author_name": "Baxter Healthcare ",
        "slug": "orinsights",
        "cover": "20220712_090749_3bb8a26a291e25b97e4603f395b2fa45.jpg"
    },
    {
        "podcast_id": 99727,
        "title": "Untangle",
        "description": "Mental Health is riddled with many challenges and barriers. Come and join me in the journey to untangle the complexities of mental health.\n\nhttps://linktr.ee/Untanglementalhealth",
        "language": "en",
        "author_name": "Brandon Vera Fang",
        "slug": "untanglementalhealth",
        "cover": "20220109_070131_96481c1166f2cb072de0deedee9a74e1.jpg"
    },
    {
        "podcast_id": 100838,
        "title": "Foot Nerd Podcast",
        "description": "Audio content for the Foot Nerd Experience",
        "language": "en",
        "author_name": "Foot Nerds",
        "slug": "footnerdprogram",
        "cover": "20220114_060122_c001bb28e389bb548609d4c306300681.jpg"
    },
    {
        "podcast_id": 101991,
        "title": "SCI Science Perspectives",
        "description": "The American Spinal Injury Association (ASIA) brings you SCI Science Perspectives. The podcast is built around two-part dialogues with spinal cord injury (SCI) professionals regarding their emerging scientific work spanning the full spectrum of SCI research, from discovery to clinical application. \n\nThe SCI Science Perspectives podcast disseminates the latest-and-greatest scientific work in the SCI field via a conversation with researchers that approaches their work from two perspectives: the “scholarly” perspective and the “community” perspective. The process begins with ASIA’s Committees informing the podcast about new and influential scientific papers relevant to the committee’s interests. Then the podcast host(s) then interview the author(s) of the papers, approaching their project from each perspective. Finally, the conversation from each perspective is published as its own episode type: \"Scholarly\" and \"Community\" episodes. Keep an eye out too for \"Admin\" episodes too, communicating administrative information relevant to ASIA members and stakeholders. ",
        "language": "en",
        "author_name": "American Spinal Injury Association",
        "slug": "sci-science-perspectives",
        "cover": "20220120_050113_cd3cbe0745b92c65642a427f8f9f6480.jpg"
    },
    {
        "podcast_id": 104279,
        "title": "The Podcast By EK",
        "description": "A mindset elevating podcast hosted by Eman Khaled. The podcast will be hosting prominent figures talking about diverse topics that are tangible to a wide audience \n   \nبودكاست يرفع من مستوى العقلية تستضيفه إيمان خالد.  سيستضيف البودكاست شخصيات بارزة تتحدث عن مواضيع متنوعة  \n\nFollow the Podcast for ongoing updates on:\nInstagram: https://www.instagram.com/thepodcastbyek/?hl=en\nYouTube: https://www.youtube.com/channel/UCG_vj9MDtBGA3vl7UhY7-QA/videos\n",
        "language": "ar",
        "author_name": "Eman Khaled",
        "slug": "thepodcastbyek",
        "cover": "20220201_090222_97fdeb6f36e8fcec141f6e3fc4c7a2d7.jpg"
    },
    {
        "podcast_id": 104387,
        "title": "Beyond Numbers: Covid19 and Society",
        "description": "<p>The effects of the COVID-19 pandemic go far beyond physical health, challenging our well-being and mental health. But did it affect everyone the same? It is clear that the pandemic also uncovered and deepened the already existing inequalities in our society. This podcast is dedicated to examining those inequalities and the impact that different measures have on different groups. This podcast is an activity of COVINFORM, a project that has received funding from the European Union’s Horizon 2020 research &amp; innovation program. To learn more about the project, you can visit our website or follow us on Twitter, LinkedIn, or Instagram.</p>",
        "language": "en",
        "author_name": "COVINFORM project",
        "slug": "beyondnumbers",
        "cover": "20220128_100123_dec57ddacaef1df5a6b6b8842124ccc0.jpg"
    },
    {
        "podcast_id": 105049,
        "title": "Spatial Navigator",
        "description": "<p>Spatial MultiOmics (Transcriptomics &amp; Proteomics) are at the forefront of biology research, providing spatial context to gene and protein expression. Join us in understanding how tissue heterogeneity is increasing our understanding of tissue biology and pathology. <a href=\"https://nanostring.com/\">https://nanostring.com/</a></p><p>Follow us on: Twitter: <a href=\"https://bit.ly/3qVLXyT\">https://bit.ly/3qVLXyT</a>, Instagram: <a href=\"https://bit.ly/3uOSyfH\">https://bit.ly/3uOSyfH</a>, Linkedin: https://bit.ly/3DB7j9P</p>",
        "language": "en",
        "author_name": "Nanostring Technologies Inc.",
        "slug": "spatial-navigator",
        "cover": "20230627_060650_7ef0527f6027e44999ef6f309644f607.jpg"
    },
    {
        "podcast_id": 106631,
        "title": "The Bottled Water Podcast ",
        "description": "A podcast about everything from UFOs to whatever is going on in the world. ",
        "language": "en",
        "author_name": "Tony",
        "slug": "thebottledwaterpodcast",
        "cover": "20220218_010207_dd9f0818e3d96b9e26c19dba29f82780.jpg"
    },
    {
        "podcast_id": 106943,
        "title": "Product Safety Broadcasting Service",
        "description": "Hosts Jared and Keith bring all-killer - no-filler, unnecessary, yet needed, consumer product safety banter to the open market. \n\nTo become a guest and BS with us - contact Keith or Jared. \n",
        "language": "en",
        "author_name": "Jared & Keith",
        "slug": "psbs",
        "cover": "20220207_040237_fa571ecb27a4c49cc0c0290bfe21f73d.jpg"
    },
    {
        "podcast_id": 110203,
        "title": "Toilet Bowl Diaries",
        "description": "From the day you were born to the day you die, all of the shit is connected. We're going to explore the world of poop to find the answer to the big question. Where's the poop? \n\nWelcome to the Toilet Bowl Diaries.\n\nShare your own story with us at toiletbowldiaries@gmail.com",
        "language": "en",
        "author_name": "Dolores Bubbleguts",
        "slug": "toiletbowldiaries",
        "cover": "20220220_100236_f72bd3e8e5aeaff770483fad5fa21aea.jpg"
    },
    {
        "podcast_id": 111193,
        "title": "Science Society",
        "description": "<p>We invite you to dive into the world of science and discovery, where knowledge knows no bounds. This podcast series aims to bring together a diverse array of scientists, researchers, and thought leaders who are at the forefront of their respective fields. From astrophysics to zoology, climate science to genetics, each episode explores groundbreaking research and innovative insights, providing listeners with a firsthand look at the progress shaping our world.</p><p>Our conversations stretch beyond the confines of laboratories and research papers. They venture into the significance and societal impact of these discoveries, the intriguing challenges scientists face, and the stories behind their aha! moments. Each week, a distinguished guest brings their latest findings to the table, making complex concepts accessible and engaging for both science enthusiasts and the scientifically curious.</p><p>Whether you are a science professional seeking to keep abreast of the latest breakthroughs or a curious mind wanting to better understand the world around you, \"Breakthrough Dialogues\" serves as your window into the fascinating world of scientific discovery. Tune in to stay informed, get inspired, and join the journey toward the future of science.</p>",
        "language": "en",
        "author_name": "Catarina Cunha",
        "slug": "sciencesociety",
        "cover": "20230704_040744_3982aa1d83750960f6e212bee0dfa33e.jpg"
    },
    {
        "podcast_id": 111323,
        "title": "The Amygdala Podcast",
        "description": "This podcast is about critical matters that teens are interested in: we need to act on large issues like climate change or equality, look at several things from a different or deeper perspective, and ascend our knowledge to a higher level about the topics we care about.",
        "language": "en",
        "author_name": "Siddhant Karmali",
        "slug": "theamygdalapodcast",
        "cover": "20220225_050230_a9d1930eccffb63427b74842a21b352b.jpg"
    },
    {
        "podcast_id": 113811,
        "title": "Integral thoughts",
        "description": "Podcast integrating insights from buddhism, philosophy, yogi-wisdom, psychedelic research, psychology, psychiatry, multiple medical fields and real-life observations\n\nInstagram: integral_thoughts_.\n\n\nPodcast theme music by Transistor.fm. Learn how to start a podcast here.",
        "language": "en",
        "author_name": "Integral thoughts",
        "slug": "integralwisdom",
        "cover": "20220308_030326_6ed9e3a210345103aa3a7d5aec1a879d.jpg"
    },
    {
        "podcast_id": 115893,
        "title": "The Jihad Science Show",
        "description": "Current Controversies in Biology & Neuroscience, SARS-CoV-2 & Culture War\nFollow\nhttp://www.mccairndojo.com\nhttps://www.wetalkyoulisten.com/\nMusic Xurios, Radz, Pa11elellives, Astral Throb, OneStepTooFar \nJoin our Discord, the invite can be found on:\nhttps://www.mccairndojo.com/\nTwitter @DrKevinWMcCair1\nTelegram:\nhttps://t.me/DrkevinMcCairn​​​​\n\nSupport the stream\nhttps://www.paypal.com/paypalme/dissidentscholar\nhttps://www.buymeacoffee.com/DrKevinMcCairn\nhttps://streamlabs.com/kevinmccairn2\nhttps://buy.stripe.com/28ofZqenB37z9KEfYZ\nhttps://www.patreon.com/join/4229182?\nhttps://www.subscribestar.com/kevin-w-mccairn-ph-d\nhttps://www.mccairndojo.com/​​​​\nResearch History - Kevin W. McCairn Ph.D.\nhttps://www.researchgate.net/profile/Kevin_McCairn\n\nMain/ Channel: Kevin W. McCairn Ph.D.\nhttps://www.youtube.com/channel/c/KevinWMcCairnPhD\n\nBitcoin:\n34JZjBeTrG2w9AVB8Tpdt1PVt78UoWrMZV\n\nBitcoin Cash:\nqqfuagsmg9xk5gsptke88y42jan8x5mauyj2yng2hp\n\nEthereum:\n0xB8bE2a9A2edCbb77A6a2Cd289032Cecad3C92aFE\n\nEthereum Classic\n0xE4fa23aBBdA9B0c8DEa5d7Bfc2665E25dE83B58F\n\nLitecoin:\nMFVDyqCNpMfFnDPWTtaxVtgCcPpkaTeeuy\n\nXRP-Wallet:\nrw2ciyaNshpHe7bCHo4bRWq6pqqynnWKQg\n\nXRP-Tag:\n470905637",
        "language": "en",
        "author_name": "Kevin W. McCairn Ph.D.",
        "slug": "jihadscience",
        "cover": "20220317_060306_c97c4b2a7958d14d83de407e07b12730.jpg"
    },
    {
        "podcast_id": 116407,
        "title": "The Hospital Playlist ",
        "description": "Hospital Playlist is a podcast hosted by two healthcare professionals, Albert and John, who believe that life experiences can be learned vicariously, and there is power to sharing one’s unique journey in order to empower others while they embark on their own. Hospital Playlist will provide listeners with different experiences from a diverse spectrum of healthcare professionals as featured guests, while Albert and John share their perspectives, as well. The podcast, while intended to be informative to listeners, also endeavors to provide a form of entertainment and become a platform for (aspiring and current) healthcare professionals to hangout and talk.\n\nChecks us out on IG: https://www.instagram.com/thehospitalplaylist/\n",
        "language": "en",
        "author_name": "Hospital_Playlist00",
        "slug": "hospitalplaylist00",
        "cover": "20220328_030300_6893e818afcb7c487f2cd3bdc49bf048.jpg"
    },
    {
        "podcast_id": 117502,
        "title": "The Cavefish Chronicles",
        "description": "Understanding how the same fish could look so different is a question that scientists have been investigating since the discovery of the blind Mexican cavefish, Astyanax Mexicanus in the 1930’s. The cave fish, pale pink without eyes, lives in underground caves below its surface cousin which is silvery gray with black eyes. Today Astyanax is a model to study genetics, disease and behavior.\n\nThe story includes jungle explorers braving plane crashes and venomous snakes to find the cavefish and the scientists who studied it including a renowned German professor who fled Nazi Germany and a female Turkish scientist, Perihan Sadoglu who did some of the first genetic work in the 1950’s, but who mysteriously disappeared mid-career. The podcast follows the stories of scientists past and present revealing clues along the way to find out what had happened to Dr. Sadoglu and why it matters now.",
        "language": "en",
        "author_name": "Andrea Carter Mincer",
        "slug": "cavefish",
        "cover": "20220325_120323_dc8db0874e193d3f8c5f7e5d1e875fe5.jpg"
    },
    {
        "podcast_id": 117878,
        "title": "Pokeology 101",
        "description": "Welcome to Pokelogy 101!\nThese lectures are taught by Professor Reed and Professor Lee who are colleagues with Professor Rowan studying Pokemon Evolution. Specifically, we study why Pokemon evolve and how they are related to each other. For example why is a Greninja form a clade with Politoad, but not Seismitoad? Who is Dunsparce and Shuckle's closest relative? All this and more discussed here!",
        "language": "en",
        "author_name": "Professor Reed and Professor Lee",
        "slug": "pokeology",
        "cover": "20220326_060342_6f2c13167b4792be1a0cddb9b1045bc4.jpg"
    },
    {
        "podcast_id": 119076,
        "title": "Goggles On! with JEI",
        "description": "Goggles On! with JEI is from the Journal of Emerging Investigators with host Scott Soldat-Valenzuela, Executive Director. We dive into science and STEM conversations with young scientists, experienced professionals and, frankly, anyone who contributes to the development of scientists in the United States. \n\nThe Journal of Emerging Investigators is an open-access journal that publishes original research in the biological and physical sciences that is written by middle and high school students.  JEI provides students, under the guidance of a teacher or advisor, the opportunity to submit and gain feedback on original research and to publish their findings in a peer-reviewed scientific journal. Because grade-school students often lack access to formal research institutions, we expect that the work submitted by students may come from classroom-based projects, science fair projects, or other forms of mentor-supervised research.",
        "language": "en",
        "author_name": "Scott Soldat-Valenzuela",
        "slug": "goggles-on",
        "cover": "20220516_030510_157b7194500d4a045a8da01a507ab294.jpg"
    },
    {
        "podcast_id": 119991,
        "title": "Shaver Cancer Charity Chat",
        "description": "“Shaver Cancer Charity Chat” is a Monthly Podcast with Hosts Roseann Giovanatto-Shaver and Heather Austin. Together, they share their decades of thoughtful work with Minnesota’s Cancer Community.  Their discussions will include the history of The Randy Shaver Cancer Research and Community Fund, insights on cancer, upcoming local fundraising efforts and the latest Minnesota based research and Community Programs.\nEnjoy easy, reflective, considerate and witty interviews with many of Minnesota’s best in the area of cancer.",
        "language": "en",
        "author_name": "Heather Austin and Roseann Giovanatto-Shaver",
        "slug": "shaver-cancer-charity-chat",
        "cover": "20220404_090410_7ad93934ad853630b48c4b674bb10828.jpg"
    },
    {
        "podcast_id": 120344,
        "title": "Vi bliver mennesker - en Podcast serie om at være menneske sammen ",
        "description": "Find et godt sted for dig at lytte med. \nMåske på din vej gennem byen, måske et stille sted hvor unger og andre små og store behovsdyr ikke kan nå dig. \nMåske i en pause fra noget af det, livet er fyldt med, og som du glæder dig til at vende tilbage til når du har lyttet\n\nDit sted. Dit tempo. Din plads. Der hvor du har det lækkert. \nDenne podcast må gerne nydes. Det hele er til dig.\nFordi den handler om dig. Og den handler om os. Hvordan vi er mennesker. Sammen.\n\nVelkommen på tur i det lækre, det grimme, det svære og det nære i det at være menneske; alene og sammen. \n\nI den her serie vil jeg sammen med en flok dejlige mennesker undersøge hvordan vi kan bruge Human Design, astrologien, vores måder at relatere på gennem nervesystemet og alt det sjove og besværlige bagage vi har med fra gode og dårlige tider i vores liv.\n\nVi bliver mennesker - En Podcast serie om at være menneske sammen \n\n\nVil du vide mere så findes jeg på insta: \nkristabellamidwife\n\nOg Facebook:\nwww.facebook.com/humandesigninmotion\n\n\nFor en læsning kontakt mig på humandesigninmotion@gmail.com",
        "language": "da",
        "author_name": "io hultén",
        "slug": "rebirthtobefree",
        "cover": "20220602_080641_f43b2ddff653ffbc49fbdb151654110c.jpg"
    },
    {
        "podcast_id": 122329,
        "title": "SDRS (Swine Disease Reporting System) Podcast",
        "description": "The Swine Disease Reporting System (SDRS) consists of multiple projects that aggregate data from participating veterinary diagnostic laboratories (VDLs) in the United States of America. \nThrough this podcast, our investigators and invited guests summarize the key information on endemic and emerging diseases affecting the swine population in the USA, assisting veterinarians and producers to make informed decisions on disease prevention, detection, and management.",
        "language": "en",
        "author_name": "Swine Disease Reporting System",
        "slug": "sdrs",
        "cover": "20220623_040615_4ebe593caefc902819760e8dc2de02b7.jpg"
    },
    {
        "podcast_id": 122573,
        "title": "Stories from the Mortuary",
        "description": "Welcome to the Mortuary! Here you can find death and true crime as told by a mortuary science student. Have a morbid curiosity?  Let's take a candid look at death together.",
        "language": "en",
        "author_name": "Aolani Santiago",
        "slug": "storiesfromthemortuary",
        "cover": "20220528_100544_72e47084cda304d45d66142fba6a3527.jpg"
    },
    {
        "podcast_id": 122702,
        "title": "B jak biologia",
        "description": "W podcaście B jak biologia opowiadam sobie wesoło o, a jakże, biologii. Zdobędziecie tu wiedzę na temat świata ożywionego w przystępny sposób. Czasem się tu denerwuję, czasem sobie pożartuję, często się zachwycam. Nie obiecam Wam, że lepszy będzie świat, jednak mogę obiecać, że będzie tu całkiem luźno i przyjemnie. \n\nJeśli chcecie popatrzeć sobie na zdjęcia roślin czy grzybów, nauczyć się ich nazw i nie tylko, to zapraszam na mój Instagram: @zamollony",
        "language": "pl",
        "author_name": "Maciej Móll",
        "slug": "bjakbiologia",
        "cover": "20220417_050418_05becf394d4fd564ba314a83330c60df.jpg"
    },
    {
        "podcast_id": 124172,
        "title": "ORDEN ROSACRUZ",
        "description": "Canal oficial de radio de la ORDEN ROSACRUZ  www.rosacruz.net \n.\n.\n.\n.\n \n#rosacruz #rosacruces #ordenrosacruz #ordemrosacruz #rosaecrucis #ordenrosaecrucis #rosenkreuz #imperator #esoterismo #misticismo #meditación #esoterico #secreto #mistico #misterios #astrología #cabala #kabala #karma #alquimia #logia #sufismo #martinista #martinismo #masonería #francmasonería #tenida #granlogia #om #rosacrucismo #conventiculo #pantaculo #elrosacruz #EscuelasdeMisterios #Antiguasescuelasdelconocimientoesotérico #PrincipiosHerméticos #iniciacion #iniciatica #iniciado #iniciados #escuelasiniciaticas #paz #esoterico #iniciático",
        "language": "ee",
        "author_name": "ORDEN ROSACRUZ - Canal Oficial ",
        "slug": "ordenrosacruzoficial",
        "cover": "20220424_060452_935a32ea285d5ebce067fb1bd23ceac4.jpg"
    },
    {
        "podcast_id": 124485,
        "title": "You Make Me Sick!",
        "description": "You Make Me Sick! is a look at pathogenic microorganisms, their unique characteristics, history, epidemiology and treatments.  ",
        "language": "en",
        "author_name": "You Make Me Sick!",
        "slug": "youmakemesick",
        "cover": "20220425_110426_064fa057fa333070cf55052643c98144.jpg"
    },
    {
        "podcast_id": 124515,
        "title": "Let's Paws",
        "description": "A podcast about the past, present, and future of oncology in both human and veterinary medicine hosted by me, a radiation therapist who has been in the field for a total of 15 years and counting... (10 years in human medicine and 5 years in veterinary)\n\nI will talk to those who practice in radiation, medical and surgical oncology on both the human and veterinary sides. \n\nTo send topics or to be a guest, email me at letspawspodcast@gmail.com or follow me on Instagram @letspawspodcast",
        "language": "en",
        "author_name": "Shivani Narayanan",
        "slug": "letspaws",
        "cover": "20220426_020443_f2fc97215be202f0697340db71848260.jpg"
    },
    {
        "podcast_id": 124629,
        "title": "Proefdiervrij de Podcast: we zijn verder dan je denkt",
        "description": "Het gebruik van proefdieren in de wetenschap is niet nieuw. Maar in een tijdperk van zelfrijdende auto’s en commerciële ruimtereizen, vragen wij ons toch af… hoe lang moeten dieren het nog ontgelden in de naam van de wetenschap?\n\nProefdiervrij de Podcast is dé podcast over proefdieren en vooral over hoe we die zo mogelijk de wereld uitkrijgen. Collega’s Saskia en Romy dagen elke maand een andere proefdiervrije pionier uit om ons te laten zien dat Nederland zonder die vreselijke dierproeven kan. Wat is er nodig voor een proefdiervrije wereld? En moeten we het niet eens gaan hebben over een dierproevenverbod? Dit (en nog veel meer) bespreken we elke laatste vrijdag van de maand om 16.00 uur in Proefdiervrij de Podcast.",
        "language": "nl",
        "author_name": "Saskia & Romy (Proefdiervrij)",
        "slug": "proefdiervrijdepodcast1",
        "cover": "20220426_020419_2ffc0fa4c87d0adb5008bd514aa72e22.jpg"
    },
    {
        "podcast_id": 125090,
        "title": "Vision 2025",
        "description": "Hoe ziet de apotheek van de toekomst eruit? Wat doet de apotheker voor patiënten in 2025? Eén ding is zeker: #OurFutureIsBright!\nIn deze podcastreeks gaan we op ontdekking in de Vision 2025 en bespreken we allerlei toekomstpistes.\nAbonneer je op deze podcast en de volgende aflevering verschijnt automatisch in je feed – handig, niet?!\nMeer info: vision2025@apb.be\n____________________________________________________________________________________\n\nÀ quoi ressemblera la pharmacie du futur ? Que feront les pharmaciens pour leurs patients en 2025 ? Une chose est sûre : #OurFutureIsBright!\nDans cette série de podcasts exclusifs, nous explorons la Vision 2025 et abordons différentes pistes d’avenir.\n\nAbonnez-vous et le prochain podcast apparaîtra automatiquement dans votre flux ! Pratique, non ?\nPlus d'infos: vision2025@apb.be\n\n\n\n\n",
        "language": "en",
        "author_name": "APB",
        "slug": "vision-2025",
        "cover": "20220428_010438_6dae50628a525ea7dbf2147158a547a2.jpg"
    },
    {
        "podcast_id": 126049,
        "title": "IdealMente ",
        "description": "Por que entender nuestra mente y emociones no es siempre lo que esperamos o necesitamos, pero tampoco son monstruos que existan para hacernos daño. La promoción y comprensión de la salud mental es esencial para una vida plena.",
        "language": "es",
        "author_name": "Paloma de la Luz Hernández Siordia",
        "slug": "idealmentecsn",
        "cover": "20220503_020559_2fa3f024744d3a054bd4a9347cb1f7d3.jpg"
    },
    {
        "podcast_id": 126318,
        "title": "Journal Club ULVF",
        "description": "V Journal Club-u ULVF spremljamo in komentiramo najnovejše znanstvene raziskave in dosežke na področju veterinarske medicine. Občasno ponovimo tudi osnove veterinarskih postopkov. Za vse veterinarje in ostalo zainteresirano javnost, ker številnim novostim najlažje sledimo skupaj.",
        "language": "sl",
        "author_name": "Veterinarska fakulteta UL",
        "slug": "ulvf",
        "cover": "20220511_070525_444200d9b2a713c0b6798b50f21da7e9.jpg"
    },
    {
        "podcast_id": 127653,
        "title": "#BlackInCompBio",
        "description": "<p>The Black Women in Computational Biology Network is accelerating opportunity at the intersection of biology, math, and computer science globally. With over 240 members from 4 continents, we increase opportunities for collaboration, professional development, and science communication to change the face of integrative biosciences across the globe.</p><p>The #BlackInCompBio series highlights Black computational biologists of all genders and professional stages and their stories. We use this platform to bridge the gap in representation and access to professional inspiration in the field.</p><p>BWCB Website</p><p><a href=\"https://www.paypal.com/us/fundraiser/charity/4843535\">Donate to BWCB</a></p>",
        "language": "en",
        "author_name": "BWCB",
        "slug": "bwcb",
        "cover": "20230723_020752_a7190c4b19e09257741d5ee0d9984f16.jpg"
    },
    {
        "podcast_id": 127938,
        "title": "Talkin' About Pigs",
        "description": "Welcome to “Talkin About Pigs” with SMEC – a podcast where individuals from the Swine Medicine Education Center discuss swine health topics over coffee. Each podcast covers a different swine health topic of interest to pork producers. All topics are generated from producer submitted questions. We keep the topic producer oriented, with the goal of bringing pork producers relevant information that they can bring back to the farm.",
        "language": "en",
        "author_name": "Swine Medicine Education Center",
        "slug": "isusmecpod",
        "cover": "20221121_051125_80ee4a4494c0116c74c5e513b148cbef.jpg"
    },
    {
        "podcast_id": 128315,
        "title": "Buggin Out",
        "description": "Hi! And welcome to “Buggin’ out” A podcast dedicated to all things creepy and crawly. I’m your host Tyler Wiedmeyer a Entomology Master’s student at the University of Delaware here to take you on a journey to the world of insects, arachnids, and all the rest of the ‘bugs’.  ",
        "language": "en",
        "author_name": "Tyler Wiedmeyer",
        "slug": "bugginout",
        "cover": "20220515_060555_dec5f221e652edb4019edd7be5e8ffdc.jpg"
    },
    {
        "podcast_id": 130236,
        "title": "The Journey of Science",
        "description": "A podcast about scientists for everyone. Gopu and Zane talks to early career scientists around the world about their science, journey, mistakes and directions. Do join us in humanising scientists and making science more accessible.\n",
        "language": "en",
        "author_name": "Gopu and Zane",
        "slug": "thejournayofscience",
        "cover": "20230119_070150_cb52fa245208e8ef6211a456000005db.jpg"
    },
    {
        "podcast_id": 131183,
        "title": "Random Gab",
        "description": "All you need to know here is, what goes on the head and never comes outta mouth ; will come out here. Sometimes gossip, sometimes advice ,sometimes random shit and sometimes just nothing at all. Me and my bff are going to chat about all teen drama , life, arguments, growing up, annoyances and BEYOND. \nNothing is off limits. So,\n\"Buck Up, Sissy pants!\" we're in a comfort of our own self to bitch about it all.",
        "language": "en",
        "author_name": "Shiksha gupta",
        "slug": "random-gab",
        "cover": "20220530_040508_72fede10ca70c1a622f3de13541f841f.jpg"
    },
    {
        "podcast_id": 131429,
        "title": "Easy Medizin Podcast mit Kauveh P",
        "description": "Im deutschsprachigem Raum gibt es bist jetzt keine Podcasts, die komplett dem M2 Staatsexamen gewidmet sind. Hier ist eure Chance euch bite-size Wiederholungen zu den wichtigsten Themen fürs M2 kostenlos anzuhören! Werdet Fit fürs M2!",
        "language": "de",
        "author_name": "Amir Kauveh Panah",
        "slug": "fitfuerm2mitkauvehp",
        "cover": "20220610_100634_27e1901f025a3bc88cabbcd2cbd08f3d.jpg"
    },
    {
        "podcast_id": 135711,
        "title": "Going Within with Sheena & Jenn",
        "description": "\"Going Within\" Podcast was Created by Sheena C. And Jennifer B to discuss living in   spirituality and going within one's self to search for the answers to some of life's  most complex and complicated questions. Join in as we dive in together into the sea of knowledge, wisdom and understanding.",
        "language": "en",
        "author_name": "Episode 1 Shadow Work",
        "slug": "goingwithin",
        "cover": "20220621_120631_01e120a131925c1b4cbec5af0e6a14a3.jpg"
    },
    {
        "podcast_id": 136142,
        "title": "The Nervous Podcast",
        "description": "Let's explore the most complex structure in the universe, the nervous system - aka you.\nThe objective functions, processes - subjective perceptions, experiences; and all the controversial theories in-between.",
        "language": "en",
        "author_name": "Jet Flavell",
        "slug": "the-nervous-podcast",
        "cover": "20220629_010612_dd8bd9ff1de3eb9b0934202f5822426f.jpg"
    },
    {
        "podcast_id": 138398,
        "title": "Heme.Onco.Mania",
        "description": "Data is not enough to answer our questions without the perspective of experts. We envision our podcast platform hosting outstanding experts, leaders, and frontiers in oncology fields will train our perspectives.\n",
        "language": "en",
        "author_name": "Heme.Onco.Mania",
        "slug": "hemoncomaina",
        "cover": "20220704_040720_774f3fffaf83c7f283a14a2818d1b91b.jpg"
    },
    {
        "podcast_id": 139974,
        "title": "Diving Into Diabetes ",
        "description": "<p>The world of diabetes management is constantly evolving, with new research, new treatments, and new recommendations for best practice. Diving into Diabetes is a series of in-depth conversations with experts who are on the front lines of diabetes research and management. We're starting the conversation with those who are committed to improving and individualizing diabetes treatment to help provide important information and insight for fellow healthcare professionals keen to target the needs of their patients. This podcast is intended for healthcare professionals only. Speaker disclosures are available in each episode’s notes. The views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of any entities they represent. Some information contained herein may cite the use of an unapproved product in a dosage, for an indication, or in a manner other than recommended. Before prescribing any product, always refer to the latest Product Monograph. Financial support for the Diving Into Diabetes program was provided by Sanofi Canada. </p><p>MAT-CA-2200968</p>",
        "language": "en",
        "author_name": "Diving Into Diabetes  ",
        "slug": "divingintodiabetes",
        "cover": "20230529_070523_c078f88d0a0975c797e7fb079a4fcd63.jpg"
    },
    {
        "podcast_id": 140011,
        "title": "Plan Amora -  el poder siempre estuvo dentro de ti",
        "description": "Un podcast de la vida y diferentes cosas que he aprendido en el camino de volver a mi ",
        "language": "es",
        "author_name": "Plan amora ",
        "slug": "planamora",
        "cover": "20220712_060749_b025c5ba5b69261d10961e5e7f5c228b.jpg"
    },
    {
        "podcast_id": 141224,
        "title": "Le point sur le diabète",
        "description": "<p>Les nouvelles études, les nouveaux traitements, les nouvelles recommandations sur les pratiques exemplaires nous forcent à revoir sans cesse nos stratégies de prise en charge du diabète. Le point sur le diabète est une série d’entretiens approfondis avec des experts directement concernés par la recherche et la prise en charge du diabète. Nous commencerons nos échanges avec les personnes qui travaillent à améliorer et à personnaliser le traitement du diabète et nous espérons apporter ainsi un complément d’information utile et un nouvel éclairage à nos collègues soucieux de répondre aux besoins de leurs patients. Ce balado est destiné aux professionnels de la santé uniquement. Les déclarations sur les conflits d’intérêts potentiels se trouvent dans les notes de chaque épisode. Les points de vue et les opinions exprimés dans le cadre de ce programme sont ceux des conférenciers et ne reflètent pas nécessairement les points de vue ou les opinions des entités qu’ils représentent. Le programme « Le point sur le diabète » bénéficie d’une aide financière de Sanofi Canada. </p><p>MAT-CA-2200968</p>",
        "language": "fr",
        "author_name": "Le point sur le diabète",
        "slug": "lepointsurlediabete",
        "cover": "20220719_020727_4bb6b71844a607c4f4b9ac5e2b08725b.jpg"
    },
    {
        "podcast_id": 141770,
        "title": "Real Addiction Talk",
        "description": "Real Addiction Talk is an unfiltered podcast that focuses on creating positive change for those who are currently struggling with an active addiction, are in recovery, or just want more information about the addiction field. We provide up-to-date content, research, techniques, education, and resources for our listeners. The podcast is hosted by James Gibbons, M.A., IADC who is also in recovery from an addiction and has been sober for over 10 years. He has spent the last decade researching, studying, and helping those with an addiction in his community. James recently received his Master’s degree from the University of South Dakota in Addiction Counseling with co-occurring disorder specialization. Check out our website at realaddictiontalk.com for more information and to sign up for our newsletters. ",
        "language": "en",
        "author_name": "James Gibbons, M.A., IADC",
        "slug": "realaddictiontalk",
        "cover": "20220808_040837_9c71c9d4a4ac4a405f30eef9a1d48158.jpg"
    },
    {
        "podcast_id": 142764,
        "title": "Builders of Biotech",
        "description": "Builders of Biotech is a show about innovation in the biotech sector, told through the experiences of industry experts and influential scientists. Host Lucas Carter investigates scientific breakthroughs with the people who made them happen, making sure to appreciate the technical wonder and human element of each discovery. Join us for stories from biotech that are informative, personal, and always fascinating. ",
        "language": "en",
        "author_name": "Lucas Carter",
        "slug": "buildersofbiotech",
        "cover": "20220727_010724_3941113ef871c195fd9ef5cb7e569d4d.jpg"
    },
    {
        "podcast_id": 143837,
        "title": "Thats Not What I Said ",
        "description": "Open conversations and positive perspective to enhance your life. Come join us as we look at lifes most impactful issues with both Kings and Queens to invoke a better understanding.",
        "language": "en",
        "author_name": "Marceles MrEgo Harris",
        "slug": "tnwispodcast",
        "cover": "20220801_030845_f43233594f24368860b5ba908368e7ab.jpg"
    },
    {
        "podcast_id": 145533,
        "title": "Body Banter",
        "description": "Welcome to Body Banter, a podcast where we explore different perspectives of the human body in all its forms! Our hosts, Dr. Claudia Krebs and Dr. Segun Oyedele, are joined by an amazing line up of guests to share their expertise and thoughts about what the human body means to them. Our guests come from all over the world and include researchers, clinicians, anatomy instructors, scholars of language and culture, and people with lived experiences navigating the healthcare system. Anatomy is for everybody and every body, and we are here to get the body banter going!",
        "language": "en",
        "author_name": "The HIVE",
        "slug": "bodybanter",
        "cover": "20220809_110812_56f3183bc341d29bda4df40e9831b78b.jpg"
    },
    {
        "podcast_id": 145692,
        "title": "Diagnexia Dialogues",
        "description": "Diagnexia is an international Pathology Services company with facilities in Chicago, Dublin and Exeter UK. \n\nIts’ mission is to improve patient experience by improving turnaround time for diagnoses. It helps hospitals balance case workload & remove backlogs by connecting them to a Global Virtual Pathology team via the Diagnexia platform. \n\nOur podcast series touches on topics like the future of pathology, innovation, digital pathology in particular, impact on practice, use of diagnostic algorithms, pressures/challenges confronting pathology across the world in the next 5-10 years and how do we position ourselves to combat these challenges.  ",
        "language": "en",
        "author_name": "Diagnexia",
        "slug": "diagnexia",
        "cover": "20220810_070829_0142c168a8e79da031a6177498219557.jpg"
    },
    {
        "podcast_id": 146608,
        "title": "Listen to Your Heart",
        "description": "<p>Advances in cardiovascular care are continuously being made, with new research, new treatments, and new recommendations for best practice. Listen to Your Heart is a series of in-depth conversation with experts who are at the forefront of cardiovascular research and medicine—preventing, diagnosing, and treating cardiovascular disease for better patient outcomes. We're starting the conversation with those who are committed to improving heart health for all, and to help provide important information and insight for fellow healthcare professionals keen to target the needs of their patients, particularly those at high-risk for cardiovascular disease. This podcast is intended for healthcare professionals only. Speaker disclosures are available in each episode’s notes. The views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of any entities they represent. Some information contained here may cite the use of an unapproved product in a dosage, for an indication, or in a manner other than recommended. Before prescribing any product always refer to the latest Product Monograph. Financial support for the Listen to Your Heart program was provided by Sanofi Canada. </p><p>MAT-CA-2201005</p>",
        "language": "en",
        "author_name": "Listen to Your Heart ",
        "slug": "listentoyourheart",
        "cover": "20220815_050806_426593816535ae2273dd0e65e300114d.jpg"
    },
    {
        "podcast_id": 147225,
        "title": "Sub 10",
        "description": "Sub 10 is a show created by Coach Mike from Melbourne Fitness & Performance, which is all about high performance. If you want a show that is entertaining, informative and straigth to the point Sub 10 is for you. 10 minutes epsiodes of the latest information and concepts to live and develop a high performance lifestyle and learn the secrets to athletic performane training. Once a month we will feature an amazing guest who will share the secrets to their success.",
        "language": "en",
        "author_name": "Mike Crichton",
        "slug": "sub10",
        "cover": "20220818_030846_f067c90cf104e557e919abd4f45cc50c.jpg"
    },
    {
        "podcast_id": 147240,
        "title": "Écoutez votre cœur",
        "description": "<p>Des progrès sont constamment réalisés dans le domaine des soins cardiovasculaires : nouveaux travaux de recherche, nouveaux traitements et nouvelles recommandations de pratiques exemplaires. Écoutez votre cœur est une série de discussions approfondies avec des experts qui sont à la pointe de la recherche et de la médecine cardiovasculaires – pour prévenir, diagnostiquer et traiter les maladies cardiovasculaires afin d’améliorer les résultats pour les patients. Les intervenants avec qui nous discuterons sont déterminés à améliorer la santé cardiaque de la population et souhaitent faire part d’importants renseignements et de leurs réflexions aux autres professionnels de la santé désireux de cibler les besoins de leurs patients, en particulier ceux qui présentent un risque élevé de maladie cardiovasculaire. Ce balado est destiné aux professionnels de la santé uniquement. Les divulgations des renseignements sur les intervenants ont été ajoutées aux notes de chaque épisode. Les points de vue et opinions exprimés dans ce programme sont ceux des intervenants et ne reflètent pas nécessairement les points de vue ou positions des entités qu’ils représentent. Certains renseignements contenus dans le présent programme peuvent mentionner l’utilisation d’un produit non approuvé dans une posologie, pour une indication ou d’une manière autre que celle recommandée. Avant de prescrire tout produit, consultez toujours la plus récente monographie. La série de balados Écoutez votre cœur a reçu un soutien financier de Sanofi Canada.</p><p>MAT-CA-2201005</p>",
        "language": "fr",
        "author_name": "Écoutez votre cœur",
        "slug": "ecoutez-votre-coeur",
        "cover": "20220818_040822_57b53e0715e3c4167a0b04ba44c6676b.jpg"
    },
    {
        "podcast_id": 148539,
        "title": "Game Changer",
        "description": "El pòdcast científic que posa sobre la taula algunes recerques científiques que canviaran la manera en com veiem el món. Un pòdcast que pretén fer reflexionar sobre les conseqüències que tindrien i l'impacte que causarien en la nostra vida les noves tècniques que es poden arribar a desenvolupar.\n\nEn aquestes gravacions es parlarà sobre la implantació de cèl·lules mare en el món de la reproducció assistida i les implicacions ètiques i morals que això comportaria, entrevistes amb professionals sobre les cèl·lules mare i molt més!\n\nNo et perdis ni un episodi del 'Game Changer' per estar al corrent d'algunes de les innovacions més pioneres en el món de la recerca científica.",
        "language": "ca-es",
        "author_name": "Marta Casals Romero",
        "slug": "gamechanger",
        "cover": "20220825_070840_8c698b35dcf6c1bbe2e521ea605c5a71.jpg"
    },
    {
        "podcast_id": 148706,
        "title": "The Social Brain",
        "description": "The place where society and biology meet. Conversations exploring the evolution and function of the human brain and the social pressures that shaped it into what it is today. ",
        "language": "en",
        "author_name": "Taylor Guthrie and Andrew Cooper Sansone",
        "slug": "thesocialbrain",
        "cover": "20221122_091137_81d16ee83a82632c2cd8db2c1a763ffa.jpg"
    },
    {
        "podcast_id": 153114,
        "title": "PMBio",
        "description": "PMBio",
        "language": "es",
        "author_name": "Pablo",
        "slug": "pmbio",
        "cover": "20220913_070917_4eb84850acdda6e5460f8f7ecbf5d24f.jpg"
    },
    {
        "podcast_id": 155107,
        "title": "VIDA",
        "description": "¿Cómo es la vida de una persona que ve de frente a la muerte todos los días? ¿Qué siente un cirujano oncólogo cuando está en la mesa de operaciones? ¿Qué pasa en la vida cotidiana de un doctor? ¿Qué preguntas le harías TÚ a un cirujano?\nEsto es VIDA, el podcast de DAVID CABA en el que platicamos sobre el pensamiento científico, las ciencias de la salud y su interacción con la vida diaria. \nCon su experiencia, el doctor Caba nos habla de medicina, cáncer, cirugías, deporte de alto rendimiento, espiritualidad, salud pública, música, literatura, filosofía y mucho más.\n¡Bienvenidos, esto es VIDA!\n",
        "language": "es-mx",
        "author_name": "David Caba",
        "slug": "davidcabavida",
        "cover": "20220927_050943_370363988210ccdc1535697d8444f4f9.jpg"
    },
    {
        "podcast_id": 155321,
        "title": "Creciendo Con Caro",
        "description": "Persiguiendo avances de la ciencia que nos ayuda a vivir más y mejor. Discusiones sobre biogerontología y conversaciones sobre enseñanzas de la vida.",
        "language": "es-mx",
        "author_name": "Carolina Cano Macip",
        "slug": "creciendoconcaro",
        "cover": "20221222_121259_a3084d45dd2616160205625bc681b006.jpg"
    },
    {
        "podcast_id": 155422,
        "title": "123inclusie - 4 Talkshows ",
        "description": "Kinderen en jongeren met een beperking vinden moeilijk aansluiting bij leeftijdsgenoten in de vrijetijds-sfeer. Nochtans zit hier maatschappelijke en emotionele winst in voor alle partijen. 123inclusie wil begeleiders in de opvang, leiders en animatoren ondersteunen in de motivatie en het proces om kinderen en jongeren met een beperking warm te onthalen en goed te begeleiden.  In de reeks van 4 talkshows over inclusie, focussen we telkens op een specifiek deelthema: Buitenschoolse Kinderopvang, Jeugdverenigingen, Sportclubs en Begeleiders met een beperking. Op het eind van elke show maakt Beno Schraepen, auteur van het boek 'Excluses' kanttekeningen bij de verhalen. ",
        "language": "nl",
        "author_name": "Wouter Kersbergen SPINDOKTER",
        "slug": "123inclusie",
        "cover": "20220923_010906_9b7898be93d79981c81e64806a195ceb.jpg"
    },
    {
        "podcast_id": 156590,
        "title": "The Black Hole",
        "description": "The Black Hole is a new podcast that will venture into the minds and hearts of the masses via two thought experts: Sancho D. Bayleaf and Doggie Boy J. Listen as the Bayleaf and the Boy outthink so called “Scientist” and “Doctors” by digging the sediment out of the woolly grundle of life and death and life again (The afterlife) and put it under a microscope and project the findings on a jumbotron (metaphorically). Hear the bigger picture and absorb every facet of yours and you neighbor’s mind.",
        "language": "en",
        "author_name": "Sancho D. Bayleaf & Doggie Boy J.",
        "slug": "thebhole",
        "cover": "20220928_080946_90d75bc2ee6b075eb2bf502dbcddbb5e.jpg"
    },
    {
        "podcast_id": 156752,
        "title": "Not Your Doc Podcast",
        "description": "Dr Charles Tadros, along with his cohost Vanessa Diederichsen, brings you the Not Your Doc podcast, a mental health and wellness program that dives into some of the most commonly misunderstood aspects of the mental health landscape. Presented by Midwest Institute for Hearts and Minds, this podcast covers a variety of general medical and mental health topics and is for informational purposes only. For questions please contact us at notyourdocpod@gmail.com. \n",
        "language": "en",
        "author_name": "Seth Gabriel",
        "slug": "notyourdocpod",
        "cover": "20220929_120951_3139a66b2673631341fac3633427b300.jpg"
    },
    {
        "podcast_id": 161956,
        "title": "来都来了",
        "description": "简介：我们是三位在读生物医学女博士，坐标北欧，本着科学态度探讨科研玄学，采用摆烂策略探索知识边界，偶尔沉迷八卦，时常认真搞笑，始终专注个人演技提升。此节目尺度较宽，信息量较大，笑声过于频繁，请择情收听。如果大龄未婚女性有意见，也请出门左转，不送。",
        "language": "zh",
        "author_name": "Tanya",
        "slug": "comeanyway",
        "cover": "20221020_051006_2e3bce9b519e42f86ccf74a7601a1d1a.jpg"
    },
    {
        "podcast_id": 163905,
        "title": "El Podcast del Toro Blanco",
        "description": "Charlas informales del Toro Blanco con amigos, escritores, músicos y todo tipo de artistas.",
        "language": "es",
        "author_name": "Toro Blanco",
        "slug": "toroblanco",
        "cover": "20221115_061139_cc63749a6ca88e6bb15ab747733f5792.jpg"
    },
    {
        "podcast_id": 164204,
        "title": "Straßenabitur",
        "description": "Straßenabitur, ein Podcast von zwei Brüdern, die einfach teilen, was Ihnen auf dem Herzen liegt. \nWir besprechen alles rund um Pop-Culture, Musik, Kunst, Psychologie, Gesundheit, Sport, Philosophie und obendrauf gibt es Anekdoten aus unserem Leben. \n\nZu Ehren von unserem Papa.",
        "language": "en",
        "author_name": "Simon Vermum Fabian Vermum",
        "slug": "strassenabitur",
        "cover": "20221127_091155_a04714ccbf2683c13306665fc93a38ba.jpg"
    },
    {
        "podcast_id": 165214,
        "title": "Making Therapy Better",
        "description": "Making Therapy Better brings together some of the top minds in psychotherapy as well as everyday clinicians to talk about where the field is headed and how we can achieve better mental health care for everyone. \n\nwww.makingtherapybetter.com",
        "language": "en",
        "author_name": "Bruce Wampold, PhD",
        "slug": "makingtherapybetter",
        "cover": "20221104_121135_ab437a8137aaaf46d2ff14773839b70b.jpg"
    },
    {
        "podcast_id": 165292,
        "title": "A4LI H-SPAN Podcast",
        "description": "<p>Our Podcast highlights notable figures within the longevity field. The goal is to create social and political action around the issues of combating age-related chronic conditions and increasing our number of healthy, disease-free years!</p>",
        "language": "en",
        "author_name": "The Alliance For Longevity Initiatives ",
        "slug": "a4li",
        "cover": "20221104_121139_28f353dc9b2d8e393461a7cc4bd7a388.jpg"
    },
    {
        "podcast_id": 166395,
        "title": "Hippo & Friends type 1 diabetesfonds podcast",
        "description": "Welkom bij de Hippo & Friends podcast. \n\nIn deze podcast behandelen we thema’s die belangrijk zijn voor mensen met type 1 diabetes. Type 1 diabetes is een chronische auto-immuunziekte die ongeveer 50 000 Belgen treft. Met het Hippo & Friends type 1 diabetesfonds creëren we meer bewustzijn, dragen we bij tot projecten voor meer levenskwaliteit en steunen we wetenschappelijk onderzoek. ",
        "language": "nl",
        "author_name": "Hippo & Friends type 1 diabetesfonds",
        "slug": "hippoandfriends",
        "cover": "20221108_031100_9b201f5f5abc697ca57ff1f57d966473.jpg"
    },
    {
        "podcast_id": 167721,
        "title": "Building a Science of Consciousness",
        "description": "The Qualia Research Institute (QRI.org) is a California 501(c)(3) non-profit research group studying consciousness in a consistent, meaningful, and rigorous way. Our goal is to spread the ideas of our institute in a more accessible way and to support the research being done by our members.",
        "language": "en",
        "author_name": "Qualia Research Institute",
        "slug": "qri",
        "cover": "20221113_101139_c986d187c7b77fa27e926d6beb66f644.jpg"
    },
    {
        "podcast_id": 167965,
        "title": "The Science Lab",
        "description": "The Science Lab was created in 2022 in order to give students open access to science learning made by students. All episodes are properly sourced with the references in the show notes and have been created in the spirit of sharing well researched knowledge beyond just the scientific community.\n\nAll opinions expressed are those of Helen Werner or the student authors and do not necessarily reflect the views of Beloit College. ",
        "language": "en",
        "author_name": "Helen Werner",
        "slug": "thesciencelabpod",
        "cover": "20221114_081112_90c32affa5737ae5357b916568c4e200.jpg"
    },
    {
        "podcast_id": 169870,
        "title": "Medical Rewrites",
        "description": "<p>Medical Rewrites is the podcast that rewrites movie scenes with evidence-based medicine. Come for the clinical pearls, stay for the tangents.</p><p>Movie suggestion form: <a href=\"https://tinyurl.com/8pa8svey\">https://tinyurl.com/8pa8svey</a></p><p>This podcast will analyze movies with medical plot points that fall short of best practices. Each episode will discuss a movie medical error, do a deep dive on the topic, then rewrite the scene or dialogue.</p><p>Schedule: Q14 days on Wednesday</p><p>Guest experts: PRN</p>",
        "language": "en",
        "author_name": "Meghan Jeffres",
        "slug": "medicalrewrites",
        "cover": "20230105_020119_1b43135209442590694f612992fc23f4.jpg"
    },
    {
        "podcast_id": 172870,
        "title": "The Quantum Supercreation Podcast",
        "description": "In this program, the international 3 Time Top Number One Bestseller Author Gisbert Reuter, an award-winning Creative Director and Mentor & Advisor to 6-, 7- and 8-fig business owners shows you how to use Quantum Leap Strategies to create better results faster.\n\nGisbert has helped more than 10,000 people in numerous live and online events, enjoy a better quality of life, more joy and fun, and in turn, have much less stress and achieve results they never thought possible.\n\nHe has worked with people all over the world, among them, medical doctors, top athletes, lawyers, speakers, consultants, business owners, and leaders.\n\nBefore Gisbert founded his first company in 1998, he worked in Munich with the former head of entertainment of German's TV station ProSieben in his film and TV production Entertainment Factory. \n\nIn 2010 Gisbert started holding seminars and handing out questionnaires to anonymously received critiques, wishes, and opinions. In the meantime, several moving boxes are stacked full of these papers, all with superlative customer opinions. \n\nStatements like \"The best thing that ever happened to me\", \"He has changed my life\", \"A state of permanent WOW!\", \"I am much happier\", or even \"The best seminar in the world!\" run as a common thread throughout these questionnaires. \n\nHis calling for you is straightforward: Do the Leap and Let Joy Work For You! \n\n● Income ● Impact ● Wealth ● Confidence ● Joy ● Health ● Wellbeing ● and Longevity ● \n\nDo you want to create top notch results for life? This is your Podcast.\n",
        "language": "en",
        "author_name": "Gisbert Reuter",
        "slug": "gisbertreuter",
        "cover": "20221206_021249_72aa27d541031c3ac4640d0d369fec48.jpg"
    },
    {
        "podcast_id": 173350,
        "title": "SHARKS",
        "description": "A deep water exploration of our planet's coolest predator. Tune in for wacky info about your favorite species of shark delivered by special celebrity guests.",
        "language": "en",
        "author_name": "William Hap Phelps",
        "slug": "sharks",
        "cover": "20221208_051224_55f1d04d6a3ba55eaa2b89cd38c55fe8.jpg"
    },
    {
        "podcast_id": 175290,
        "title": "Where They Are Now And Where We Will Follow ",
        "description": "This show is to highlight Elon University alumni's post-grad accomplishments pertaining to the field of biology. Each Episode contains stories of alumni and advice on grad school, internships, post-grad life, studying tips, unwinding, scientific discoveries, and much more.",
        "language": "en",
        "author_name": "Frieda Walsh and Elon Bio",
        "slug": "wheretheyarenowelonunibio",
        "cover": "20221219_041240_9592e869723ad4a2809fc9d3ae3a07fb.jpg"
    },
    {
        "podcast_id": 177226,
        "title": "Eveciencia (Preguntas Ñoñas) ",
        "description": "En este podcast preguntas ñoñas, divulgamos filosofía y ciencia, desde matemáticas, física, química, biología, ciencias sociales, ambientales, geografía y un poco de historia, todo con una actitud positiva, y en modo de aprender. Queremos, promover la curiosidad entre nuestro público, la discusión y método dialéctico para resolución de problemas.",
        "language": "es-mx",
        "author_name": "Bernardo Águila",
        "slug": "evecienica",
        "cover": "20221231_011232_12577996efd44af54063cf93de4d3696.jpg"
    },
    {
        "podcast_id": 178370,
        "title": "The Silly Salamander Scientist",
        "description": "<p>In this series, join me as I break down current topics from all fields of science from biology to physics, mathematics to engineering. I discuss issues related to science and the behind the scenes of academia and research.</p>",
        "language": "en",
        "author_name": "Talon Jost",
        "slug": "silly-salamander-scientist",
        "cover": "20230105_080137_99f97b45e0ddd6be864b7945ecd64e0d.jpg"
    },
    {
        "podcast_id": 179112,
        "title": "Jugend fragt... Der Podcast",
        "description": "Land der Berge, Land am Strome, Land der Schnitzel, Land der Walzer, Land der Hidden Champions, zukunftsreich. Doch wie zukunftsreich ist Österreich noch? \n\nJugend fragt.. Der Podcast\nEin ganzer Podcast der Generation Z gewidmet. \n\nIn 15 Minuten reden Christoph Bartos und seine Gäste über die Zukunft, Präsenz und Vergangenheit aus der Sicht der Jugend.",
        "language": "de",
        "author_name": "Christoph Bartos",
        "slug": "jugend-fragt",
        "cover": "20230120_080148_a65a4e375ef1114a61128667624d1208.jpg"
    },
    {
        "podcast_id": 181815,
        "title": "DNA&",
        "description": "<p>Unlock the secrets of the genomics revolution with the \"DNA&amp;\" podcast! Join Imperial College scientists Hannah &amp; Angelos to explore the impact of DNA on personalised healthcare. Designed for non-experts and sponsored by the UK Genetics Society. </p><p>Music by Auburn Jam Music LTD <a href=\"http://www.auburnjam.co.uk\">www.auburnjam.co.uk</a> and artwork by Nikos Kabasele <a href=\"https://www.facebook.com/Kabasele.Nikos\">https://www.facebook.com/Kabasele.Nikos</a></p>",
        "language": "en",
        "author_name": "Hannah and Angelos",
        "slug": "dnaandpod",
        "cover": "20230119_110149_50d0e24408d1067b7cfc436277fb3a63.jpg"
    },
    {
        "podcast_id": 182521,
        "title": "Prehospital Care Research Forum",
        "description": "The UCLA Center for Prehospital Care established the Prehospital Care Research Forum at UCLA in 1992 in cooperation with Jems Communications. The mission? To promote, educate and disseminate prehospital research conducted at all provider levels to advance and challenge the future of EMS.\n\nComprised of respected members of the national and international EMS community, Prehospital Care Research Forum at UCLA Associates represents clinicians, educators, and representatives from state and local governments, public and private sector EMS providers, and manufacturers providing equipment to the prehospital industry.",
        "language": "en",
        "author_name": "Prehospital Care Research Forum",
        "slug": "prehospitalcareresearchforum",
        "cover": "20230122_010100_7fd6b84037722f0bef4ebfd681bd0ccd.jpg"
    },
    {
        "podcast_id": 185422,
        "title": "Paradox Institute Podcast",
        "description": "<p>The Paradox Institute presents research and commentary on the biology of sex and the differences between males and females in animated videos, articles, and books. Visit us at <a href=\"https://www.theparadoxinstitute.com\">theparadoxinstitute.com</a>.</p>",
        "language": "en",
        "author_name": "Paradox Institute",
        "slug": "paradoxinstitute",
        "cover": "20230430_010411_605d77e85927ebc0cd8036a1571d7bf9.jpg"
    },
    {
        "podcast_id": 185525,
        "title": "Madonna Mia Mary",
        "description": "<p>Ho sempre pensato a ciò che non sono senza prendere consapevolezza di ciò che sono. E quindi eccomi qui a prenderne coscienza insieme a voi con le mie controverse opinioni, le mie passioni e la mia creatività. E poi mi direte se Madonna Mia Mary è un'imprecazione perchè parlo troppo, è un'esclamazione di stupore o un modo diverso per darmi della Santa. </p>",
        "language": "it",
        "author_name": "Mary",
        "slug": "madonnamiamary",
        "cover": "20230201_100254_fa40867ee69413fbc7ed34578529f5b1.jpg"
    },
    {
        "podcast_id": 185944,
        "title": "Totally Buggin’",
        "description": "<p>The podcast about all things creepy crawly with host organisms Cammie and Faith.</p>",
        "language": "en",
        "author_name": "Cammie Murray and Faith Mihalick",
        "slug": "totallybuggin",
        "cover": "20230426_090453_2e2f0d7bdd2e07e8cc87e00ad1ac010d.jpg"
    },
    {
        "podcast_id": 187285,
        "title": "Bioengineering Podcast",
        "description": "With the support of the UCSD Bioengineering Graduate Society (BEGS), join us as we delve into the cutting-edge world of bioengineering, life sciences, and health technology, exploring the latest developments and their impact on improving human health and wellness.",
        "language": "en",
        "author_name": "Omeed Djassemi",
        "slug": "engineering4life",
        "cover": "20230207_060236_882ba195ee783d804c539ff580147d96.jpg"
    },
    {
        "podcast_id": 188092,
        "title": "Statistics with Crayons",
        "description": "<p>Welcome to Statistics with Crayons, a podcast where we talk about statistics, oral health, and everything in between. Our hosts, Dr. Alonso Carrasco-Labra and Dr. Michael Glick, are professionals from the Center for Integrative Global Oral Health at Penn Dental Medicine. This center unites health researchers, educators, and practitioners at the University of Pennsylvania and beyond in seeking creative solutions to address unmet oral health needs related to the worldwide prevalence of caries, periodontal disease, oral cancer and craniofacial deformity which impacts more than 3.5 billion people annually.</p>",
        "language": "en",
        "author_name": "Penn Dental Medicine",
        "slug": "statswithcrayons",
        "cover": "20230317_030301_0e8db4b3eb9696ce4b97955230c06d94.jpg"
    },
    {
        "podcast_id": 188466,
        "title": "UNSW Exercise Physiology Journal Club",
        "description": "Everything you need to know to be a skeptical and curious clinician",
        "language": "en",
        "author_name": "Andrew & Emily",
        "slug": "unswexphysjc",
        "cover": "20230211_010216_fa23af3ad4b44ca416da8f86371be0ce.jpg"
    },
    {
        "podcast_id": 190365,
        "title": "Biotech Banter",
        "description": "<p>Biotech Banter is hosted by <a href=\"https://biocentriq.com/\">BioCentriq</a>, a highly collaborative CDMO focused exclusively on cell and gene therapy and supporting all stages of <a href=\"https://biocentriq.com/capabilities/process-development/\">process development</a> and <a href=\"https://biocentriq.com/capabilities/manufacturing/\">clinical manufacturing</a>. This podcast explores the challenges and opportunities of advancing cell and gene therapies to clinic. Hear the perspective of a wide range of contributors ranging from C-level executives to manufacturing operators and more. With expert insights, tips, and information, you'll discover what it takes to set the stage for successful clinical manufacturing, how to decide if working with a CDMO is the right move for your project, how to get the most out of your partnership with a CDMO, and more.</p>",
        "language": "en",
        "author_name": "BioCentriq",
        "slug": "biotechbanter",
        "cover": "20230217_080216_1cf15775692d77af24ff262833a40893.jpg"
    },
    {
        "podcast_id": 191347,
        "title": "DEMYSTIFY",
        "description": "<p>Welcome to Demystify, a podcast that aims to unveil the mystery behind biotechnological outbreaks and their impact on our daily lives!</p>",
        "language": "en",
        "author_name": "Mickael Dang & Chiara Bostock",
        "slug": "demystify",
        "cover": "20230425_030441_8121f2dbde0547f4ecd5cc08870c2adb.jpg"
    },
    {
        "podcast_id": 191690,
        "title": "Free American Podcast ",
        "description": "<p>The Free American Podcast is a podcast for Americans that are free.</p><p>On this debut episode of F.A.P. Join John and Jake, our co-host, as they tackle the day to day life of being an American from all kinds of backgrounds, and from all walks of life.</p>",
        "language": "en",
        "author_name": "Jacob Mitchell & Johnathon Siemaszkiewicz",
        "slug": "thefreeamericanpodcast",
        "cover": "20230222_110242_4a9beb3d7582c80c37cc731e1391399e.jpg"
    },
    {
        "podcast_id": 192052,
        "title": "The Costa Project",
        "description": "<p>Podcast Oficial del Colegio Cervantes Costa Rica.</p><p>Noticias, Chismes, Podcast</p>",
        "language": "en",
        "author_name": "The Costa Project",
        "slug": "podcast-costa",
        "cover": "20230224_020221_1cf0fda7b1a14e80969c48948d2df2f7.jpg"
    },
    {
        "podcast_id": 192164,
        "title": "Differential Discussions",
        "description": "<p>Two hematology nerds NOT just talking about cells. This channel will serve as a place to review theory and explore topics in laboratory medicine with colleagues working in the field.</p>",
        "language": "en",
        "author_name": "Differential Discussions",
        "slug": "differentialdiscussion",
        "cover": "20230224_070235_67525684a95fcc371420d3f9afc1ef03.jpg"
    },
    {
        "podcast_id": 192922,
        "title": "Targeting With JK-47 Paranormal",
        "description": "<p>In this <strong>Vodcast </strong>i will challenge video and picture  evidence of so called  paranormal captures. Once a week i will</p><p>go live on my facebook account discussing sverythibg</p><p>i love input from everyone so put your question up and lets work together!</p><p>Hit that like and subscribe please it helps more than u know</p>",
        "language": "en",
        "author_name": "Jonathan Keyworth",
        "slug": "targetingwithjk47",
        "cover": "20230227_050236_bd03d59643252caa48a55c861f0776ce.jpg"
    },
    {
        "podcast_id": 193312,
        "title": "Prefrontal Podcast",
        "description": "<p>A Neuroscience-themed podcast aimed at communicating interesting topics in neuroscience to a wide audience. Produced by two Masters Students at Vrije Universiteit Amsterdam, each episode, feature a guest in the field of Neuroscience to have a laid-back conversation. We talk to our guests about their research and cover topical themes aimed at appealing to neuroscientists and a broader audience.</p>",
        "language": "en",
        "author_name": "Patrick Pollak & Isabel Ericson",
        "slug": "prefrontalpodcast",
        "cover": "20230505_100556_6b4b9ba0c436d8597ec81f8021dc54da.jpg"
    },
    {
        "podcast_id": 195182,
        "title": "Hysteria - Gender Health Talk mit Anja und Caro",
        "description": "<p>Willkommen beim Hysteria-Podcast, in dem wir geschlechtsspezifische Datenlücken (Gender Data Gap) im Gesundheitswesen besprechen und vielversprechende Lösungen vorstellen.</p>",
        "language": "de",
        "author_name": "Caroline Baltzer, Anja Wiemers",
        "slug": "hysteria",
        "cover": "20230308_090304_b27ab55dc2d4df13939cf3c7801924fc.jpg"
    },
    {
        "podcast_id": 196077,
        "title": "Ageless Science",
        "description": "<p>Ageless Science is the companion podcast to the nonprofit organization, hosted by founder Ellie Tillman-Schwartz. We discuss scientific topics to allow people of all ages develop greater understanding of changes in the world around them. Our episodes include both interviews with guest speakers and reviews of topics covered at our discussion events.</p>",
        "language": "en",
        "author_name": "Ellie Tillman-Schwartz",
        "slug": "agelessscience",
        "cover": "20230810_030818_469f497db61308efa2f098506534cdd5.jpg"
    },
    {
        "podcast_id": 197634,
        "title": "Vísindaknokkar",
        "description": "<p>Hetta poddvarpið, er sprottið úr einari blanding av forvitni, og eldhuga fyri at læra og miðla vitan.</p><p>Endamálið er at lýsa gransking í Føroyum, umframt at lýsa ymisku møguleikarnar fyri at nema sær náttúruvísindarliga útbúgving og starv, bæði heima og í útlegd.</p><p>Hetta verður gjørt, við at bjóða granskarum ein pall har tey kunnu miðla tí gransking sum fer fram í løtuni, umframt áhugaverda og týdningarmikla gransking sum longu er framd.</p><p>Ynski okkara er at verða ein miðil, ið ger tað lættari fyri ein og hvønn FORVITNISKNOKK, at fáa atgongd til náttúruvísindaliga vitan, sum hevur serligan týdning fyri Føroyar og okkum føroyingar.</p><p>Finn okkum á Facebook og Instagram.</p><p>Allir tónarnir, sum vit hava brúkt í okkara poddvarpi eru frá: Flawed Mangoes</p><p>All soundtracks in this podcast are the courtesy of: Flawed Mangoes</p>",
        "language": "da",
        "author_name": "Vísindaknokkar",
        "slug": "visindaknokkar",
        "cover": "20230318_050343_81739cb7d171b0453bcd8c0817d08cec.jpg"
    },
    {
        "podcast_id": 199863,
        "title": "MoeSullyTalks",
        "description": "<p>In Search and discovery of life</p>",
        "language": "en",
        "author_name": "Moe.Sully.Talk",
        "slug": "moesully",
        "cover": "20230328_040322_c4c0685d020a220eccb14d1d55690d57.jpg"
    },
    {
        "podcast_id": 199989,
        "title": "Lurt av læreboken?",
        "description": "<p>Har du noen ganger møtt påstander du lurer på om stemmer? Med denne podkasten ønsker vi å bidra på vår måte til mer refleksjon og bedre undervisning. Episodene vil ha ulike temaer, men mange vil handle om myter og misforståelser som vi dessverre kan finne i læremidler og populærvitenskap, på skolebiblioteket og i sosiale media.</p><p>\"Lurt av læreboken?\" er en podkast fra <a href=\"http://Fagsjekk.no\">Fagsjekk.no</a>. Har du noen spørsmål til oss? Send oss en mail til <a href=\"mailto:fagsjekk@nkss.no\">fagsjekk@nkss.no</a></p>",
        "language": "nb",
        "author_name": "Fagsjekk.no",
        "slug": "lurtavlaereboken",
        "cover": "20230331_050317_98dfde6161798b5d90e6d1d19b268178.jpg"
    },
    {
        "podcast_id": 201203,
        "title": "The NICU Dad Podcast",
        "description": "<p>The NICU Dad Podcast is a podcast for NICU Dads by NICU Dads. Follow us as you hear NICU dads share their stories and experiences. Listen as they offer advice for new and current NICU dads.</p>",
        "language": "en",
        "author_name": "Alex Zavala",
        "slug": "thenicudad",
        "cover": "20230425_050456_f5a28ca73c6b6091e1f00e75a2785a93.jpg"
    },
    {
        "podcast_id": 205775,
        "title": "Excited By The Science",
        "description": "<p>Welcome to EXCITED by the SCIENCE, brought to you by the experts at Edanz. In this journal club style podcast, our panelists and special guests discuss science articles that excite them. Join us for new adventures and insights into leading-edge science and publishing! <a href=\"https://jp.edanz.com/excited-science\">https://jp.edanz.com/excited-science</a> • <a href=\"https://www.edanz.com/excited-science\">https://www.edanz.com/excited-science</a> </p>",
        "language": "en",
        "author_name": "Edanz",
        "slug": "excited-science",
        "cover": "20230426_100415_4037dc04de7ff2478d1aaa34b4977f06.jpg"
    },
    {
        "podcast_id": 206674,
        "title": "Safe Space - The ABA Podcast",
        "description": "<p>At Safe Space, we believe in the power of compassion and its ability to transform lives. We are a team of passionate professionals dedicated to our mission of increasing the quality of life for individuals with autism and related disorders. We understand the challenges faced by those with autism and their families, and we are here to provide support, guidance, and resources to help navigate those challenges. Our approach is grounded in research-backed techniques, and we are committed to sharing our knowledge and insights with the wider community. We believe in creating a safe and inclusive space for all individuals to learn, grow, and thrive. Join us on this mission to explore the infinite possibilities of creating a brighter and more compassionate future for all individuals in the world of ABA.</p>",
        "language": "en",
        "author_name": "To the Moon PLLC",
        "slug": "safespaceaba",
        "cover": "20230501_100513_e33a15a2a82fde3c2fe4c0d1fc79e695.jpg"
    },
    {
        "podcast_id": 213302,
        "title": "Keep Them Wild: the wildlife news podcast",
        "description": "<p>Keep Them Wild brings you the latest wildlife news and discussions on wildlife conservation, ethics, and welfare. We bring you up-to-date conservation news on the current state of wildlife populations, environmental policies, and global initiatives aimed at saving wildlife. From time-to-time we'll feature discussions and interviews with scientists, conservationists, wildlife experts, and advocates who dedicate their lives to protecting and promoting the welfare of animals. Join us, as we deepen our understanding of what it really takes to save wild animals.</p>",
        "language": "en",
        "author_name": "Adventurers for Animals",
        "slug": "keepthemwild",
        "cover": "20230605_010641_bdbeedba132a597fe77aacc288298303.jpg"
    },
    {
        "podcast_id": 214597,
        "title": "The Cancer Sisters",
        "description": "<p>We're identical sisters going through a crazy cancer situation.</p>",
        "language": "en",
        "author_name": "Amanda Hinton & Nicole Stratton",
        "slug": "thecancersisters",
        "cover": "20230611_090647_0c40b418b06718d02b968701f08ce349.jpg"
    },
    {
        "podcast_id": 216003,
        "title": "Cut the Chat Life Science Insider",
        "description": "<p>An informative podcast series designed quite literally cut the unnecessary talk and get straight to the point and heart of many life science and Biotech conversations that need to happen for our industry to evolve, innovate and get smarter—faster.</p><p>We’ll facilitate the conversations you’ve been dying to hear and tackle the real crux of our industry’s challenges while addressing the subjects of what we can do as life science leaders to be more successful in a shorter period of time, conversations that might actually help each other when we dare to open up.<strong>  </strong></p><p>Hear directly from some visionary global biotech and life science leaders.</p><p><a href=\"https://www.seuss.plus/cut-the-chat-life-science-insider-podcast/\">Discover more about Seuss+</a></p>",
        "language": "en",
        "author_name": "Seuss+",
        "slug": "cutthechat",
        "cover": "20230620_070621_a709cb40565433a46a2556e7cc23d8c8.jpg"
    },
    {
        "podcast_id": 217880,
        "title": "The Future of Foods - A series of podcasts",
        "description": "<p>Alex and guests discuss the Food Evolution, cellular agriculture, and novel foods.</p><p>Consider leaving a <strong>DONATION </strong>to<strong> FoF</strong> to help spread the word further and faster.</p><p><a href=\"https://www.paypal.com/donate/?hosted_button_id=ABYF9L6UY3A5Y\">https://www.paypal.com/donate/?hosted_button_id=ABYF9L6UY3A5Y</a></p><p>If you have any questions or comments, or wish to discuss collaboration, sponsorship or other, please contact me at <a href=\"mailto:crisplexmail@gmail.com\">crisplexmail@gmail.com</a></p>",
        "language": "en",
        "author_name": "Alex Crisp",
        "slug": "alexcrisp-futureoffood",
        "cover": "20230710_040720_c367ba5fde577f203d8e9276e90bbfb4.jpg"
    },
    {
        "podcast_id": 218213,
        "title": "L&D Lightning Talks",
        "description": "<p>Multi-cultural training challenges</p>",
        "language": "en",
        "author_name": "www.bigdatatrunk.com",
        "slug": "multi-cultural-training-challenges",
        "cover": "20230706_080742_02290fc52b4929cbb9a1fcfd8888ccb1.jpg"
    },
    {
        "podcast_id": 218811,
        "title": "Graft vs. Host Discussion",
        "description": "<p>The landscape of graft-versus-host disease (GVHD) management is continuously evolving. Graft vs. Host Discussion is a series of in-depth conversations with experts on the front lines of all facets of chronic GVHD. We are delving into the most pressing topics, ranging from key clinical data to practical clinical pearls and long-term complications of chronic GVHD. We are starting the conversation with experts at the forefront of this disease's research and management; they provide a comprehensive perspective on patient management and care to fellow healthcare professionals equally committed to improving and personalizing treatment for patients with GVHD.</p><p>This podcast is intended for healthcare professionals only. Speaker disclosures are available in each episode’s notes. The views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of any entities they represent. Some information contained herein may cite the use of an unapproved product in a dosage, for an indication, or in a manner other than recommended. Before prescribing any product, always refer to the latest Product Monograph. Financial support for the Graft vs. Host Discussion program was provided by Sanofi Canada.</p><p>MAT-CA-2301273 App Sept 2023</p>",
        "language": "en",
        "author_name": "Graft vs. Host Discussion",
        "slug": "graftvshost",
        "cover": "20230710_050714_e99037185c656d35dcf2d1ff1c741034.jpg"
    },
    {
        "podcast_id": 218812,
        "title": "Discussion greffon contre l’hôte",
        "description": "<p>Le paysage de la gestion de la maladie du greffon contre l'hôte (GVH) évolue constamment. Discussion greffon contre l’hôte est une série de discussions approfondies avec des experts portant sur toutes les facettes de la GVH chronique. Nous nous penchons sur les sujets les plus urgents, allant des principales données cliniques aux perles cliniques pratiques et aux complications à long terme de la GVH chronique. Nous entamons la conversation avec des experts à la pointe de la recherche et de la gestion de cette maladie pour fournir une perspective globale sur la prise en charge et les soins des patients à nos collègues professionnels de la santé déterminés à améliorer et à personnaliser le traitement de la GVH.</p><p>Ce balado est destiné aux professionnels de la santé uniquement. Les déclarations sur les conflits d’intérêts potentiels se trouvent dans les notes de chaque épisode. Les points de vue et les opinions exprimés dans le cadre de ce programme sont ceux des conférenciers et ne reflètent pas nécessairement les points de vue ou les opinions des entités qu’ils représentent. Le programme discussion greffon contre l’hôte bénéficie d’une aide financière de Sanofi Canada.</p><p>MAT-CA-2301273 App sept. 2023</p>",
        "language": "fr",
        "author_name": "Discussion greffon contre l’hôte",
        "slug": "greffoncontrelhote",
        "cover": "20230829_050859_f71ae965cd4b0b4bca7f20b4d94ede17.jpg"
    },
    {
        "podcast_id": 219280,
        "title": "Mrena Zemrës (URBAN FM)",
        "description": "<p>Një prej mënyrave ma efikase për me zhvillu mentalitetin tonë është përmes pyetjeve. Kualiteti I pyetjeve që ja bojna vetës është pasqyre e kualiteti të mentalitetit qe e kemi.</p><p>Pyetjet si:</p><p>Qysh me u përballu me vështirësi?</p><p>Çka është qëllimi I jetës?</p><p>Qysh me fitu ma shumë pare n’Kosovë?</p><p>Qysh me gjetë çfarë profesioni po du me u fokusu?</p><p>Qysh me shku rregulisht n’fitness? ETJ....</p><p>Esenca e këtij podcasti është me e zgjedhë një pyetje edhe me i hi thellit bashk me një mysafir edhe me I ndihmu audiencës me ide, me thellu pyetjet, edhe me marre perspektiva tjera. Në një far mënyre është për me i qitë pike – pyetjes.</p><p>Bashkë me Mentor Didën çdo të hënë nga ora 10:30 deri në 11:30 në 103.5 dhe 105.5 në Urban FM</p><p>Web: radiourban.fm</p>",
        "language": "en",
        "author_name": "URBAN FM",
        "slug": "mrenazemresurbanfm",
        "cover": "20230713_110711_3739652f876995882a20ceda0433ae8d.jpg"
    },
    {
        "podcast_id": 219510,
        "title": "R-Academy",
        "description": "<p>The R-Academy podcast provides a platform for the democratization of information about highly localized and niche topics. Its host, Robert Contofalsky, firmly believes in the importance of “Open-Access” like platforms where conversations about psychology, history, and science do not have barriers or paywalls behind them. The future of our society depends on the information that we are given at the time, and he believes that this podcast would be a contribution to this overall goal.</p><p>The topics discussed on this podcast will start where Robert has the most outreach: academia. He has maintained good relations with many professors and, thus, will begin by conversing with professors in Psychology and history, eventually expanding outwards. However, the “limited” faculty list is not a defect of the podcast, these are world-class scholars that he will be talking to, and the conversations will be nothing short of engaging and insightful. Here is a list of topics that will be covered:</p><ul><li>The nature of consciousness, language, and communication</li><li>The Psychology of personality, pain, neuroscience, and Culture</li><li>The heritability of behaviour and intelligence, and its societal implications</li><li>Medieval history, translational history; the nature of writing</li><li>The Cold War and American history</li></ul><p>This podcast will concentrate on academic affairs for the time being, with the hope of expanding outwards into more niche domains of scholarly topics. The potential for topics on this podcast will be infinite as professors are never done talking about their work, and that is the beauty of this podcast, is that it will allow the listeners to understand the work of top-shelf experts in a digestible format, and give them the opportunity to continue their curiosities in the topics that are discussed on this podcast.</p><p>In sum, the purpose of this podcast is for the host to act like a tourist in the minds and workspace of his guests; it is a zone that is free of judgment, and its primary focus is inquiry.</p>",
        "language": "en",
        "author_name": "Robert Contofalsky",
        "slug": "r-academy",
        "cover": "20230714_100727_76322e8674fd84f55a2a29f9c05b26ba.jpg"
    },
    {
        "podcast_id": 220541,
        "title": "The Paraqua Podcast",
        "description": "<p>The ParAqua Podcast is a science podcast that shines a light on the newest and most interesting research being conducted in the fields of aquatic and marine ecology. In this exciting new podcast we interview scientists from all around the world and learn more about their work in the fields of aquatic and marine ecology and how their research is shaping the world we live in.</p><p>The ParAqua podcast was funded by COST, the European Cooperation in Science and Technology and is a product of the ParAqua Action. If you are interested in joining the Action or just want to know more please go to www.paraqua- <a href=\"http://cost.eu\">cost.eu</a> </p><p>The podcast is produced by Joe Money and Serena Rasconi and the Science Communication Coordinator is Ana Gavrilović. If you have any questions or want to get in touch to discuss your research in aquatic or marine ecology please email <a href=\"mailto:joe.money@amu.edu.pl\">joe.money@amu.edu.pl</a></p>",
        "language": "en",
        "author_name": "Paraqua",
        "slug": "the-paraqua-podcast",
        "cover": "20230721_100755_37c6b7a8e0a949b9b1314e8584db814d.jpg"
    },
    {
        "podcast_id": 220573,
        "title": "Podcast sobre el tiempo",
        "description": "<p>Hablamos y debatimos sobre el tiempo en un podcast interactivo para una prueba semestral de nuestra institucion educacional</p>",
        "language": "es",
        "author_name": "Kevin Amaral y Agustin Correa",
        "slug": "podcast-tiempo",
        "cover": "20230721_040732_548679692322c9d5cf6ac561a1a3a297.jpg"
    },
    {
        "podcast_id": 221331,
        "title": "Conversation Currents with SIMS",
        "description": "<p>Welcome to the 'Conversation Currents with SIMS' podcast.</p><p>Every episode will feature a guest speaker in the marine science space and will focus on science to revive our oceans. This will include researchers, academics, philanthropists, technical staff and many more!</p>",
        "language": "en",
        "author_name": "Sydney Institute of Marine Science",
        "slug": "conversation-currents-with-sims",
        "cover": "20230727_020718_c08f3ebc92cc68941050c0df847e66c4.jpg"
    },
    {
        "podcast_id": 222085,
        "title": "No cap bros podcast",
        "description": "<p>Welcome to No cap bros podcast </p>",
        "language": "en",
        "author_name": "Dezi",
        "slug": "nocapbrospodcast",
        "cover": "20230801_090859_2a0178e11d0fef05ff71b1a2873aebfc.jpg"
    },
    {
        "podcast_id": 222202,
        "title": "Freedom's Shores",
        "description": "<p>Welcome!</p><p>Four of us truth seekers decided to engage on a journey to True freedom. Our podcast is centered around the freedom of humanity! Yes, we are a small group of individuals who want to see change on our planet Terra (Earth) and we are well aware that for change to happen on Earth, we must first change ourselves, change the way we were programmed to THINK, change the way we interact with our communities and society in general. Our planet needs our help with her Ascension process, even though she WILL ascend to a high frequency with or without US Earthlings! One thing we do know is that for US as individuals to ascend with our planet, we too must begin our own ascension process of evolution and this is where this podcast comes in play in your life, we have the information to help guide you on your way so stay tuned to each podcast episode! If you are a truth seeker, going through a spiritual awakening, feel like your going crazy? Your Not! Our entire Galaxy and Solar system is going through an evolutionary period in this NEW age of Aquarius predicted and prophesied by great scholars and spiritualists since ancient times. Our mission is to help guide you along your journey to absolute truth by sharing the knowledge we have gained in our lifetime thus far. We are so delighted that you have joined us on this Journey to finally attaining REAL freedom, freedom of the mind, body and soul. Welcome to Freedom's Shores!</p>",
        "language": "en",
        "author_name": "Sheena C, Micheal M, Charles N, Renee G",
        "slug": "freedomsshores",
        "cover": "20230802_020827_53bf993bb43d21a74ecb279d93c1523c.jpg"
    },
    {
        "podcast_id": 222404,
        "title": "സയന്റിഫിക് ടെമ്പറും പൗരബോധവും.",
        "description": "<p>WELCOME TO    SCIENTIFIC TEMPER (M&amp;DE)   |    <a href=\"https://chat.whatsapp.com/CiN05ZftgKk4sHWYYb4YEv\">https://chat.whatsapp.com/CiN05ZftgKk4sHWYYb4YEv</a></p><p>🔹️ ഈ ഗ്രൂപ്പ് ശാസ്ത്രവും സംശയങ്ങളുമായി ബന്ധപ്പെട്ട വിവരങ്ങളും പങ്കിടുന്നതിനാണ്, അല്ലാതെ മറ്റ് ആവശ്യങ്ങൾക്ക് വേണ്ടിയല്ല.</p><p>🔹️ നിങ്ങളോരോരുത്തരും ഇത് പാലിക്കണമെന്ന് അഭ്യർത്ഥിക്കുന്നു, </p><p>🔹️നിങ്ങൾക്ക് പൊതുവായ എന്തെങ്കിലും സംശയമുണ്ടെങ്കിൽ, ഗ്രൂപ്പിൽ  ചോദിക്കാവുന്നതാണ്.</p><p>⚠️ദയവായി ഈ നിയമങ്ങൾ അനുസരിക്കുക.. അല്ലാത്തപക്ഷം നിങ്ങൾ നീക്കം ചെയ്യപ്പെടും)</p><p> 1 സംശയങ്ങൾ ചോദിക്കുക.(ജ്യോതിശാസ്ത്രം, പ്രപഞ്ചശാസ്ത്രം, ക്വാണ്ടം ഭൗതികശാസ്ത്രം, ജീവശാസ്ത്രം, രസതന്ത്രം, ഭൗതികശാസ്ത്രം, സുവോളജി, ഗണിതം, കമ്പ്യൂട്ടർ സയൻസ്, മതത്തെ അടിസ്ഥാനമാക്കിയുള്ള, പ്രകൃതി, ബഹിരാകാശ സമയം...... മുതലായവ) </p><p>2 ഓഡിയോ അല്ലെങ്കിൽ വീഡിയോ കോളുകൾ ചെയ്യരുത്.</p><p>3 മതപരമായ പ്രചാരണം അനുവദനീയമല്ല.</p><p>4 വ്യക്തിഗത ചാറ്റുകൾ അനുവദനീയമല്ല...</p><p>(m_jkop)</p>",
        "language": "ml",
        "author_name": "em jey kop",
        "slug": "scientifictemper",
        "cover": "20230803_060821_49c1854fdd8dccd8833002989d193f06.jpg"
    },
    {
        "podcast_id": 222518,
        "title": "Telomeros, telomerasas, y envejecimiento. By Katrin Pico y Esteban Simbaña ",
        "description": "<p>Tema: Telomeros. Telomerasas. y envejecimiento</p><p>Participantes: Katrin Pico, Esteban Simbaña</p><p>Universidad UTE</p><p>Carrrera Odontología</p>",
        "language": "es",
        "author_name": "Esteban Simbaña katrin Pico",
        "slug": "telomeros-byestebanykatrin",
        "cover": "20230804_040846_b29b004728c4031317454f91a75b3e7a.jpg"
    },
    {
        "podcast_id": 223315,
        "title": "A Growth Mindset ... Understanding Cancer Research",
        "description": "<p>A Growth Mindset ... Understanding Cancer Research is a podcast from the Community Outreach and Engagement team at the NCI-designated Sidney Kimmel Cancer Center at Jefferson Health designed to answer your cancer health questions. </p>",
        "language": "en",
        "author_name": "Sidney Kimmel Cancer Center",
        "slug": "agrowthmindset",
        "cover": "20230809_050827_55983db4b40ac4318cef29a7f8281f19.jpg"
    },
    {
        "podcast_id": 223411,
        "title": "Life, Science and Marketing",
        "description": "<p>Airing every other week, BioStrata CEO, Paul Avery, engages in insightful conversations with leading science marketing experts from across the globe, delving deep into their life and career story, the areas of science that inspire them, and the marketing tips and tricks they have learned along the way.</p><p>Our aim is to provide life science marketers with the perfect resource to help them navigate the ever-changing and competitive landscape of our industry. We're hoping to arm you with industry-leading perspectives, expert insights, and innovative strategies, so you can stay ahead of the curve. The right knowledge can be your secret for success - access it by listening to Life, Science and Marketing.</p>",
        "language": "en",
        "author_name": "Paul Avery",
        "slug": "life-science-and-marketing",
        "cover": "20230810_030852_f464aac07ec4b4d4b6c45180326f28cc.jpg"
    },
    {
        "podcast_id": 223412,
        "title": "Kelu -Stories of Life",
        "description": "<p>Kelu offers meticulously selected podcasts of exceptional quality, abundant in entertainment, literature, morals, philosophy, and content deeply rooted in regional and cultural heritage.</p>",
        "language": "kn",
        "author_name": "Ramanujan MK",
        "slug": "kelu",
        "cover": "20230810_080835_50537cbd58fa4859590d38f995933bda.jpg"
    },
    {
        "podcast_id": 224840,
        "title": "Bi Aile Meselesi",
        "description": "<p>Merhaba, bu bizim podcast kanalımız.</p>",
        "language": "tr",
        "author_name": "Bi Aile Meselesi",
        "slug": "biailemeselesi",
        "cover": "20230819_040821_9ab1f11bc2f83af26b9e520bfacf2452.jpg"
    },
    {
        "podcast_id": 225133,
        "title": "The Plastic Planet podcast",
        "description": "<p>Introduction to the host and the concept of the podcast </p>",
        "language": "en",
        "author_name": "Dr Refilwe Mofokeng",
        "slug": "plastic-planet",
        "cover": "20230821_060826_d1bb15ba9f1ff6eda78b993305d8e673.jpg"
    },
    {
        "podcast_id": 226011,
        "title": "Decomp Danny",
        "description": "<p>I like death and murder stories so let me talk about my work experience. </p>",
        "language": "en",
        "author_name": "Danny Amaya",
        "slug": "decompdanny",
        "cover": "20230827_010857_fb6195161870fa0faffaf9540b0adf01.jpg"
    },
    {
        "podcast_id": 226392,
        "title": "InnerGround RailRoad",
        "description": "<p>Embark on an exploration of faith, mindfulness, and personal growth with Conductor: Dwayne Roper on \"The Inner Ground Railroad.\"  Dwayne guides listeners on a profound journey towards self-discovery and inspiration.</p>",
        "language": "en",
        "author_name": "Dwayne Roper",
        "slug": "igrr",
        "cover": "20230829_030800_ba22fb84e7e0871c406380a65ec758cf.jpg"
    },
    {
        "podcast_id": 227777,
        "title": "Mostly Hairless Apes",
        "description": "<p>Episode 1:  Belief</p><p>    Belief is one half of our information.  The other half is knowledge.  Belief is what we each accept without proof.  Knowledge is what we can prove to each other with independent facts.  </p><p>   Because no one knows everything, we depend on our belief systems to fill in the gaps of information.  Science is the best belief system for better information because it requires the simplest belief - that the universe exists with constant properties, and the scientific method is the best way to discover them.</p><p>   Join the Church of Science!  The services are lots of fun.</p>",
        "language": "en",
        "author_name": "Gene Mesco",
        "slug": "mostlyhairlessapes",
        "cover": "20230908_100932_adcffb896e60bb215d9459138f0f5cef.jpg"
    },
    {
        "podcast_id": 228031,
        "title": "The Saola Foundation Podcast",
        "description": "<p>Exciting adventures, conservation success stories, and insights from the incredible individuals who form the backbone of the Saola Foundation Field Team. Together, we can make a difference for our planet's most precious ecosystems!</p><p>For more information about the Saola Foundation please visit our website: <a href=\"https://www.saolafoundation.org/\">https://www.saolafoundation.org/</a></p><p>To subscribe to our newsletter for the latest information: <a href=\"https://www.saolafoundation.org/newsl\">https://www.saolafoundation.org/newsl</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbmlCNFRpemdVTDBaeXdkNkwwdVdaWVhNd3FNQXxBQ3Jtc0tucWliZEVWUHY4MFI5bGI2ZjlPdVpiSl9ldUFYcC1Sdm1sQ2Utd1pudjRRTVYwUXdyeS1sSVlyWVBqc0lLN2ZWT1l0NUg0T0ZnM2RFZlA5dFJIWXdiZk1GbmV2aktHbU54TEl0TjVwakNoaThWeGFLbw&amp;q=https%3A%2F%2Fwww.saolafoundation.org%2Fnewsletter%2F&amp;v=OrYmIZVhthk\">...</a></p><p>To donate: <a href=\"https://www.saolafoundation.org/donate/\">https://www.saolafoundation.org/donate/</a></p>",
        "language": "en",
        "author_name": "Saola Foundation",
        "slug": "saolafoundation",
        "cover": "20230910_100902_76c46f029c7c6ea15c1257e5faab5dc8.jpg"
    },
    {
        "podcast_id": 228685,
        "title": "Wat gebeurd er na de dood?",
        "description": "<p>Dag allemaal, ik ben helemaal nieuw met dit. Ik had gewoon een gedachte om dit te doen en ik ging ervoor. Het leek me interessant om een beetje te praten wat er nu eigenlijk na de dood gebeurd.. </p>",
        "language": "nl",
        "author_name": "Gizem ",
        "slug": "gizemo",
        "cover": "20230914_070921_d77aa5a50767ac394a82a8f95e2f2f1a.jpg"
    },
    {
        "podcast_id": 228892,
        "title": "หลวงปู่สาคร ธัมมาวุโธ ป12-640617 นักวิทยาศาสตร์คนแรกของโลก",
        "description": "<p>12-640617 นักวิทยาศาสตร์คนแรกของโลก</p>",
        "language": "th",
        "author_name": "หลวงปู่สาคร ธัมมาวุโธ",
        "slug": "640617-1stscientist",
        "cover": "20230916_030918_c23799f132eaeef27dec8d1a54d32dcb.jpg"
    },
    {
        "podcast_id": 229325,
        "title": "Biologi B - 2h 2023",
        "description": "<p>Forsøg med oplæste lektier til jer</p>",
        "language": "da",
        "author_name": "Simon Messell",
        "slug": "2h-bio-2023",
        "cover": "20230919_010938_6ab1566842bac16c74899c314fa65381.jpg"
    }
]