[
    {
        "podcast_id": 15741,
        "title": "I Like Maths",
        "description": "<p>People who have a passion for math often possess a unique set of skills that are highly sought after in various industries. Through learning and understanding math, these individuals have built up impressive careers in fields such as finance, engineering, computer science, and many others. They have used their analytical and problem-solving abilities to make a significant impact in their chosen professions.</p><p>I Like Maths is a podcast which shares stories of people who make a significant impact in society through applying their mathematical skills.</p><p>The show is hosted by Dr. Nahid Linda Banihashemi who is an applied mathematician and mathematics educator. She is also the founder of Bungee Pi which helps children learn mathematics using storytelling, animations and real life applications. She is based in Sydney, Australia.</p>",
        "language": "en",
        "author_name": "Dr. Linda Banihashemi",
        "slug": "likemaths",
        "cover": "20230222_050214_14ed36f848f36b173281173d979ff594.jpg"
    },
    {
        "podcast_id": 40346,
        "title": "Plato's Pod: Dialogues on the works of Plato",
        "description": "<p>Welcome to Plato's Pod, a bi-weekly podcast of group discussions on the dialogues of Plato held through <a href=\"http://Meetup.com\">Meetup.com</a>. Anyone interested in participating, whether to learn about Plato or to contribute to the dialogue, is welcome to join with no experience required! The podcast is hosted by amateur philosopher James Myers and inquiries can be e-mailed to dialoguesonplato@outlook.com. Wherever we go in our discussions we gain knowledge from each other’s perspectives, and for the increase in knowledge we invite everyone to add their voice to the dialogue. Plato, without a doubt, would have imagined no better way than in dialogue for knowledge – the account of the reasons why – to find its home.</p>",
        "language": "en",
        "author_name": "James Myers",
        "slug": "platospod",
        "cover": "20210719_185105_33b89d4c8fd52765cd17ba9a67e5a62e.jpg"
    },
    {
        "podcast_id": 64637,
        "title": "DNA in the Bible",
        "description": "Is there a numbers code within the King James Bible?  Was it placed there by the authors, or is this evidence of the hand of God?  The Bible Code is a podcast covering the numbers God uses in the Bible to support doctrine found in the pages of scripture.  You will discover a book most dismiss as archaic is the most advanced book ever to be written.",
        "language": "en",
        "author_name": "The Bible Code",
        "slug": "dnainthebible",
        "cover": "20210623_220450_6d93d341f17fbf8a21a5c342eccb00c2.jpg"
    },
    {
        "podcast_id": 78462,
        "title": "Statistically Insignificant",
        "description": "A podcast with visual aids about statistics in everyday life. Content is nominally published every fortnight.\nSupport the pod on Patreon: https://www.patreon.com/statisticallyinsignificant\n\nStatistically Insignificant is created on Wurundjeri and Dharawal country. We acknowledge the elders past, present, and future. Sovereignty was never ceded. ",
        "language": "en",
        "author_name": "Tess O'Brien",
        "slug": "statisticallyinsignificant",
        "cover": "20211104_023157_18e9208796b17c4df5c95db0a36781ed.jpg"
    },
    {
        "podcast_id": 81624,
        "title": "Bitcoin Stoa",
        "description": "Conversations shaping a Bitcoin future. A hub in cyberspace for community coordination. Building and protecting sound money for humanity.",
        "language": "en",
        "author_name": "Nobody Caribou",
        "slug": "bitcoinstoa",
        "cover": "20210926_200703_eb5ce66beadd76bd0a59946d21168351.jpg"
    },
    {
        "podcast_id": 116246,
        "title": "Physics By The River",
        "description": "<p>I'm Junaid, a Maths/Physics undergraduate student at Durham University aiming for a career in Physics. I meet with academics to discuss their research, their path in academia, science in general, and anything else that comes up in conversation! Check out my blog at: Junaid-Afzal.com and my YouTube channel: https://www.youtube.com/channel/UCB452vA6j_SSSCrcCBD1PMQ</p>",
        "language": "en",
        "author_name": "Junaid Afzal",
        "slug": "pbtr",
        "cover": "20221116_021131_7ed9cad4611c7aa296466024b78f51a5.jpg"
    },
    {
        "podcast_id": 119961,
        "title": "Cannabis Data Science",
        "description": "You can join a group of like-minded individuals who are interested in learning about how to apply data science to cannabis data. Utilize the web and APIs to get the data that you need. Wrangle the data like a pro into a format suitable for analysis. Then calculate statistics to your heart's galore. Furthermore, learn how to build forecasting and prediction models to get an upper-hand on your competition.\n\nAt the Cannabis Data Science meetup, you can join like-minded individuals, learn modern data science techniques, and go through hands-on exercises with real cannabis data. This is a great opportunity for anyone in a cannabis-testing lab, anyone working at a cannabis cultivation or processing plant, any cannabis retailer, and even any cannabis researcher or consumer seeking knowledge. Please join us for a coffee, I like tea, for a fun time crunching cannabis numbers. We follow the value for value principle, so if you find value then you may consider donating so the Cannlytics team can continue to provide you with value.",
        "language": "en",
        "author_name": "Cannlytics",
        "slug": "cannabis-data-science",
        "cover": "20220408_020404_0417d7a86990a41807ffdf3d38c624a5.jpg"
    },
    {
        "podcast_id": 132640,
        "title": "What in the world is dyscalculia?",
        "description": "<p>Dyscalculia is the math learning disorder most people have never heard of. Which is hard to believe, because approximately 5 million K-12 students have dyscalculia-- just in the USA! Find out what this learning disorder means to you as a teacher, a parent, and as a student. Presented by EduCalc Learning, https://www.educalclearning.com/ and hosted by Dr. Honora Wall.</p>",
        "language": "en",
        "author_name": "Dr. Honora Wall, Ed.D.",
        "slug": "dyscalculia",
        "cover": "20220606_110639_5c2d00ae0131280f88932459935baa37.jpg"
    },
    {
        "podcast_id": 162048,
        "title": "The Beyond Podcast",
        "description": "The Beyond Podcast explores meta-topics and concepts. Note: this has nothing to do with Meta - the corporation. We will focus on mind-twisting subjects like recursion, self-similarity, self-reference, various paradoxes, and other fun puzzles and problems. We will discuss meta references in art and entertainment. And we will try to make these discussions fun and entertaining! Check out The Beyond Podcast at thebeyondpod.com, or wherever you get your podcasts.",
        "language": "en",
        "author_name": "Vadim Yushprakh",
        "slug": "thebeyondpod",
        "cover": "20221021_011048_df1c3d7ca3c82adea68a40aadf605054.jpg"
    },
    {
        "podcast_id": 167721,
        "title": "Building a Science of Consciousness",
        "description": "The Qualia Research Institute (QRI.org) is a California 501(c)(3) non-profit research group studying consciousness in a consistent, meaningful, and rigorous way. Our goal is to spread the ideas of our institute in a more accessible way and to support the research being done by our members.",
        "language": "en",
        "author_name": "Qualia Research Institute",
        "slug": "qri",
        "cover": "20221113_101139_c986d187c7b77fa27e926d6beb66f644.jpg"
    },
    {
        "podcast_id": 178370,
        "title": "The Silly Salamander Scientist",
        "description": "<p>In this series, join me as I break down current topics from all fields of science from biology to physics, mathematics to engineering. I discuss issues related to science and the behind the scenes of academia and research.</p>",
        "language": "en",
        "author_name": "Talon Jost",
        "slug": "silly-salamander-scientist",
        "cover": "20230105_080137_99f97b45e0ddd6be864b7945ecd64e0d.jpg"
    },
    {
        "podcast_id": 184537,
        "title": "People Analytics World Podcast",
        "description": "Exploring the use of people data to drive business success, and how technology, policy, macroeconomics, and social trends impact how businesses collect and use workforce data.",
        "language": "en",
        "author_name": "Tucana",
        "slug": "peopleanalytics",
        "cover": "20230129_100110_21d0949a3b825cb6e1f7b98d75328172.jpg"
    },
    {
        "podcast_id": 185372,
        "title": "Charlas Aleatorias",
        "description": "La intención de esta serie es acercar al público en general y, en particular, a l@s estudiantes de licenciatura a los seminarios que organiza el Departamento de Estadística del ITAM. Los episodios son cortos pues son charlas informales que tenemos con los expositores del seminario. El objetivo es dar una oportunidad a los ponentes de platicar de su trabajo en un ambiente mas informal que un seminario y motivar al estudiantado a indagar un poco mas en los temas. Y por qué no, atender con mejor contexto las pláticas de dicho seminario. ¡Disfrutalo!",
        "language": "es-mx",
        "author_name": "Alfredo Garbuno Iñigo",
        "slug": "charlas-aleatorias",
        "cover": "20230207_110226_5d89701d8ff76c6f55d998835fe87d91.jpg"
    },
    {
        "podcast_id": 188092,
        "title": "Statistics with Crayons",
        "description": "<p>Welcome to Statistics with Crayons, a podcast where we talk about statistics, oral health, and everything in between. Our hosts, Dr. Alonso Carrasco-Labra and Dr. Michael Glick, are professionals from the Center for Integrative Global Oral Health at Penn Dental Medicine. This center unites health researchers, educators, and practitioners at the University of Pennsylvania and beyond in seeking creative solutions to address unmet oral health needs related to the worldwide prevalence of caries, periodontal disease, oral cancer and craniofacial deformity which impacts more than 3.5 billion people annually.</p>",
        "language": "en",
        "author_name": "Penn Dental Medicine",
        "slug": "statswithcrayons",
        "cover": "20230317_030301_0e8db4b3eb9696ce4b97955230c06d94.jpg"
    },
    {
        "podcast_id": 197687,
        "title": "The Tangent Territory",
        "description": "<p>Podcast on mathematics, mathematics education, tech and music.</p>",
        "language": "en",
        "author_name": "HL",
        "slug": "tangenterritory",
        "cover": "20230318_060339_712caa500bdf3816f3600b9ee811e980.jpg"
    },
    {
        "podcast_id": 202239,
        "title": "Making Number Sense Make Sense: A Math Podcast for Early Elementary Teachers",
        "description": "<p>Hi! I'm Lara and I didn't use to be a math person. Through a winding series of events, I have developed a passion for early elementary mathematics! Learn about it in this episode and stay tuned for future episodes about developing number sense in math!</p><p>Follow me on <a href=\"https://www.instagram.com/numbersensemakesense/\">Instagram</a></p><p><a href=\"https://www.youtube.com/playlist?list=PLXXMTdtSTEZF3CoXfL4l_WmqqS-ub3iVv\">Video Podcast/YouTube Channel</a></p><p><a href=\"https://www.makingnumbersensemakesense.com/blog-1\">Blog: Making Number Sense Make Sense</a></p><p><a href>Introduction Music</a></p>",
        "language": "en",
        "author_name": "Lara",
        "slug": "makingnumbersensemakesense",
        "cover": "20230721_050729_425aa93ab20c18cec7027023114d89c9.jpg"
    },
    {
        "podcast_id": 209060,
        "title": "Intersecting Us",
        "description": "<p>Brian Rihner and Dave Kester started their first business venture together in 1995. Now, 28 years later, they reunite again to talk about their passions of math, life, hope, and faith, and how they are all connected. They provided a probing and analytic perspective to consider the beauty, wonder and timeless treasures of these topics and how they have the power to draw us closer together.</p>",
        "language": "en",
        "author_name": "Dave Kester & Brian Rihner",
        "slug": "intersecting-us",
        "cover": "20230514_120538_869c93d6a6c3616bdb2631db8f233b16.jpg"
    },
    {
        "podcast_id": 213860,
        "title": "Docentes Innovadores!!",
        "description": "<p>Hola, Bienvenidos a Docentes innovadores </p>",
        "language": "es-mx",
        "author_name": "ara",
        "slug": "podara1",
        "cover": "20230617_050653_b9336bd70244faf789dad7d4946b3493.jpg"
    },
    {
        "podcast_id": 220555,
        "title": "Wopiti Wopiti",
        "description": "<p>Este podcast fue realizado por el grupo 8º3 del liceo nº8 de Montevideo en el año 2023...</p>",
        "language": "es",
        "author_name": "Alejandro Villa",
        "slug": "wopitiwopiti",
        "cover": "20230721_010736_5a11249fe6904d82dd1987622667cc6d.jpg"
    }
]