[
    {
        "podcast_id": 669,
        "title": "Eco Futures - Welcome to the New Generation of Planet Restoration: Join the Evolution",
        "description": "A podcast/radio program from Australia about the environment, conservation, climate change and living sustainability in an earth of ever diminishing resources and more waste. The program is based in Byron Bay though the issues we cover affect all people and planet Earth. Your host Michelle Michels has updates, interviews and stories about climate change, conservation, indigenous perspectives on land management, ecology, energy and sustainability topics. Local, national and international topics are discussed. Local communities, academics, activists and anyone concerned about the environment speak about their concerns and projects. \n Included is the project on Modern Slavery legislation in Australia, kindly funded by the Community Broadcasting Foundation. Written and produced by Michelle Michels in collaboration with Jodee Sydney (aired on Bay FM 'Eco Futures' from June 2020 - March 2021).  \nWeekly program broadcast on www.bayfm.org 11 am -12 pm Wednesdays available online https://www.bayfm.org//shows/eco-futures/",
        "language": "en",
        "author_name": "Michelle Michels",
        "slug": "ecofuturesradio",
        "cover": "20210310_044523_4ebb025435cbe8f8ec8b6fc9767ee419.jpg"
    },
    {
        "podcast_id": 1907,
        "title": "We All Know Nothing",
        "description": "Weekly podcast hosted by husband and wife, centered on circadian rhythm and returning to nature.",
        "language": "en",
        "author_name": "Liz and Phil Welch",
        "slug": "waknpodcast",
        "cover": "5d0d4633bf833.png"
    },
    {
        "podcast_id": 3514,
        "title": "Demystifying NMO & MOG",
        "description": "Neuromyelitis Optica Spectrum Disorder (NMOSD) and Myelin Oligodendrocyte Glycoprotein antibody disease (MOGAD) are neurological autoimmune diseases that cause blindness and paralysis. While NMOSD and MOGAD are rare diseases, autoimmune diseases are common, and so is finding scientific and medical jargon tricky to understand. In this podcast, The Sumaira Foundation works to simplify the science associated with NMOSD, MOGAD, and related neuro-immune disorders, bringing together patients and experts.",
        "language": "en",
        "author_name": "The Sumaira Foundation",
        "slug": "demystifyingnmo",
        "cover": "20230106_070156_d03adb84d9fffbcc542dddf28656fa97.jpg"
    },
    {
        "podcast_id": 8572,
        "title": "Virkelige Underlige Vidundere",
        "description": "Fjollet og eksperimenterende podcast om dyr og skør biodiversitet: Virkelige Underlige Vidundere 🐙\nHar du nogensinde tænkt over hvordan der er opstået så mange mærkelige dyr på vores planet? Menneskets forundring og søgen efter at forstå de mest underlige dyr har altid været stor.\nDette er en podcast om mærkværdige dyr og deres twist på tilværelsen.\nFindes der udødelige dyr?\nHar dyr en seksualitet?\nEr dyr dumme?\nLever der dyr på toppen af det højeste bjerg?\nKan en vandmand se?\nHvad er det mærkeligste dyr du kender?\n\nLad dig blive opslugt af fortællinger og diskussioner om\nVirkelige underlige vidundere\nMed dine værter\nSandra Helmark og Julie Ørneborg",
        "language": "da",
        "author_name": "Sandra Helmark Hansen",
        "slug": "virkeligeunderligevidundere",
        "cover": "20200507_195717_62a849cc5d02f2f6258441c0ee011f69.jpeg"
    },
    {
        "podcast_id": 10590,
        "title": "Soil4Climate Voices - Outspoken Advocates of Soil Restoration as a Climate Solution",
        "description": "Soil4Climate interviews with heroes of the regenerative agriculture and soil restoration as a climate solution.",
        "language": "en",
        "author_name": "seth itzkan",
        "slug": "soil4climate",
        "cover": "20200715_225954_5e20fe241bec64302eab6a9b95e7e2b2.jpg"
    },
    {
        "podcast_id": 14524,
        "title": "Довколаботаніка",
        "description": "Подкаст про ботаніку та інші природничі науки",
        "language": "uk",
        "author_name": "Oleksii Kovalenko",
        "slug": "dovkolalabotanika",
        "cover": "20201112_124058_e33ef75097a3d68091d92ea2d09562fe.jpg"
    },
    {
        "podcast_id": 15202,
        "title": "Insight & Excite ",
        "description": "Excitement is a powerful catalyst for change. When shared with others, it has the power to change the world. Tune in with me, and let’s learn from individuals working toward a future that excites them the most.",
        "language": "en",
        "author_name": "Najeeb Akbar",
        "slug": "najeeb-gets-excited",
        "cover": "20201212_163410_ec9b143c9e887fc81448da62a9a8fecb.jpg"
    },
    {
        "podcast_id": 15925,
        "title": "Politics Under the Microscope",
        "description": "<p>Politics Under the Microscope captures the thought process of policy makers as they respond to complex problems and to discuss the implications those policies will have for the scientific community and broader society. Each episode starts by briefing the listener on a societal problem using an anecdote, then will reframe the problem with a science policy-related question, and finally engage the listener by integrating audio from multiple expert interviews. Taken together, these will shape the role science can and may play in developing policies in response to political and social issues. Our unique approach lies in our ability to layer scientific and political facts in a single narrative, with an emphasis on capturing the principles of scientific and creative problem solving to address a diverse range of topics that caters to many interests. For more information and for the episode transcripts, visit us at www.politicsunderthemicroscope.com.</p>",
        "language": "en",
        "author_name": "Joanna, Ellie, Naira, and Nina",
        "slug": "politicsunderthemicroscope",
        "cover": "20210814_012625_3f345e4c16489ac6884dfe4f36e76969.jpg"
    },
    {
        "podcast_id": 16412,
        "title": "İklim Kafe Konuşmaları",
        "description": "İklim Kafe Konuşmaları'nda iklim değişikliğiyle ilgili çeşitli konuları, politikadan atmosfer bilimlerine, ekonomiden psikolojiye kadar disiplinler arası bir ortamda tartışmak üzere bir araya geliyoruz.  İklim Kafe Konuşmaları serisini buradan dinleyebilirsiniz. ",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipm",
        "cover": "20201202_135237_87088afee167711c4d957188e962855f.jpg"
    },
    {
        "podcast_id": 18989,
        "title": "The Women of Regenerative Ag: Transforming the Health of the Soil, Land & People",
        "description": "This is a platform for the extraordinary women leading the regenerative agricultural movement—and the transformation of our societies--around the world. They are on the ground, creating critical shifts in seemingly intractable and highly unsustainable systems. And they've been doing so for a long time. \n\nIn this series, we look to explore beyond the soil, to the underlying theme of transformation itself across multiple dimensions: from that very internal landscape of human consciousness to the outer manifestation in the world around us, be it in the form of agricultural management practices, tools and techniques, to culture, economics, policy, and the built environment. \n \nThis series is a joint venture with Soil4Climate and my own organization, the Ouroboros Agency, where we work to help transform the human social infrastructure, and the built environment, to create truly resilient and regenerative societies. \n \nThese recordings originally aired as interactive livestream interviews on social media. They were held during the initial months of the US Covid lockdown and due to limited facilities, we sometimes had to get creative with our locations and dealt with the occasional technical issue. ",
        "language": "en",
        "author_name": "Aurora Flynn",
        "slug": "thewomenofregenerativeag",
        "cover": "20201225_025849_d12af27f749d52f081ef1ecfafaa5bf6.jpg"
    },
    {
        "podcast_id": 19976,
        "title": "Manual Ganadero",
        "description": "Este es un podcast para las personas que quieren hacer más rentable el hermoso negocio de la ganadería, nuestra pasión!",
        "language": "es",
        "author_name": "Jaime Moreno",
        "slug": "manualganadero",
        "cover": "20201224_013635_3d53c178edeb0699bb6f10ee4cbfbe8e.jpg"
    },
    {
        "podcast_id": 20220,
        "title": "Clippings: The Official Podcast of the Council for Nail Disorders",
        "description": "Welcome to Clippings, the official podcast of the Council for Nail Disorders where Drs. April Schachtel and Dr. Katherine Stiff take a closer look at articles and clippings published on all things nail disease. Visit us at www.nailexperts.org \nThank you for listening!\n",
        "language": "en",
        "author_name": "Council for Nail Disorders",
        "slug": "cndclippings",
        "cover": "20201223_125644_8f53eb80348152ec1515d1888fa20106.jpg"
    },
    {
        "podcast_id": 26666,
        "title": "Podcast Molecular - Nos Bastidores da Ciência",
        "description": "No Podcast Molecular, fala-se sobre os bastidores da Ciência, com foco especial na Química.\nSerão entrevistados Investigadores e Professores universitários que nos falarão dos projetos científicos em que estão a trabalhar, dos problemas que estes pretendem responder, no percurso que tiveram até chegar aqui e naquilo que fazem para além da ciência.",
        "language": "pt-pt",
        "author_name": "Molecular JE",
        "slug": "podcastmolecular",
        "cover": "20210123_215013_421586a663d952e0353fcfd14962ebfa.jpg"
    },
    {
        "podcast_id": 27618,
        "title": "The Guide Post ",
        "description": "A community hub where anglers, fishing guides, scientists, and policymakers connect to discuss fisheries, their history, their futures, and the importance of effective management.\n\nProduced by the American Saltwater Guides Association.\nPresented by Costa Sunglasses.",
        "language": "en",
        "author_name": "American Saltwater Guides Association",
        "slug": "theguidepost",
        "cover": "20211101_181234_9385d3872fe6c3169c17c44b34152d69.jpg"
    },
    {
        "podcast_id": 33731,
        "title": "Land Ethic",
        "description": "The Land Ethic Podcast features people who have dedicated their lives to conservation and stewardship of the natural world. Hosted by Dylan Bagnasco. ",
        "language": "en",
        "author_name": "Dylan Bagnasco",
        "slug": "landethic",
        "cover": "20220428_030437_8707c1db3eb4973801c3375a438ee88b.jpg"
    },
    {
        "podcast_id": 43945,
        "title": "The Comic Cosmonaut",
        "description": "Hi ya! My name is Bek, and this podcast is aimed toward anything and everything space related! So come hang out and chill with me :) Let's listen to music and talk about space!",
        "language": "en",
        "author_name": "Rebekah Denton",
        "slug": "thedowntimedentons",
        "cover": "20220618_070621_7eadcdbb78e1e3814aedbdf4fc029f82.jpg"
    },
    {
        "podcast_id": 44805,
        "title": "Physique & Chimie en pandémie",
        "description": "Nous, Félix - Physique - (maîtrise en physique) et Mathieu - Chimie - (bientôt Docteur en sciences pharmaceutiques) essayons, du mieux qu'on peut, de vous présenter/expliquer de façon simple des phénomènes naturels qui nous passionnent et qui vous intriguent. Sans math, sans calcul, sans équation. Bref, sans tout ce qui vous fait normalement suer. On commence, ça ne va y aller qu'en s'améliorant! Bonne écoute!",
        "language": "en",
        "author_name": "Felix Blais",
        "slug": "physique-et-chimie",
        "cover": "20210328_192119_ccf09062ad4b9c53526cc9e7ac17d373.jpg"
    },
    {
        "podcast_id": 47773,
        "title": "The World Around Us",
        "description": "Hello ! \nThis podcast is intended to expand our knowledge of the world around us and expose us to the wonderful people who compose it ! \nIt is extraordinarily easy to meet people in a somewhat tangential fashion, never really uncovering the intricacies of their personalities and what they are interested in. My name is Jake and I am a Bachelor of advanced science student at the University of Sydney. Consequently, I will be aiming to chat primarily to people from the University, such as professors and students, aiming to establish true relationships with them and learn even a small part of the knowledge these amazing people have uncovered in their time. \nSit back relax as we get to know various people from various walks of life and continue to learn more about the world around us. ",
        "language": "en",
        "author_name": "Jake Chidiac",
        "slug": "theworldaroundus",
        "cover": "20210408_104419_2e96e2be48f2660fcf716ef913c54ab8.jpg"
    },
    {
        "podcast_id": 48009,
        "title": "The Digital Forester",
        "description": "Foresters that have embraced digital technologies to transform the business of forestry share their experiences and lessons learned in this podcast.",
        "language": "en",
        "author_name": "Kevin Lim",
        "slug": "thedigitalforester",
        "cover": "20210419_023352_f458ccf699b79b8365e1730e975960e7.jpg"
    },
    {
        "podcast_id": 49372,
        "title": "Agromeetings",
        "description": "No podcast Agromeetings teremos várias conversas com convidados, onde nos propomos debater temáticas dedicadas à agricultura e ao agronegócio.",
        "language": "pt-pt",
        "author_name": "Espaço Visual",
        "slug": "agromeetings",
        "cover": "20230111_090133_7b619c62d7b9ad3fd2ddc3e164466956.jpg"
    },
    {
        "podcast_id": 49448,
        "title": "Crème de la Crème",
        "description": "Por Joana Nobre.\nSou Farmacêutica, com mestrado em Ciências Farmacêuticas e especialista em Cosmética, tendo feito uma pós-graduação nesta área e ainda outra em Branding e Gestão de Imagem. Tenho um fascínio assumido pela Psicanálise, a Estatística e a Comunicação. Trabalho na Indústria Farmacêutica desde 2005, leciono em diversas Instituições de ensino superior e sou Program Manager de um Curso de Especialização em Dermocosmética. A Cosmética é uma ciência e nela vivem muitas outras. Adoro escrever sobre o tema, sempre com o objetivo de contribuir para a literacia na área. O rigor é a minha imagem de marca. Viajo muito em trabalho e fora dele. Nas minhas viagens e tempos livres, faço fotografia e crio playlists no Spotify. O meu dia favorito é o sábado, quando arranjo tempo para me aventurar em receitas de bolos e passear em família sem horas marcadas. No meu Crème De La Crème mostro-vos que a cosmética tem um futuro muito promissor.",
        "language": "pt-pt",
        "author_name": "Joana Nobre",
        "slug": "cremedelacreme",
        "cover": "20210414_202523_dd2f0838dc19a236ef3c683c8cb41b80.jpg"
    },
    {
        "podcast_id": 50187,
        "title": "The Elevated High",
        "description": "A cannabis friendly podcast where we take an inside look at what goes on in the mind of a stoner. We discuss topics such as, cannabis strains, cannabis types, cannabis news, personal experiences, and psychedelics. We also take a small step into the astrology world and we start diving into the spiritual aspect of cannabis along side other spiritual practices and beliefs. ",
        "language": "en",
        "author_name": "Eli Griego",
        "slug": "elevatedhigh",
        "cover": "20210422_221341_bc9f8bd8a8fcf8b5cbb3da67b7b99062.jpg"
    },
    {
        "podcast_id": 51176,
        "title": "Big Minds",
        "description": "The Journey School of Houston students explore topics that spark curiosity, excitement, and sometimes make you go \"hmm.\" ",
        "language": "en",
        "author_name": "The Journey School of Houston",
        "slug": "bigminds",
        "cover": "20210421_202504_bd1ce2c4f9f6d485045a1d2cedd61dd4.jpg"
    },
    {
        "podcast_id": 57320,
        "title": "This Ones On Us Podcast",
        "description": "This Ones On Us aims to provide insight and create conversation around all aspects of sustainability, through conversation with experts and the hosts individual experience and investigations.\n\n\n",
        "language": "en",
        "author_name": "Andrew and Brian",
        "slug": "thisonesonuspodcast",
        "cover": "20210526_101245_4c6992e0b9aba44623443d80cb2f5e7e.jpg"
    },
    {
        "podcast_id": 57747,
        "title": "The Official Podcast of the WCD",
        "description": "The World Congress of Dermatology (WCD) will be held next in Singapore in 2023. We are all working hard to bring you an unforgettable congress and experience. Join us in this podcast as we keep up with Dermatology News and talk to dermatologists and skin researchers on their excited work leading up to the Congress.\n\nHosted by Dr Etienne Wang of the National Skin Centre, with Resident co-hosts Sashen Aponso and Ellie Choi.\n",
        "language": "en",
        "author_name": "Etienne Wang",
        "slug": "wcd2023singapore",
        "cover": "20210519_044311_1187f75b46b22fe6bb9a53f601917100.jpg"
    },
    {
        "podcast_id": 58033,
        "title": "Can Architecture Fix This? ",
        "description": "'Can Architecture Fix This?' is a podcast from White arkitekter in Oslo. Join host Rebekah Schaberg and producer Ingjerd Sandven Kleivan for discussions and interviews with experts in the fields of design to see if we can answer the question: Can Architecture Fix This? - whatever this may be!",
        "language": "en",
        "author_name": "White arkitekter Oslo",
        "slug": "caft",
        "cover": "20210520_113352_2358b1f03e4037f8ff89a045c50153f5.jpg"
    },
    {
        "podcast_id": 59780,
        "title": "The Black Science Guy Podcast",
        "description": "Do you have a curiosity about all things science? Do you enjoy learning about science? Well this is the podcast for you! Each episode we cover everyday science topics from astronomy to microscopy. Then if it's something you're curious about, you can ask the black science guy! ",
        "language": "en",
        "author_name": "Chris Edwards",
        "slug": "blackscienceguypodcast",
        "cover": "20210530_021905_3de06922d6f88792c052059c114790d9.jpg"
    },
    {
        "podcast_id": 60200,
        "title": "Weather or Not?",
        "description": "From Tropical Talk to Space Chats, Climate Change, and Environmental Concerns, will any of them impact you?",
        "language": "en",
        "author_name": "WSVN-TV",
        "slug": "weatherornot",
        "cover": "20210531_182944_1295ffb083ac8e753ef61aa31d8459af.jpg"
    },
    {
        "podcast_id": 61657,
        "title": "We Know Some Stuff",
        "description": "Why do all your plants die? Will robots take over the world? Do squirrels like pizza? \n\nCurrent and recent graduate students have the answers to these questions. We certainly don't know everything, which is why you are listening to We Know Some Stuff ",
        "language": "en",
        "author_name": "Louis A. Colaruotolo",
        "slug": "weknowsomestuff",
        "cover": "20210608_044031_dab5a52f412a0aae8afbb048b930ee3c.jpg"
    },
    {
        "podcast_id": 67776,
        "title": "Clean Sailors podcast",
        "description": "Welcome to our Clean Sailors podcast!\n\nHosted by Clean Sailors founder, Holly, we talk all about sea, sailing and keeping it clean, exploring some of the areas in which sailing and our wider marine industry can become that bit cleaner. \n\nThrough conversations with experts, innovators, inventors and activists, all working towards the health of our seas, we showcase the people and projects changing the way things are done.\n\nWe believe great ideas should be shared so our podcast is free to appear on. If you've got a project, idea or topic you think we should be discussing - get in touch!",
        "language": "en",
        "author_name": "Clean Sailors Crew 🌊",
        "slug": "cleansailors",
        "cover": "20210714_103957_987d5c508296eed5c084e38049cb4b7a.jpg"
    },
    {
        "podcast_id": 68611,
        "title": "Ghetto To Glory : Intellectual Outlooks From Ghetto Perspectives",
        "description": "Peace family, Radio Razeem in the building and this is Ghetto to Glory, intellectual outlooks from ghetto perspectives, your media hub that breaks down the world around us with science, empathy, and an open mind , mixed with a fifth of henny, an Oz of sour, and a hand full of homies on the stoop.\n\nHere on G to G, we'll be addressing all types of subject matters going on in the world, past, present, or what's to come in the future and how those things have , are right now, or will one day effect all of us from the basement to the pent house. These topics will encourage you to take a deeper look at things and  I think you're all are gonna rock with us. So sit back relax catch a contact sip ya cognac cuz its on black as we vibe and mac.\n\n",
        "language": "en",
        "author_name": "Radio Razeem",
        "slug": "ghettotoglory",
        "cover": "20210717_071754_89ce4386419a9402408371524cfed37f.jpg"
    },
    {
        "podcast_id": 69001,
        "title": "GeoTrek",
        "description": "GeoTrek investigates the impacts of extreme weather and natural disasters on individuals and communities. Our goal is to help improve your decision making, risk assessment and communication related to extreme events, so you can take action to make yourself, your family and your community more resilient.\n\nOur guests include scientists, storm chasers, farmers, urban planners, disaster response professionals, and travelers/ explorers.\n\nVisit our website 👉  https://www.geo-trek.com/\n\nListen to our Podcast \n👉\n  iTunes - https://podcasts.apple.com/us/podcast/geotrek/id1577259065\nSpotify \n👉\n  https://open.spotify.com/show/73GLqlNgdJr04KoI5yU6h5\n\nFollow us on Facebook \n👉\n  https://www.facebook.com/GeoTrekbyCNC\n\nJoin our Facebook Group \n👉\n  https://www.facebook.com/groups/515960219869748 \n\nFollow us on Instagram \n👉\n https://www.instagram.com/_geotrek/ \n\nFollow us on Twitter \n👉\n https://twitter.com/_geotrek \n\nFollow us on TikTok \n👉\n  https://www.tiktok.com/@_geotrek",
        "language": "en",
        "author_name": "GeoTrek",
        "slug": "geotrek",
        "cover": "20210719_164325_f5143e36bfb4337dc0ea027e40b06edf.jpg"
    },
    {
        "podcast_id": 71825,
        "title": "In The Know with Nueces County Extension",
        "description": "Monthly podcast focusing on Extension Education in Nueces County",
        "language": "en",
        "author_name": "Nueces County Extension Staff",
        "slug": "intheknowwithnuecescountyextension",
        "cover": "20210804_214529_342e8c2095bb2486f4856759cca298cf.jpg"
    },
    {
        "podcast_id": 72711,
        "title": "Certain Uncertainty Podcast (CUP) ",
        "description": "Jon and Joe are two biotechnology engineers bringing new thoughts for certain uncertainty in the world.\n\nFreeform conversations about neuroscience, society, computation, individualism, philosophy, psychology, and more. \n\nEvery Monday at 12pm PST.",
        "language": "en",
        "author_name": "Joe Schroer and Jon Cramer",
        "slug": "cupepisde1",
        "cover": "20210809_230409_862c341d7d6af397c6a80ee8ae31b156.jpg"
    },
    {
        "podcast_id": 75541,
        "title": "TUSmedline",
        "description": "TUSmedline Tıpta Uzmanlık Sınavına hazırlanan hekimlere yenilikçi ve dijital kanallar aracılığıyla bilgi vererek hazırlık süreçlerini verimli ve en iyi şekilde yönetmelerini sağlamayı amaçlar. Alanında uzman eğitmenlerden hazırlık önerileri, temel ve klinik bilimler hakkında ayrıntılı ve güncel bilgiler sunar.",
        "language": "tr",
        "author_name": "TUSmedline",
        "slug": "tusmedline",
        "cover": "20211020_080457_e8ae2e432ccd80a61fcd131e60e45511.jpg"
    },
    {
        "podcast_id": 77786,
        "title": "The Qubit Guy's Podcast",
        "description": "The Qubit Guy (Yuval Boger) hosts thought leaders in quantum computing to discuss business and technical questions that impact the quantum computing ecosystem.",
        "language": "en",
        "author_name": "Yuval Boger",
        "slug": "qubit",
        "cover": "20210906_214813_d13b15e3fec57fbcc6e1546e711d14a5.jpg"
    },
    {
        "podcast_id": 78462,
        "title": "Statistically Insignificant",
        "description": "A podcast with visual aids about statistics in everyday life. Content is nominally published every fortnight.\nSupport the pod on Patreon: https://www.patreon.com/statisticallyinsignificant\n\nStatistically Insignificant is created on Wurundjeri and Dharawal country. We acknowledge the elders past, present, and future. Sovereignty was never ceded. ",
        "language": "en",
        "author_name": "Tess O'Brien",
        "slug": "statisticallyinsignificant",
        "cover": "20211104_023157_18e9208796b17c4df5c95db0a36781ed.jpg"
    },
    {
        "podcast_id": 81603,
        "title": "Zhens' ",
        "description": "Two brothers into science, technology, and entrepreneurship",
        "language": "en",
        "author_name": "Zhen Rong Yap and Zhen Wei Yap",
        "slug": "zhens",
        "cover": "20230212_100216_e196227d8adbc8d0476c43d6a7914e7a.jpg"
    },
    {
        "podcast_id": 83951,
        "title": "The Skin Series",
        "description": "Hosted by qualified Naturopaths and Corneotherapists Danika and Hayley. This podcast covers all of your burning questions about skin health. We explore acne, eczema, dermatitis, rosacea, topical steroid withdrawal, healthy skincare, hormones, gut health, emotional wellbeing and so much more.  We draw on our own clinical experience and also interview some amazing experts in our field.\n\nJoin us here and over on our instagrams @theskinseries_pod @clear_skin_naturopath and @solsticeskin_ \n\nFor 1:1 advice from us and to book in skin treatments please visit www.solsticeskin.com.au and www.danikajanenaturopathy.com.au. To contact us for collaborations, guest and topic suggestions or to give us (only good hehe) feedback please email theskinseriespod@gmail.com.\n\nWe are here to promote loving the skin you're in and treating the root cause of skin conditions for long term healthy skin! Enjoy! xxx",
        "language": "en",
        "author_name": "Danika and Hayley",
        "slug": "theskinseries",
        "cover": "20211015_062311_27d2c8dbb56d330ad1bd952c19f57b51.jpg"
    },
    {
        "podcast_id": 85560,
        "title": "The Final Frontier",
        "description": "Today we will be taking a journey through time and space, from near earth orbit to the farthest reaches of the Milky Way. We will explore strange worlds and the vastness of the void, and seek to understand the greatest mysteries of the cosmos. This… is the Final Frontier.\n",
        "language": "en",
        "author_name": "Matt Walz",
        "slug": "thefinalfrontier",
        "cover": "20211016_224117_ab036871d7fd19865fcdcd3c355c4837.jpg"
    },
    {
        "podcast_id": 96262,
        "title": "Brain Stream - The Brain Computer Interfacing Podcast",
        "description": "Join the BCI Guys (Colin Fausnaught and Harrison Canning) as they discuss all things Neurotechnology! Brain Stream will cover a wide range of topics in Neurotechnology, ranging from ethics to cutting edge technology. Join us as we explore a wide range of topics and discuss the future of the field! Future episodes will feature prominent figures in the Neurotechnology field, so make sure you subscribe to us on Stitcher, Google Play, or Apple Podcasts to stay up to date!\n\nHarrison and Colin (The BCI Guys) are neurotech researchers and entrepreneurs dedicated to creating a brain-controlled future! Neurotechnology and brain-computer interfaces are devices that allow users to control machines with their thoughts and interact with technology in new ways. This revolutionary technology will change life as we know it, and soon will be as common as the touchscreen on your smartphone. Join us in learning about the brain-controlled future!\n\nSupport Us: https://www.bciguys.com/support\n\nFollow us on Social Media!\nTwitter: https://twitter.com/bciguys​​\nInstagram: https://www.instagram.com/bciguys/​​\nWebsite: https://www.bciguys.com \n",
        "language": "en",
        "author_name": "The BCI Guys",
        "slug": "brainstream",
        "cover": "20211217_051252_07e0a2dec267208c9fedfe9ab252085f.jpg"
    },
    {
        "podcast_id": 97469,
        "title": "Cow Talks",
        "description": "<p>Cow Talks with Dr. Marcelo Wallau, UF/IFAS Forage Extension Specialist and Chris Prevatt, Beef Cattle and Forage Commodity Director for the Alabama Farmers Federation. This podcast is tailored towards producers and extension agents in Florida.</p>",
        "language": "en",
        "author_name": "Marcelo Wallau and Chris Prevatt",
        "slug": "cowtalks",
        "cover": "20211228_071213_d6d7f40cc1b2e4b301e1fd76d28990f8.jpg"
    },
    {
        "podcast_id": 97691,
        "title": "CODPAST podcast",
        "description": "Let your “Fishy Past” hook your brilliant future… Join us as we laugh-out-loud while co-learning at high speed. We discuss and interview “edgy” topics learning to “Hack and Laugh” From ETs to Jesus to Yoga and marketing, or attending our world Transformational Retreats, we aim to laugh, learn and earn while we get things done. We love fabulous people and interviews so if you are one, contact us :)",
        "language": "en",
        "author_name": "Dr. Deborah Schlosser, Laura Clancy, Dr Trish Sanders, ",
        "slug": "codpastpodcast",
        "cover": "20220402_120403_631c85ce1936ef1c9fb32945d0c016c7.jpg"
    },
    {
        "podcast_id": 98432,
        "title": "Venom Exchange Radio",
        "description": "<p>Venom Exchange Radio! A Podcast for all things Venomous! </p><p>Hosted By, Nipper Read and Phil Wolf </p><p>Venom Exchange Radio and Venomous Etiquette Videos on YouTube!</p><p> www.youtube.com/channel/UC0KozTrYrzjiFI1CiPfiU6g</p>",
        "language": "en",
        "author_name": "Nipper & Phil",
        "slug": "venomexchangeradio",
        "cover": "20220102_040126_6e14cc0c81c9da133118d340ec200c90.jpg"
    },
    {
        "podcast_id": 106595,
        "title": "Following the Tracks",
        "description": "Join Sammi Shimota and Giselle Ray as we discuss wildlife research reports and talk about its relevance to today's issues and its implications for our future. ",
        "language": "en",
        "author_name": "Samantha Shimota",
        "slug": "followingthetracks",
        "cover": "20220417_080401_4a78155340aea2afe6a573b687a2ae2e.jpg"
    },
    {
        "podcast_id": 108765,
        "title": "INFRAIntelligence - ReNew Canada",
        "description": "Canada's leading infrastructure experts come together to discuss the key elements necessary to support the largest and most important infrastructure assets that impact all Canadians. INFRAIntelligence podcasts are adapted from an ongoing webinar series hosted by ReNew Canada magazine. ",
        "language": "en",
        "author_name": "ReNew Canada Magazine",
        "slug": "infraintelligence",
        "cover": "20220214_050206_6f7e7c0d6ca0bd4cd3a11ffbe7b37918.jpg"
    },
    {
        "podcast_id": 108789,
        "title": "Challenging Colonialism",
        "description": "Challenging Colonialism amplifies Indigenous perspectives on issues of concern to native Californian communities. It is our intention to create an educational resource where everyone can hear the perspectives of Indigenous peoples in their own words. It is not our intention to further colonize the narrative, or to misrepresent stories that are not our own. The podcast is produced by Martin Rizzo-Martinez, Historian, & Daniel Stonebloom, a Public School Administrator. ",
        "language": "en",
        "author_name": "Martin Rizzo-Martinez & Daniel Stonebloom",
        "slug": "challengingcolonialism",
        "cover": "20220214_070252_367edc6b2eaf1486222d08a940895412.jpg"
    },
    {
        "podcast_id": 111914,
        "title": "Mi Última Neurona",
        "description": "<p>El propósito de este podcast es llevar información gratuita y valiosa a la comunidad hispana, que tiene acceso limitado al complejo mundo de la neurociencia debido a las barreras del idioma y la subrepresentación en las ciencias. También pretende inspirar a la próxima generación de neurocientíficos hispanos.  Jessica Chomik, la host y productora del podcast, es una investigadora en el Instituto Tecnológico de Massachusetts, o mejor conocido como MIT. Ella trabaja en los laboratorios de la Dra. Nancy Kanwisher y la Dra. Laura Schulz.</p>",
        "language": "es",
        "author_name": "Jessica Chomik-Morales",
        "slug": "miultimaneurona",
        "cover": "20230711_030737_90f61643dc3a17440a5f0fc356b99c4c.jpg"
    },
    {
        "podcast_id": 112202,
        "title": "Freddy Future Talks",
        "description": "<p>Freddy Future Talks : In deze podcast gaat het over innovatie in de gezondheidszorg. Freddy Flux is de spreekbuis van FarmaFlux, een organisatie die zorgt voor een veilige gegevensuitwisseling van en naar de apotheek, maar ook allerlei tools ontwikkelt om apothekers te ondersteunen bij de zorg voor hun patiënten. Ons team is begeesterd door innovatie: VR, AI, 3D-printing, datamining, ... en blikt steeds vooruit in deze snel evoluerende digitale wereld van de gezondheidszorg. Volg ons ook op: - https://www.facebook.com/profile.php?id=100011742976405 - https://twitter.com/FreddyFlux - https://www.instagram.com/apo_freddy_flux/ - https://www.linkedin.com/in/freddy-flux-315261191/</p>",
        "language": "nl",
        "author_name": "Farmaflux",
        "slug": "freddy-future-talks",
        "cover": "20220301_070335_a1d2b4322754990de87d8136b984d76d.jpg"
    },
    {
        "podcast_id": 112641,
        "title": "RED: Abya Yala",
        "description": "RED: Abya Yala - Continental Communications : Communicaciones - Media : Medios",
        "language": "en",
        "author_name": "Tupak Huehuecoyotl",
        "slug": "redabyayala",
        "cover": "20220303_050304_73754651f38d1aad922aad30fa7176e2.jpg"
    },
    {
        "podcast_id": 117502,
        "title": "The Cavefish Chronicles",
        "description": "Understanding how the same fish could look so different is a question that scientists have been investigating since the discovery of the blind Mexican cavefish, Astyanax Mexicanus in the 1930’s. The cave fish, pale pink without eyes, lives in underground caves below its surface cousin which is silvery gray with black eyes. Today Astyanax is a model to study genetics, disease and behavior.\n\nThe story includes jungle explorers braving plane crashes and venomous snakes to find the cavefish and the scientists who studied it including a renowned German professor who fled Nazi Germany and a female Turkish scientist, Perihan Sadoglu who did some of the first genetic work in the 1950’s, but who mysteriously disappeared mid-career. The podcast follows the stories of scientists past and present revealing clues along the way to find out what had happened to Dr. Sadoglu and why it matters now.",
        "language": "en",
        "author_name": "Andrea Carter Mincer",
        "slug": "cavefish",
        "cover": "20220325_120323_dc8db0874e193d3f8c5f7e5d1e875fe5.jpg"
    },
    {
        "podcast_id": 122131,
        "title": "The GWES ERN Podcast",
        "description": "Participants of the GWES EAS Relay Network talk about all things EAS and Weather!",
        "language": "en",
        "author_name": "Global Weather and EAS Society",
        "slug": "ernpodcast",
        "cover": "20220414_060407_5d136bf2e01e500538a0395aa596a566.jpg"
    },
    {
        "podcast_id": 122702,
        "title": "B jak biologia",
        "description": "W podcaście B jak biologia opowiadam sobie wesoło o, a jakże, biologii. Zdobędziecie tu wiedzę na temat świata ożywionego w przystępny sposób. Czasem się tu denerwuję, czasem sobie pożartuję, często się zachwycam. Nie obiecam Wam, że lepszy będzie świat, jednak mogę obiecać, że będzie tu całkiem luźno i przyjemnie. \n\nJeśli chcecie popatrzeć sobie na zdjęcia roślin czy grzybów, nauczyć się ich nazw i nie tylko, to zapraszam na mój Instagram: @zamollony",
        "language": "pl",
        "author_name": "Maciej Móll",
        "slug": "bjakbiologia",
        "cover": "20220417_050418_05becf394d4fd564ba314a83330c60df.jpg"
    },
    {
        "podcast_id": 123086,
        "title": "Afraid of the Dark",
        "description": "Alex, Carlie, and friends discuss cryptozoological folklore from across the world. From the legend of The Mothman and Indrid Cold, to the events that befell Skinwalker Ranch in the 90s, nothing is off the table. \n",
        "language": "en",
        "author_name": "AOTD Podcast Group",
        "slug": "aotdpod",
        "cover": "20220425_120445_3ef017c0a77677481a815bdd43347b47.jpg"
    },
    {
        "podcast_id": 125348,
        "title": "The Everyday Wonders of Science",
        "description": "Rural communities are oftentimes neglected when it comes to science communication. This leaves individuals feeling excluded, negatively impacting their relationship with science. The aim of this project is to get more people, especially those in rural communities, to engage with science. For this project, I have created a podcast mini-series highlighting the ways that science impacts our daily lives. Episodes include How the Internet Connects Us, The Importance of Improving Water Quality, and Why the Scientific Method Isn’t Just for Scientists. In order to cater this podcast to rural communities, I have partnered with various public libraries across the state of Iowa to establish content areas of interest and ways to reach their patrons. The podcasts consist of interviews with professionals and faculty at the University of Iowa that have extensive experience in the areas of interest. These short episodes are intended to be easily digestible in order to get people excited about science and how it works without us even knowing.",
        "language": "en",
        "author_name": "Preston Johnson",
        "slug": "the-everyday-wonders-of-science",
        "cover": "20220429_040444_a0802896070364f862888623cf373d80.jpg"
    },
    {
        "podcast_id": 129177,
        "title": "Y.E.A.! il podcast green degli studenti",
        "description": "Un podcast creato dai ragazzi di una scuola media montessoriana, una serie di episodi fresh and cool a tema green, \"visto l'ambiente\", che proveranno a raccontare un percorso didattico sulla relazione Natura ed Essere Umano cercando di strappare un sorriso ogni tanto. Ah, il nome? YEA! = Yellow (la nostra classe) Envirorment (il nostro tema) Amazing (il modo in cui lo facciamo)!  \nSeguici anche su Youtube!",
        "language": "it",
        "author_name": "Classe dei \"Gialli\" ",
        "slug": "classe-yea",
        "cover": "20220601_070650_38837f681ae79a348885f7b2d5d62ecb.jpg"
    },
    {
        "podcast_id": 131374,
        "title": "RESENHA RURAL",
        "description": "<p>Podcast da RURALSERVICE voltado aos profissionais e simpatizantes do agro. Estamos no mercado do agronegócio desde 1986. Além de atender as exigências legais do crédito rural, com foco na elaboração de projetos, organização e gestão da documentação necessária, orientamos os agropecuaristas sobre boas práticas para produção, cuidados com a proteção e preservação do meio ambiente, contando com a parceria e respaldo técnico dos maiores desenvolvedores de tecnologia do setor. Em 1999, ingressamos na atividade de seguro agrícola e como empresa de inspeções rurais, primamos pela ética, transparência e precisão nas avaliações. Fornecemos apoio constante e treinamentos periódicos para toda a rede de engenheiros agrônomos credenciados, além de mantê-los alinhados com as expectativas da empresa e dos clientes. Nosso time, vanguardista nos dois segmentos de atuação, nos garante além da excelência na execução e conhecimento dos processos, uma rede de contatos de alto impacto que possibilita aproveitar as oportunidades do mercado para agregar ainda mais valor à cadeia.</p>",
        "language": "pt-br",
        "author_name": "RURALSERVICE",
        "slug": "ruralservice",
        "cover": "20220531_030503_7bdc2f8c6b2dc676b3172945e5a8b2fc.jpg"
    },
    {
        "podcast_id": 132632,
        "title": "TechTalk: A Pre-Physical Therapy Podcast",
        "description": "TechTalk is a Pre-Physical Therapy Podcast created by students and at Texas Tech University with the goal of illuminating the pathway of becoming a physical therapist. Join us as we talk to guests about the many intricacies involved in the physical therapy profession as well as how the modern student can be successful in such a competitive and important field. ",
        "language": "en",
        "author_name": "Case Danzeiser",
        "slug": "techtalkphysicaltherapypodcast",
        "cover": "20220606_100649_4c6edce5a3c1c2abad6e62b679b47c70.jpg"
    },
    {
        "podcast_id": 133100,
        "title": "Accès Innovation",
        "description": "Accès Innovation est une série d'entrevues qui ont pour but de présenter les beaux projets et découvertes dans l'ingénierie au Québec.\n\nSi vous participez à un projet qui vaudrait la peine d'être présenté, écrivez-moi: emile.demers97@gmail.com\n\nLe podcast est créé et édité par Émile Demers.",
        "language": "fr",
        "author_name": "Émile Demers",
        "slug": "accesinnovation",
        "cover": "20220609_010610_d38c191f16a15b6e34dad6ed5fd2af42.jpg"
    },
    {
        "podcast_id": 133428,
        "title": "Labákový Podcast InUPS 📚",
        "description": "Miško a Nika sú nadšení doktorandi, vďaka ktorým sa zamilujete do vedy, výskumu a inovácií aj vy 👩🏼‍🔬 Spolu budeme spoznávať zaujímavosti vo vede 🧪a vyspovedáme mnohých vedcov 🧑🏻‍🔬 Naším mottom je: \"po vedecky, ale stále zrozumiteľne\". Tento podcast vznikol s finančnou podporou projektu InUPS \"Inovačné zoskupenie na podporu udržateľných potravinových systémov\". www.inups.uniag.sk\n",
        "language": "sk",
        "author_name": "Labákový Podcast inUPS",
        "slug": "labakovypodcastinups",
        "cover": "20220610_120624_1409c395fe01b40b4b00804217c06fd5.jpg"
    },
    {
        "podcast_id": 133450,
        "title": "Ingeniería Química en 5!!! Ep. 1",
        "description": "Canal dedicado a la divulgación científica en el área de ingeniería química y procesos sustentables.  ¡¡¡¡¡Ven a descubrir esta maravillosa disciplina!!!!!",
        "language": "es",
        "author_name": "ADREESUG",
        "slug": "adreesug",
        "cover": "20220610_010631_9f9ee22ea07e258927a551156b6912cd.jpg"
    },
    {
        "podcast_id": 136142,
        "title": "The Nervous Podcast",
        "description": "Let's explore the most complex structure in the universe, the nervous system - aka you.\nThe objective functions, processes - subjective perceptions, experiences; and all the controversial theories in-between.",
        "language": "en",
        "author_name": "Jet Flavell",
        "slug": "the-nervous-podcast",
        "cover": "20220629_010612_dd8bd9ff1de3eb9b0934202f5822426f.jpg"
    },
    {
        "podcast_id": 140388,
        "title": "Essence of ",
        "description": "This Podcast is hosted by Dr. Abbasi and Héctor Cancel \nThe goal is to talk about medicine and health education from the perspectives of a Neurosurgeon and a future Medical Doctor \n\nFollow us for more!",
        "language": "en",
        "author_name": "Dr. Hamid Abbasi and Héctor Cancel",
        "slug": "essenceof",
        "cover": "20220714_100708_8702604684d585a4e1699c1b2fd9ee82.jpg"
    },
    {
        "podcast_id": 144231,
        "title": "Psychedelic Frontiers: Bridging Science, Medicine and Consciousness",
        "description": "<p> In recent years, Psychedelics have begun to recapture the attention of the scientific community, largely related to their efficacy in the treatment of neurological disorders including PTSD, depression and addiction. Alongside this, with recent technological advances in neuroimaging, psychedelics may offer an all important tool to further our understanding of consciousness. With groundbreaking studies being released nearly every month, the psychedelic science scene is certainly one you want to keep up to date with!</p><p> The Psychedelic Frontiers Podcast features interview-style episodes discussing the science and potential applications of psychedelic and psychoactive compounds with leading academics. By studying these powerful substances, we can gain insight into the nature of consciousness itself, alongside understanding the mechanisms responsible for their profound effects, including those related to mental health. Join us each month for a new episode exploring this fascinating field.</p><p> Ben Clayden, the creator and owner of this podcast is currently studying for an MSci in Natural Sciences specialising in Neuroscience at the University of York. Alongside the podcast, he is the co-chair for the Drug Science Student Society Network, as well as the president of his universities Drug Science Society. He has a key interest in neuropsychopharmacology, particularly relating to the neural correlates of consciousness and altered states of consciousness.</p><p>Podcast Themes: Psychedelics, LSD, Psilocybin, Magic Mushrooms, MDMA, DMT, Drugs, Science, Medicine, Mental Health, Anxiety, Depression, Consciousness, Biology, Chemistry, Neuroscience, Psychology, Education</p><p>Contact and Extra Information: Keep updated and listen to all our episodes and clips!</p><p>Podcast Email - <a href=\"mailto:psymedpod@gmail.com\">psymedpod@gmail.com</a></p><p>Listen to the Psychedelic Frontiers Podcast! - <a href=\"https://rss.com/podcasts/psymedpod/\">https://rss.com/podcasts/psymedpod/</a></p><p>Psychedelic Frontiers Linktree - <a href=\"https://linktr.ee/psychedelicfrontiers\">https://linktr.ee/psychedelicfrontiers</a></p><p>Psychedelic Frontiers Instagram - <a href=\"https://www.instagram.com/psychedelicfrontiers/\">https://www.instagram.com/psychedelicfrontiers/</a></p><p>Psychedelic Frontiers Twitter - <a href=\"https://twitter.com/in_psychedelics\">https://twitter.com/in_psychedelics</a></p><p>Psychedelic Frontiers TikTok - <a href=\"https://www.tiktok.com/@psychedelicfrontiers\">https://www.tiktok.com/@psychedelicfrontiers</a></p>",
        "language": "en",
        "author_name": "Ben Clayden",
        "slug": "psymedpod",
        "cover": "20230611_060617_699a04929303c5eac0ee570d77d6b81e.jpg"
    },
    {
        "podcast_id": 150472,
        "title": "Tinfoil Tales",
        "description": "<p>Are you curious about the unknown? Join us at Tinfoil Tales and explore the mysteries of the paranormal, cryptids, aliens, monsters, conspiracies, time travel and more. Every week we interview people who have had first-hand encounters with high strangeness phenomena. From experts to everyday people, you'll gain insight into these mysterious occurrences as we search to uncover the truth.</p>",
        "language": "en",
        "author_name": "Brandon Wright",
        "slug": "tinfoiltales",
        "cover": "20230913_050904_081fd1509b9ecd58b2bc5a3498493653.jpg"
    },
    {
        "podcast_id": 152084,
        "title": "MERLIN Podcast: Bringing Europe’s freshwaters back to life",
        "description": "Europe’s freshwaters are in an alarming state. Water pollution, habitat destruction and the ongoing effects of climate change have caused significant biodiversity loss and ecological decline across the continent. There is a pressing need for major freshwater restoration projects which tackle these declines and bring rivers, streams, peatlands and wetlands back to life. \n\nMERLIN is a major European Union funded project which is investing millions of Euros to help mainstream freshwater restoration across the continent over the coming years. This podcast follows the MERLIN project in this journey. It offers a behind the scenes look at some of the continent’s most ambitious freshwater restoration projects carried out through cutting-edge aquatic science and conservation.\n",
        "language": "en",
        "author_name": "MERLIN project",
        "slug": "project-merlin",
        "cover": "20220908_040936_e979230da85a9e773d02e8fe2069ce9c.jpg"
    },
    {
        "podcast_id": 152527,
        "title": "Mind Blowing Week of Magic and Synchronicity Began with Techniques from the Retreat",
        "description": "One of the greatest spiritual teachers on the planet, the Medicine Man from the Havasupi Tribe, Uqualla, was one of the participants at the Retreat hosted this week by Dr. Trish and Dr. Davies. There were high profile participants, so this was extremely sensitive and private to enable trust between everyone. What happened was another Black Swan Event...things we could have never predicted or believed would happen...happened. We have three more scheduled retreats coming up, most certainly to be building a cresendo to catapult transcendence for all participants. The next retreat will be in Otter Crest, Oregon on Sept 21-25    Masters to Masters\nhttps://www.eventbrite.com/e/400754887657\nThe next event will be one day with Jack Canfield in Simi Valley on Nov. 8, 2022 for the Full Moon Gathering of the Golden Motorcycle Gang Rally \nhttps://www.eventbrite.com/e/395568545167\nThen we will travel to Costa Rica the day after Thanksgiving for the week. \nEach of our retreats are carefully orchestrated to produce outcomes for each person to experience more fun and more enlightenment than ever before. Most are kept small to maintain the integrity of the processes. This podcast goes into detail about what happened this week. ",
        "language": "en",
        "author_name": "Dr Byron Davies",
        "slug": "blackswanlife",
        "cover": "20220910_070921_f59af5cdca21ce7f14f268e640ccc2ae.jpg"
    },
    {
        "podcast_id": 152528,
        "title": "The Within Podcast",
        "description": "<p>Hello Beautiful Souls 😊</p><p>Im your host Ruth. This is a space of upliftment &amp; support during the ascension. Reminding you of what's important--YOU.</p><p>Your heart &amp; soul is valid. Infinite is your nature. You are human &amp; beautiful &amp; God &amp; special. &amp; Life is here to mold to your desires. Keep the faith in yourself.</p><p>Take deep breaths &amp; care for your beautiful precious body. Speak good thoughts &amp; care for your wonderful amazing world that's right here in front of you.</p><p>✨️✨️</p><p><a href=\"http://Cash.app/$Trustyourtruth\">Cash.app/$Trustyourtruth</a></p><p>Paypal.me/TrustYourTruthh</p><p>My Patreon: patreon.com/TheWithin?utm_source=waitlist</p><p><a href=\"http://linktr.ee/trustyourtruth\">linktr.ee/trustyourtruth</a></p><p>✨️My latest book: Lies My Scientist Told Me <a href=\"https://www.amazon.com/dp/B0BD24W6WT?ref_=pe_3052080_397514860\">https://www.amazon.com/dp/B0BD24W6WT?ref_=pe_3052080_397514860</a></p><p>By engaging with this content, you acknowledge that everything on this platform is not medical or legal advice. You're responsible for your own life &amp; the choices you make. This content is just based on my personal perspectives &amp; experiences.</p>",
        "language": "en",
        "author_name": "Ruth",
        "slug": "thewithin",
        "cover": "20220928_060928_82891e055c2d0e54b476a4e583f6fb88.jpg"
    },
    {
        "podcast_id": 155079,
        "title": "THE POWER CLUB",
        "description": "The POWER CLUB was born in 2022 since TEERAK inc established. We realized about the climate change situation. We can't make it change by our self, we need everyone to join in our pack to make the effects to our earth together.\n\n|| - GET a FREE!! \"Climate change NEWS\" \n- \"NOTIFICATION\" for a new podcast episode \n- get FREE \"FUN STUFF!!!!\" and GIFT treat!!!!!!. \n&gt;&gt;&gt; JUST click \"FOLLOW\" button and go REGISTER on WWW.POWERTABLETS.NET &lt;&lt;&lt;",
        "language": "en",
        "author_name": "TEERAPAT.KKK",
        "slug": "thepowerclub",
        "cover": "20220927_050913_3b47f343391c4b3d26d4093a6129ae62.jpg"
    },
    {
        "podcast_id": 155086,
        "title": "The RVGS Rat Chat",
        "description": "<p>STEM focused podcast from the Roanoke Valley Governor's School. Learn about students STEM interests as they talk with classmates and share their passions.</p>",
        "language": "en",
        "author_name": "RVGS Rat Chat",
        "slug": "rvgsratchat",
        "cover": "20230320_120346_7d06cd776518dc1538819bd282b78710.jpg"
    },
    {
        "podcast_id": 155945,
        "title": "KK DNA ",
        "description": "Topics in Genetics",
        "language": "en",
        "author_name": "Kashish Khanna",
        "slug": "kkdna",
        "cover": "20221012_111058_de815208b0ba068c485dc9dfcd8073ca.jpg"
    },
    {
        "podcast_id": 156064,
        "title": "Mole Valley Farmers",
        "description": "The Mole Valley Farmers’ podcast covers the latest farming news, technical advice and business and market matters using top experts from across the UK. So, whether it’s grassland management, market conditions, feed prices or policy changes, our Podcasts are here to help. Produced in association with Seth Conway Media. \n\nDon’t forget to subscribe to keep up to date when every new episode is out.  ",
        "language": "en",
        "author_name": "Mole Valley Farmers",
        "slug": "mvf",
        "cover": "20220926_020931_f48b13efe747b83305b92400114a16fe.jpg"
    },
    {
        "podcast_id": 156475,
        "title": "The Climate Voices Podcast",
        "description": "<p>Climate Change is no longer a question of “if” or “when” because it’s a reality and people are already feeling the impacts globally. We will be hosting experts and climate change advocates from all over the globe every two weeks to tackle different topics like just energy transition, youth climate activism and advocacy and resilient systems. If you want to learn what efforts people are putting across the world to address the climate crisis, this is definitely the show for you!</p>",
        "language": "en",
        "author_name": "Omesa Mokaya",
        "slug": "theclimatevoices",
        "cover": "20220928_100942_4c58e02c8d747732cf73df64ec26769a.jpg"
    },
    {
        "podcast_id": 158471,
        "title": "Refer the Reefer with Host Lil Pharmer",
        "description": "<p>Refer the Reefer with host Michael Alkire aka Lil Pharmer is a podcast that references medical cannabis consumption practices, methods and habits of medical cannabis consumers, long time cannabis activists and medical cannabis researchers who are pioneers in their studies. There is not much reliable information, for people to search for when looking for answers on how to consume medical cannabis responsibly for different ailments. Here we hope to shed light on proper ways to prep and consume medical cannabis for these different ailments that it is said to help relieve. Nowadays there are 100s of products and ways to consume them. Even to an experienced consumer there are always new things to be learned about the ever-changing world of legal cannabis. It is becoming ever increasingly popular in many parts of the world and being legalized for usage. More and more people are wanting to try cannabis for the first time, whether it be for recreational purposes or medical relief of any type. More and more people suffering from chronic illnesses that find little to no relief from pharmaceutical prescriptions and want to explore new options. After working in a recreational dispensary in Breckenridge, Colorado for 3 years, talking to clients from all over the world about why they consume and how it helps them, it has become clear that there are benefits to their consumption. Everyone has a unique Endocannabinoid System (ECS) and cannabis effects everyone a little bit differently depending on their own personal chemistry. What is the ECS and what does it control or do? The ECS is complicated, and experts haven’t yet determined exactly how it works or all of its potential functions are listed below. • appetite and digestion • metabolism • chronic pain • inflammation and other immune system responses • mood • learning and memory • motor control • sleep • cardiovascular system function • muscle formation • bone remodeling and growth • liver function • reproductive system function • stress • skin and nerve function These functions all contribute to homeostasis, which refers to stability of your internal environment. For example, if an outside force, such as pain from an injury or a fever, throws off your body’s homeostasis, your ECS kicks in to help your body return to its ideal operation. Today, experts believe that maintaining homeostasis if the primary role of the ECS. We will also be talking about the benefits of legalization, debunk the stigmas of Refer Madness and normalize cannabis consumption for everyone Worldwide. That being said cannabis isn’t for everyone and sometime can cause unwanted side-effects. This could be due to many factors including improper growing, contaminants and/or over consuming one's personal limits. Some people need to eat higher concentrates of edible cannabis and get the same effect as the next person. Sometimes 2.5 mg of THC is enough for one person and then 200 mg for the next to get the same desired effects. We will talk about how to avoid these bad situations and how to deal with them if they occur. We will also reference situations that occurred while trying to retrieve black market cannabis in the past and explain why it is better that it is legal. There are also thousands of different chemovars and cultivars of cannabis out there currently and thousands to come in the near future. These are many new terms that are being used in the industry now and some terms like Indica and Sativa that are not being used as much. Chemovars are used to describe cannabis strains by the chemical contents of the strain with terpene profiles and cannabinoid percentages present in each batch. Cultivars are used to describe a batch with a name of a strain, with the name of the grower and type of cultivation method used to grow it.</p>",
        "language": "en",
        "author_name": "Lil Pharmer",
        "slug": "referthereefer",
        "cover": "20221006_041018_3411e8f2901e6ce1763e64394709bd7a.jpg"
    },
    {
        "podcast_id": 162268,
        "title": "Tiny Living Beings",
        "description": "<p>Tiny Living Beings is a weekly podcast where listeners get to know a scientist, a weird microorganism they like, and why they think it’s interesting. Our planet is full of billions of different microscopic organisms, most of which are still unknown to science. The ones we do know are diverse and strange. Microbiology knowledge is often gatekept by scientists who discuss this information in exclusive professional circles, but more of these topics need to be shared with the public! Although generally upbeat and fun, conversations often tangentially address frustrations with society or become existential, which, because of the time we are living through, is inherently connected to any discussion of topical scientific information. Content is geared toward all ages and backgrounds, anyone who is scientifically curious. </p>",
        "language": "en",
        "author_name": "Julia Van Etten",
        "slug": "couchmicroscopy",
        "cover": "20221022_121007_d0a2e054b491323f02a8193f01c2d099.jpg"
    },
    {
        "podcast_id": 162876,
        "title": "Talking Owls 86",
        "description": "Talking owls 86 is a nonprofit open group of high school teachers and students who talk about different topics to practice the speaking skill and have fun while learning.",
        "language": "en",
        "author_name": "Ricardo Quinteros & Cynthia Alvidrez",
        "slug": "talkingowls86",
        "cover": "20221024_101044_2c1e7eadc3868c64db9ca086970cad14.jpg"
    },
    {
        "podcast_id": 167721,
        "title": "Building a Science of Consciousness",
        "description": "The Qualia Research Institute (QRI.org) is a California 501(c)(3) non-profit research group studying consciousness in a consistent, meaningful, and rigorous way. Our goal is to spread the ideas of our institute in a more accessible way and to support the research being done by our members.",
        "language": "en",
        "author_name": "Qualia Research Institute",
        "slug": "qri",
        "cover": "20221113_101139_c986d187c7b77fa27e926d6beb66f644.jpg"
    },
    {
        "podcast_id": 167965,
        "title": "The Science Lab",
        "description": "The Science Lab was created in 2022 in order to give students open access to science learning made by students. All episodes are properly sourced with the references in the show notes and have been created in the spirit of sharing well researched knowledge beyond just the scientific community.\n\nAll opinions expressed are those of Helen Werner or the student authors and do not necessarily reflect the views of Beloit College. ",
        "language": "en",
        "author_name": "Helen Werner",
        "slug": "thesciencelabpod",
        "cover": "20221114_081112_90c32affa5737ae5357b916568c4e200.jpg"
    },
    {
        "podcast_id": 168572,
        "title": "[Biota]LKS Podcast",
        "description": "Candid conservation conversations. ",
        "language": "en",
        "author_name": "Shelby Herbert",
        "slug": "biotalkspod",
        "cover": "20221117_041151_4d19febd7cec0973cad43fe123f4b94b.jpg"
    },
    {
        "podcast_id": 169157,
        "title": "Plant Pals",
        "description": "The people behind the plants! A casual exploration of how people find their way into the outside world, field stories, and the species that blow their minds.",
        "language": "en",
        "author_name": "Michael Heine",
        "slug": "plantpals",
        "cover": "20221126_021157_0b237e3208cc497af6bdba1760076372.jpg"
    },
    {
        "podcast_id": 169327,
        "title": "Dosis de #Cela/cons.ciencia",
        "description": "Dosis de #Cela/cons.ciencia es el podcast donde explicamos cómo la terapia de Nutrición y Medicina Ortomolecular es una alternativa viable para la prevención y control de enfermedades. Es una terapia que recupera los conceptos de la bioquimica y la medicina para explicar que las enfermedades son deficiencias nutricionales. En cada capitulo argumentamos que más que ciencia ficción es pura bioquimica. https://medicinaortomolecular.mx/",
        "language": "es-mx",
        "author_name": "CELANMOR ",
        "slug": "celanmormx",
        "cover": "20221120_061142_6bd5fef23fa7d298abee9deef3bd920e.jpg"
    },
    {
        "podcast_id": 170734,
        "title": "Escape The Loop",
        "description": "<p>Wir sind zwei Studenten, die über alles mögliche plaudern. Von Informatik, Über Philosophie bis Quantenphysik. Kommt mit uns auf eine Reise ins Unbekannte!</p>",
        "language": "de",
        "author_name": "Mert und Andi",
        "slug": "escpaetheloop",
        "cover": "20221127_121119_062da4cfb4fd3b8402c8854503b65732.jpg"
    },
    {
        "podcast_id": 174580,
        "title": "Wet",
        "description": "In each episode, Anya breaks down ongoing marine science research for everyday listening. Topics range from coral bleaching to the deep sea in this fresh take on pop-science podcasts.&nbsp;",
        "language": "en-US",
        "author_name": "Anya Stajner",
        "slug": "wet",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 175177,
        "title": "Freshwater Perspectives",
        "description": "Hosts Riley and Matt have a combined 20+ years experience working in and around freshwater. Their love of freshwater, eagerness to continue to learn, and passion to educate has brought them to sharing their discussions with the world. On a weekly basis, Matt and Riley will cover anything from the illegal caviar market, to using mussels to monitor water quality.",
        "language": "en",
        "author_name": "Riley Buley & Matt Gladfelter",
        "slug": "freshwaterperspectives",
        "cover": "20221219_121255_1b2294d415506f576f6c8dc0e1099add.jpg"
    },
    {
        "podcast_id": 175590,
        "title": "Herp Talk Radio",
        "description": "Welcome to Herp Talk Raido. A once a week podcast where we dive head first into the world of herpeticulture. From breeder interviews to conservationalist converstaions, we will be covering herpeticulture as a whole. Thanks for coming! We hope you enjoy!\n",
        "language": "en",
        "author_name": "Herp Talk Radio",
        "slug": "herptalkradio",
        "cover": "20230105_010113_c254cecfe8e9f47894f70c02087f8212.jpg"
    },
    {
        "podcast_id": 177290,
        "title": "luminati.be",
        "description": "Verhalen over oude en nieuwe complottheorieën, pseudowetenschap en desinformatie.\nPer maand één onderwerp, in één of meerdere episodes.",
        "language": "nl",
        "author_name": "Frank Verhoft",
        "slug": "luminati",
        "cover": "20221231_111224_12bca06293a64fdf8afa6b5682267a69.jpg"
    },
    {
        "podcast_id": 182131,
        "title": "Capital Roots: Stories from Agriculture's Footprint",
        "description": "A podcast brought to you by Capital Farm Credit, featuring stories about\nagriculture production, sustainability, lifestyle and Texas tall tales. We'll share unique stories about Texas agriculture and how the ag industry impacts lives every day.\n\nFor more than 100 years, Capital Farm Credit has supported rural communities and agriculture with reliable, consistent credit and financial services. Capital Farm Credit is a proud member of the Farm Credit System and serves more than 23,000 members, with loans outstanding totaling more than $11 billion. Headquartered in Bryan, Texas, Capital Farm Credit has offices serving 192 of Texas’ 254 counties. Learn more at CapitalFarmCredit.com.",
        "language": "en",
        "author_name": "Capital Farm Credit",
        "slug": "capitalroots",
        "cover": "20230120_030108_777c42faa5893bd11d0117805896eb3e.jpg"
    },
    {
        "podcast_id": 183551,
        "title": "Fermentation and Health Speaker Series",
        "description": "The Center for Human Microbiome Studies at Stanford University School of Medicine presents Fermentation and Health Speaker Series, led by Elisa Caffrey, David Zilber, and Dr. Justin Sonnenburg. The goal of this series is to create space to have nuanced conversations around the current understanding and knowledge gaps of fermented food research, and act as a platform to define and promote future fermented food and health projects.\n",
        "language": "en",
        "author_name": "Elisa Caffrey, David Zilber, and Justin Sonnenburg",
        "slug": "fermentationandhealthstanford",
        "cover": "20230125_050109_2e61239f18c0f840d257508209b33171.jpg"
    },
    {
        "podcast_id": 184571,
        "title": " Pigeon House",
        "description": "Shalom!\n\nЯ Игорь, музыкант, программист (а теперь и подкастер) из Минска. В своём подкасте я общаюсь с друзьями и знакомыми о музыке, науке, искусстве, политике и наших проектах . Иногда мы шутим, иногда пьём алкоголь и почти никогда не пишем сценарий.\n\nWhat you hear is what you get.",
        "language": "ru",
        "author_name": "Igor Golubenkov",
        "slug": "pigeonhouse",
        "cover": "20230129_020140_61aeddc552e4a46135af3c19169e5b1a.jpg"
    },
    {
        "podcast_id": 185215,
        "title": "Efficiency Optimized: Unlocking the Full Potential of Multiple Impacts",
        "description": "Welcome to Efficiency Optimized: Unlocking the Full Potential of Multiple Impacts, the podcast that seeks to create a narrative surrounding the Multiple Impacts of energy efficiency, and connect the dots between the theoretical applicability and the real life applications of Multiple Impacts through tri-weekly discussions and debates with European energy experts. This podcast is hosted by the H2020-funded MICAT project, which aims to estimate the Multiple Impacts of Energy Efficiency via a free, easy-to-use online tool, called the MICATool.\n\nFollow and interact with us @MICAT_EU!",
        "language": "en",
        "author_name": "the MICAT Project",
        "slug": "multipleimpacts",
        "cover": "20230131_120148_f5f358151e9882b666e81812177ace92.jpg"
    },
    {
        "podcast_id": 187908,
        "title": "Saving Green Podcast",
        "description": "<p>A news and politics podcast that covers current events in natural resources, and the solutions that can improve the problems we face</p>",
        "language": "en",
        "author_name": "John Glover",
        "slug": "savingreenpod",
        "cover": "20230518_050539_1acd8784f3fef1424e388cbd72c8fffd.jpg"
    },
    {
        "podcast_id": 189335,
        "title": "Podcast ",
        "description": "<p>En este Podcast se explorar las implicaciones éticas y sociales de estas teorías, como por ejemplo si es posible responsabilizar moralmente a alguien por sus acciones si estas están totalmente determinadas por factores ajenos a su voluntad y debatidas de la filosofía.</p>",
        "language": "es-mx",
        "author_name": "Jeshua",
        "slug": "7-mentes-una-idea-diferente",
        "cover": "20230214_020203_e84215e1425835d4cf725ced3d713f85.jpg"
    },
    {
        "podcast_id": 189372,
        "title": "Hormonal ",
        "description": "Since the dawn of time, the hormones in your body have been like an intricate, complex friend group fighting to protect you. There are the impulsive ones, the happy ones, the always-hungry ones, and the ones that make you feel all the love. They've got personalities just like us—ones that we haven't taken the time to understand enough. Join Zarah Khondoker as she questions the chemicals behind the madness—and everything it means to be human.",
        "language": "en",
        "author_name": "Zarah Khondoker ",
        "slug": "hormonal",
        "cover": "20230214_050243_4137eb568d4a471d358cc0c7b8285b73.jpg"
    },
    {
        "podcast_id": 191076,
        "title": "Ag-celerate: Podcast Series",
        "description": "<p>An industry-first Linkedin Live Podcast series, where we will host candid conversations on trending topics with industry stalwarts, influencers, subject matter experts, and government officials from the agriculture fraternity.</p><p>This series aims to establish a community at large to adopt digital in the industry and create a platform for the ag industry to share, learn and connect with like-minded people from the industry.</p><p>To watch the video podcast visit - <a href=\"https://www.cropin.com/ag-celerate/linkedin-live-podcast-series\">https://www.cropin.com/ag-celerate/linkedin-live-podcast-series</a></p>",
        "language": "en",
        "author_name": "Agcelerate with Cropin Podcast Series",
        "slug": "ag-celerate-podcast",
        "cover": "20230601_070602_ee194c8dc61f6f18382024e7cd099b28.jpg"
    },
    {
        "podcast_id": 191990,
        "title": "Ciencia, Género y Diversidad con Fran Bubani",
        "description": "<p>Un espacio para escuchar otras voces. Un espacio para hablar de lo que no se habla.</p><p>Esta es una propuesta de comunicación de la ciencia que visibiliza mujeres y diversidades. Hablamos sobre quiénes somos, nuestras trayectorias profesionales, nuestro trabajo diario, la investigación científica y la universidad. Pero también hablamos de lo que no se habla: los obstáculos adicionales que tuvimos que superar por ser mujeres y disidencias, el machismo, la discriminación, la violencia de género y las personas que terminaron excluidas del sistema.</p><p>#cienciaygenero #cientificas #ciencia #genero #diversidad #stem #trans</p><p><a href=\"https://linktr.ee/franbubani\">https://linktr.ee/franbubani</a></p>",
        "language": "es",
        "author_name": "Fran Bubani",
        "slug": "franbubani",
        "cover": "20230308_040319_2747e9a57e04df1e36902cd1e556183c.jpg"
    },
    {
        "podcast_id": 196077,
        "title": "Ageless Science",
        "description": "<p>Ageless Science is the companion podcast to the nonprofit organization, hosted by founder Ellie Tillman-Schwartz. We discuss scientific topics to allow people of all ages develop greater understanding of changes in the world around them. Our episodes include both interviews with guest speakers and reviews of topics covered at our discussion events.</p>",
        "language": "en",
        "author_name": "Ellie Tillman-Schwartz",
        "slug": "agelessscience",
        "cover": "20230810_030818_469f497db61308efa2f098506534cdd5.jpg"
    },
    {
        "podcast_id": 197634,
        "title": "Vísindaknokkar",
        "description": "<p>Hetta poddvarpið, er sprottið úr einari blanding av forvitni, og eldhuga fyri at læra og miðla vitan.</p><p>Endamálið er at lýsa gransking í Føroyum, umframt at lýsa ymisku møguleikarnar fyri at nema sær náttúruvísindarliga útbúgving og starv, bæði heima og í útlegd.</p><p>Hetta verður gjørt, við at bjóða granskarum ein pall har tey kunnu miðla tí gransking sum fer fram í løtuni, umframt áhugaverda og týdningarmikla gransking sum longu er framd.</p><p>Ynski okkara er at verða ein miðil, ið ger tað lættari fyri ein og hvønn FORVITNISKNOKK, at fáa atgongd til náttúruvísindaliga vitan, sum hevur serligan týdning fyri Føroyar og okkum føroyingar.</p><p>Finn okkum á Facebook og Instagram.</p><p>Allir tónarnir, sum vit hava brúkt í okkara poddvarpi eru frá: Flawed Mangoes</p><p>All soundtracks in this podcast are the courtesy of: Flawed Mangoes</p>",
        "language": "da",
        "author_name": "Vísindaknokkar",
        "slug": "visindaknokkar",
        "cover": "20230318_050343_81739cb7d171b0453bcd8c0817d08cec.jpg"
    },
    {
        "podcast_id": 199297,
        "title": "Branching Out",
        "description": "<p>Welcome to Branching Out, the podcast that delivers interesting facts and tidbits about WashU's trees right to your ears. Hosts Faith, Ivy, and Cameryn discuss well-known and more niche trees around the campus, diving into their rich histories and unique quirks that make these trees so special. The hope is that you get to know some of our green neighbors, one tree at a time. Written and Produced by Ivy Moore, Cameryn Berryhill, and Faith Liang. Show art by Ivy Moore.</p><p><a href=\"https://instagram.com/branchingout_podcast?igshid=YmMyMTA2M2Y=\">https://instagram.com/branchingout_podcast?igshid=YmMyMTA2M2Y=</a></p>",
        "language": "en",
        "author_name": "Ivy Moore, Faith Liang, Cameryn Berryhill",
        "slug": "branchingoutpodcast",
        "cover": "20230325_050353_1d576240718408313f4cef73ea13785a.jpg"
    },
    {
        "podcast_id": 201968,
        "title": "Conversations with the Future | Spacetime Archives",
        "description": "<p>We might be attributed to our affinities for space, hence the name \"Spacetime Archives,\" but our passions stretch beyond just that continuum and dip into the invigorating research developing in the world around us. Hear the vibrant, controversial, and unvoiced thoughts of youth researchers and writers as we establish our roles in blossoming scientific fields. Have a conversation with us—we're the future, after all!</p>",
        "language": "en",
        "author_name": "Rishika Porandla",
        "slug": "spacetimearchives",
        "cover": "20230407_110443_959022a5871156e8b763cc59800480c0.jpg"
    },
    {
        "podcast_id": 206429,
        "title": "Bear in Mind",
        "description": "<p>Welcome to Bear in Mind! Join zoo educators Lisa and Emily and a variety of guests as they talk about all things bear and dive deeper into the conservation, well-being, and education efforts of the Bear TAG (Taxon Advisory Group).</p>",
        "language": "en",
        "author_name": "Emily Bisordi",
        "slug": "bear-in-mind",
        "cover": "20230430_010402_effe07bc6ef21fc48725fdc9cdba85d3.jpg"
    },
    {
        "podcast_id": 206717,
        "title": "The Mutation Station",
        "description": "<p>\"The Mutation Station\" is a gripping 10-episode podcast that delves deep into the fascinating world of genetic mutations. Hosted by a mutant, each episode explores a different mutation, from the well-known like Heterochromia Iridium to the more obscure like chimerism and diastema.</p><p>Listeners will be taken on an enlightening journey through the intricacies of each mutation, learning about the genetic causes and how they manifest in the human body. But \"The Mutation Station\" doesn't just stop there. Each episode will also dive into the historical and cultural significance of these mutations, exploring how they've been perceived and treated throughout history.</p><p>Listeners with an interest in Heterochromia Iridium will be particularly captivated by this podcast. They'll learn about the genetics behind this fascinating condition that results in one eye being a different colour from the other, and how it's been viewed in different cultures around the world.</p><p>But even those without a specific interest in Heterochromia Iridium will find something to enjoy in \"The Mutation Station.\" The podcast provides a rare opportunity to learn about the unique mutations that make us all different, and to appreciate the diversity of the human experience.</p><p>Overall, \"The Mutation Station\" is an engrossing podcast that is sure to appeal to anyone with a curious mind and an interest in the incredible diversity of human genetics.</p>",
        "language": "en",
        "author_name": "Mish Cavanagh-Downs",
        "slug": "themutationstation",
        "cover": "20230502_040537_d0793fa389b9776a7937ef26cdbf4a17.jpg"
    },
    {
        "podcast_id": 212583,
        "title": "Arkansas Weather Watchers Podcast",
        "description": "<p>Cameron and Derek have been running Arkansas Weather Watchers since 2014. AWW is an organization that covers local Arkansas weather, as well as chases through the heartland severe weather storms.</p><p>Our podcast will cover both current weather topics as well as past weather events that impacted the lives of many throughout the heartland.</p>",
        "language": "en",
        "author_name": "Arkansas Weather Watchers",
        "slug": "awwpodcast",
        "cover": "20230610_020658_019476ddf161d26aef0aef69821dcced.jpg"
    },
    {
        "podcast_id": 212725,
        "title": "Elements",
        "description": "<p>Join the Particle team as we explore how the four natural elements shape the people of Western Australia and their physical environment.</p><p>Find out more about all the weird and wonderful science happening in Western Australia via <a href=\"https://particle.scitech.org.au/\">www.particle.scitech.org.au</a></p>",
        "language": "en",
        "author_name": "Particle WA",
        "slug": "elements",
        "cover": "podcast_cover.png"
    },
    {
        "podcast_id": 214926,
        "title": "Mammals R Us",
        "description": "<p>Part science, part cultural history,  part travelogue, and part bad jokes, our podcast gives a 360° perspective on some of our most charismatic wild mammals.  </p><p>Fiona Mathews and Tim Kendall are the first married couple ever to make a podcast together. Fiona is Chair of Mammal Conservation Europe and Professor at the University of Sussex, and Tim is Professor of English Literature at the University of Exeter. They are the authors of <em>Black Ops and Beaver Bombing; Adventures with Britain's Wild Mammals</em> ('The book I'll be recommending for the rest of the year', <em>BBC Countryfile Magazine</em>;  'Surprisingly interesting', our daughter's friend's boyfriend).                        </p><p>All episodes available at <a href=\"http://Britishmammals.com\">Britishmammals.com</a>, </p><p>Hosted on <a href=\"http://rss.com\">rss.com</a>. See <a href=\"http://rss.com/privacy\">rss.com/privacy</a> for more information.</p><p>℗ &amp; © 2023. Mammals R Us. </p><p>                                                                                            </p>",
        "language": "en",
        "author_name": "Fiona Mathews & Tim Kendall",
        "slug": "mammalsrus",
        "cover": "20230613_120605_6fd57c5fdc8fdc369959e632f15f9008.jpg"
    },
    {
        "podcast_id": 216252,
        "title": "Conspiracy soldiers ",
        "description": "<p>Conspiracies, government overreach and fake news</p>",
        "language": "en",
        "author_name": "Fox",
        "slug": "conspiracysoldiers",
        "cover": "20230624_040656_6e1788a043c4441887f9a88dba324cf0.jpg"
    },
    {
        "podcast_id": 217261,
        "title": "Imunização e vacinas: importância, fake news e perspectivas",
        "description": "<p>Podcast criado por alunas de biomedicina da Católica de Santa Catarina com participação especial de uma convidada.</p>",
        "language": "pt-pt",
        "author_name": "Ana Beatriz Capellari, Bianca Lourenço, Bianca Santos, Laura de Vicente Schmidt e Maria Augusta Grubba Selhorst",
        "slug": "vacinas",
        "cover": "20230629_010631_ed66d76b44f1dccd62cc857071daeb80.jpg"
    },
    {
        "podcast_id": 217745,
        "title": "The Eco Trails",
        "description": "<p>A Journey Through Earths Ecological Wonders</p>",
        "language": "en",
        "author_name": "Ryan Nicolas Lotz",
        "slug": "theecotrails",
        "cover": "20230703_010758_e333ee0442d9fd9a341c68db5bbdd47b.jpg"
    },
    {
        "podcast_id": 217773,
        "title": "Journey Through Time",
        "description": "<p>Hosted by Dave Gammon</p><p>Produced by Tyler Lopez</p><p>Recorded at WSOE Podcast Studio, Elon University</p><p>Theme music by Tyler Lopez</p>",
        "language": "en",
        "author_name": "Dave Gammon",
        "slug": "journeythroughtime",
        "cover": "20230703_020733_8bf320d3eae53a8ca1ff8a89ad0bd483.jpg"
    },
    {
        "podcast_id": 217798,
        "title": "From Glitter to Grit : The Unicorn's True Form",
        "description": "<p>In the captivating podcast, we journey into the realm of mythical beasts and their surprising connections to creatures that roam our world today. Each episode weaves ancient lore with modern biology, revealing fascinating parallels between legendary creatures and real-life animals. From dragons echoing the might of the Komodo Dragon, to the majestic Unicorn's semblance to the Rhinoceros, \"From Glitter to Grit\" uncovers the roots of our mythical creatures in the natural world. It's a thrilling exploration of the intersection between mythology and nature, where fantastical beasts meet earthly reality. Prepare to see our world's wildlife in a whole new light.</p>",
        "language": "en",
        "author_name": "Mish Cavanagh-Downs",
        "slug": "fromglittertogrit",
        "cover": "20230703_080720_b1c45ce2134862974d7fc5e26e13c336.jpg"
    },
    {
        "podcast_id": 218090,
        "title": "the Dog Scholar",
        "description": "<p>A dog-obsessed science show hosted by two expert dog-trainers and a neuroscientist, the dog scholar uses the latest cutting-edge research from neuroscience, psychology, and other life sciences to bust common myths about dogs and their relationship with people. Each episode tackles one common question we have about our canine companions, Dr Sab breaks down a related recent scientific study, and Jamie and Danny discuss how those findings apply to your dogs with practical take-home tips.</p><p><strong>🐕 MEET THE HOSTS 🐕</strong></p><p>Dr Sabrina Cohen-Hatton 🧠</p><p>⬩Role: The neuroscientist</p><p>⬩Dogs: Luther, Red and Jimmy Chew (Xolo's / Mexican hairless)</p><p>A dog-obsessed neuroscientist researching human and animal learning mechanisms. She has won international acclaim for her prize-winning research, which she has presented all over the world and used to change deeply ingrained national policy. Dogs are an important part of Dr Sab’s life, since adopting a stray dog during her period of homelessness which provided the only social and emotional connection during that time. A strong advocate for social mobility, she is an ambassador for Street Vet, a charity that provides outreach veterinary care to dogs belonging to people experiencing homelessness.</p><p>Danny Wells 📢</p><p>⬩Role: The trainer</p><p>⬩Dogs: Wade &amp; Logan (Malinois), Flint (Labrador), Ralph (Bull breed), Lenny (Parson Jack Russell)</p><p>A well respected and multi-dimensional dog trainer, Danny specialises in the rehabilitation of dogs that other trainers have deemed a lost cause and untrainable. He has saved countless dogs lives, working with both dog and owner to create a harmonious relationship and a greater bond. Danny and his dog have won titles in both Protection Dog Trials and Gun Dog Trials. Danny works closely with a dog rescue charity that promises not to put healthy dogs down, and successfully rehabilitates dogs with severe behavioural issues so they can go on to live their best lives.</p><p></p><p>Jamie Penrith 📃</p><p>⬩Role: The expert</p><p>⬩Dogs: Bonnie, Drake, Pumpkin, Truman, Tinkerbell (Labradors) and Sherlock (Labrador x English pointer)</p><p>A leading expert in canine predatory behaviour, Jamie divides his time between the provision of established, highly regarded and sought-after dog training and behaviour services, and actively campaigning on behalf of dog welfare and responsible dog ownership. As a former police dog handler, Jamie knows exactly what it means to train dogs for real life situations.</p><p></p><p><strong>🐕 CREDITS 🐕</strong></p><p>Produced by Will Carne</p><p>Created by Dr Sabrina Cohen-Hatton, Danny Wells and Jamie Penrith</p><p>Filmed on location at WillCarne Studio 1 in London. Set, graphic, lighting and sound design by WilCa Studios. With thanks to George Jennings, Stephanie Donowho, Jake Edwards and Matthew Crossey. Copyright WillCarne Originals 2023.</p>",
        "language": "en",
        "author_name": "Dr Sabrina Cohen-Hatton, Jamie Penrith and Danny Wells",
        "slug": "dogscholar",
        "cover": "20230716_080752_e5e8d5376618b5992cad8f9ba751b0d0.jpg"
    },
    {
        "podcast_id": 218563,
        "title": "Coastal Catch Ups",
        "description": "<p>A podcast exploring the marine and coastal environments.</p>",
        "language": "en",
        "author_name": "Sam Purdon",
        "slug": "coastalcatchups",
        "cover": "20230718_080732_b29b2ab1726198848a045bb36962a1ab.jpg"
    },
    {
        "podcast_id": 218851,
        "title": "Mente Abisal",
        "description": "<p>Un podcast donde sobre pensamos todo pero aprendemos en el proceso.</p><p>Siganme en IG:  ivonne.b.rr97  para ver fotos de lo que les cuento </p>",
        "language": "es",
        "author_name": "Ivonne Rodriguez Ramirez",
        "slug": "menteabisal",
        "cover": "20230710_090757_2db7ffc27f9476be7db48d5064b083da.jpg"
    },
    {
        "podcast_id": 220361,
        "title": "Trees and the environment",
        "description": "<p>Trees have a huge impact on the environment. They help regulate the air, reduce pollution, provide oxygen, prevent floods and droughts, conserve biodiversity, and improve people's quality of life.</p><p>Air conditioner</p><p>Trees help regulate the air by absorbing carbon dioxide and releasing oxygen. Carbon dioxide is a greenhouse gas that causes the greenhouse effect, which contributes to climate change. Oxygen is an essential gas for the life of humans and other animals.</p><p>Reduce pollution</p><p>Trees also help reduce air pollution by filtering dust and other pollutants. Dust and pollutants can cause health problems like asthma, bronchitis and lung cancer.</p><p>Oxygen supply</p><p>Trees provide oxygen for humans and other animals. Oxygen is a gas necessary for life. One tree can provide oxygen for about 10 people in a day.</p><p>Preventing floods and droughts</p><p>Trees help prevent floods and droughts by holding water in the soil. When it rains, plants absorb water from the soil and use it to grow. This helps to reduce the amount of water that flows into rivers, lakes and seas, thereby preventing flooding. When it's dry, trees release water into the atmosphere, thereby helping to reduce drought.</p><p>Conservation of biodiversity</p><p>Trees are home to many animals, including birds, insects, small animals and mammals. Trees help conserve biodiversity by providing food, shelter and breeding grounds for animals.</p><p>Improve people's quality of life</p><p>Trees help improve people's quality of life by reducing stress, enhancing concentration and improving mood. Trees also help reduce noise and create a green and beautiful living environment.</p><p>In short, trees have a huge impact on the environment. They help regulate the air, reduce pollution, provide oxygen, prevent floods and droughts, conserve biodiversity, and improve people's quality of life. We need to plant and protect trees to protect the environment and improve our quality of life.</p>",
        "language": "en",
        "author_name": "Alkeyrou Issoufou",
        "slug": "alkeyrouissoufou",
        "cover": "20230720_080724_116b5d928b9ce5f386438b6ad218d23c.jpg"
    },
    {
        "podcast_id": 220541,
        "title": "The Paraqua Podcast",
        "description": "<p>The ParAqua Podcast is a science podcast that shines a light on the newest and most interesting research being conducted in the fields of aquatic and marine ecology. In this exciting new podcast we interview scientists from all around the world and learn more about their work in the fields of aquatic and marine ecology and how their research is shaping the world we live in.</p><p>The ParAqua podcast was funded by COST, the European Cooperation in Science and Technology and is a product of the ParAqua Action. If you are interested in joining the Action or just want to know more please go to www.paraqua- <a href=\"http://cost.eu\">cost.eu</a> </p><p>The podcast is produced by Joe Money and Serena Rasconi and the Science Communication Coordinator is Ana Gavrilović. If you have any questions or want to get in touch to discuss your research in aquatic or marine ecology please email <a href=\"mailto:joe.money@amu.edu.pl\">joe.money@amu.edu.pl</a></p>",
        "language": "en",
        "author_name": "Paraqua",
        "slug": "the-paraqua-podcast",
        "cover": "20230721_100755_37c6b7a8e0a949b9b1314e8584db814d.jpg"
    },
    {
        "podcast_id": 221425,
        "title": "BIOSA",
        "description": "<p>El objetivo del programa \"<strong>Biomanejo Integral Orgánico Sustentable para la Agricultura</strong>\" es brindar información y orientación completa a los agricultores y profesionales del sector agrícola sobre las mejores prácticas, técnicas y tecnologías relacionadas con el manejo integral orgánico y sostenible en la agricultura. El programa se enfoca en promover el uso responsable y eficiente de recursos naturales, fomentando prácticas agrícolas respetuosas con el medio ambiente y que generen beneficios económicos, sociales y ambientales a largo plazo. A través de entrevistas con expertos, testimonios de agricultores exitosos y la presentación de casos de estudio, el programa busca empoderar a la audiencia para adoptar en sus cultivos métodos sustentables, reducir el impacto negativo en el ecosistema y contribuir a la seguridad alimentaria global. Además, el \"Biomanejo Integral Orgánico Sustentable para la Agricultura\" busca crear conciencia sobre la importancia de la agricultura orgánica y sostenible, así como motivar a los agricultores a adoptar prácticas que protejan y regeneren los recursos naturales para las futuras generaciones. Con enfoque en la innovación y la ciencia, el programa también explorará las últimas investigaciones y desarrollos en el campo de la agricultura sostenible y compartirá conocimientos prácticos para lograr una producción agrícola eficiente y responsable en armonía con el entorno natural.</p>",
        "language": "es-mx",
        "author_name": "Ing. Juan José Hernández Segura",
        "slug": "biosa",
        "cover": "20230727_070727_8781695ad97a70b8c6ed274a06000018.jpg"
    },
    {
        "podcast_id": 222074,
        "title": "Palaeo Report ",
        "description": "<p>I talk about the month's Palaeontology news.</p>",
        "language": "en",
        "author_name": "Chameleons ",
        "slug": "palaeoreport",
        "cover": "20230801_080823_de02fc9351801b14f36eb1de19b068f1.jpg"
    },
    {
        "podcast_id": 222313,
        "title": "Logan Black Twitter Space",
        "description": "<p><strong><em>All things paranormal.</em></strong></p>",
        "language": "en",
        "author_name": "loganblack",
        "slug": "loganblack",
        "cover": "20230812_070824_3ef5475156b56dd01bd841a9ba1ce585.jpg"
    },
    {
        "podcast_id": 226142,
        "title": "CONCIENCIA AMBIENTAL",
        "description": "<p>con base a una cartilla educativa de educación ambiental de Ecoembes España, cree este podcast con el fin de generar conciencia sobre la importancia de cambiar nuestros hábitos de consumo y reciclaje, como actividad de lo análogo a lo digital de la asignatura de Comunicación digital sonora de la Fundación universitaria Católica del Norte. Bienvenidos.</p>",
        "language": "es",
        "author_name": "Alejandro Colorado Villada",
        "slug": "educacionambiental",
        "cover": "20230828_120844_f5a60dea28286e0c8304c0f5c4f61ff0.jpg"
    },
    {
        "podcast_id": 226423,
        "title": "Spectrum of Science",
        "description": "<p>Engage with leading academic minds in \"Spectrum of Science,\" a podcast that delves into the transformative arenas of science and education. Discover the personal journeys of trailblazing scholars, explore bold critiques of current educational paradigms, and grapple with the fundamental questions shaping our world. Designed for aspiring academics, educators, policy-makers, and intellectually curious listeners, this podcast aims to spark innovation and inspire the next generation of thinkers. Currently hosted by T. Gökalp Elaçmaz, new episodes released regularly. The podcast belongs to the student club called Scientific Communication Society. For your questions, please reach, bilkentbit@gmail.com</p>",
        "language": "en",
        "author_name": "T. Gökalp Elaçmaz",
        "slug": "spectrum-of-science",
        "cover": "20230829_060825_3eb6bff10c02f1bc02b9f7cc92318ffc.jpg"
    },
    {
        "podcast_id": 228179,
        "title": "Nebraska ON TAP",
        "description": "<p>We created a podcast to be educational and informational. Covering groundwater management in the state of Nebraska and our own Republican River Basin. If you are an Ag producer, Rancher or citizen of Nebraska this show was made for you. Tune in Weekly.</p>",
        "language": "en",
        "author_name": "Heather Dizmang",
        "slug": "nebraskaontap",
        "cover": "20230911_010936_e21ad0a9c3d07ad79742edfe93de2b0c.jpg"
    }
]