[
    {
        "podcast_id": 462,
        "title": "Find Your Fortitude",
        "description": "A positive and inspirational podcast to help you find your fortitude",
        "language": "en",
        "author_name": "Mark Jansen",
        "slug": "findyourfortitude",
        "cover": "5c4cfbdca6a85.jpg"
    },
    {
        "podcast_id": 1681,
        "title": "Perfected Health",
        "description": "Explore how to optimize your health through diet, sun, exercise, and water",
        "language": "en",
        "author_name": "frank tufano",
        "slug": "perfectedhealth",
        "cover": "5cfbf6ea8bfa8.jpg"
    },
    {
        "podcast_id": 3080,
        "title": "Gut Health Reset with Dr. Ann-Marie Barter",
        "description": "This podcast dives deep into the root causes behind issues that start in the gut like bloating, gas, and constipation. Each week, Dr. Ann-Marie Barter and guests will give you the knowledge you need to heal your gut and reset your health! \n\nDr. Ann-Marie Barter is a Functional Medicine and Chiropractic Doctor at Alternative Family Medicine & Chiropractic. She is the clinic founder of Alternative Family Medicine & Chiropractic that has two offices one in Longmont and Denver. They treat an array of health conditions overlooked or under-treated by conventional medicine, called the \"grey zone\". https://altfammed.com http://drannmariebarter.com/",
        "language": "en",
        "author_name": "Dr. Ann-Marie Barter",
        "slug": "fearlesshealthpodcast",
        "cover": "20210506_020633_a52d5d7de2eb42129ec21b95992c6c10.jpg"
    },
    {
        "podcast_id": 4965,
        "title": "The Stayhealthy Experience with Robert Ferguson",
        "description": "The Stayhealthy Experience takes an innovative approach to healthy living and living your healthiest life!\n \nHosted by Robert Ferguson, Stayhealthy’s Health Ambassador and America’s Fat Loss Coach, and co-hosted by nutrition and weight loss coach Barbara Kris, the podcast lets audiences experience up-close, personal and solution-based conversations about all aspects of healthy living.\n \nThe Stayhealthy Experience will feature health professionals and experts in the health field along with celebrities, athletes, authors as well as ordinary people who have overcome extraordinary, health-related challenges.",
        "language": "en",
        "author_name": "Stayhealthy, Inc.",
        "slug": "thestayhealthyexperience",
        "cover": "5de92cfea7e77.jpg"
    },
    {
        "podcast_id": 5375,
        "title": "Autoimmune Health: How to Feel, Look & Live Better",
        "description": "A podcast for smart and passionate women with chronic, autoimmune conditions. Being diagnosed with an autoimmune disorder is life-altering and requires a major shift in lifestyle and behavior. In this podcast, you'll discover a holistic approach to healing and explore methods for showing kindness to yourself, reducing stress, and using food as medicine. ",
        "language": "en",
        "author_name": "Emily Brown",
        "slug": "autoimmunehealth",
        "cover": "5e0d3cf2889eb.jpg"
    },
    {
        "podcast_id": 6745,
        "title": "Happy Habits",
        "description": "Yoga experte Nina De Man ontfutselt de geheimen van vier inspirerende vrouwen met ieder hun eigen visie op holistic well-being. Welkom bij inspirerende gesprekken over gelukmakende gewoontes. Zelf ook zin om met je eigen « happy habits » aan de slag te gaan? Surf naar Activia.be en ontdek hoe jij in 21 dagen tijd je beste zelf wordt.\n--\nL'experte en yoga Nina De Man dévoile les secrets de quatre femmes inspirantes, chacune avec sa propre vision du bien-être holistique et les habitudes qui alimentent leur bonheur au quotidien.\nEnvie de mettre en place vos propres « happy habits » ? Surfez sur Activia.be et découvrez nos trucs et astuces pour y arriver en seulement 21 jours.",
        "language": "nl",
        "author_name": "Activia",
        "slug": "happyhabits",
        "cover": "20200313_172400_ffe405c65cf9501ab118bb04e259e207.jpeg"
    },
    {
        "podcast_id": 7320,
        "title": "Made For Me Fitness",
        "description": "<p>Liz King has been a certified personal trainer for 10 years and the creator of Made For Me Fitness. This podcast digs deeper into topics about fitness, nutrition and mental health to uncover why we do the things we do and how we can help change our behaviors to be successful in our fitness journeys.</p>",
        "language": "en",
        "author_name": "Liz King",
        "slug": "madeformefitness",
        "cover": "20230504_100533_e0cd52312ba4f6ef716ba5b1159591d8.jpg"
    },
    {
        "podcast_id": 7543,
        "title": "The Macular Health Podcast",
        "description": "Welcome to the MacuHealth podcast, a channel dedicated to providing up-to-date education on macular health, nutrition and advancing visual performance.",
        "language": "en",
        "author_name": "MacuHealth",
        "slug": "macuhealth",
        "cover": "20200408_182056_dcd2a60305ab51a5d29127c9a99cc6fd.jpeg"
    },
    {
        "podcast_id": 8657,
        "title": "The BrainGainz Podcast",
        "description": "BrainGainz Podcast is all about strength training, physiotherapy and more. Host coachcappuccino aka Carmen (strength coach, powerlifter and physiotherapy student) will make sure you'll mentally hypertrophy by listening to the talks and interviews with herself and other inspiring, knowledgable guests and experts.",
        "language": "en",
        "author_name": "coachcappuccino",
        "slug": "braingainz",
        "cover": "20200510_121851_662bc988fe233a008e346f9aae47aeee.jpeg"
    },
    {
        "podcast_id": 9620,
        "title": "Where Optimal Meets Practical",
        "description": "When it comes to nutrition and training...talking about what's optimal is always fun, but making it practical changes lives. On this show we'll dive deep on all things training, nutrition, and mindset optimization while making sure to drive home the practical and applicable side of things.",
        "language": "en",
        "author_name": "Jordan Lips",
        "slug": "whereoptimalmeetspractical",
        "cover": "20221201_061239_ddeba506bfa5bf43c3c4b74e5a1b7f10.jpg"
    },
    {
        "podcast_id": 12595,
        "title": "Brainiac Bodybuilding",
        "description": "Welcome to Brainiac Bodybuilding! Tyler Bedson and Kyle Winters, two up and coming brainiac studs in the bodybuilding world, talk all things bodybuilding and fitness. Q&As, guests, brainiac segments...Right now we’re weekly, dropping every Monday. ",
        "language": "en",
        "author_name": "Kyle Winters and Tyler Bedson",
        "slug": "brainiacbodybuilding",
        "cover": "20200921_004902_4a88ec4861a00e49afa39d14418ec677.jpg"
    },
    {
        "podcast_id": 13093,
        "title": "Fitness Education By Ian Findlay PFT",
        "description": "Breaking down and explaining in Lehmann's terms everything you need to know to work towards your goals. Leave feeling more confident, knowledgeable and with direction towards your goal.",
        "language": "en",
        "author_name": "Ian Findlay PFT",
        "slug": "pftianfindlay",
        "cover": "20201005_080300_56e0b9b471263c54bfb06f373d93e39d.jpg"
    },
    {
        "podcast_id": 13218,
        "title": "The Paul Norton Podcast",
        "description": "The Paul Norton podcast aims to talk about fitness in a different way. Discussing topics such as mental health, sleep, stress, confidence, motivation, sex life and everything we don't consider when it comes to fitness. ",
        "language": "en",
        "author_name": "Paul Norton",
        "slug": "dccdcdccx",
        "cover": "20201016_044558_e50eaf40de7d3726b710a4de6b8093df.jpg"
    },
    {
        "podcast_id": 13388,
        "title": "SPORTIVÉaf.",
        "description": "<p>Welcome to SPORTIVÉaf the podcast that takes you behind the scenes of the world of ballet. Join us as Audrey Freeman sits down with current and past ballet stars to hear their untold stories, secrets, and advice.</p><p>From their earliest days at the barre to the heights of their careers, we'll hear from some of the most accomplished dancers in the world about the triumphs and struggles that have shaped their lives. We'll explore the physical and mental demands of this art form, and the sacrifices that dancers make in order to pursue their passion.</p><p>Join us every week for fascinating interviews with dancers, choreographers, and other ballet professionals, as we dive deep into the world of ballet and reveal the secrets behind the tutu. Whether you're a lifelong fan of dance or a newcomer to the art form, SPORTIVÉaf has something for everyone.</p>",
        "language": "en",
        "author_name": "Audrey Freeman",
        "slug": "sportiveaf",
        "cover": "20230327_050314_b3a10f0758da62fd34d799d425867ccb.jpg"
    },
    {
        "podcast_id": 14141,
        "title": "Dailyish Fit Tips",
        "description": "Hey queens (and kings). I'm here to hype you up. Wanna get lean? I got you. Wanna bulk up? I got you. Just getting into the wellness space? I'm 100% your b*tch. Follow me for a nice change of pace from your average fitness influencer. I'm here with facts, not fads. I'm here for sustainable, forget short-term. Whatever you want to do with it, this is YOUR time.",
        "language": "en",
        "author_name": "Molly Falkenstein ",
        "slug": "primalzoneathletics",
        "cover": "20210224_014115_4cf8230b6d6b5116fbcc747f27b324ae.jpg"
    },
    {
        "podcast_id": 14687,
        "title": "Your Health Matters",
        "description": "Join us as we discuss with our amazing doctors the latest news in the medical field as well as our services and how it can affect you and your family.\nWe are your Private option for Health Care in the center of Marlow, and our cutting edge treatments and compassionate care for you is what sets us apart. ",
        "language": "en",
        "author_name": "My Specialist GP",
        "slug": "myspecialistgp",
        "cover": "20201117_170221_be895c811749319d3c903eab626bb793.jpg"
    },
    {
        "podcast_id": 15764,
        "title": "Fit on the move podcast",
        "description": "Hallo, en welkom! Wij zijn Hannes Tollet en Gust Alaerts, oprichters van Fit On The Move en wij nodigen mensen uit de sportwereld bij ons uit. Wij praten met hun over de ervaringen die ze hebben met sport, wat hun trainingsgewoontes zijn, hun voedingspatroon ,... Luister naar onze podcast en leer de wondere wereld van topsport en het team erachter kennen.\n",
        "language": "en",
        "author_name": "Fitonthemove",
        "slug": "fitonthemove",
        "cover": "20201128_144131_5e0d399ea1ef0be291de9cf8788ba025.jpg"
    },
    {
        "podcast_id": 19132,
        "title": "BA Fitness Podcast ",
        "description": "Good day to everybody who has bothered to listen to me talk about... I am a Gym Owner and Online Trainer & I love to chat s**t about everything Fitness & Nutrition and what it can do for you in life, business mental & physical health.. So I created this podcast.. These are all my professional views on the fitness industry & how I believe things should or shouldn't be done.",
        "language": "en",
        "author_name": "Introduction to the 'BA Fitness Online Academy'",
        "slug": "notsospecialpt",
        "cover": "20210204_113108_dc085940fac2c1dd9a261fd6bc940667.jpg"
    },
    {
        "podcast_id": 19145,
        "title": "Precision Opinions Live",
        "description": "Welcome to Precision Opinions Live! A podcast and videocast, hosted by Christian Stella (Pharm D, ABAAHP), that discusses different topics within the pharmaceutical, compounding and medical world. \n\nPrecision Opinions Live is recorded inside the offices of Precision Compounding Pharmacy, located in Bellmore New York. \nBeing inside an active pharmacy, we are able to use the podcast and videocast platforms to further assist the pharmacy's customers and partners while being on the front lines of pharmaceutical trends and consumer needs. \n\nChristian Stella and guests provide information and technical insight to both patients and other professionals, as well as offering an avenue for answering any compounding or pharmaceutical questions submitted to the show anonymously. \n\nHaving previously been a guest on shows like; Optimal Health with Dr. Christopher Calapai on WABC 770am, and the LDN Radio show, Christian Stella has taken the next step in providing you the listener with even more opportunities to expand your understanding of medications and pharmaceuticals, by starting Precision Opinions Live.\n\n\"If I can help one patient better understand what they are taking, why something may or may not be providing the results they are looking for or even simply help them use their medication safely and correctly, then Precision Opinions Live has done it's job\" says Christian Stella, Pharm D ABAAHP and host of Precision Opinions Live. \n\n\"Sometimes patients or even other industry professionals are unaware of all of the options that are available to them. By bringing in different guests ranging from doctors with large practices to students, there is a greater chance of connecting that one listener struggling with a medical issue, to the medical professional who can better assist them.\"    \n\nSo join us here at Precision Opinions Live, on our journey to a better understanding of how different pharmaceuticals work and a healthier future.\n  \nThe show can also be viewed on our Youtube channel (all links below) and new updates are always posted on our Instagram, Facebook and Linkedin accounts. \n\n\n\n\nhttps://www.precisionpharmacy.net\nhttps://www.youtube.com/channel/UChoQnIdhY2pUvirfJzowsRQ/featured\nhttps://www.instagram.com/precision_pharm/?hl=en\nhttps://www.facebook.com/precisioncompoundingpharmacy\n\nPrecision Opinions Live is produced and directed by Alexander Ratner of evomximages.com",
        "language": "en",
        "author_name": "Alexander Ratner",
        "slug": "precisionopinionslive",
        "cover": "20201216_154632_c32c352449d26ad3eba1a504e26c4f6b.jpg"
    },
    {
        "podcast_id": 21130,
        "title": "Houston exercise science",
        "description": "In this podcast, I will be talking about myths, facts, and problems with fitness. If you have any questions or suggestions on a new episode email me! houstonexercisescience@gmail.com",
        "language": "en",
        "author_name": "Paul Slawson",
        "slug": "houstonexercisescience",
        "cover": "20210119_225947_4653b320cd07482585742c9c5ad01026.jpg"
    },
    {
        "podcast_id": 22560,
        "title": "Charlie the Chicken Mushroom",
        "description": "An exploratory journey into all the things that feed us. What feeds our bellies, feeds our minds and our souls? And how are they all connected? We focus on environmental health and how that contributes down the path from our farms, foods and individual health. This series is partnered with my children's cook book series, The 9 Lives of Charlie the Chicken Mushroom. An adventure series complete with kid friendly recipes. I believe healthy habits start young and encourage kids to gain nutrition through variety. Together we can learn more about our current food systems and collectively improve the health of our planet and our bodies, minds and spirits. It takes a village. \nwww.charliethechickenmushroom.com ",
        "language": "en",
        "author_name": "Katie Kirwan",
        "slug": "charliethechickenmushroom",
        "cover": "20210106_200226_09c3f8e9e9860e3947d14407156abcb8.jpg"
    },
    {
        "podcast_id": 23537,
        "title": "Power Fitness Podcast: Krafttraining, Ernährung, Muskelaufbau, Fitness, Abnehmen, Coaching",
        "description": "Im Power-Fitness Podcast werdet ihr wertvolle Informationen und Ansichten rund um Kraft- bzw. Muskelaufbau erfahren. \n\nIn vielen Folgen werden mehr psychische Aspekte, in anderen wiederum Körperliche oder Ernährungsbasierte Fakten thematisiert. \nLange Rede kurzer Sinn: Du ziehst durch und holst dir den Körper den du willst!",
        "language": "de",
        "author_name": "Gabriel Reifinger - Experte für Kraftsport und Ernährung",
        "slug": "powerfitnesspodcast",
        "cover": "20211003_103028_5bc28e3132050ad689242af579ed7e6e.jpg"
    },
    {
        "podcast_id": 23971,
        "title": "Mobilis Crossfit Podcast",
        "description": "Welkom bij de Mobilis Crossfit Podcast! \nLuister mee terwijl de coaches het hebben over fitness, voeding en alles daar om heen. \nHave fun!",
        "language": "nl",
        "author_name": "Pablo Stegerhoek",
        "slug": "mobiliscrossfitpodcast",
        "cover": "20210116_125137_216e5ca8c1be60a266f39ae2ad573495.jpg"
    },
    {
        "podcast_id": 26627,
        "title": "The Physical Mindset Podcast",
        "description": "Welcome to the Physical Mindset Podcast! This is where we talk to the world's best trainers, physical therapist, psychologist and doctors about physical activity, their advice into getting into the field, ways to prevent injury, and the mental toughness that goes into the world's most popular sports! I hope you enjoy each conversation! Enjoy!\n",
        "language": "en",
        "author_name": "Ziggy Zeigler",
        "slug": "thephysicalmindsetpodcast",
        "cover": "20210122_180100_d12dd0288d789680eac6d84250cfa598.jpg"
    },
    {
        "podcast_id": 27881,
        "title": "The Full of Beans Podcast",
        "description": "The Full of Beans podcast, hosted by Han (your favourite crazy bean) is on a mission to reduce eating disorder stigma and increase ED awareness. Join Han weekly to hear the inspiring conversations she establishes with a range of individuals including those with personal experience and their loved ones as well as researchers, clinicians and charities who are all working to increase the understanding of eating disorders. \n\nUsing Han's personal battle with atypical anorexia and body dysmorphia, as well as her MSc in Eating Disorders and Clinical Nutrition, Han uses her own knowledge to explore the experiences of like-minded individuals who are equally as passionate about sharing their own stories to increase the understanding of eating disorders. \n\nEating disorders are crippling illnesses and this podcast aims to motivate individuals along their path of recovery. For more support please visit the BEAT or First Steps ED website, or visit your local GP. \n\nFor more information, check out www.fullofbeansed.co.uk or follow the Full of Beans podcast at @thefobpodcast. ",
        "language": "en",
        "author_name": "Hannah Hickinbotham",
        "slug": "fullofbeans",
        "cover": "20220613_120642_bbf3039a28d191d12fce2bce4b0611b3.jpg"
    },
    {
        "podcast_id": 31284,
        "title": "MSC Performance Podcast",
        "description": "The MSC Performance Podcast covers a variety of topics in the Strength and Conditioning world. \nOur main aim is to provide you with relatable information that you can take on board and apply in your own life. ",
        "language": "en",
        "author_name": "MSC Performance Birmingham",
        "slug": "mscperformancepodcast",
        "cover": "20220929_040913_adc94e0c2d85b2eefe20b2a3258966be.jpg"
    },
    {
        "podcast_id": 31479,
        "title": "Weightroom Overtime",
        "description": "This podcast educates athletes, coaches and trainers on new exercise training methods, research, and science. ",
        "language": "en",
        "author_name": "Jovan Rojas",
        "slug": "weightroomovertime",
        "cover": "20210211_024749_3a6ed8da1498ff754a71a88b68c18e18.jpg"
    },
    {
        "podcast_id": 31485,
        "title": "TD Nutrition ",
        "description": "<p>TD Nutrition Podcast discusses ways to improve your health and well being through nutrition. It offers tips and changes to help guide you on your way to a healthy life. It also helps to provide those suffering with a chronic illness useful information to help minimize symptoms. The information in the TD Nutrition Podcast is based on combined intensive research and knowledge learned through obtaining my Masters of Science degree and applying Medical Medium information.</p>",
        "language": "en",
        "author_name": "Taylor DeBoer",
        "slug": "tdnutrition",
        "cover": "20210720_151019_ae246fa2b1fde86b49223ceb23615146.jpg"
    },
    {
        "podcast_id": 31875,
        "title": "Nutrimamma - Ask the Experts",
        "description": "Founder of Nutrimamma Dr Federica Amati, interviews experts and visionaries on a variety of topics all about health and wellbeing. Our aim is to give our listeners evidence-based tools to nourish themselves and their families with clear, actionable information based on science. ",
        "language": "en",
        "author_name": "Federica Amati",
        "slug": "nutrimamma",
        "cover": "20210305_143810_3ccb90376245ece85dd28a707b9ccc96.jpg"
    },
    {
        "podcast_id": 35263,
        "title": "Cosmic Conversations with Sarah R. Adams",
        "description": "Sarah R. Adams has decided to interview gifted people in the spiritual and awakened community as she wants to get the healing and truth out to as many people as possible. She has incarnated with the life mission to emanate her knowledge to people of their divine power and that everyone can heal and ascend into Christ consciousness. Sarah has appeared on Gaia TV, Vice TV and the BBC and has now launched her own podcast where she interviews people of influence and spiritual leaders in the awakened community about important subjects such as healing, health, wealth, and connecting to the spirits and realms. Learn about health and well-being, diet and superfoods, alternative realities and dimensions, energy work, astral travel, karma and how to become more multidimensional.",
        "language": "en",
        "author_name": "Sarah R. Adams",
        "slug": "cosmicconversations",
        "cover": "20210222_025314_525c7b4b73de938bfd03dfbe4dc8e20f.jpg"
    },
    {
        "podcast_id": 36359,
        "title": "It's Reigning Cats and Dogs",
        "description": "Do your pets rule your house like ours do? Join host Joel Baardseth and his guest as they discuss all things pet from whole food nutrition, behavioral tips, and other trends in the pet kingdom. ",
        "language": "en",
        "author_name": "Joel @ Steve's Real Food ",
        "slug": "stevesrealfood",
        "cover": "20210226_232641_af2e63dc875952aedc903d1dc1d3b2b8.jpg"
    },
    {
        "podcast_id": 40599,
        "title": "PurposeKitchen ",
        "description": "Hey Everybody!\n\nWelcome to the Purpose Kitchen Pod featuring Lauren & Mitchell. Join them as they embark on their new adventure of lifestyle podcasting. Got a question for them? Email them at purposekitchen@gmail.com ",
        "language": "en",
        "author_name": "PurposeKitchen",
        "slug": "purposekitchen",
        "cover": "20210311_140847_7c6a2bc81da01282842fce21e66d4ed3.jpg"
    },
    {
        "podcast_id": 41899,
        "title": "Paneb liikuma",
        "description": "See toitumisele, treeningutele ja üldiselt tervisele ning heaolule keskenduv podcast Paneb liikuma. Paneb liikuma mõtte ehk motiveerib alustama. Paneb liikuma füüsiliselt ehk klapid pähe ja kõndima. Paneb liikuma meeled ehk inspireerib tegema muudatusi oma elusstiilis. Võta meie saatekülaliste kogemused ning lood endaga kaasa ja hakka liikuma - oma enda parima versiooni suunas! Saadet juhib Kaisa Selde.",
        "language": "ee",
        "author_name": "Reval-Sport",
        "slug": "terviseskulptor",
        "cover": "20210405_180835_d5f48717ddc08cebb3e0f5cb95a7ac6a.jpg"
    },
    {
        "podcast_id": 44244,
        "title": "Prophletics Podcast ",
        "description": "This podcast is dedicated to health and fitness, boxing and combat sports, and a small touch on current events. ",
        "language": "en",
        "author_name": "Kieston Reece",
        "slug": "prophleticspodcast",
        "cover": "20210325_131322_a32983a95590ef0947249cef3394a7db.jpg"
    },
    {
        "podcast_id": 46555,
        "title": "Dedicated Nation",
        "description": "The Dedicated Nation Podcast is a one-stop-shop for anyone Dedicated to fitness!\n\nThe DN podcast is  Hosted by NASM CPT and Co-owner of Dedicated Health gym Josh Riggs along with Co-Owner John Kernstein, and Dedicated Health trainer Erik Bryant.\n\nThe DN crew cover everything fitness from tips on nutrition to just everyday life advice\n\n",
        "language": "en",
        "author_name": "Josh Riggs ",
        "slug": "dedicatednation",
        "cover": "20210403_171721_2629cb7f95815baf1de1617cd972df7a.jpg"
    },
    {
        "podcast_id": 47032,
        "title": "Here's To Your Health - Crawford County Memorial Hospital, Denison, IA",
        "description": "A weekly podcast with topical information regarding general health, diet, disease management, immunizations, diagnostic services, and other events at Crawford County Memorial Hospital in Denison, IA. Guests come from a variety of sources including in-house and external medical specialists.",
        "language": "en",
        "author_name": "Donald Luensmann",
        "slug": "ccmhia",
        "cover": "20210405_192034_692d0241aa8169d915cafc085cef5d15.jpg"
    },
    {
        "podcast_id": 47049,
        "title": "Overeaters Anonymous of San Gabriel Valley Inland Empire Intergroup",
        "description": "Members of OA SGVIE share their experience strength and hope. ",
        "language": "en",
        "author_name": "OASGVIE",
        "slug": "oasgvie",
        "cover": "20210407_174305_169eb8876da9fcb90ff91525ea8ed9c8.jpg"
    },
    {
        "podcast_id": 49165,
        "title": "Fit Like a Girl Podcast",
        "description": "Hey! I'm Jackie, I am a personal trainer and owner of my own company Fit Like a Girl Personal Training. I help amazing, busy & badass women lose weight, get fit, strong and confident in their bodies and own abilities. \n\nAre you ready to change your life and get real advice on how to achieve your weight loss goals (hint it's not as complex as #influcencers try to make it seem)? \nThen grab your favourite coffee, I'll take mine hot & black and let's talk everything from fitness to nutrition, life and everything in between! \n\nI'm definitely going to swear a lot, I might go on some rants and tangents, but I promise everything will be 100% real and honest advice on how to achieve your goals and I'll be there every step of the way. \n\nIf you're interested in learning more about me & my coaching offers, head to my website https://fitlikeagirl.ca/ \nDon't forget to follow me on Instagram https://www.instagram.com/jackie.fitlikeagirl/\nAnd finally, if you enjoy the podcast, please leave a review and share it with your friends! \n\nLet's change your life together! ",
        "language": "en",
        "author_name": "Jackie Lindal ",
        "slug": "fitlikeagirl",
        "cover": "20210413_185158_22d52a8b0eda0f8a1a0acf67d0f7d051.jpg"
    },
    {
        "podcast_id": 49680,
        "title": "The Improvement Podcast",
        "description": "<p>All things health and fitness related to help you improve physically and mentally brought to you by Charlie Cuthbert</p>",
        "language": "en",
        "author_name": "Charlie Cuthbert",
        "slug": "theimprovementpodcast",
        "cover": "20230316_020333_e5ef2a9b3c22f66809616c65aba179d2.jpg"
    },
    {
        "podcast_id": 50407,
        "title": "Health Glow with Clo",
        "description": "Welcome to Health Glow with Clo , where Health is ALWAYS a MOOD! \nThis podcast is a fun, entertaining and enlightening look at health and fitness. No subject is off limits!  On this journey, we will debunk common myths, spill health care secrets and break generational health curses! \n\nYou can Find me at \nSocial : Instagram : chloe_v_\n\nAlways remember, A healthy glow comes from within!\n",
        "language": "en",
        "author_name": "Chloe Rolle",
        "slug": "healthglowwithclo",
        "cover": "20210418_204736_efe7294971b9177c302eb88773ec36ea.jpg"
    },
    {
        "podcast_id": 50793,
        "title": "Voeding Leeft Zorgprofessionals ",
        "description": "In deze serie podcasts inspireren we jou wat een andere leefstijl met je kan doen, voor jou en je patiënt. Voor ons begint dat in de spreekkamer, daar waar symptoom en oplossing bij elkaar komen. Wil jij mee doen met een van onze nascholingen of wil je weten hoe je je patiënt kan doorverwijzen naar Keer Diabetes2 Om? Ga dan naar keerdiabetesom.nl/voor-zorgverleners/ ",
        "language": "nl",
        "author_name": "Voeding Leeft",
        "slug": "voedingleeft",
        "cover": "20210420_101644_59f1cba6aee0e20a123a54ff146bf710.jpg"
    },
    {
        "podcast_id": 51627,
        "title": "21st Century Healing",
        "description": "Michelle from Eternalbeing started having Colonic Hydrotherapy treatments after suffering from IBS for years and a friend recommended her to go for a treatment. Michelle studied and graduated from the Chi Centre as a therapist. She has a wonderful passion for what she does and wants to spread the word about colonics and all the benefits it has given her and how it has changed her life.\n\nThis podcast discusses taboo issues such as gut health and digestion problems, she speaks to her clients about issues that they have had and what has helped them.",
        "language": "en",
        "author_name": "Michelle Geraghty-Corns",
        "slug": "21stcenturyhealing",
        "cover": "20210706_162308_30ba12f8151cbda95b0c7d22c2b896e5.jpg"
    },
    {
        "podcast_id": 52562,
        "title": "Ayurvedic Radiant Health And Wellness With Dr. Aruna Patki ",
        "description": "Are you ready for your joy, happiness and bliss in your life? Are you willing to change? Are you willing for your mental, physical and spiritual detox? Are you ready for your self-care? then I am ready to share with 20 Years of practica experience I as \na Board Certified Ayurvedic Doctor (BAMS), TMB Therapist (BCTMB), Registered Yoga Teacher (RYT), Licensed Massage & Body Work Therapist (LMBT), NCBTMB(National Certified Body Work Massage Therapist Provider), Author of 2 Books, Board of Director AAAP(American Association of Ayurvedic Professionals), Certified Chakra Healer Therapist, Ayurvedic Nutritional Therapist. \n\nBegin your life journey by preserving your health by practising Ayurveda, Yoga, Diet, Nutrition, Herbs, Pranayama, Meditation, Chakra Healing, Pranic Healing, Indian Acupressure Murma Healing, Energy Healing, Cranio-Sacral Therapy and EFT Therapy (Emotional Freedom Technique). Connect with your bodies energy with this information and transform your life. \n\nWould you like to practise the Ayurvedic way of Healing in your mind to heal your body?\nWould you like to preserve your health & wellness? \nWould you like to grow in your spiritual health? \nWould you like to enhance your longevity? \nWould you like to know your source of energy in your body? \n\nLet's learn the essence of life, reshape the thinking of healing and update ourselves from the wrong myths in the current time, heal quantum capacities of our body, enhance our feminine energy and our masculine energy, achieve the optimal health and wellness, understand the healing powers of our body by understanding our unique nature of body type constitution. \n\nLearn the Secret keys of Health and Wellness, Secrets of Healing, Secrets of Mind, body and Spirit Healing. Let's improvise our health by the conscious awakening of our physical body, grow our spiritual health, remove the blocked energies, blocked tissues, blocked channels through the body and mind.  \n\nHeal Grief, Emotion, Trauma, Healing from within. \n\nhttps://ayurvedahealingspa.com/\nhttps://www.ayurvedahealingspa.com/books/\nhttps://www.facebook.com/AyurvedaHealingHealthandWellnessCentre\nhttps://www.instagram.com/ayurvedahealingspa/\nhttps://www.linkedin.com/in/dr-aruna-patki-ayurvedic-physician\nhttps://www.youtube.com/channel/UCSvPd2mtyEUfkN-BVjQSKGg",
        "language": "en",
        "author_name": "Dr. Aruna Patki",
        "slug": "ayurvedicradianthealthandwellnesswithdrarunapatki",
        "cover": "20210428_054235_b04b5707a0817c817452d7883095b72a.jpg"
    },
    {
        "podcast_id": 53956,
        "title": "Explore. Bouge. Inspire. Le Balado",
        "description": "Via Explore. Bouge. Inspire. Le Balado, on discute de différents sujets en lien avec les trois thèmes:  Explore pour voyages et expéditions, Bouge pour sports et entrainement et Inspire pour repos et yoga. Avec vos animateurs : Philippe Robert & Sébastian Villeneuve. ",
        "language": "fr",
        "author_name": "Skogen Athletics",
        "slug": "explorebougeinspire",
        "cover": "20210503_010700_01bb18c6c47e8ea838ff4e172054b92b.jpg"
    },
    {
        "podcast_id": 56564,
        "title": "Your Favorite F-Word",
        "description": "Deep conversations about our favorite things... food, fitness & feelings - with the occasional f*ck thrown in!",
        "language": "en",
        "author_name": "Paradigm Nutrition & Performance",
        "slug": "yourfavefword",
        "cover": "20220323_080318_b83c078e5e2d3280d41debd6bb7b08bf.jpg"
    },
    {
        "podcast_id": 57314,
        "title": "Voeding Leeft ",
        "description": "Voeding Leeft ontwikkelt en exploiteert samen met wetenschappers, artsen en andere professionals leefstijlprogramma's voor mensen met een chronische aandoening. We vergroten de kennis over voeding in de breedste zin van het woord in relatie tot gezondheid door te delen, te coachen, te inspireren en te vernieuwen.",
        "language": "nl",
        "author_name": "Voeding Leeft",
        "slug": "podcastvoedingleeft",
        "cover": "20210517_113133_8f9a68b38dfb89900ec8b9f455a7b6c3.jpg"
    },
    {
        "podcast_id": 64233,
        "title": "The Wolf Mentality Podcast ",
        "description": "<p>Welcome to the SHE Wolf Mentality Podcast This podcast was designed and created to educate and inspire you in the areas of hypertrophy style training, nutrition and mindset! My objective is for you to get value from each podcast and have takeaways for your own personal fitness journey. You can reach me  or Instagram - @isaiahbawek for any questions on coaching / guidance. Thanks for listening!</p>",
        "language": "en",
        "author_name": "Isaiah Bawek",
        "slug": "builtelitetraining",
        "cover": "20220923_010905_204f1f7157ddcc7681b0effe9fdab300.jpg"
    },
    {
        "podcast_id": 64407,
        "title": "Grape Juice Wine n Jazz",
        "description": "A sensory chronicle of music and wine that explores a different theme or style each episode, designed to enrich, edify and occasionally even fortify!\n\nFor the first series born during the 2020 lockdown search us up on our Mixcloud page, and don't forget to give our very active Instagram a follow for visual accompaniments to each episode and almost daily stories on what we've uncorked :)",
        "language": "en",
        "author_name": "Ben Petrie",
        "slug": "grapejuicewinenjazz",
        "cover": "20210623_101509_dda464109d6df8504c21553c06e6e2f0.jpg"
    },
    {
        "podcast_id": 64623,
        "title": "Tip of the Spear - Honoring the ways of our Ancestors",
        "description": "Welcome to Tip of the Spear - Where it's my mission to honor the ways of our Ancestors by putting back in what the modern world left out, to return you to strength, health, and happiness. Your host, Ben Johnson, will lead you on a journey to discover how Ancestral living can help you overcome the pitfalls of the modern world - declining health, isolation, and an epidemic of weakness - to reclaim your birthright as one of the baddest mammalian predators to have ever lived.  A mixture of solo casts, interviews with subject matter experts, and profound stories of Ancestral living improving the lives of our community, this content will propel you in your journey to be the best version of yourself! ",
        "language": "en",
        "author_name": "Ben Johnson",
        "slug": "tipofthespear",
        "cover": "20210623_204000_31492eae2103d9503c050a834687d26c.jpg"
    },
    {
        "podcast_id": 65777,
        "title": "JIVINITI Connecting the Dots ",
        "description": "JIVINITI presents Connecting The Dots - A show that reveals interconnections across concepts vital to public and planetary health. We promote whole-food plant-based living and intersectional vegan consciousness for a healthier, happier planet. This show is hosted by Nivi Jaswal, Founder - The VIRSA Foundation, and the JIVINITI Coalition and Research Program. This show is in partnership with the JaneUnChained News Network. ",
        "language": "en",
        "author_name": "Nivi Jaswal",
        "slug": "jiviniticonnectingthedots",
        "cover": "20220214_030203_74744a8ce9e26f9c308efa7780be27b4.jpg"
    },
    {
        "podcast_id": 66141,
        "title": "Health Coaches Academy",
        "description": "Welcome to the home of Health Coaching with the team here at The Health Coaches Academy. This show explores the power of health coaching to enable people to live life well, through interviews with some of the UK's leading Health Coaches and associated professionals. For more information on Health Coaching, and how you can become one, visit www.healthcoachesacademy.com",
        "language": "en",
        "author_name": "Health Coaches Academy",
        "slug": "healthcoachesacademy",
        "cover": "20210702_115509_3dc6498cd2f66dd55866fd6b552f9f39.jpg"
    },
    {
        "podcast_id": 68356,
        "title": "Infinite Mindset",
        "description": "En Infinite Mindset queremos que lleves tu cuerpo y tu mente al siguiente nivel, que creas que la longevidad, el vivir relajadamente más de 100 años es posible simplemente cuidando y escuchando tu cuerpo y por supuesto, apoyándote en la tecnología. Todo cambio empieza por nuestra mente y con la correcta mentalidad, desde ahí no sólo podemos cambiar nuestro cuerpo para mejor sino modificar cada aspecto de nuestras vidas. De la mano de Pipe Ramírez, biohacker por más de 7 años y Blas Miliani te traen hacks, noticias, consejos y tips sobre salud, alimentación, suplementos, estilo de vida y tecnología para que lo implementes en tu vida diaria. ",
        "language": "es",
        "author_name": "Pipe Ramírez y Blas Miliani",
        "slug": "infinitemindset",
        "cover": "20210717_195448_742c5c8b3bef189794c0516b5e25dd23.jpg"
    },
    {
        "podcast_id": 69265,
        "title": "Nutritionista",
        "description": "Welcome to the Nutritionista podcast! We bring you evidence-based information on how to help you and your family live healthier and happier lives. \nWe're Megyn Hayes + Rarnie McCudden, two busy Mums and Clinical Nutritionists who specialise in all facets of Women's Health. Join us as we share about our lives, answer your questions, share all that you need to know about identifying the root causes of your symptoms, eliminate diet culture and how nutrition can turn it all around to have you feeling your very best. ",
        "language": "en",
        "author_name": "Megyn Hayes & Rarnie McCudden",
        "slug": "nutritionista",
        "cover": "20230131_030146_48c15124a802a03bf580ead35eea4fd5.jpg"
    },
    {
        "podcast_id": 76306,
        "title": "Making Synapses",
        "description": "Welcome to Making Synapses with Thomas, Co-Founder of Nice Supplement Co.;\nwhere we take on an enthusiasts deep dive into neuroscience, looking into how our brains work, and experiment with how to modulate them. ",
        "language": "en",
        "author_name": "Thomas (Nice Supplement Co.)",
        "slug": "making-synapses",
        "cover": "20210830_024154_de05e4f552eab9f57bf8a239da218871.jpg"
    },
    {
        "podcast_id": 76324,
        "title": "Ricci Flow Nutrition Podcast",
        "description": "Welcome to the Ricci Flow Nutrition Podcast. In this series, I discuss a host of topics related to health, wellness, nutrition, science and medicine. I get the opportunity to learn from some of the brightest and most forward-thinking minds in the world. This podcast invites fresh thoughts and ideas about our health and the health of our planet.",
        "language": "en",
        "author_name": "Cameron Borg",
        "slug": "ricciflownutrition",
        "cover": "20230103_110105_164635d46b7c0a9bf8a59977443f45ec.jpg"
    },
    {
        "podcast_id": 76577,
        "title": "CLINICA NATURISTA  - Medicina naturopata y funcional. Consejeria emocional ",
        "description": "<p>CLINICA NATURISTA tiene 22 años en Las Vegas NV, USA. Serviendo su comunidad local y alrededor del mundo. Consultas por video, en persona y con la clinica naturista movil.</p><p>La Dra. Ana Mantilla ND-WC tiene 23 años de practica en Miami, Fl y Las Vegas, NV.</p><p>Productora executiva de radio y podcast.</p><p>Hablamos Español y Portugues.</p><p>Nuestros temas son sobre la medicina naturopata funcional, nutricion, salud en la sociedad avanzada, causas de problemas de salud, consejeria emocional, pruebas avanzados de laboratorio.</p><p>Estamos localizados en el: 1703 Civic Center Dr #4, North Las Vegas, NV 89030</p><p>Telefono: 702-643-7336</p><p>Correo electronico: <a href=\"mailto:holisticrescuenv@gmail.com\">holisticrescuenv@gmail.com</a> </p><p><a href=\"http://www.holisticrescues.com\">www.holisticrescues.com</a> </p>",
        "language": "es",
        "author_name": "Holistic Rescue ",
        "slug": "holisticrescue",
        "cover": "20210922_144354_8b50bd17da2c3c236ffb3c97f4955c44.jpg"
    },
    {
        "podcast_id": 76657,
        "title": "RYSE & GRIND",
        "description": "Welcome to the RYSE & GRIND podcast. In this you will hear all the in/outs of the fitness industry from the RYSE C.E.O. and athletes. Make sure to follow for the newest episodes. ",
        "language": "en",
        "author_name": "Nic Stella & Jake Oelke",
        "slug": "ryseandgrind",
        "cover": "20210902_150258_bb13b3946d773fd65b5133489cc2022f.jpg"
    },
    {
        "podcast_id": 76921,
        "title": "Macro Cap Podcast",
        "description": "What's going on guys? Welcome to Macro Cap, hosted by Counting Zacros. We talk everything food, fitness and beyond with frequent special guests! New episodes dropping every week. Follow our Instagram @macrocappodcast to keep up with the latest.",
        "language": "en",
        "author_name": "Zac Kerr",
        "slug": "macrocappodcast",
        "cover": "20210902_035118_fcf823f7725edb71d1ddfa55ff4e7e47.jpg"
    },
    {
        "podcast_id": 78376,
        "title": "You're Great with Unique Hammond",
        "description": "<p>Join Unique Hammond, Holistic Nutrition Educator, Integrative Health Coach, and Author of Your Tastebuds are A**holes, for a podcast that offers hope and tools for your healing journey.</p><p>Health is simple; we need a healthy diet, movement, rest, sunlight, water, community, and stress management. The health world makes it complex by fighting over the best diet. PS. The best diet is the one that supports your best (individual) health.</p><p>This podcast is my passion project—real people sharing their healing stories.</p>",
        "language": "en",
        "author_name": "Unique Hammond ",
        "slug": "youregreat",
        "cover": "20220228_100201_73890b9a020e1c5bdaace26d655ce54f.jpg"
    },
    {
        "podcast_id": 79275,
        "title": "The Doctor Is In - Beyond the Prescription ",
        "description": "<p>The Doctor is In - Beyond the Prescription takes an in-depth look at the Doctor Is In column, a publication run by students in professional health programs at the University of Iowa and published in The Daily Iowan. We ask contributors questions about their articles, their lives, and their advice to listeners.</p>",
        "language": "en",
        "author_name": "Linda Peng and Darby Manternach",
        "slug": "thedoctorisin",
        "cover": "20210915_005439_5d355f2219790185b96bf084ab5094d0.jpg"
    },
    {
        "podcast_id": 80646,
        "title": "Sustainable Healing ",
        "description": "Welcome friends! I'm so happy you are here. Gosh so.many.things.  This podcast was created to help you take control over your health mentally, physically, and emotionally. I am a huge motivator and a firm believer that you are in control, we just have to tap into it. So moms, friends, or husbands throw some ear buds in and let's get started. ",
        "language": "en",
        "author_name": "Porsche Jade",
        "slug": "sustainablehealingwithporschejade",
        "cover": "20210921_163548_c00038906054afe0db41a9440b767c8d.jpg"
    },
    {
        "podcast_id": 82530,
        "title": "Entre deux traites",
        "description": "Entre deux traites est un balado créé par des producteurs laitiers d’ici pour les producteurs laitiers et ceux qui s’intéressent au secteur laitier. Entre deux traites, vos animateurs Sabrina Caron et Jean-François Janelle explorent différents enjeux liés à la production laitière. Avec l’aide d’experts, ils cherchent à apprendre, comprendre et analyser. Ils partagent avec vous leurs points de vue sur l’industrie laitière, tant ici au pays qu'à l'étranger.",
        "language": "fr",
        "author_name": "Sabrina Caron et Jean-François Janelle",
        "slug": "entredeuxtraites",
        "cover": "20211012_152529_9bc35e9e86685df1b350b84f25182018.jpg"
    },
    {
        "podcast_id": 82834,
        "title": "Natural Solutions Podcast - Maya Attinello CFMP, CNC",
        "description": "Welcome to the Natural Solutions Podcast with Maya Attinello. This podcast is for listeners who want to learn about Natural Solutions for Optimal health through diet, nutrition, herbal & functional medicine, and lifestyle practices.\n\nGet my 5-day mini-course Lighter & Brighter:\nhttps://mailchi.mp/23eef30fb343/5-day-free-nutrition-challenge\n\nFollow me on social media\nYoutube: https://youtu.be/7cw24yfHXsM\nInstagram: www.instagram.com/mayanaturalsolutions",
        "language": "en",
        "author_name": "Maya Attinello",
        "slug": "naturalsolutions",
        "cover": "20211002_134104_2816a31b7d563161fa6195f90577cc46.jpg"
    },
    {
        "podcast_id": 83814,
        "title": "Ne hladu podcast o výživě",
        "description": "<p>Podcast o nejrůznějších zákoutích ze světa výživy se srozumitelnými a ucelenými informacemi, který ti pomůže se v této sféře lépe orientovat. Vyjasní ti nejčastější výživové mýty, pomůže se správným výběrem potravin, seznámí tě se zajímavými hosty a jejich pohledem na výživu a mnoho dalšího. Jednotlivými epizodami tě provedou nutriční terapeutky z Ne hladu - Ing. Mgr. Veronika Pourová, Mgr. Andrea Jakešová a další. ————————— Za možnost zrealizovat tento podcast děkujeme především Sportisimu.</p>",
        "language": "cs",
        "author_name": "Ne hladu ",
        "slug": "nehladupodcastovyzive",
        "cover": "20230517_010525_7986dffef81fb4b4fe4d4a258014e3ba.jpg"
    },
    {
        "podcast_id": 84207,
        "title": "Up Level Your Life",
        "description": "Discover how to transform your life from mediocre and stressed to one full of inner peace, happiness, and good health in the Up Level Your Life podcast. Ali helps take your life to the next level by teaching you how to combine energy, intuition, ancient wisdom and brain science to live healthy, wealthy, and happy. Get off of autopilot and start consciously creating the life of your dreams today.",
        "language": "en",
        "author_name": "Ali Gregoire",
        "slug": "uplevelyourlife",
        "cover": "20211009_183626_a0b4ef6b0515130e7a89b0cc9e673763.jpg"
    },
    {
        "podcast_id": 84900,
        "title": "The Spice of Life Podcast",
        "description": "Introducing “The Spice of Life Podcast”\nAll things culinary  \n\nI will be your host Taylor Duncan as we delve into all aspects of the culinary world, we will discuss food trends, upcoming local 757 food events, interviews with local farmers, personal trainers, local chefs and more!\n\nCheck us out for a NEW biweekly podcast!",
        "language": "en",
        "author_name": "Taylor J Duncan",
        "slug": "tsolpodcast",
        "cover": "20211013_153045_0fa90730324effc3c36e7ca688dd8e7a.jpg"
    },
    {
        "podcast_id": 86325,
        "title": "Inside Medical Nutrition",
        "description": "In this podcast for healthcare professionals, powered by Nestlé Health Science, our host Dr Linia Patel explores an array of medical nutrition topics with our expert guest speakers. Whether you’re interested in optimising dysphagia management, navigating the blended diets trend in enteral nutrition, or hearing real life experiences from your peers, you’re in the right place. Switch on, tune in, and dive deeper Inside Medical Nutrition. \n\nThis podcast is for healthcare professionals only, and all views expressed belong to our speakers, not necessarily reflecting those of Nestlé Health Science. ",
        "language": "en",
        "author_name": "Nestlé Health Science",
        "slug": "inside-medical-nutrition",
        "cover": "20211021_103403_58a2243f20cfae5b6119c06a821f9442.jpg"
    },
    {
        "podcast_id": 90409,
        "title": "Meat Based",
        "description": "Josh (from South Africa) and Nicole (from California) are what you would call \"meat based\". Their diet consists of mostly eating meat, but there is so much more to living a meat based life than just that. Join us for authentic discussions around what it is to be meat based, our experience and benefits from following meat-based diet, some taboo topics in health, and the journey of living in a foreign country while staying physically active and practicing mindfulness. \n",
        "language": "en",
        "author_name": "Meat Based",
        "slug": "meatbased",
        "cover": "20211113_084857_b985705c8d3a4803116462e148db0992.jpg"
    },
    {
        "podcast_id": 90945,
        "title": "The Impact Academy",
        "description": "My goal with this podcast is to make an impact in as many peoples lives as I can. I want to leverage my expertise to cut through the noise and answer all your health and fitness related questions. ",
        "language": "en",
        "author_name": "Kyle Norman",
        "slug": "impactacademypodcast",
        "cover": "20221208_121234_9e3298a0126e8a7859e9362231ccea8d.jpg"
    },
    {
        "podcast_id": 91067,
        "title": "aPODtera - La oss snakke om det",
        "description": "<p>aPODtera er podkasten til Apotera nettapotek. Vi snakker om alt innenfor helse og kropp. Her er det ingenting som er flaut å snakke om! Vi har en livlig tilnærming og godt humør. Av Apotera med Mia Meland</p>",
        "language": "nb",
        "author_name": "aPODtera",
        "slug": "apodtera",
        "cover": "20230317_010350_38a66abce8d891a5b1931eb4e7bb7eb4.jpg"
    },
    {
        "podcast_id": 91708,
        "title": "Let Me Help You",
        "description": "This is a podcast created to help bring natural alternatives furthering your journey in health, happiness and longevity.",
        "language": "en",
        "author_name": "LMHY",
        "slug": "lmhy",
        "cover": "20211120_193005_d48133eb9853180f56e52cf32ce20348.jpg"
    },
    {
        "podcast_id": 93159,
        "title": "Sci•Care",
        "description": "Welcome to Sci•Care with Robin Laird, a podcast on science, self-care, and all things wellness.  Join us as we walk and talk towards mental and physical mastery, so you too can the best version of yourself. ",
        "language": "en",
        "author_name": "Robin Laird",
        "slug": "sci-care",
        "cover": "20211129_101115_f9b2da729e8d5d9147a7f19ba3790cc9.jpg"
    },
    {
        "podcast_id": 94716,
        "title": "37Health ",
        "description": "٣٧ مئوية ، برنامج يدور في مدار الطب وسيرة الطب، لياليه وأيامه، متاعبه وأحلامه، يحلق حوله لكنه لا يقتصر عليه، ينطلق من مواضيع الطب والصحة إلى ما هو أبعد، الى التجربة الانسانية بعنوانها الأصفى والأرحب. \n\nابق على تواصل مع ٣٧ مئوية ولا تنس تفعيل زرّ الاشتراك الموجود في تطبيقك لتصلك الحلقات أولاً بأول.\n\n \n\n                                                                  \n\n\n                                                              \n\n\n\n\n \n\nالحلقة الأولى تقودنا الى شخصية الطبيب والروائي خالد حسيني مبعوث النوايا الحسنة للمفوضية السامية بالأمم المتحدة لشئون اللاجئين.\n\n \n\nكان من بين ٤٠ مليون نازح، ممن عثر بهم الحظ والجغرافيا والتاريخ، تضيق بهم الأرض، تحشرهم في الممر الأخير.\n\nعندما حطت به الطائرة لاجئا في الولايات المتحدة قبل ٤٠ عاما، لم يكن يعرف الانجليزية. بعدها بسنوات يجد الجالسة الى جواره على الطائرة تقرأ احدى رواياته. يشاهد التلفزيون يوما فيسمع اسمه كجواب صحيح يدلي به متسابق في برنامج مسابقات شهير.\n\n \n\nهو اليوم روائي شهير طبعت من رواياته أكثر من ٤٠ مليون نسخة.\n\nفي هذه الحلقة تتعرفون على خبايا القصة الحقيقية لفتى الشرق النازح.\n\n \n\nالحلقة الأولى من تقديم: د. أميرة السنوسي و د. رياض سلمان\n\nإعلان الحلقة: الأستاذ والإعلامي القدير عصام سيف\n\nالدبلجة بصوت: الأستاذ محمد الموالي\n\nفكرة وبحث: د. يثرب العالي\n\nمراجعة وكتابة النص: أسرة التحرير\n\nتصميم الشعار: أبرار الحجيري  و حبيب الفردان\n\nالتأليف الموسيقي: أحمد الغانم\n\nالإشراف والمتابعة: د. رياض سلمان\n\n\n\n\nالمصادر:\n\n \n\n١- مقال صحيفة التايم في ١٧ مايو ٢٠٠٧ بعنوان \" كاتب عداء الطائرة الورقية يعود لوطنه\"\n\n \n\n٢- موقع وكالة اللاجئين بالأمم المتحدة\n\n \n\n٣- مقال من صحيفة التيليغراف ١٩ مايو ٢٠٠٧ بعنوان \" اليأس في كابول\"\n\n \n\n٤- مقال من موقع الإذاعة الأوروبية ٢١ يونيو ٢٠١٢ ، بعنوان : كاتب عداء الطائرة الورقية : عن طفولته ، كتاباته، وقضيته -اللاجئين الأفغان\n\n \n\n٥- مقابلة مع تيري ديري على برنامج Saturday Live بتاريخ ٢٦ اكتوبر ٢٠١٣\n\n  \n\n \n\nالهندسة الصوتية والمونتاج       التصميم والميديا           الإعلان والتسويق\n\n                                                                                           \n\n\n\n\n\n \n\n \n\n www.37Health.org\n\n\nجميع الحقوق محفوظة",
        "language": "ar",
        "author_name": "Podcast",
        "slug": "37health",
        "cover": "20211208_121231_18b78e24b415337cb92725c6569eb9ea.jpg"
    },
    {
        "podcast_id": 95555,
        "title": "SanoPeople",
        "description": "SanoPeople este un podcast lansat de SanoPass, în care discuțiile sunt purtate cu medici specialiști pe teme și limbaj relevant pentru populația generală.",
        "language": "ro",
        "author_name": "SanoPass",
        "slug": "sanopeople",
        "cover": "20211213_091215_646dfdfb1f86e77d0e9c7b64ebc58067.jpg"
    },
    {
        "podcast_id": 95637,
        "title": "Trace Your Day",
        "description": "<p>You’re listening to “Trace Your Day”, the Trace Minerals podcast we pack full of useful information and easy tips to help you live a healthier lifestyle. From hydration to healing to healthy eating and everything in between, we’re here to talk about the health topics that matter to you. I’m Dr. Darrin Starkey, board-certified naturopathic physician and manager of training and education at Trace Minerals. After 30 years in health education, I’m excited to share what I’ve learned with you. From me and all your friends at Trace Minerals, thanks for listening to “Trace Your Day.”</p>",
        "language": "en",
        "author_name": "Dr. Darrin Starkey",
        "slug": "traceyourday",
        "cover": "20211213_071240_ccb5c937d51272e198394a7ae30bc3e9.jpg"
    },
    {
        "podcast_id": 95940,
        "title": "DIETETYKA – PODCAST WIEDZY",
        "description": "Interesujesz się współczesną dietetyką i szukasz rzetelnych informacji? Chcesz zbudować trwałe nawyki zdrowego odżywiania, albo przygotować plan żywieniowy dopasowany do zdiagnozowanej choroby? A może jesteś dietetykiem i szukasz forum do wymiany doświadczenia i doskonalenia zawodowego? Z myślą o Tobie stworzyliśmy to miejsce – „Dietetyka- podcast wiedzy”. To tutaj swoją wiedzą i doświadczeniem w zakresie współczesnej dietetyki dzielą się eksperci i praktycy PZWL Wydawnictwa Lekarskiego.\n\nLink do książki: https://bit.ly/30yxv5O",
        "language": "pl",
        "author_name": "PZWL Wydawnictwo Lekarskie",
        "slug": "dietetyka-podcast-wiedzy",
        "cover": "20220114_100110_360f9ebe6c5a501cc52c7534984ff3ef.jpg"
    },
    {
        "podcast_id": 96522,
        "title": "The Luke Smith Nutrition Podcast",
        "description": "Talking all things nutrition, fitness and mindset to help you optimize your life and create the best version of you. ",
        "language": "en",
        "author_name": "Luke Smith",
        "slug": "lukesmithnutrition",
        "cover": "20211219_091202_a368a39d6a0478b933df70bc7d975f28.jpg"
    },
    {
        "podcast_id": 96958,
        "title": "TY TALKS",
        "description": "<p>This show is where you can listen to anything and everything bodybuilding/competition related by 12x top prep coach award winner Ty Woosley with Prestige Physiques. Co-hosting is national level bodybuilder and coach Justin Abbott. We bring current clients on to share their stories and journey to the stage. We also bring on other top coaches in the industry as well to share their knowledge. This show will cover nutrition, training, hormones, and supplementation. This podcast is to help others learn and for people to share their knowledge/stories</p>",
        "language": "en",
        "author_name": "Ty Woosley",
        "slug": "tystalk",
        "cover": "20211222_051239_c0b2ee349fe5a3ab242e0fcd2f66dd2a.jpg"
    },
    {
        "podcast_id": 97282,
        "title": "Dark Side Podcast",
        "description": "Kluci z Dark Side Movement si povídají o pohybu, cvičení, stravě a všem, co souvisí se zdravým životním stylem.",
        "language": "cs",
        "author_name": "Dark Side Podcast",
        "slug": "jentakpodcast",
        "cover": "20220928_100913_22cfe9640d3e9119543d5f641eda5ce7.jpg"
    },
    {
        "podcast_id": 97374,
        "title": "Superfood Sundays with Chef Lynnette",
        "description": "Join Superfood School founder Chef Lynnette Astaire for candid kitchen conversations with some of the most prominent plant-based people on the planet.\n\nLearn more at superfoodschool.org",
        "language": "en",
        "author_name": "Superfood School",
        "slug": "superfoodsundays",
        "cover": "20211226_091238_d8537a194b214821eec4d0b9a97e698c.jpg"
    },
    {
        "podcast_id": 97513,
        "title": "הכל על תזונת ילדים",
        "description": "רוצים לגדל ילדים שאוכלים בהנאה אוכל בריא? מחפשים מידע אמין ובגישה שפויה ומאוזנת בנושא התזונה המשפחתית? מתעניינים בנושאים הקשורים לאוכל וגדילה? רוצים לדעת מה כדאי לעשות כדי לעזור לילדים לשמור על אכילה מאוזנת ומשקל תקין ללא מאבקים וללא ״דיאטות״? בכל אלו ובנושאים מגוונים נוספים נדון בפודקאסט, המוקדש כולו לתזונת ילדים, החל מהינקות ועד סוף גיל ההתבגרות. \nהפודקאסט בהנחיית יעל חן-רביע וענת תבור, דיאטניות ילדים ומשפחה מעל 25 שנה ואימהות לילדים בעצמן. בעלות קליניקה פרטית לתזונת ילדים, מרצות ומרכזות את הקורס ״טיפול בהשמנת ילדים״ לדיאטניות קליניות בעמותת עתיד (עמותת הדיאטניות).\nלאתר של יעל כנסו ל- www.yaelchenrabih.com.\nלאתר ולבלוג של ענת כנסו ל- www.tavoranat.com.\n",
        "language": "he",
        "author_name": "ענת תבור ויעל חן רביע",
        "slug": "all-about-pediatric-nutrition",
        "cover": "20211227_031201_44591374020a6f3d49813e2246d43e26.jpg"
    },
    {
        "podcast_id": 98191,
        "title": "The Lively Pod",
        "description": "<p>Lauren is a holistic health coach on a mission to simplify wellness for the twentysomethings ⚡️ We'll talk all things nutrition, fitness, personal development, relationships, and more. Are you ready to live a lively life? Subscribe for a new episode each week on Sundays! https://www.instagram.com/lettucebelively/ https://www.lettucebelively.com/ https://www.youtube.com/channel/UC9iw1gK6th8kNO7T5mo1pvQ Email: lettucebelively@gmail.com</p>",
        "language": "en",
        "author_name": "Lauren",
        "slug": "lettucebelively",
        "cover": "20230721_060717_9daa8d8382b01b9f57f3225f9353837f.jpg"
    },
    {
        "podcast_id": 98424,
        "title": "ThicccCast ",
        "description": "Hello, I'm your host Molly Edwards and this is ThicccCast! the Podcast that talks all things Bodybuilding, with the purpose to inspire, motivate and educate you.\n- Molly @mollyjayne_bikini",
        "language": "en",
        "author_name": "Molly Edwards",
        "slug": "thiccccast",
        "cover": "20220102_030115_81f905aab943eea8e1345c172ca91797.jpg"
    },
    {
        "podcast_id": 99013,
        "title": "The Natural Health Revolution",
        "description": "It's time to join The Natural Health Revolution!\n \nDr. Sarah Kelly (PhD) brings you the latest from the fields of health, nutrition, science and wellbeing to help you take care of your long-term health. Each week, Sarah unpacks a topic that affects our everyday health with the latest facts & research from well-respected experts in their field (academia, science, medicine, health).\n\nIt can be hard to sift through all the information we are bombarded with when it comes to health - especially when we don't know who to trust. We bring you experienced voices to cut through that noise of misinformation and give you the foundational knowledge you need to make up your own mind. Our goal is to breakdown complicated subjects into the philosophy of 'gentle changes': small steps we can take to create healthy and sustainable habits in the long-term!\n\nA former Assoc. Professor at the School of Health & Human Performance at Dublin City University, Sarah brings her passion & expertise to each conversation -  creating casual and easy-to-follow conversations with experts covering Gut Health; Pelvic Health; Menopause; Skincare; Chronic Disease; Heart Health and much more.\n\nNo More 'Taboo' Subjects!\nThe Natural Health Revolution wants to empower people to understand how to take care of their own bodies without embarrassment. Sarah and her guests lead by example with honest conversations about subjects we need to get comfortable with if we want to take care of ourselves and each other.",
        "language": "en",
        "author_name": "Circle of Light",
        "slug": "thenaturalhealthrevolution",
        "cover": "20220128_110104_25e1101241261e1a6ab1816271e6726d.jpg"
    },
    {
        "podcast_id": 99490,
        "title": "Delgado RANTS-Beat the sun up",
        "description": "Join me every morning when I get you ready for the day! I talk about general self improvement topics that will question the things you have been told your entire life! Thank you for listening and always, BE GREAT!",
        "language": "en",
        "author_name": "Joe Delgado",
        "slug": "beatthesunup",
        "cover": "20220116_010135_b0358439181eb34f2f40e8c0feec40ae.jpg"
    },
    {
        "podcast_id": 100508,
        "title": "Two Broke Girls",
        "description": "Raeleigh Windham and Baylee Ockomon chat about relationships, health, fashion & everything in between on this crazy adventure they call their 20s. ",
        "language": "en",
        "author_name": "Raeleigh Windham and Baylee Ockomon",
        "slug": "twobrokegirlspodcast",
        "cover": "20220113_030127_a5694feac02145d01c6d250b3bb7ec0f.jpg"
    },
    {
        "podcast_id": 103017,
        "title": "Wellcast with Josif",
        "description": "11 years ago I've involved myself in the fitness and wellness industry. My father was diagnosed with prostate cancer, later it transferred to the bones and after couple of years he was diagnosed with Alzheimer's disease. That was the reason why I went on a mission for healthier and happier life. This podcast has a goal to inspire people and help them achieve quality of living. ",
        "language": "en",
        "author_name": "Josif Damjanov",
        "slug": "wellcast",
        "cover": "20220123_080102_a7fbe0ec098f030b7003af34423d79c0.jpg"
    },
    {
        "podcast_id": 103349,
        "title": "Coffee With Mike ",
        "description": "<p>Mike is a Small Business Owner, CCFT &amp; Coffee Enthusiast. Dig in to his down to earth brain as he showcases his journey through the world of gym ownership, fitness and life. </p>",
        "language": "en",
        "author_name": "Mike MacLeod",
        "slug": "solvradio",
        "cover": "20230509_020544_4b608aa5a6c9d3f2c98e480e9ab9b565.jpg"
    },
    {
        "podcast_id": 103768,
        "title": "The Truth of “Wellness”",
        "description": "We all seem to be on a diet. We all seem to be depriving and going on extreme and all are confused\nLet’s deep dive into what each diets means and how they are not working. Weight loss and regaining your health all starts in your mind. We must have a positive reasoning- let’s learn positive reinforcement and how to form healthy habits. This goes from those with depression or anxiety to anyone losing weight. The first step starts with your mentality. Then once we learn how to instill proper behaviors and habits we will learn the basics of Nutrition and fitness. Gain the skills you need to never be on an extreme diet again with me",
        "language": "en",
        "author_name": "Lena Leva",
        "slug": "lenaswaytohealth",
        "cover": "20220125_110108_5fc8e44e3db67c2ca42e23bd3515ebbc.jpg"
    },
    {
        "podcast_id": 105420,
        "title": "\"אבא חטוב\" עם צביקה עינב",
        "description": "הפודקאסט הרשמי של \"אתגר אבא חטוב\", שיטת ההרזיה לגברים המצליחה בישראל.\n\nאיך לרדת במשקל ללא רעב או חשקים?\nאיך להצליח סופסוף להוריד את הכרס עם מינימום חוקים?\nמה משותף למעטים שמצליחים להגיע ליעד ולא להעלות הכול בחזרה?\n\nצביקה עינב הוא מאמן כושר, יועץ תזונה ומייסד \"אתגר אבא חטוב\" והשיטה הלפטינית להרזיה. מעל 15,000 גברים עברו את התהליך באחוזי הצלחה גבוהים, ובפודקאסט הזה תקבלו הצצת עומק לכלים, הטכניקות, השיטה והסיפורים שיעזרו לך להוריד את הכרס ולהיות אבא חטוב :)",
        "language": "he",
        "author_name": "Tzvika Einav",
        "slug": "abahatuv",
        "cover": "20220201_010230_f751c44578a56b318fe237f1aa25547c.jpg"
    },
    {
        "podcast_id": 106741,
        "title": "The Fitt 4 Life Podcast",
        "description": "<p>Discover the secrets to living a fit and healthy life with Alan Fitton, host of The Fitt 4 Life Podcast! Join Alan for inspiring conversations filled with tips, tricks, and motivation to help you reach your fitness goals. Alan will also be joined by a list of guests from the fitness and mental health space sharing their own experiences, how they reached success, and their own mental health struggles. Be empowered to make lasting changes in your life and become the fittest version of you, lets be fitt 4 life.</p>",
        "language": "en",
        "author_name": "Alan Fitton",
        "slug": "fitt4life",
        "cover": "20230605_040612_d06768050052b758b00c40f97ba287ef.jpg"
    },
    {
        "podcast_id": 106749,
        "title": "Pistachea",
        "description": "Alimentación, salud , entrevistas, deporte y buen humor. El podcast que se disfruta con un buen bol de pistachos. ",
        "language": "es",
        "author_name": "Jordi Marques",
        "slug": "pistachea",
        "cover": "20220206_120216_cab3221c13d17ae04fa9eec3cd24ea11.jpg"
    },
    {
        "podcast_id": 106787,
        "title": "The Physique Factory Podcast",
        "description": "If you're someone who has been going to the gym but seeing little in the way of results, or if you're a personal trainer or coach who wants to learn more to apply with your clients, then you are in the right place.\n\nWe cover everything from nutrition to biomechanics so that you have all of the information you and your clients need to level up your training, nutrition and achieve your dream physique!\n\nHosted by Physique Factory coaches Conor Moran and James Tildsley.\n\nCheck us out on Instagram for more free content!\n\n@physique_factory_coaching \n@cm_physiquefactory\n@jt_physiquefactory",
        "language": "en",
        "author_name": "The Physique Factory Podcast",
        "slug": "physiquefactorycoaching",
        "cover": "20221018_031025_17cb26f5c2b122eedd28edc0cb6931d8.jpg"
    },
    {
        "podcast_id": 109354,
        "title": "THE SWOLLEN EXPERIENCE",
        "description": "Me and Dogson waffle about Mixed Martial Arts events and life sometimes with just us and sometimes with guests",
        "language": "en",
        "author_name": "THE SWOLLEN EXPERIENCE",
        "slug": "theswollenexperience",
        "cover": "20220302_030306_c80205bf34abec8d272921f068c8ad2d.jpg"
    },
    {
        "podcast_id": 109945,
        "title": "Bork'n Talk",
        "description": "<p>Podcasten for dig som vil tabe dig, leve sundere og lære om det rette mindset. </p>",
        "language": "da",
        "author_name": "Jacob Bork",
        "slug": "borkfitness",
        "cover": "20220219_020252_e13e13b54bcc9b68f4b9d1d43a602ec2.jpg"
    },
    {
        "podcast_id": 110507,
        "title": "Mambo vipi ?",
        "description": "<p>Urugendo mu kwihaza mu biribwa ni rurerure. Sangira natwe uburyo twahinga tukanorora ibidutunga. Ngwino dusangire amafunguro tuzatekera hamwe mu bivuye mubyo twahinze.</p>",
        "language": "en",
        "author_name": "Nilekast",
        "slug": "mambovipi",
        "cover": "20220227_020239_9e1d59bb78df4d4364272e878eaa87a5.jpg"
    },
    {
        "podcast_id": 111734,
        "title": "Get to Know - with Dallen and Alex",
        "description": "Alex and I are 2 very invested online physique coaches and bodybuilding competitors who want to bring this podcast to you in an educational yet informal manner. \n\nWe will be touching on many important topics of training, nutrition, PEDs, mental health and many other topics through the lens of personal experience, evidence-based practice and with a host of established guests in their respective fields.\n\nIf you have any questions or feedback with regard points mentioned or topics in particular you'd like us to cover, please reach out to either of us on Instagram, \n@daragh_allen\n@therealmrfreshwater\n\nThanks for listening!",
        "language": "en",
        "author_name": "Daragh Allen and Alexander Freshwater",
        "slug": "gettoknowwithdallenandalex",
        "cover": "20230209_040240_b6b8c9d8c28a76bfd13dcd8a39332d97.jpg"
    },
    {
        "podcast_id": 112478,
        "title": "Train Like a Ranger Podcast ",
        "description": "The Train Like a Ranger Podcast is the most entertaining and engaging podcast for fitness, nutrition, and military prep! The host, Daniel Burnett, is an Army Ranger Veteran, Certified Strength and Conditioning Specialist (NSCA CSCS), Certified Sports Nutrition Specialist, and Certified Personal Trainer. Join Daniel as he talks with epic guests from around the world!",
        "language": "en",
        "author_name": "Daniel Burnett",
        "slug": "trainlikearanger",
        "cover": "20220302_030346_8cde99f04940d4beaf243d8ef4139ba7.jpg"
    },
    {
        "podcast_id": 113076,
        "title": "MY WELLNESS FRIEND",
        "description": "MWF es un podcast que nace de una amistad de dos personas con caminos distintos, que en la búsqueda de su propio bienestar  se encontraron  y descubrieron  que había mucho por seguir aprendiendo y por compartir.\nY en ese compartir se abrirá un tercer micrófono para todas esas personas interesantes que han llegado a su vida a enseñarles algo. ",
        "language": "es",
        "author_name": "ANA Y JOSE",
        "slug": "mywellnessfriend",
        "cover": "20220615_100634_19338272af447aa5f2d0eeec65a7d265.jpg"
    },
    {
        "podcast_id": 115347,
        "title": "eVOLV Strong with C.J. ",
        "description": "<p>Honest fitness advice that works. I provide you the tools needed to lose 10 pounds and 5 inches off of your waist in 28 days. My mission is to help you feel confident and fabulous when looking in the mirror.</p>",
        "language": "en",
        "author_name": "Curt Chavez",
        "slug": "evolvstrong",
        "cover": "20230911_040935_ee250e0a53175ad425503e8abbbf5203.jpg"
    },
    {
        "podcast_id": 115511,
        "title": "My Gut Feelings",
        "description": "The answer to most digestive ailments today results from poor choices in our diet,  chronic stress and alterations in the microbiome or gut bacteria. Medical research has drastically changed our understanding of many G.I. diseases. Stomach ulcers are no known to be caused by an infection with H. pylori bacteria. So successful eradication of the infection prevents stomach ulcers from recurring. Bleeding ulcers and esophageal ulceration from acid reflux is rarely seen now with a very potent proton pump inhibitors such as omeprazole. On the other hand autoimmune disease of the bowel such as Crohn's disease or ulcerative colitis is on the increase although biologic agents are now able to alter the disease course so that the overall prognosis is better in these patients. Irritable bowel syndrome is more often diagnosed and its treatment leaves much to be desired. Screening colonoscopy has decreased the death rate from colon cancer. We also have a better understanding of anorectal disease and it's management. I am a professor of Medicine and have been practicing for over 30 years and offer my insights into our digestive wellbeing.",
        "language": "en",
        "author_name": "Waqar Qureshi, MD, FRCP, FASGE, FACG. Professor of Medicine",
        "slug": "mygutfeelings",
        "cover": "20220505_050549_b5bbf7274dc2545cb688d76f98963c77.jpg"
    },
    {
        "podcast_id": 118170,
        "title": "Eat Gluten Free with Me",
        "description": "<p>Eat Gluten Free with Me is a health &amp; wellness account I started on TikTok (@eatglutenfreewithme) to create a close-knit gluten-free community. I was diagnosed with Celiac Disease, Crohn's Disease, &amp; IBS when I was 17 years old and I always struggled to find people that I could relate to and ask advice from when it came to living gluten-free. Instead of waiting to find my community, I built my own to help others in the same situation. I provide you with valuable knowledge to make living life with Celiac Disease, an autoimmune disease, or simply eating gluten-free something you no longer see as a task. You deserve freedom from your diagnosis. Subscribe to find your freedom and to join the gluten-free community. Follow me on TikTok - @eatglutenfreewithme, IG - @eat.glutenfreewithme to see my daily tips &amp; tricks or YouTube @eatglutenfreewithme for more in depth videos on Celiac Disease! YOU ARE MORE THAN YOUR DIAGNOSIS.</p>",
        "language": "en",
        "author_name": "Lauren Murawski",
        "slug": "eatglutenfreewithme",
        "cover": "20220913_070952_6b5ba2da3592ff3fb2cd570c84b62a97.jpg"
    },
    {
        "podcast_id": 118200,
        "title": "Recovery Is Not Selfish",
        "description": "Two 20 something year old girls who met in Residential Eating Disorder treatment are now taking on the world of outpatient recovery. Join Janel and Halle for a nice chat on different aspects and outlooks of recovery, with both a lighthearted and vulnerable outlook. \n\nINSTAGRAM: @recoveryisnotselfish\nEMAIL: recoveryisnotselfish@gmail.com",
        "language": "en",
        "author_name": "Janel and Halle",
        "slug": "recoveryisnotselfish",
        "cover": "20220331_040340_e54976b6f067c0fad324d13e58e87711.jpg"
    },
    {
        "podcast_id": 118785,
        "title": "Be Bold ",
        "description": "<p>Tessa Breeden is a fitness junkie, personal trainer, and fitness nutrition specialist who has been in fitness for over a decade. Tessa dives deeper into topics such as health, nutrition, wellness, lifestyle, mental health, relationships, and more. Be bold is a podcast that is intended to get you thinking about how to create bold choices to help you live the most optimal and fulfilling life. Tessa's passion is helping women to feel fulfilled in and outside of the gym, as well as educating them on how to live their own version of a healthy lifestyle.</p><p>You can expect bold, raw, and honest conversations on this podcast. Tune in for weekly chats with Tessa's friends, colleagues, and biggest inspirations. Never forget to be bold, be confident, and to be you.</p>",
        "language": "en",
        "author_name": "Tessa Breeden",
        "slug": "beboldfitnesspod",
        "cover": "20230504_020529_3a6dc4130476e5dc1896c06bfb93d546.jpg"
    },
    {
        "podcast_id": 119645,
        "title": "Kevdr podcast",
        "description": "Veš unu, ka greš u kevdr s kolegi, pa se menš kr neki, k nasledno jutro use pozabs?\nPodcast o 2,5 dolenjca (1 prženjen), ki v kevdru ene od dolenjski zidanic ob narezku in kozarčku rujnega rdečega debatirajo o raznovrstnih temah in dogodkih... sami ali v družbi imenitnih gostov...\n",
        "language": "sl",
        "author_name": "Kevdrčki",
        "slug": "keudr",
        "cover": "20220404_090420_368f3c6c1b1da2af39daf0a64d31d365.jpg"
    },
    {
        "podcast_id": 120373,
        "title": "Wylde On Health: Seeking Healthspan ",
        "description": "Lifespan is the time you‘ll clock on the planet. Healthspan, however, is the time you will spend living your life in optimal mental and physical health.\n\nWylde On Health: Seeking Healthspan is a podcast that delivers actionable healthy living tips and features guest experts - known to be the best in their respective fields - who are extraordinarily passionate to share evidence based information on nutrition, lifestyle, supplementation, technology, self-assessment, and healthy living tips. Listeners gain insights on how to live their best life, as long as possible, with optimal physical health and cognitive faculty.",
        "language": "en",
        "author_name": "Functional Medicine Clinician Bryce Wylde",
        "slug": "wyldeonhealth",
        "cover": "20221217_041222_64fa6af3a7f541d1c84c24a13b66389a.jpg"
    },
    {
        "podcast_id": 120570,
        "title": "Women's Health CLARITY with Cloe & Kate",
        "description": "* Formally NO BS Women's Health * \n\nHonest, open conversations about the health topics women* worry about. Cloe and Kate share their professional insights, collective experiences in movement and nutrition and a no BS attitude to give you the CLARITY you need for your best, most confident health.\nCloe Bunter is a Pilates Teacher Trainer & creator of The Pilates Instructor Hub. With over a decade in the fitness industry, Cloe's mission is to help you feel empowered in your body to move fearlessly. Kate Spina is a nutritionist, award-winning chef and eating disorder survivor. Kate is committed to helping you wade through all the overwhelming nutrition BS and feel more confident about what you eat.\n\nConnect with us here: \nInstagram @womenshealthclaritypodcast\nCloe via Instagram @cloebunterpilates & www.cloebunterpilates.com.au\nKate via Instagram @katespinanutrition & www.katespinanutrition.com\n\nDon’t forget to subscribe so you never miss an episode and follow us on Instagram to ask us the questions you need no BS answers for! We would love it if you left us a review and share how an episode has helped you take a no BS approach to your health. Thanks so much for your support!\n\n*including non-binary, gender-fluid and transgender women. Basically, however your female gender expresses itself, you’re welcome here!\n\n\nDISCLAIMER:\nThe Women’s Health CLARITY podcast is an educational platform that provides information of a general nature only. The podcast’s content is not a substitute for personal, professional medical care and is not intended as health advice for any individual. \n",
        "language": "en",
        "author_name": "Cloe Bunter & Kate Spina",
        "slug": "nobswomenshealth",
        "cover": "20220623_090656_8957322b394603709276923ef6febd22.jpg"
    },
    {
        "podcast_id": 121751,
        "title": "Holistic Health Series",
        "description": "Welcome to the Holistic Health podcast. My name is Sarah Sadeq, a certified Integrative Nutrition Health Coach from the Institute of Integrative Nutrition. This is a podcast that explores health from emotional, spiritual, mental, and physical health. If you have any questions, reach out to me at @embracing_wellbeing on Instagram or click on the contact me  via email at sarah@embracingwellbeing.com ",
        "language": "en",
        "author_name": "Sarah Sadeq",
        "slug": "embracingwellbeing",
        "cover": "20220412_100410_e03604690d21b6025f05ee8034c2ed38.jpg"
    },
    {
        "podcast_id": 122032,
        "title": "Tea with Tia, a podcast about health, nutrition, wellness and everything in between",
        "description": "Join Dr. Tia with your morning cup of tea and lets jump into your gut health. Dr. Tia will cover Ketogenic diet, intermittent fasting, TCM nutrition and Functional Medicine used synergistically to create a healthy microbiome.  ",
        "language": "en",
        "author_name": "Tia",
        "slug": "teawithtia",
        "cover": "20220417_070414_a3cb977895843c2e0c31bd4a40c814ad.jpg"
    },
    {
        "podcast_id": 122261,
        "title": "The weekly running recipe",
        "description": "Food and running...",
        "language": "en",
        "author_name": "Ewan Parker",
        "slug": "weeklyrunningrecipe",
        "cover": "20220415_060407_e909dd5b3586936125fecfef92363c8f.jpg"
    },
    {
        "podcast_id": 126710,
        "title": "A Second Helping Podcast ",
        "description": "Brother and sister team of Good Mood Food UK and JMS Nutrition bring you an original and delicious podcast, where we chew over all things food. From the our favourite recipes and time saving tips in the kitchen to making the food you love work for you and your health goals. ",
        "language": "en",
        "author_name": "Emily & James Sandom",
        "slug": "a-second-helping",
        "cover": "20220506_090558_dd0b5a47ca9c4b9f2923376d94d60267.jpg"
    },
    {
        "podcast_id": 126902,
        "title": "No Country For Healthy Living",
        "description": "Kaylie and Laura are two new Health and Life Coaches, here to help you learn how to reach levels of growth, self love, and connection you never thought were possible! ",
        "language": "en-us",
        "author_name": "Kaylie and Laura",
        "slug": "no-country-for-healthy-living",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 127765,
        "title": "Vida & Veda con Mireya Rodríguez",
        "description": "Vida & Veda es un podcast donde nos acercaremos al mundo de la salud desde un punto de vista holístico. Aprenderemos hábitos más saludables y a cómo acompañar al cuerpo, a la mente y a la emoción, utilizando herramientas como la nutrición, las plantas medicinales y el ayurveda. Hosteado por la nutricionista, naturópata y especializada en Medicina Ayurveda, Mireya Rodríguez Arce, fundadora de la Escuela Alsándara en Telde, Gran Canaria.",
        "language": "es",
        "author_name": "Mireya Rodríguez Arce",
        "slug": "vidayveda",
        "cover": "20220512_030522_03c73221f326fc64d14a2295f3012caf.jpg"
    },
    {
        "podcast_id": 128314,
        "title": "Under the Bougainvillea",
        "description": "A conversational podcast exploring the pursuit of balance, sustainability and happiness in this unstoppable machine that is society and the world.  \n\nIf you choose to follow along, we ask a little bit of patience, a gentle sense of humour and an open mind as we navigate this new phase of life and the expression of that on this platform, with you.\n ",
        "language": "en",
        "author_name": "Lexi & Lourens",
        "slug": "underthebougainvillea",
        "cover": "20220514_040535_2d2e062a5ebf5d42cfc987b6a4f80279.jpg"
    },
    {
        "podcast_id": 128694,
        "title": "OGCG",
        "description": "✨Holistic Women’s services \n🤰🏼Pre-conception, Pregnancy & Postnatal care\n🍼GP Lactation consultant \n🥗 Dietician\n🌈All welcome\nOGCG has five female specialist obstetricians; Dr Jean Wong, Dr Leah Xu, Dr Natalia Khomko, Dr Perri Dyson and Dr Robin Thurman.\nSupporting the obstetricians are Dr Amber Hart (GP lactation consultant & Infant sleep/settling consultant), Robyn Compton (Maternal & Paediatric Dietician) and Aminee Dickenson (Counsellor). \nWe also offer the services of 2 specialist gynaecologists, Dr Harvinder Kaur and Dr Stephen Lee.",
        "language": "en",
        "author_name": "Obstetrics & Gynaecology Consulting Group",
        "slug": "ogcg",
        "cover": "20220519_040507_8b1ec57d515d45da82e386cfb991aaa5.jpg"
    },
    {
        "podcast_id": 129582,
        "title": "CASA VIDA",
        "description": "Centro Agroecológico de Saberes Campesinos, CASA VIDA. Somos un lugar de encuentro, para compartir y tejer saberes, prácticas, pensares y sabores. Es un lugar para  reconocernos, seguir caminando y cuidarnos entre nosotras, nosotros, nosotres, en armonía con la Madre Tierra, las plantas, los animales, el aire, el suelo, el agua y seres sintientes. Aquí la vida campesina dialoga con la agroecología, la economía solidaria, el buen vivir, el ecofeminismo, la salud, la espiritualidad  y la soberanía alimentaria.",
        "language": "es",
        "author_name": "Centro Agroecológico de Saberes Campesinos, CASA VIDA",
        "slug": "casavida",
        "cover": "20220521_060544_e3fce4f05044a697fcf525770c4809a8.jpg"
    },
    {
        "podcast_id": 130356,
        "title": "CORONA WITH LYME",
        "description": "Host Noah Shaffer records a podcast focused on creating awareness for chronic Lyme disease through educational conversations and sharing of personal experiences",
        "language": "en",
        "author_name": "Noah Shaffer",
        "slug": "coronawithlyme",
        "cover": "20220603_120641_336b2fcb944241efb28f89e3ea413bb4.jpg"
    },
    {
        "podcast_id": 130424,
        "title": "Real Talk with OTF HV men",
        "description": "3 men from Orangetheory Fitness came together to bring you a podcast on all things fitness as well as whatever else we decide to get into! These men come with a lot of experience and truly want the people that listen to this podcast to succeed.",
        "language": "en",
        "author_name": "Chad Doyle",
        "slug": "real-talk-with-otf-hv-men",
        "cover": "20220615_090610_8869682c14da4f0b62aa179f5541a26a.jpg"
    },
    {
        "podcast_id": 130611,
        "title": "PUNTOYCOME",
        "description": "<p>Un Podcast sobre la nutrición como es y desde su esencia, sin mitos, sin creencias, sin conflicto de intereses, sin cultura de dieta, SOLO DESDE LA EVIDENCIA.</p>",
        "language": "es",
        "author_name": "Lina Noriega",
        "slug": "puntoycome",
        "cover": "20230223_040205_60933a895d64874bfdfb4ebdce0348da.jpg"
    },
    {
        "podcast_id": 130746,
        "title": "The Relentless Gardener",
        "description": "Welcome to the Relentless Gardner Podcast with Linda Langelo, a Colorado State University Extension Horticulture Agent. In this podcast, we will discuss all things gardening. From the wonderful programs CSU Extension has to specific gardening tips.",
        "language": "en",
        "author_name": "Linda Langelo",
        "slug": "the-relentless-gardener",
        "cover": "20220527_050543_b91998db79afc26be314d18456c78b39.jpg"
    },
    {
        "podcast_id": 130760,
        "title": "Whole Healing Podcast: Mind, Body, & Food",
        "description": "<p>Whole Healing Podcast: Mind, Body, &amp; Food</p>",
        "language": "en",
        "author_name": "THE INC TEAM",
        "slug": "food-fast-podcast",
        "cover": "20230713_090724_1dcc8d9eed327e7d9dc89ededa8f5e70.jpg"
    },
    {
        "podcast_id": 130784,
        "title": "Everything Hurts and I’m Dying",
        "description": "Join Personal Trainer Julia Kraus through her journey of health and fitness from the perspective of someone in the industry who has seen it all. Get ready for witty quips, informative tips and tricks, and deeper musings from weekly guests. \n\nGot a question you want answered? Get in touch at question@ehaid.com",
        "language": "en",
        "author_name": "Julia Kraus",
        "slug": "ehaid",
        "cover": "20220719_090756_d7058f392cd4303c8d5c7c6fc5a84c8a.jpg"
    },
    {
        "podcast_id": 131437,
        "title": "Alimentazione e merceologia ",
        "description": "<p>tecniche di cucina potenzialmente dannose e suggerimenti su come evitarle</p>",
        "language": "it",
        "author_name": "La Nina e il Tè",
        "slug": "laninaeilte",
        "cover": "20230607_060634_ef443a93dc8024ffea797a4221a976ac.jpg"
    },
    {
        "podcast_id": 132818,
        "title": "Woman Unsilenced",
        "description": "In the Sisteration Room It's \"The Conversation\" that serves to listen, heal and empower as we laugh, talk and cry along the way. Whether you are returning from prison, or heading to prison, seeking shelter after domestic abuse or seeking ways to help; you found the right cast of Sisters. Restoration of SELF-WORTH.",
        "language": "en",
        "author_name": "Lonett \"Cookie\" Williams",
        "slug": "womanunsilenced",
        "cover": "20220724_040748_02c46fffc8dd52687ab5d45f19a3708d.jpg"
    },
    {
        "podcast_id": 133428,
        "title": "Labákový Podcast InUPS 📚",
        "description": "Miško a Nika sú nadšení doktorandi, vďaka ktorým sa zamilujete do vedy, výskumu a inovácií aj vy 👩🏼‍🔬 Spolu budeme spoznávať zaujímavosti vo vede 🧪a vyspovedáme mnohých vedcov 🧑🏻‍🔬 Naším mottom je: \"po vedecky, ale stále zrozumiteľne\". Tento podcast vznikol s finančnou podporou projektu InUPS \"Inovačné zoskupenie na podporu udržateľných potravinových systémov\". www.inups.uniag.sk\n",
        "language": "sk",
        "author_name": "Labákový Podcast inUPS",
        "slug": "labakovypodcastinups",
        "cover": "20220610_120624_1409c395fe01b40b4b00804217c06fd5.jpg"
    },
    {
        "podcast_id": 133802,
        "title": "Carnivore Stories",
        "description": "The Carnivore Stories podcast is hosted by Alyssa Groebner and features weekly interviews of people from all over the world telling their own carnivore success stories.",
        "language": "en",
        "author_name": "Alyssa Groebner",
        "slug": "carnivorestories",
        "cover": "20220612_010612_7bb4e0339e743b61527497f9d59ec89a.jpg"
    },
    {
        "podcast_id": 134308,
        "title": "The Dr Rodcast",
        "description": "<p>\"The Dr Rodcast\" with Dr Rodrigo (Rod) Rodriguez-Fernandez is a podcast that connects and unites people from all walks of life to discuss Health and Wellbeing through thought provoking conversations and real life stories. With guest that range from Global Medical Directors of fortune 100 companies to world renown experts. The Dr Rodcast is the answer to the questions “What do doctors talk about at dinner parties? Navigating the smoke and mirrors that make up many of today’s Health and Wellbeing related issues, we cut through the noise to look at the science, while having fun. <a href=\"https://rodcastpodcast.com/\">https://rodcastpodcast.com/</a></p>",
        "language": "en",
        "author_name": "Dr Rodrigo Rodriguez-Fernandez",
        "slug": "rodcast",
        "cover": "20220615_020608_bb0801b030f5987843b4efc708d986ad.jpg"
    },
    {
        "podcast_id": 135490,
        "title": "The Triple F- Fine, Fresh & F**king Fantastic",
        "description": "Hello and Welcome to the Triple F podcast, where you will be dipping your toe into the ambient sounds of my droning voice !\nI will have regular guests, topics and some fun BS where we can talk and provide some good context and hopefully plenty of enjoyment and laughs... much love my people ",
        "language": "en",
        "author_name": "Brad",
        "slug": "triplefpodcastbwanimalistik",
        "cover": "20220620_010648_c865211697f92217eb44397d5e575ca9.jpg"
    },
    {
        "podcast_id": 137068,
        "title": "Wellness in the Multiverse",
        "description": "<p>This is the show where we look at your favorite Superheroes and their lifestyle. How would they achieve their level of fitness? What kind of workout do they have to do to improve and keep saving worlds? We cover everything from fitness, food, stress, and much more, to bring you the most accurate health journey of your heroes.</p>",
        "language": "en",
        "author_name": "Jonathan Gagne",
        "slug": "wellness-in-the-multiverse",
        "cover": "20220627_080637_7075e4b13e2496aa307fa617e151d107.jpg"
    },
    {
        "podcast_id": 137087,
        "title": "Kawfee With Klavi ",
        "description": "Learn about coffee and how to make it a part of your life. Klavier is a coffee enthusiast hoping to help others take their love of coffee to the next level or integrate coffee in a new ways in their life. Klavier loves to educate about coffee and help others find a love of coffee or deepen their passion!",
        "language": "en",
        "author_name": "Klavier Newshan",
        "slug": "kawfeewithklavi",
        "cover": "20220707_020738_e603e8283a9f8b2e950093cdd1b91d48.jpg"
    },
    {
        "podcast_id": 138882,
        "title": "Caffeinated Corner",
        "description": "THIS IS NOT A FITNESS PODCAST - Different guests, engaging conversations.... always fuelled by a cup of the good stuff or a slightly more 'powerful' beverage!! Presented & Hosted by @coach.will.hall",
        "language": "en",
        "author_name": "William Hall",
        "slug": "caffeinatedcorner",
        "cover": "20220918_070910_27b7c431f9132541649ec11ef5156487.jpg"
    },
    {
        "podcast_id": 139113,
        "title": "Healing With Hart",
        "description": "Dr. Martin Hart has earned a reputation for being one of the leading health care providers in the alternative healthcare field. Committed to many more years of excellence, Dr. Hart is a highly trained, board-certified chiropractor and is here to pave the way for  the quality healing and care you have been searching for.",
        "language": "en",
        "author_name": "Dr. Martin Hart",
        "slug": "healingwithhart",
        "cover": "20220707_080729_4088159a8e46cbf4b2dba0057f4420ff.jpg"
    },
    {
        "podcast_id": 139638,
        "title": "The Adapted Strength Podcast",
        "description": "Just here to spread some helpful knowledge.  My goal is to try and bridge the gap between optimal and practical for training in the gym.",
        "language": "en",
        "author_name": "Alex-Andre B Palting",
        "slug": "the-adaptedstrength-podcast",
        "cover": "20220921_050942_17ce555352ca820740a850ae702cb3be.jpg"
    },
    {
        "podcast_id": 139805,
        "title": "Joyful Balance Podcast",
        "description": "Join us (Meera & Denise) on the exciting journey of the brain, mind and body and how they're connected. We provide the human element to understanding the relationship between the three. \nWe will share our personal experience and guidance to enable you to feel less alone in the journey towards healthier relationships with your mind and food, your existence and your everyday self.",
        "language": "en",
        "author_name": "Meera & Denise",
        "slug": "joyfulbalance",
        "cover": "20220713_030723_82b30a0e079b62443d63a85c01136a56.jpg"
    },
    {
        "podcast_id": 140111,
        "title": "ALL THINGS DVN",
        "description": "<p><strong>DVNSLY</strong> is a lifestyle brand for your mind, body and spirit created and founded by Ericka Sloan Dontello. Ericka combined her education in Eastern and Western medicine to create a space and community that empowers everyone to GRW.WELL and BE.WELL in becoming a more healthy version of ourselves.</p><p><strong>DVNSLY</strong> is not just a lifestyle brand but also a therapy and complementary alternative medicine practice.</p><p><em>WE ARE CULTURAL; AND OUR LEGACY IS TO BE OF SERVICE IN HELPING OTHERS REACH THEIR HIGHEST DIVINE SELF. WE ARE DESIGNED FOR ANYONE WHO </em><strong><em>REFUSES TO BE DEFINED</em></strong><em>.</em></p>",
        "language": "en",
        "author_name": "DVNSLY",
        "slug": "divinesly",
        "cover": "20230403_020419_ac3a227f2f106db5443b532c8538e43a.jpg"
    },
    {
        "podcast_id": 142100,
        "title": "Banter and Barbells Podcast",
        "description": "<p>If you feel like you could eat healthier, sleep better, train harder, improve your relationships &amp; level up in all aspects of life, then join me as I meet with several different guests to share back with you. </p><p>Follow Us on IG: https://www.instagram.com/banterandbarbells/</p>",
        "language": "en",
        "author_name": "Joy Himley ",
        "slug": "babesbarbellsandbanter",
        "cover": "20230729_100711_32a2271ba91acd15332b3ab369b6add8.jpg"
    },
    {
        "podcast_id": 144993,
        "title": "Nada Vogt",
        "description": "<p>Podcast Nada Vogt je za žene koje su umorne od osećaja robovanja beskrajnom ciklusu dijeta. Misija ovod podcast-a je da vas oslobodi ograničenja restriktivne ishrane, tako da možete ponovo da uživate u hrani i svom životu. Pridružite mi se u nedeljnim epizodama u kojima prolazimo kroz teme: Kako imati uravnotežen i zdrav odnos sa hranom i izaći iz začaranog ciklusa dijeta. Kako da brinete o svom fizičkom i emocionalnom blagostanju bez stalnog brojanja kalorija ili osećaja krivice zbog izbora hrane. Plus saveti i inspiracija od Nade i njenih gostiju o svim aspektima zdravog života i brige o sebi. Nahranite svoje telo i um, zaljubite se u hranu i osećajte se najbolje u svom telu od sada. Za više informacija posetite: Blog: https://www.nadavogt.com/ Instagram: https://www.instagram.com/nadavogt/</p>",
        "language": "sr",
        "author_name": "Nada Vogt",
        "slug": "nadafitt",
        "cover": "20230324_120331_9c950ed9a3b5fd05a5d9e5572e4a3966.jpg"
    },
    {
        "podcast_id": 145797,
        "title": "Felipe Rodas ",
        "description": "Felipe Rodas is a Fitness trainer and Nutrition coach based in London. With over 7 years of experience in the field of weight training, Fitness Competitions, Nutrition, healthy lifestyle, wellness and Biohacking. Helping people to optimise their health and lifestyle by sharing all his knowledge in this podcast. ",
        "language": "en",
        "author_name": "Felipe Rodas",
        "slug": "feliperodas",
        "cover": "20220814_070800_7f209616ae689501748a8facfad118c3.jpg"
    },
    {
        "podcast_id": 145933,
        "title": "Essence of Health Tea Time",
        "description": "Join Dr. Shayla Toombs-Withers and friends as she spills the tea on all things health, wellness, and plant based nutrition! The Essence of Health is in YOU!\n\nSend inquiries to TeaTimeEOH@gmail.com.",
        "language": "en",
        "author_name": "Shayla Toombs-Withers, DO",
        "slug": "teatimeeoh",
        "cover": "20220816_020800_42e511e1ca252e90be0af852da798440.jpg"
    },
    {
        "podcast_id": 146864,
        "title": "שומן הוא חבר",
        "description": "הגעתם לפודקאסט של עודד טלמור קיטו שף\nבפודקאסט אארח אנשים שאימצו את אורח החיים הקטוגני\nאבל לא סתם קטוגני - קיטו שפוי\nנדבר על השינוי שחוו, על הסיפור האישי ואיך הקיטו שיפר את איכות חייהם",
        "language": "he",
        "author_name": "עודד טלמור",
        "slug": "ketochef",
        "cover": "20220922_040924_b5ebbd157918efaf9558c406473512e0.jpg"
    },
    {
        "podcast_id": 147046,
        "title": "The ATS Podcast",
        "description": "Health and Fitness podcast where we sort out all the noise and break big topics into small manageable chunks. ",
        "language": "en",
        "author_name": "William Brown",
        "slug": "atspodcast",
        "cover": "20220817_090809_e7aafb04515e637299db160acbb38701.jpg"
    },
    {
        "podcast_id": 147563,
        "title": "HŌM Health Podcast",
        "description": "The HŌM Health Podcast is dedicated to elevating your healthy lifestyle with motivational stories, health coaching insight, and inspirational information on all topics related to your well-being; movement, meals, and mindfulness! ",
        "language": "en",
        "author_name": "Jeremy Riesenburger",
        "slug": "homhealth",
        "cover": "20220819_060806_4cba74a4c093997bdb173685893c52eb.jpg"
    },
    {
        "podcast_id": 147853,
        "title": "Coaches Chat",
        "description": "Coaches Cullam and Jane Ross-Davie chat about coaching and different aspects of the CrossFit training methodology. With special guests and thought provoking questions. \nWhat will they say next?!",
        "language": "en",
        "author_name": "Cullam Davie",
        "slug": "coacheschat",
        "cover": "20220821_060857_86193cc9f55359bf05a3ed8b326c68a5.jpg"
    },
    {
        "podcast_id": 147984,
        "title": "Fin à la faim - Nutrition sans Frontières à l'écoute",
        "description": "Marie-France Lalancette, fondatrice de Nutrition sans Frontières, rassemble des professionnels, volontaires et citoyens engagés des quatre coins du monde qui apportent un éclairage et partagent leur vision afin de sensibiliser aux enjeux de nutrition mondiale et promouvoir l'innovation dans la coopération. Ensemble, on met FIN à la FAIM!",
        "language": "fr",
        "author_name": "Nutrition sans Frontières",
        "slug": "fin-a-la-faim",
        "cover": "20220920_030900_4ca1635f560cb979ff60c798a8957c4b.jpg"
    },
    {
        "podcast_id": 148104,
        "title": "Wod's Up at Train Harder CrossFit Podcast ",
        "description": "What happens when you put a bunch of CrossFit Coaches in front of an open microphone? One thing is certain, they will talk about CrossFit! From coaching to being an athlete in class, no subject is off the table. Special guest appearances from gym members as well. We are CrossFitters just like you! Let's talk about Wod's Up at Train Harder CrossFit  ",
        "language": "en",
        "author_name": "Joe Thiede",
        "slug": "wodsupattrainharder",
        "cover": "20220822_010845_14e9a64d35dbef6bb63a66b1a30dd296.jpg"
    },
    {
        "podcast_id": 148426,
        "title": "The BC Messenger",
        "description": "The BC Messenger is a monthly publication and podcast which summarizes and highlights the work of The Biblical Chronologist (BC) in simple, layman's terms. Each month includes a collage of topics focused on and relating to the research work of Dr. Gerald Aardsma, along with a peek behind-the-scenes. The BC Messenger aims to keep busy individuals informed about life-impacting BC research and discoveries.",
        "language": "en",
        "author_name": "Steve and Jennifer Hall",
        "slug": "bcmessenger",
        "cover": "20220823_090806_047261f557714ce39060d301aa5f3fff.jpg"
    },
    {
        "podcast_id": 149349,
        "title": "Purely Nourished Podcast",
        "description": "<p>This podcast was created for recreational outdoor athletes &amp; active people who want to level up their performance and optimize their health. Join Amanda Fitt, Clinical Nutritionist, rock climber, and functional nutrition wizard for conversations on performance sports nutrition, gut health, hormone optimization, and SO much more. This podcast will provide you with evidence-based nutrition information so you can improve your athletic performance, enhance your health, and take charge of your own wellbeing.</p>",
        "language": "en",
        "author_name": "Amanda Fitt, MS, CN",
        "slug": "purelynourishedpodcast",
        "cover": "20230722_090754_8b8accec217e75d6686a538b2bfc89d8.jpg"
    },
    {
        "podcast_id": 150191,
        "title": "The HealthCast",
        "description": "<p>Powered by GlobMed.</p><p>Welcome to the HealthCast, where healthcare professionals and experts from the UK and worldwide discuss all things healthcare - providing world class insights from the best in medicine.</p><p>For inquiries, contact us at <a href=\"mailto:contact@globmed.co.uk\">contact@globmed.co.uk</a></p>",
        "language": "en",
        "author_name": "Luise Hasse and Marilee Smith",
        "slug": "thehealthcast",
        "cover": "20230314_010319_08ee170feaf14268c205d5439b807a18.jpg"
    },
    {
        "podcast_id": 150386,
        "title": "Chronic Confidence Academy",
        "description": "Our weekly zoom sessions covering everything from food to communication to life hacks. Those who listen to these recordings achieve far better results! \n\nIf you have any questions, please reach out to your coach!",
        "language": "en",
        "author_name": "Michelle Amato",
        "slug": "ccacoaching",
        "cover": "20220906_110955_eba13e8d0fa3b34e22c4535c06c6af81.jpg"
    },
    {
        "podcast_id": 151292,
        "title": "Call Fit Radio",
        "description": "Call Fit Radio!",
        "language": "en",
        "author_name": "Callum Lambie",
        "slug": "callf",
        "cover": "20221224_071222_b573391628b003b993d508c3f0d3e1c0.jpg"
    },
    {
        "podcast_id": 151573,
        "title": "The Mental Re-Rack",
        "description": "All things fitness and mental heath.",
        "language": "en",
        "author_name": "Marie Butler",
        "slug": "thementalrerack",
        "cover": "20220906_070905_68cfa14f7365df9a99409ec491f84b6b.jpg"
    },
    {
        "podcast_id": 152002,
        "title": "Jezte s rozumem SPECIÁL",
        "description": "<p>Jezte s rozumem, to je oblíbený pořad z produkce Radia Čas, který se věnuje tématům z oblasti zdravého jídla, stravování, zdravého životního stylu a hubnutí. Moderátorka Eva Rigler je propagátorkou racionálního stravování a taky vášnivou kuchařkou. Pořad pro všechny, kterým není jedno, co jedí! Nyní i on-line prostřednictvím oblíbených stremovacích platforem.</p>",
        "language": "cs",
        "author_name": "Radio Čas",
        "slug": "jezte-s-rozumem",
        "cover": "20230817_110851_3b4fa4d06e23df9a6511f89d7270bbb4.jpg"
    },
    {
        "podcast_id": 152558,
        "title": "Ryan Bigelow and Adam Gates Fitness Knowledge ",
        "description": "Ryan Bigelow and Adam Gates share their love and knowledge for fitness from their past experience of interviewing prep coaches, doctors and many other fitness experts!",
        "language": "en",
        "author_name": "AR 15 A Week",
        "slug": "ar15weekly",
        "cover": "20220924_040907_4e5248c847107c6e46a8728b5409a868.jpg"
    },
    {
        "podcast_id": 152895,
        "title": "Sade Düşün",
        "description": "\n                                    Sade bir yaşam sizin için ne ifade eder? Her şeyden uzakta kalmak mı? Yoksa her\n                                    şeyin tam ortasında olmak mı? Kim bilir belki yepyeni, hem sağlıklı, hem aktif, hem\n                                    dengeli hem de esnek bir sade yaşam mümkündür?\n                                ",
        "language": "tr",
        "author_name": "Nilüfer Yıldırım",
        "slug": "sade-dusun",
        "cover": "20221003_061040_3178ddc8571cc4743c461869ae65a0b1.jpg"
    },
    {
        "podcast_id": 153436,
        "title": "The Health Revolution",
        "description": "Clive de Carle our leading light in natural health and Tesla frequency. \n\n https://secrethealth.com\nhttps://brandnewtube.com/@clivedecarle\nhttps://www.bitchute.com/channel/GzmkINfAzghP/\nhttps://odysee.com/@ClivedeCarle:1\nhttps://rumble.com/c/CliveDeCarle\n\nwww.clivedecarle.com\n\n",
        "language": "en",
        "author_name": "Clive de Carle",
        "slug": "clivedecarle",
        "cover": "20220914_040910_1f62227dcba8f5cdcfa1f6ff7220b1ec.jpg"
    },
    {
        "podcast_id": 153926,
        "title": "The Doctor The Therapist and The Coach",
        "description": "Anything goes in this unique podcast series from YO1 Radio as we bring together our host and lifestyle coach, Gemma Taylor, together with Dr Angela Wright and Therapist Colette Safhill for a no-holds-barred conversation on a whole range of topics and how they impact on our lives.\n\nIf you’d like to get involved with a contribution, comment or feedback on any of the episodes – or if you’d like to suggest a topic for a future episode, just send the team an email to dtc@yo1radio.co.uk",
        "language": "en",
        "author_name": "YO1 Radio",
        "slug": "yo1radio",
        "cover": "20220916_060937_1b42a0a9fd27c6679a3ed6e9d54b101a.jpg"
    },
    {
        "podcast_id": 155112,
        "title": "The Real Angie Perez Podcast",
        "description": "I'm taking you on my journey of health, mindset and making dreams come true. I'll introduce you to people who have influenced my life in a positive way and share stories of inspiration that will motivation you to make your own dreams come true! ",
        "language": "en",
        "author_name": "Angie Perez",
        "slug": "therealangieperez",
        "cover": "20221012_011056_4c17df4f9a4bf35e9d0089914d80999e.jpg"
    },
    {
        "podcast_id": 156284,
        "title": "Voice Notes Unscripted",
        "description": "Do you love delving down those magical rabbit holes about all things productivity, gym and nutrition-related? Then you have come to the right place. Join the conversation between two of your mates.\n\nVoice notes unscripted started between a client and his coach sending copious voice notes back and forth over WhatsApp. Each message had a nugget of wisdom found by prying into the process of trying to optimise performance, lifestyle and productivity. After a while, it dawned upon us. We need to share our findings and explorations with others. Voice notes unscripted is the definition of a passion project.",
        "language": "en",
        "author_name": "Stuart Tufft & Rory Halliday-Stokes",
        "slug": "voice-notes-unscripted",
        "cover": "20220927_050918_0a0cf458215ce4b77ad5fc7c9605a13a.jpg"
    },
    {
        "podcast_id": 156495,
        "title": "NA OBISKU ",
        "description": "NA OBISKU je serija podkastov v produkciji Slovenskega združenja bolnikov z limfomom in levkemijo, L&L. Zainteresiranim javnostim skozi sproščen pogovor predstavljamo zanimive posameznike - bolnike, zdravnike, medicinske sestre in ostale strokovnjake in partnerje ter njihova atraktivna medicinska in raziskovalna področja. \n\n",
        "language": "sl",
        "author_name": "Združenje L&L ",
        "slug": "naobisku",
        "cover": "20221007_101020_be0b058926022a2a83cdeee6688f7b4c.jpg"
    },
    {
        "podcast_id": 156980,
        "title": "Unlocked Podcast",
        "description": "<p>Host: Welcome to \"The Unlocked Podcast\" - your go-to source for holistic living, fitness, nutrition, health, and unlocking the potential within you. I'm your host, Coach Kate Markel, and I'm thrilled to embark on this transformative journey with you.</p><p>Host: In a world filled with constant distractions and demands, it's easy to lose sight of what truly matters – our well-being. But here, on \"The Unlocked Podcast,\" we believe in the power of holistic living to create a harmonious balance in every aspect of our lives.</p><p>Whether you're seeking guidance to nourish your body, strengthen your mind, or find inner peace, this podcast is designed to unlock the secrets to a healthier, happier, and more fulfilled life.</p><p></p><p>Each week, we'll dive deep into a variety of topics, ranging from fitness routines that ignite your energy and transform your physique, to nutrition strategies that nourish you from the inside out. We'll explore the latest scientific breakthroughs and timeless wisdom from experts in the field, all aimed at empowering you to make informed choices for your well-being.</p><p></p><p>But \"The Unlocked Podcast\" is more than just a resource for physical health. We believe in a holistic approach, encompassing mental, emotional, and spiritual well-being. We'll tackle subjects like mindfulness, stress management, personal development, and so much more, to help you unlock the full potential of your mind and soul. Learn through others' stories of how they went confined in their own mind to unlocked and set free!</p><p></p><p>So, whether you're a fitness enthusiast, a health-conscious individual, or someone looking to find a path to greater vitality, this podcast is here to serve you. We'll provide you with practical tips, inspiring stories, and thought-provoking conversations, all geared towards helping you live your best life.</p><p></p><p>I am honored to be your guide on this incredible journey of transformation. Together, we'll uncover the keys to unlock your true potential and live a life of abundance, joy, and purpose.</p><p></p><p>Get ready to unlock the door to a better you. Welcome to \"The Unlocked Podcast\"!</p>",
        "language": "en",
        "author_name": "Katie Markel",
        "slug": "sheeats",
        "cover": "20220930_060935_7f1ec29d1f938e018ee75267a3201014.jpg"
    },
    {
        "podcast_id": 157215,
        "title": "Rebel Wellness",
        "description": "<p>Welcome to Rebel Wellness, the podcast that shatters stereotypes and empowers women to reclaim their health and well-being. Join us as we unravel the mysteries of the health, nutrition, and fitness worlds with a well-rounded perspective that comes from over a decade of professional experience. No more conflicting advice or unrealistic expectations. We dig deep into the latest research and expert insights to provide you with practical, evidence-based strategies to nourish your body, mind, and spirit. Get ready to challenge societal norms, break free from societal pressures, and embrace your unique journey towards holistic wellness. It's time to rebel against the status quo and embark on a transformative wellness adventure with your host, Kaileigh, here on Rebel Wellness.</p>",
        "language": "en",
        "author_name": "Kaileigh Lauren (Coach Kailes)",
        "slug": "rebelwellness",
        "cover": "20230608_090606_6281c7c7d17aad6514f447e20d047412.jpg"
    },
    {
        "podcast_id": 157402,
        "title": "The Guide To Wellness",
        "description": "<p>The Guide To Wellness podcast has been born from the skin care company Honey Health And Wellness. In order to heal and reach our full potential, we need to look at our lives holistically. This podcast opens the door to expansive conversations in order to help you understand your mind, body and soul. Join me for a weekly episodes chatting with people who inspire, educate and motivate me.</p>",
        "language": "en",
        "author_name": "Marissa Otis",
        "slug": "honeyhealthandwellness",
        "cover": "20230315_040312_d91bee76d42c12c06b149617296b1021.jpg"
    },
    {
        "podcast_id": 157646,
        "title": "Kick it with Kira",
        "description": "A health and wellness series hosted by Kira Russell, a fitness instructor in medical school. Kick it with Kira uses scientific research to dissect hot topics in health and provide easily understood information for the average listener.",
        "language": "en",
        "author_name": "Kira Russell",
        "slug": "kick-it-with-kira",
        "cover": "20221003_041058_fd701d4958bbf880d521d9580999bb4e.jpg"
    },
    {
        "podcast_id": 158228,
        "title": "Overall Package Podcast",
        "description": "All Things Bikini.\nIntroducing the Overall Package Podcast!\nHosted by Gabby, Ash and Alison.\nThe place to tune in for all things bikini, alongside highlighting aspects of all divisions of female bodybuilding!\n\nEpisodes will cover every aspect of the sport: from personal experiences as Canadian Physique Alliance bikini athletes, listener Questions and Answers, highlighting Canadian athletes, interviews with selected athletes and coaches, and covering topics on all things prep, show-day, and post show.\nFind us on Instagram: overallpackagepodcast, gabriellefoglietta, ashtronautt_fit, alisonannefitness",
        "language": "en",
        "author_name": "Gabrielle Foglietta, Ashley Gagnon, Alison Anne Walker",
        "slug": "overallpackagepodcast",
        "cover": "20221010_031056_0d43e73a415090f80df6faf457caafac.jpg"
    },
    {
        "podcast_id": 158300,
        "title": "Clean Beauty Over Coffee",
        "description": "Clean Beauty over Coffee is a sit-down chitchat about all things natural and clean with regards to lifestyle and wellness. We are three culturally diverse women with a passion for healthy lifestyle, and above all, want to invite regular women such as ourselves to feel included in our discussions on various clean beauty topics. We will also be featuring guests and experts in different fields.",
        "language": "en",
        "author_name": "Marie, Doris & Rosie",
        "slug": "cleanbeautyovercoffee",
        "cover": "20221005_081026_e3ff6d786e8a5d3163e60901608e6349.jpg"
    },
    {
        "podcast_id": 158367,
        "title": "The Flextalk Podcast ",
        "description": "Lex Jaramillo is a Personal Trainer, Coach and Entrepreneur with over a decade of experience in the fitness industry. Brian Busalacci is also an entrepreneur, business coach and has worked in fitness industry for over a decade as well. The Flextalk Podcast shares inspiring and motivating perspective to get your mind right so you can crush your fitness & health goals daily- unlock your inner greatness and live your best life! ",
        "language": "en",
        "author_name": "Lex Jaramillo & Brian Busalacci ",
        "slug": "flextalk",
        "cover": "20221013_051031_f06c3e46e335ef25ed546c148a01cc3b.jpg"
    },
    {
        "podcast_id": 158449,
        "title": "The Food Freedom Life Podcast",
        "description": "<p>The Food Freedom Life Podcast is your go-to place for the down low on how to stop binge and emotional overeating, make peace with food and feel at home in your body. Join Registered Dietitian Brittany Allison each week in this inspiring, real and educational show that will help you transform your mind and regain trust around food. Learn more at brittanyallisonrd.com</p>",
        "language": "en",
        "author_name": "Brittany Allison",
        "slug": "thefoodfreedomlife",
        "cover": "20230427_040404_8661dfa910a3e1dbc2ba0136edd16f6e.jpg"
    },
    {
        "podcast_id": 158503,
        "title": "Hormone Healing | Migraines, Birth Control, Mood Swings, Fertility, Periods, Libido ",
        "description": "<p>Do you wish you could finally have a regular period? Are you scared to tell your doctor about your mood swings, hormonal acne, and heavy periods for fear that you’ll be told to try another kind of birth control? What about the constant headaches and mood swings that you deal with every day?</p><p>Well, girl, I am so excited you’re here!</p><p>In this podcast, you will learn how to regulate your period naturally, decrease mood swings (yes, even postpartum!), eliminate headaches, and enjoy sex again!</p><p>I’m Dominique, a mom, military wife, daughter of Jesus, and women’s hormone specialist! I remember a time when I suffered with the worst period cramps and migraines. Then, after my first daughter, I suffered from postpartum depression. However, I did not want the new form of birth control that everyone told me to try. I wanted to get to the root cause of my problems and not just slap a “band-aid” on them. So I went back to school (yes with a new baby and a toddler) for my Master of Science in Nutrition Sciences with my focus in women’s hormones.</p><p>I learned how to heal my hormones and created a plan that was easy, natural, and doable because that’s what I needed as a busy mom of littles. And now I’m ready to share everything I’ve learned with you.</p><p>If you are ready to finally get to the root cause of your period problems, mood swings, and lack of sex drive, then grab your notebook and pen (or crayon if that’s all you can find), your beverage of choice, and get ready to listen in!</p><p>Website: <a href=\"http://Hormonehealing.org\">Hormonehealing.org</a></p><p>Email: <a href=\"mailto:hormonehealing1@gmail.com\">hormonehealing1@gmail.com</a> </p>",
        "language": "en",
        "author_name": "Dominique | M.S. Nutrition, Holistic Hormone Coach, NASM-CPT",
        "slug": "holistic-healing",
        "cover": "20230504_110510_a1b45d3bcc49b1a86c0eb7e8430c9f8f.jpg"
    },
    {
        "podcast_id": 159464,
        "title": "StellaLife Podcast ",
        "description": "Listen to interviews with Dental Influencers who improve and save lives. Understand the impact of periodontal disease on overall health and novel approach to pain management in dentistry.  Implement solutions to reduce dependence on opioids and introduce the benefits of StellaLife to enhance the healing and long-term health of our patients.   StellaLife® is a biotech company on a mission to improve people’s lives by offering innovative, natural products to accelerate the healing process while also helping to relieve pain as well as reducing the need for opioids. ",
        "language": "en",
        "author_name": "StellaLife Inc",
        "slug": "stellalife",
        "cover": "20221011_041000_e6c0ee21da5f0e6db87419a060ce0d8f.jpg"
    },
    {
        "podcast_id": 159811,
        "title": "Child Health Pedia",
        "description": "New Podcast Alert! Child Health Pedia !\nOur new pediatric & parenting podcast with Dr. Amulya Mysore, Consultant Pediatrician & Child Development Specialist. The podcast would mainly focus on latest updates in pediatrics, tips for parents, latest medical procedures, rare cases of pediatrics, treatments for children and many more informational discussions. The podcast would also be hosting many guest speakers and one-on-one discussions which would have great insights and provide valuable knowledge to all.",
        "language": "en",
        "author_name": "Rainbow Children's Hospital",
        "slug": "rainbowhospitals",
        "cover": "20221013_051040_94e95537196504d57b9d2749fa9e4c1d.jpg"
    },
    {
        "podcast_id": 160167,
        "title": "Lo Importante de Empezar",
        "description": "Empecemos con cambiar nuestra mentalidad y vamos juntos a evolucionar",
        "language": "es-mx",
        "author_name": "VICTOR NEDA",
        "slug": "vfearlessradio",
        "cover": "20221013_071049_1b559b39b66259323ea166e3fe572068.jpg"
    },
    {
        "podcast_id": 162089,
        "title": "The MetPro Method",
        "description": "Unlock the power of your metabolism with MetPro. MetPro specializes in helping people get “unstuck” in their aspirations to become healthier, better versions of themselves. Hear from MetPro coaches who’ve helped thousands of people transform their bodies using Metabolic Profiling, and other industry-leading experts in nutrition, fitness, and wellness. This question of “what will work for me” is what the team at MetPro is solving. MetPro is the first-ever evaluation-based system. Using coaching and metabolic science, MetPro helps people transform their bodies by hacking their metabolism. The health and fitness space is a noisy world. It’s beyond difficult, and often frustrating, to find the ‘right’ answers about what foods, exercises, or strategies will work best for you. Many of us try everything in the book ending right back where we started. The MetPro Method podcast will provide you with honest answers to the most challenging questions about fitness, metabolism, and weight loss. We’ll help you break through weight loss barriers. We’ll give you tips and tricks to living a happier, healthier, more active lifestyle. And most of all, our promise to you is no gimmicks, fad-diets, or false promises, just the truth about transforming.",
        "language": "en-us",
        "author_name": "Crystal OKeefe",
        "slug": "the-metpro-method",
        "cover": "20221101_041121_e61542b5ed366b5bf617ea4939220f3d.jpg"
    },
    {
        "podcast_id": 163771,
        "title": "PODCAST ALCATRAZ FITNESS A FAMILY GYM",
        "description": "Podcast de Salud, Nutrición, Bienestar físico y emocional, Fitness, Inclusión, Familia y Acondicionamiento Físico.",
        "language": "es",
        "author_name": "Alcatraz Fitness a Family Gym",
        "slug": "alcatrazfamilygym",
        "cover": "20221028_091020_69dd195cf3f30c98b887b58116521d37.jpg"
    },
    {
        "podcast_id": 164253,
        "title": "Coaches and the couch ",
        "description": "<p>2 coaches (and a couch) covering everything health and fitness related. We bust training and nutrition myths to help you understand whats actually important to get you the results you want! Enjoy and please leave feedback :)</p>",
        "language": "en",
        "author_name": "Harry & Fraser",
        "slug": "coachesandthecouch",
        "cover": "20230418_070447_9ae4f2ef51226902b0f44ddde0114ffb.jpg"
    },
    {
        "podcast_id": 164399,
        "title": "Welcome to Breast Talk with Bev and Liv, where we are with you from diagnoses to FOREVER!",
        "description": "Breast Talk is brought to you from Pink Ribbon Boutique in Fort Smith, AR. ",
        "language": "en",
        "author_name": "Breast Talk",
        "slug": "breasttalk",
        "cover": "20221031_101053_59ec3244772278eebcaf7721b0d36b19.jpg"
    },
    {
        "podcast_id": 164706,
        "title": "My Voice",
        "description": "My thoughts on all subject matter. ",
        "language": "en",
        "author_name": "Kate French",
        "slug": "katefrench-myvoice",
        "cover": "20221101_081128_bb277f3932280c0770dea6abe5885c2d.jpg"
    },
    {
        "podcast_id": 165070,
        "title": "TheValiyevShow",
        "description": "Elit Performans, Liderlik, Kouçinq, Sahibkarlıq.",
        "language": "az-az",
        "author_name": "ismayil valiyev",
        "slug": "thevaliyevshow",
        "cover": "podcast_cover.jpeg"
    },
    {
        "podcast_id": 166618,
        "title": "מדיקו פודקאסט - Medico Podcast",
        "description": "מדיקו פודקאסט - Medico Podcast",
        "language": "he",
        "author_name": "Medical Online",
        "slug": "medico",
        "cover": "20221109_111108_6fe310b7e4a378525f33690766929a55.jpg"
    },
    {
        "podcast_id": 167503,
        "title": "Fit Life Academy",
        "description": "<p>Here to help women break-up with yo-yo dieting, find food freedom, and fall in love with fitness as an act of self-care.</p>",
        "language": "en",
        "author_name": "Mallory King",
        "slug": "fitlifeacademy",
        "cover": "20221112_111113_6873a1d6c3419936ad98e6cd9f71f2ce.jpg"
    },
    {
        "podcast_id": 167853,
        "title": "DAMIHOW Podcast ",
        "description": "Join us as we sit down with different Sports/Fitness Professionals to discuss their journeys, inspirations & advice. We wanted to create a platform where we can discuss all things health and fitness.\nThe goal has always been to be help you #FeelConfidentInFitness and this platform will help us explore all the areas you may be unsure about. \n\nFollow us on instagram - https://www.instagram.com/damihow\nShop our Activewear - https://www.damihow.com\n\nDon't forget to like and subscribe! \n\nThank you for watching #FeelConfidentInFitness",
        "language": "en",
        "author_name": "DAMIHOW",
        "slug": "damihow",
        "cover": "20221114_111143_052cd3591e53104e892f4d10e82554a9.jpg"
    },
    {
        "podcast_id": 168744,
        "title": "Visceral: Listen to Your Gut",
        "description": "Visceral: Listen to Your Gut features the latest research updates and treatment options on specific digestive diseases. Episodes are presented by the physician-scientists and experts at the University of Chicago and feature compelling patient stories. \n\nPodcast episode topics include pediatric Crohn’s disease; risk and prevention of GI cancer; hepatology and liver disease; the microbiome and gut health; surgical treatments for ulcerative colitis, and the intersection of diet, nutrition, and GI health.",
        "language": "en",
        "author_name": "GI Research Foundation",
        "slug": "visceral",
        "cover": "20221117_101127_3922e06bf4f94442a1d5e25cd9a81f85.jpg"
    },
    {
        "podcast_id": 170692,
        "title": "THRIVE with Sarah Davidson-James",
        "description": "All things PCOS, balancing your hormones, and other topics to help you THRIVE and live life to the fullest! This podcast will give you the roadmap needed to transform your health.\nSarah is a certified Personal Trainer, Nutrition Coach, and Wellness Coach... But before all of that she was diagnosed and struggled with two chronic illnesses (Hashimoto's hypothyroidism and PCOS). She knows what it's like to be at your lowest point and is here to teach you the skills you need to completely transform your health and life.\nInstagram/TikTok/Youtube - sarahdavidsonjames",
        "language": "en",
        "author_name": "Sarah Davidson-James",
        "slug": "sarahdavidsonjames",
        "cover": "20221127_041155_1d176d88a097676f3ba13f75ac54d741.jpg"
    },
    {
        "podcast_id": 171820,
        "title": "More Reps: Training & Lifestyle Podcast",
        "description": "\nWelcome to the More Reps Podcast with Kwbana Beckles & Chadwick Brown where we cover everything from fitness, training, current events, life and a plethora of other topics!\nFollow us on:\nInstagram: @morerepspodcast\nTikTok: @morerepspc\nYouTube: @morerepspodcast\nEmail: morerepspc@gmail.com",
        "language": "en",
        "author_name": "Kwbana Beckles & Chadwick Brown",
        "slug": "morereps",
        "cover": "20221211_111236_a1786149c54204aac9ed9ab9b74848ad.jpg"
    },
    {
        "podcast_id": 172041,
        "title": "Mārtiņš Bidiņš RUNĀ",
        "description": "Mārtiņš Bidiņš ir uztura treneris",
        "language": "lv",
        "author_name": "Mārtiņš Bidiņš",
        "slug": "martinsbidins",
        "cover": "20221202_021225_14d36d383ddad7972c52a577015b2323.jpg"
    },
    {
        "podcast_id": 173331,
        "title": "Mentes de Hierro",
        "description": "<p>David Carrasco y Felipe Da Silva se juntan para dar una visión diferente al mundo del fitness, del desarrollo y el crecimiento personal. Los invitados, de varios ámbitos, hablarán de sus experiencias de vida y te sorprenderán con sus historias. </p><p>Cada dos martes a las 12 del mediodía, no te lo pierdas! </p>",
        "language": "es",
        "author_name": "Mentes de Hierro",
        "slug": "mentesdehierro",
        "cover": "20230912_120951_bb9c44977af2babcb1d2cad1c96bdf72.jpg"
    },
    {
        "podcast_id": 173405,
        "title": "Martinas Bidinas KALBA",
        "description": "Martinas yra mitybos treneris",
        "language": "lt",
        "author_name": "Martins Bidins",
        "slug": "martinas-bidinas-kalba",
        "cover": "20221209_101229_21b80b45be3e5c80e5d075e5c73e92ef.jpg"
    },
    {
        "podcast_id": 174455,
        "title": "Goodness Inside Out",
        "description": "Welcome to the Goodness Inside Out podcast. \nHelping you find your best self from the inside and out. Combining nutrition science and mindset coaching to unlock your full potential with a non-diet approach to food, body, and movement. ",
        "language": "en",
        "author_name": "Alexandra Chicoine",
        "slug": "goodnessinsideout",
        "cover": "20221222_011213_25145ade1e99c811f1983a2fc6bdef6e.jpg"
    },
    {
        "podcast_id": 175018,
        "title": "Chasing the God Shot",
        "description": "Introducing \"Chasing the God Shot\" - a new show that explores the personal stories of people and their first experience with a God Shot. In each episode, we will hear from a different person as they recount their tale of finding the perfect cup of coffee. From the aroma and flavor, to the atmosphere and company, each story will be unique and truly special. Join us on our journey to discover the best coffee the world has to offer.",
        "language": "en",
        "author_name": "Bubba Hernandez",
        "slug": "godshot",
        "cover": "20230108_080134_93e750c87fcd57f9874030c24e82a8ed.jpg"
    },
    {
        "podcast_id": 175673,
        "title": "V-losophie",
        "description": "Podcast rund um das Thema Veganismus und der Philosophie dahinter.",
        "language": "de",
        "author_name": "Steinente",
        "slug": "vlosophie",
        "cover": "20221221_021227_2f0f3831b06a9bfa4320c8ab96987652.jpg"
    },
    {
        "podcast_id": 175947,
        "title": "The Diabeto Show ",
        "description": "Welcome to the Diabeto Show hosted by Riley Williams. This podcast is about the ins and outs of health and fitness, my journey with T1D and talking with small business owners and asking them questions on their business and what has went into it. New episodes drop on Mondays. Enjoy. ",
        "language": "en",
        "author_name": "Riley Williams",
        "slug": "thediabetoshow",
        "cover": "20221223_051241_18724a92f178a275367ec36fb85c8b6c.jpg"
    },
    {
        "podcast_id": 176575,
        "title": "🐥 Radio Pollito 🐇 ",
        "description": "Bienvenidos a Radio Pollito. 🐣 \n\nEs una serie de 21 cápsulas radiofónicas que hablarán sobre la alimentación infantil en la segunda infancia la duración de cada cápsula es de 4:40 seg. Los conductores serán Pollin P. Chuga y Con Lechuga.\nEn ellas vamos a poder entrevistar a diferentes alimentos como: al chocolate, la hamburguesa, la leche, la tortilla, el chile, el frijol, el refresco y al Dr. Filete. \nRealizaremos la preparación de platillos divertidos y fáciles, diremos cuentos, fabulas, chistes, adivinanzas, realizaremos preguntas a polloamigos, diremos algunos top 5 de interés y revelaremos algunos mitos sobre los alimentos. \n\n 🐥 Come nutritivo con alimento divertido 🐰 ",
        "language": "es",
        "author_name": "Alejandro Maldonado Orduña ",
        "slug": "radiopollito-6-donhamburgueso",
        "cover": "20230118_100112_d4eec9d2a15befd71630e08b04c0b53a.jpg"
    },
    {
        "podcast_id": 179977,
        "title": "Proactive People's Health",
        "description": "Hello and welcome to my new podcast, I'm so happy you're here! Two years ago I was diagnosed with endometriosis, which took me down a health spiral that's grown my love for wellness and nutrition SO much. I've learned a lot along the way that I want to share and encourage others with, because we all deserve to live happy, healthy lives! Join me every episode to learn something new and talk about the one thing we can all work on: being proactively healthy!",
        "language": "en",
        "author_name": "Solen Aref",
        "slug": "proactivepeopleshealth",
        "cover": "20230112_040120_bc5248ea652861e460d2bba44333618e.jpg"
    },
    {
        "podcast_id": 181729,
        "title": "The Collective",
        "description": "Chris Perry (Owner of Die Trying LLC) and Mike White (Owner of Grey Matter Training) discuss all topics surrounding bodybuilding, fitness, and life ",
        "language": "en",
        "author_name": "Christopher Perry",
        "slug": "the-collective",
        "cover": "20230122_120111_23940d222b98192db14946c59f1c10b6.jpg"
    },
    {
        "podcast_id": 182602,
        "title": "Fitness Unravelled",
        "description": "Hey, I'm Jess and this is Fitness Unravelled!\n\nThe goal of this podcast is to motivate, educate and unravel the confusing online health and fitness space. \n\nMost people feel like they have to give up their social lives in order to achieve their fitness goals. \n\nI help people transform their bodies by staying consistent with their diet and exercise, getting them results without sacrificing areas that are important to them.",
        "language": "en",
        "author_name": "Jess Lockwood",
        "slug": "fitnessunravelled",
        "cover": "20230122_110103_4f46fa7131455d80ef358741340dbf7d.jpg"
    },
    {
        "podcast_id": 183569,
        "title": "The Art Of Growth Cast! A Podcast by Felix Steigerwald & Lisa Marie Seelmann",
        "description": "Hallo und herzlich willkommen zu unserem Podcast \"The Art Of Growth Cast\"!\n\nWir möchten dich mit unserem Podcast in die Welt des Bodybuilding mitnehmen. In den folgenden Episoden werden wir über die verschiedenen Themen, wie beispielsweise Training und Ernährung, reden und in diesem Zusammenhang auch auf viele wichtige Punkte näher eingehen. Mit unseren Folgen möchten wir dir einen Einblick in unsere eigenen Erfahrungen geben und offenstehende Fragen klären.\n\nWie es zu \"The Art Of Growth Cast\" kam und wer wir sind, erfahrt ihr in der ersten Episode!\n\nFelix und Lisa",
        "language": "de",
        "author_name": "Felix und Lisa",
        "slug": "theartofgrowthcast",
        "cover": "20230125_060157_7b5b45f01405a0d23de5474b526be224.jpg"
    },
    {
        "podcast_id": 183833,
        "title": "De Spotkast",
        "description": "Alles over training, voeding en leefstijl van bodybuilders, door Jay Whey en Jelle Starreveld",
        "language": "nl",
        "author_name": "Jay Whey & Jelle Starreveld",
        "slug": "despotkast",
        "cover": "20230128_020121_a1fa046a0904b0c558b1196bf2e07138.jpg"
    },
    {
        "podcast_id": 183943,
        "title": "Adaptations Podcast",
        "description": "Your body adapts to your lifestyle. So if you want a new body... just change your lifestyle. Easy right? Welcome to the Adaptations podcast! Adaptations is all about changing your life through habit change and this podcast is here to help reach your goals! My goal is to bring people in fitness and share their stories to help inspire, support, or entertain you on your journey in the fitness space!",
        "language": "en",
        "author_name": "Jorge Diaz",
        "slug": "adaptationspodcast",
        "cover": "20230127_120127_91bbb1ca46ed35149c6fa529ca79d547.jpg"
    },
    {
        "podcast_id": 184914,
        "title": "Fueling Success: An Athlete’s Story",
        "description": "Hi! My name is Derek and I'm a Board Certified Sports Dietitian and Certified Strength & Conditioning Coach. I have had the privilege of working with hundreds of elite athletes over the years, and have come across some AMAZING stories.\n\nBecoming a D1 or Professional athlete is NOT easy by any means! Yet so many young athletes want it so badly. And that's why I started this Podcast! 😄\n\nThis podcast will share the stories and insights of Division I and Professional athletes, including what they did to get to this level, the role of nutrition in fueling their success, and the obstacles they faced. The goal of \"Fueling Success: An Athletes Story\" is to entertain listeners and provide valuable lessons that will help young athletes improve their chances of playing at the next level 💪🏼 \n\nNew episodes each week!! 😁",
        "language": "en",
        "author_name": "Derek Lipton MS RD CSSD CSCC",
        "slug": "fueling-success",
        "cover": "20230206_060205_5f0880dc08b32ca0157c4badde8b678a.jpg"
    },
    {
        "podcast_id": 186111,
        "title": "Denali Lord Nutrition & Wellness",
        "description": "This podcast is designed to discuss topics in wellness, nutrition, fitness, sleep, health, and mindset. It is designed to empower you to live your best life. ",
        "language": "en",
        "author_name": "Denali Cristen Lord",
        "slug": "denalilord",
        "cover": "20230203_030209_41e14168ee115dccf0c2bbbdaeed7b1d.jpg"
    },
    {
        "podcast_id": 186195,
        "title": "Lev deg frisk podden",
        "description": "<p>Lev deg Frisk podden er en spennende utdypning innen helse og hvordan det er å leve sunt. Podcasten arrangeres av Fredheim livsstilssenter som har mer en 40 år erfaring i å hjelpe folk til en bedre og sunnere hverdag. Fokuset er på hva som virkelig er sunt og hvordan man praktisk kan implementere disse vanene i hverdagen. Vi tar opp tema både innom hvordan du kan forebygge og behandle sykdom, og hvordan du kan maksimere din helse og velvære. Vi snakker om alt fra trening, søvn og spisevaner til sykdommer som hjerte og kar, diabetes og høyt blodtrykk, med fokus på hva vi kan gjøre selv, så du kan gjenvinne helsen og nyte livet.</p>",
        "language": "nb",
        "author_name": "Fredheim Livsstilssenter",
        "slug": "levdegfriskpodden",
        "cover": "20230316_100302_f89370d8b20d78260bcf460ec13128e3.jpg"
    },
    {
        "podcast_id": 188017,
        "title": "What an absolute FIT show",
        "description": "What’s going on with fitness these days? \nLet’s talk about it!",
        "language": "en",
        "author_name": "Nick Southall",
        "slug": "what-an-absolute-fit-show",
        "cover": "20230209_010244_dc9db14350f304b479eccc94f1a3ec1d.jpg"
    },
    {
        "podcast_id": 188045,
        "title": "RICETTE SENZA",
        "description": "\"Ricette senza\", un podcast con chiacchiere di cucina, alimentazione sana e ricette senza, alternativamente: glutine, latticini, carne o pesce, con tante alternative sane e gustose alle ricette classiche. Schede specifiche di alimenti o ingredienti ancora poco conosciuti. Per un' alimentazione adatta a tutti ed attenta ad intolleranze e allergie. Consigli ed idee di cucina per tutti.\n",
        "language": "it",
        "author_name": "Beatrice Bello",
        "slug": "ricettesenza",
        "cover": "20230209_030256_11041e27a1fea66b070786bb53754b02.jpg"
    },
    {
        "podcast_id": 188443,
        "title": "Nutrition on a Mission",
        "description": "<p>Educating and inspiring nutrition professionals and the public on cutting edge research and treatments in the field of nutrition. A podcast from the Council on Nutrition, hosted by Dr. James Geiselman and Coach Drew Sams.</p>",
        "language": "en",
        "author_name": "The Council on Nutrition ",
        "slug": "nutritiononamission",
        "cover": "20230210_090232_a1cff7847330db3ed9f8f756423172a8.jpg"
    },
    {
        "podcast_id": 189169,
        "title": "D Alpas - Ser libre",
        "description": "<p>Te compartire un poco de mi historia. Un espacio seguro para saber que no estas solo, y si conoces a alguien que tenga diabetes entiendas el porque de sus emociones.</p>",
        "language": "es",
        "author_name": "Rafael Aspiazu",
        "slug": "viviendocondiabetes",
        "cover": "20230403_070408_a9bcf08cfb130c78b63a5eb86e75620e.jpg"
    },
    {
        "podcast_id": 189267,
        "title": "The Nathan Crane Podcast",
        "description": "<p>The #1 Holistic Health Podcast in the World. We dive deep into uplifting, transformational and controversial health and wellness topics with top experts from around the world.</p>",
        "language": "en",
        "author_name": "Nathan Crane",
        "slug": "thenathancranepodcast",
        "cover": "20230220_090237_52d8c7fa9a8873f22d5814bf2a2d1041.jpg"
    },
    {
        "podcast_id": 190109,
        "title": "The Bread Health Show",
        "description": "<p>Discover the Joseph's Organic Bakery Show hosted by radio personality Norman Lawrence, the Humble Lion.</p><p>This show is all about how to achieve health through proper diet, not medications.</p><p>Joseph Masel and his son Amos, founders and owners of Joseph's Organic Bakery are interviewed on the show.</p><p>They discuss how to overcome common conditions affecting many Americans like diabetes, heart disease, high blood pressure, kidney disease and more.</p><p>Norman Lawrence, better known as the \"Humble Lion\" is a well known radio host in South Florida. His show includes inspiring interviews with leaders in the holistic health field and positive music from popular genres like Reggae to Dance Pop.</p>",
        "language": "en",
        "author_name": "Robert Masel",
        "slug": "thebreadhealthshow",
        "cover": "20230216_080249_f217d24e53a130b6e7afd9a66990b259.jpg"
    },
    {
        "podcast_id": 190399,
        "title": "RCCF Podcast",
        "description": "<p>This is the official podcast of Rock City Complete Fitness the home of:</p><ul><li><p>Rock City CrossFit</p></li><li><p>Rock City Bootcamp</p></li><li><p>Rock City Personal Training</p></li><li><p>Rock City Nutrition Coaching</p></li><li><p>Rock City Youth Fitness</p></li></ul><p>We cover a variety of topics related to health and fitness. Our mission is to get more people off the couch and into the gym. The hardest part is the first step. Almost EVERYONE says the only regret is not starting sooner.</p><p>We are CrossFit affiliate under the Rock City CrossFit but we also have bootcamp, personal training and nutrition coaching. We cover the bases so if you walk in our door, there is something we can do to help you move towards your best self!</p><p>For more information about Rock City Complete Fitness visit our website</p><p>www.rockcitycompletefitness.com</p>",
        "language": "en",
        "author_name": "Phil Forrester",
        "slug": "rccfpodcast",
        "cover": "20230217_100200_9fe1972a0bd7afcf299a43dc8995014e.jpg"
    },
    {
        "podcast_id": 192543,
        "title": "Women's Wellness Group",
        "description": "<p>Providing advice, hints &amp; tips and education around women's wellness. Covering topics such as nutrition, hormones, gut health, stress &amp; fitness. With the goal to help support and empower women and to create a community of listeners who want to be the best version of themselves they can be.</p>",
        "language": "en",
        "author_name": "Elisha Edwards",
        "slug": "womens-wellness-group",
        "cover": "20230226_090256_46c95638a506160bd1d90ce40b06fc92.jpg"
    },
    {
        "podcast_id": 192924,
        "title": "HEARD- an industry podcast",
        "description": "<p>Hosted by Ryan Pittenger (bartender at Hilltop Tavern) and Sara Matthieu (owner of The Cranky Buzzard restaurant). </p><p>Listen to interviews from a diverse cross-section of the chefs. bartenders, and restauranteurs who serve the Chippewa Valley. \"HEARD\"- your go-to podcast for all things food, drink, and hospitality. </p>",
        "language": "en",
        "author_name": "Sara Matthieu ",
        "slug": "heardthepodcast",
        "cover": "20230227_050225_e31e4c0631d5c6a648e070907ff67fa9.jpg"
    },
    {
        "podcast_id": 192942,
        "title": "Life On Semaglutide",
        "description": "<p>During this Podcast Kody and Krystal will take you on there adventure of obtaining, using and everything in between of this new weight loss drug called Semaglutide.</p>",
        "language": "en",
        "author_name": "Kody and Krystal Dunn",
        "slug": "semaglutide",
        "cover": "20230306_040311_edbddba5a47e0caefc4d31cfcf11bf14.jpg"
    },
    {
        "podcast_id": 193574,
        "title": "Sund Sult Med Sand",
        "description": "<p>Sund Sult Med Sand</p>",
        "language": "en",
        "author_name": "Ida Bastian Sand",
        "slug": "sundsultmedsand",
        "cover": "20230301_090355_27d6b3a5a6c47bdef5ca0b2bde5c822f.jpg"
    },
    {
        "podcast_id": 194466,
        "title": "The Shaping Wellness Podcast",
        "description": "<p>The Shaping Wellness Podcast focuses on bringing awareness to healthy living through routine, nutrition and a positive mindset. These quick episodes provide tips, tricks and advice on how to implement daily wellness and shape it to be what you need. We explore holistic health, healing methods, relationship, diet culture, personal stories, social media fads, and the most popular stigmas. Start your week off by shaping your wellness and prepare to become the best version of yourself!</p>",
        "language": "en",
        "author_name": "Stephanie Costa",
        "slug": "shapingwellnesspodcast",
        "cover": "20230305_020303_41843bb0d74bf55380341782c190f000.jpg"
    },
    {
        "podcast_id": 195977,
        "title": "Strong Passion",
        "description": "<p>Herzlich Willkommen beim “Strong Passion”- Podcast. </p><p>Deinem Podcast für Training, Ernährung, Mindset &amp; Lifestyle.</p><p>Mein Name ist Bea, ich bin Fitness Online Coach und Figure-Athletin. </p><p>Dieser Podcast soll dir helfen Training &amp; Ernährung besser zu verstehen. Du erfährst, wie du mit dem richtigen Mindset deine Ziele erreichst. Es erwarten dich Tipps, persönliche Erfahrungen und evidenzbasiertes Wissen. </p><p>Lass mir gern 5 Sterne da, wenn dir der Podcast gefallen hat.</p><p>Du möchtest deine Frage im Podcast beantwortet haben? Schreib mir gerne auf Instagram!</p><p>Instagram: beatrix.hersich</p>",
        "language": "de",
        "author_name": "Beatrix Hersich",
        "slug": "strongpassion",
        "cover": "20230310_060336_5c13835297d36e7c25de5905d5de4be0.jpg"
    },
    {
        "podcast_id": 196768,
        "title": "وخزة",
        "description": "<p>يبدأ الشعور بثِقل السكري من النوع الأول فور مغادرتك عيادة الطبيب بعد التشخيص. في هذا البودكاست، تأخذكم دانية، أخصائية التغذية العلاجية التي تشخصت بالسكري من النوع الأول في رحلة نتحدث فيها عن كل ما يهم في إدارة السكري، من تغذية، إنسولين، نشاط بدني، وعقلية صلبة قادرة على إدارة التحديات بنجاح، لعيش حياة صحية، بالعلم.</p><p></p><p>هذا البودكاست هو احد برامج بودكاست بشنين.</p>",
        "language": "ar",
        "author_name": "Bashneen | بشنين",
        "slug": "wakhza",
        "cover": "20230319_030313_2f04562fb3de88eb71bf4de0fd8ed4f9.jpg"
    },
    {
        "podcast_id": 197930,
        "title": "Stories of Being",
        "description": "<p>Stories of Being is a series of conversations with a range of inspiring humans whose approaches to life each offer an important piece of the puzzle for how we go about creating the fairer, more balanced, connected and beautiful world we long for. Each conversation explores a new perspective on how we view success, connection, power and progress, and offers inspiration and guidance as we collectively transition to more harmonious ways of being with ourselves, each other and our shared home.</p>",
        "language": "en",
        "author_name": "Ingrid James",
        "slug": "storiesofbeing",
        "cover": "20230319_100321_71fc6ea6650db1a9d9458311c5c09a86.jpg"
    },
    {
        "podcast_id": 198064,
        "title": "تمكين",
        "description": "<p>هل أنت فعلًا بحاجة لخسارة الوزن؟</p><p>الكثير من الناس ترغب بخسارة وزن، حتى أصبح هوساً، نهدف في هذا البودكاست لتمكين الأفراد من عاداتهم الغذائية، ومساعدتهم على رفع قدرتهم على اتخاذ قرارات تساعدهم على تحقيق أهدافهم الحقيقية، مستندين على أجود الأبحاث العلمية المساندة.</p><p>لا يوجد طريق واحد لتعيش حياة صحية، ولكن لتعيش حياة صحية بأي طريق سلكت، لا بد من بناء علاقة صحية مع جسدك، ومع الطعام الذي لا غنى عنه حتى الممات!</p>",
        "language": "en",
        "author_name": "بشنين | Bashneen",
        "slug": "tamkeen",
        "cover": "20230613_090635_30e2736af58d9d3590a441cfbfa12737.jpg"
    },
    {
        "podcast_id": 198536,
        "title": "Lovoni and Sarah",
        "description": "<p>Lovoni and Sarah is a lifestyle podcast offering a straightforward approach to improving your health and wellbeing; the relationship you have with yourself; and creating an environment to help you thrive. By sharing our weight loss stories, we hope to inspire and empower you to improve your health and live the abundant life you deserve.</p><p>Join us: Sarah Holton (artist, business owner and mum) and Lovoni Walker (nutritionist, cookbook author &amp; food consultant) as we talk frankly about our journeys to better health, strength and vibrancy so we can live our best lives and hopefully inspire others to do the same.</p>",
        "language": "en",
        "author_name": "Lovoni Walker and Sarah Holton",
        "slug": "lovoniandsarah",
        "cover": "20230917_110924_797243db374a6cf1d157e92c8a106eb7.jpg"
    },
    {
        "podcast_id": 198698,
        "title": "BJJ Nutrition",
        "description": "<p>A Nutritionist interviewing grapplers about their experiences in the sport and what they did with their nutrition on the lead up to the events they participated in.</p><p>Thank you for listening.</p><p>Social Media Channels</p><p>Instagram - <a href=\"https://www.instagram.com/bjj.nutrition/\">https://www.instagram.com/bjj.nutrition/</a></p><p>Youtube - <a href=\"https://www.youtube.com/@BJJNutrition-ye7kb\">https://www.youtube.com/@BJJNutrition-ye7kb</a></p><p>Facebook - <a href=\"https://www.facebook.com/profile.php?id=100089645601449\">https://www.facebook.com/profile.php?id=100089645601449</a></p><p>TikTock - <a href=\"https://www.tiktok.com/@bjjnutrition?_t=8auYoYGt9M5&amp;_r=1\">https://www.tiktok.com/@bjjnutrition?_t=8auYoYGt9M5&amp;_r=1</a></p>",
        "language": "en",
        "author_name": "BJJ Nutrition",
        "slug": "bjj-nutrition",
        "cover": "20230322_070328_9ce9212deee85920d7683adecea9a38e.jpg"
    },
    {
        "podcast_id": 199031,
        "title": "LIFE FOOD BALANCE",
        "description": "<p>Frei von Verboten und festen Regeln, ohne Fressanfälle und Heißhunger seine körperlichen Ziele erreichen - klingt gut? Das finde ich auch!</p><p>Hier dreht sich alles um ein entspanntes Verhältnis zum Essen. Du fragst, dich, was Life-Food-Balance bedeutet? Das erfährst du in der ersten Folge!</p><p>Mein Name ist Julia, ich bin angehende Sportwissenschaftlerin und Coach für ein entspanntes Essverhalten. Ich helfe Frauen, ihre körperlichen Ziele ohne ständige Verbote, zwanghaftes Kalorienzählen und ein exorbitantes Maß an Bewegung zu erreichen. Viel zu lange bestand auch mein Leben nur aus Training und Ernährung. Alles war darauf ausgerichtet, meine Gedanken kreisten um nichts anderes und Zeit für Spaß im Leben war auch eher Mangelware.</p><p>Ich möchte hier meine Gedanken und Erfahrungen mit dir teilen, damit du draus lernen und es besser machen kannst! Das Leben ist doch viel zu kurz, um sich ständig nur mit der perfekten Ernährung und dem optimalen Training zu beschäftigen!</p><p>Hier findest du mehr von mir:</p><p>Website: <a href=\"https://www.lifefoodbalance.de/\">Life Food Balance - Mit entspanntem Essverhalten zur Wohlfühlfigur! By Julia Fuchs</a></p><p>Instagram: <a href=\"https://www.instagram.com/ju.lifts/\">Julia Fuchs | Fitness &amp; Mindset Coach (@ju.lifts) • Instagram-Fotos und -Videos</a></p><p>YouTube: <a href=\"https://www.youtube.com/channel/UCQEyUsP4Dpm1ZXbKCGk3TzQ/videos\">Julia Fuchs - YouTube</a></p>",
        "language": "de",
        "author_name": "Julia Fuchs",
        "slug": "lifefoodbalance",
        "cover": "20230814_080812_8705c74570e37640d664b8ede2e04bed.jpg"
    },
    {
        "podcast_id": 199991,
        "title": "Greenews - חדשות הבריאות הטבעית",
        "description": "<p>צחי ספונד ועמית לב גולדשטיין חוקרים את עולם הבריאות הטבעית, אחרי תהליך אישי של שינוי באורח החיים וגמילה מתלות בתרופות, ממשיכים לחקור דרכים לריפוי טבעי של הגוף וניקוי מרעלים.</p><p>בפודקאסט יתארחו מטפלים מובילים בישראל ומומחים שונים מעולמות הבריאות הטבעית.</p>",
        "language": "he",
        "author_name": "צחי ספונד ועמית לב גולדשטיין",
        "slug": "greenews",
        "cover": "20230404_060442_9c5ab62de791421590255944843225d1.jpg"
    },
    {
        "podcast_id": 200130,
        "title": "La note vocale",
        "description": "<p>Amanda Abagima coach en nutrition et bien-être mais aussi maman, employée, entrepreneuse, vous partage ses notes vocales : tantôt nutrition, tantôt bien-être, tantôt tout ce qui lui passe par la tête. C'est du sans filtre ici, pas de matos just me, myself, mon téléphone et vous.</p>",
        "language": "fr",
        "author_name": "Amanda Abagima",
        "slug": "lanotevocale",
        "cover": "20230329_110308_f1a6600816f794d2b98ecad6254976d8.jpg"
    },
    {
        "podcast_id": 200205,
        "title": "Enemmän elämää",
        "description": "<p>Enemmän elämää -podcastissa käsitellään laajasti hyvinvointiin ja terveyteen liittyviä teemoja erityisesti liikuntaan, ravitsemukseen ja palautumiseen liittyen. Podcastin emäntänä toimii oululaisen Liikuntakeskus Hukan valmennusvastaava ja valmentaja Salla Käsmä ja hänen aisapareinaan valmentajat Mirka Nevala ja Joni Tuohimaa. Mukana aika-ajoin myös kiinnostavia vieraita, joten tule mukaan kuulemaan lisää rennon letkeää rupattelua sekä saamaan konkreettisia vinkkejä oman hyvinvoinnin edistämiseksi!</p>",
        "language": "fi",
        "author_name": "Liikuntakeskus Hukka",
        "slug": "enemman-elamaa",
        "cover": "20230330_110309_cb238a4c98f68ab8f863d51c546b3e0e.jpg"
    },
    {
        "podcast_id": 204571,
        "title": "THE GRIND PODCAST WITH BIGLEE",
        "description": "<p>We will discuss about bodybuilding, health, wellness and everything related to health and fitness with interesting guests and our inner circle here on a regular basis.</p>",
        "language": "en",
        "author_name": "biglee murali",
        "slug": "biglee",
        "cover": "20230421_050441_1cd9b30c1360a2d748f35b1823778544.jpg"
    },
    {
        "podcast_id": 205039,
        "title": "Tu riñón y tú",
        "description": "<p>Bienvenidos al canal de podcast tu riñón y tú, un canal creado para familiares y pacientes con enfermedad renal que quieren obtener y ampliar, con información de calidad, sus conocimientos respecto a los procesos que está sufriendo su riñón y su cuerpo y conocer alternativas de actuación.</p><p>Mi nombre es Esmeralda Castillo, soy médico especialista en Nefrología ejerciendo en Madrid, España. A lo largo de mi experiencia tanto profesional como personal he observado que disponer de información veraz y de calidad puede aportar cierto grado de control y tranquilidad sobre la enfermedad. Ese es el objetivo de este canal, espero que os sea de mucha ayuda.</p><p>¡Muchas gracias por visitarlo!</p>",
        "language": "es",
        "author_name": "Esmeralda Castillo",
        "slug": "turinonytu",
        "cover": "20230424_110410_e51c2f7c457b47d245614d0d3c55ca24.jpg"
    },
    {
        "podcast_id": 206607,
        "title": "Werken aan Goed Voedsel",
        "description": "<p><strong>Wat is Goed Voedsel?</strong> Is dat gezond voedsel? Is dat duurzaam of juist betaalbaar voedsel? En hoe ziet dit eruit over 20 jaar?</p><p> In deze podcastreeks reizen René Bruijns en René Schellekens het land door om voorlopers in verandering te ontmoeten. Pioniers op het gebied van voedsel. Een roadtrip op zoek naar antwoorden, inspiratie en nieuwe ideeën over de verbindingen tussen de mens en haar voedsel, de natuur en met elkaar.</p><p><strong> DuurzaamDoor</strong></p><p> De podcastreeks ‘Werken aan Goed Voedsel’ is een initiatief van De Participatietafel Voedseltransitie, een onderdeel van het Rijksprogramma DuurzaamDoor. Het programma DuurzaamDoor verbindt partijen in de voedseltransitie met elkaar zodat ze elkaar leren kennen, van elkaar kunnen leren en kunnen samenwerken met als doel de duurzame transitie te versnellen.</p><p> René Bruijns is werkzaam bij RVO en voor DuurzaamDoor de secretaris van de Participatietafel Voedseltransitie.</p><p> René Schellekens is ook werkzaam bij RVO en houdt zich bezig met energiearmoede.</p>",
        "language": "nl",
        "author_name": "René Bruijns & René Schellekens",
        "slug": "werkenaangoedvoedsel",
        "cover": "20230501_010546_a8796254c7805cffb9b6b6beb4668c32.jpg"
    },
    {
        "podcast_id": 207324,
        "title": "Embody Your Health ",
        "description": "<p>Hey there! Welcome to the Embody Your Health Podcast hosted by Gabby and Nat! We are so happy to have you here with us! We look forward to sharing our passions about mindset, nutrition, and exercise, all while making it an enjoyable time for you!</p><p>Disclaimer: We are NOT medical professionals so please do not take anything we discuss as medical advice (:</p><p>Connect with us on social media!</p><p>Gabby's Ig handle: @gabby_sanch</p><p>Nat's Ig handle: @natcoaches</p><p>Email: embodyyourhealthpod@gmail.com</p>",
        "language": "en",
        "author_name": "Gabby and Nat",
        "slug": "titsandtalkswithgabsandnat",
        "cover": "20230903_030931_7b3da1c5c1274ace8370f0b9c4f5bfec.jpg"
    },
    {
        "podcast_id": 209266,
        "title": "ABBEYOFFICIALFIT",
        "description": "<p>Welcome! Meet host Abbey, the personal trainer, and her co-host Keith as they talk about their weightloss, journey and goals moving forward in nutrition and fitness. Hear their voices and stories, what worked for them, and what didn’t work. Hear what’s next to come!</p>",
        "language": "en",
        "author_name": "ABBEYOFFICIALFIT ",
        "slug": "abbeyofficialfit",
        "cover": "20230515_060502_f3b1cb91eb0f517ac9d09d92c40b0d69.jpg"
    },
    {
        "podcast_id": 209811,
        "title": "In Defense of Food",
        "description": "<p>In Defense of Food seeks to help us all rethink our relationship with food by arming our listeners with the information needed to make better consumer decisions in the market, try new foods and explore things they've never considered before.</p>",
        "language": "en",
        "author_name": "Tani & Dr. Kuribo",
        "slug": "indefenseoffood",
        "cover": "20230518_010511_b85b540749eb347c4200dfdc99988886.jpg"
    },
    {
        "podcast_id": 210220,
        "title": "Cheeky Mid Weeky",
        "description": "<p>Strength and conditioning in athletics SHOULD be exciting. Yet too many people make it dull and boring. We are not sure why this is the case - working with professional and collegiate athletes is awesome! In this show from Strength Coach Network, join Dr. Justin Lima as he talks with experts in the field of strength and conditioning.</p><p>Dr. Lima has been working in college athletics since 2009 after his athletic career ended. Since then he has worked in college sports at Big 10, ACC, Ivy League, and more helping hundreds of athletes while placing some into professional careers. He also earned his PhD in Health and Human Performance and Masters in Strength and Conditioning.</p><p>Each week he is joined by coaches who make their living working in the field of strength and conditioning. On the show we dive into the world of working in professional and collegiate sport - but make it interesting! Yes we dive into the science of exercise, our spin on it makes it digestable for everyone to understand how elite athletes are able to perform.</p><p></p><p>So be cheeky and indulge on this conversation in the middle of each week, and learn how the best athletes prepare for GameDay.</p><p></p><p>Strength Coach Network is where strength coaches learn because we bridge the gap from what is taught in the class room with what actually happens in the weight room.</p><p></p><p>For more information from Strength Coach Network follow us at:</p><p>Twitter: <a href=\"https://twitter.com/StrCoachNetwork\">https://twitter.com/StrCoachNetwork</a></p><p>Instagram: <a href=\"https://www.instagram.com/strength_coach_network/\">https://www.instagram.com/strength_coach_network/</a></p><p>YouTube: <a href=\"https://www.youtube.com/@StrengthCoachNetwork\">https://www.youtube.com/@StrengthCoachNetwork</a></p><p>Facebook: <a href=\"https://www.facebook.com/strengthcoachnetwork\">https://www.facebook.com/strengthcoachnetwork</a></p><p>Blog: <a href=\"https://strengthcoachnetwork.com/blog\">https://strengthcoachnetwork.com/blog</a></p><p>Website: <a href=\"https://strengthcoachnetwork.com/\">https://strengthcoachnetwork.com/</a></p><p>Education Courses: <a href=\"https://strengthcoachnetwork.com/fundamentals\">https://strengthcoachnetwork.com/fundamentals</a></p>",
        "language": "en",
        "author_name": "Strength Coach Network",
        "slug": "cmw",
        "cover": "20230519_120557_83a68aa800ef8dff48b5acfb95f9fc10.jpg"
    },
    {
        "podcast_id": 212720,
        "title": "ELIEL NAVAS, NUTRICIÓN PARA EL TRIATLETA.",
        "description": "<p>TU RENDIMIENTO, MI PASIÓN.</p><p>Soy nutriólogo deportivo, especializado en deportes de resistencia</p>",
        "language": "es",
        "author_name": "ELIEL NAVAS MALDONADO",
        "slug": "eliel-navas",
        "cover": "20230601_110606_d341fdf0ed111aae449ae7b70d51895b.jpg"
    },
    {
        "podcast_id": 213407,
        "title": "The John Terilli Universe",
        "description": "<p>Two time <strong>Mr Universe</strong> winner <strong>John Terilli</strong> discusses <strong>classic bodybuilding</strong>, bodybuilding,<strong> fitness</strong> and life with friends, competitors and personalities of the bodybuilding and fitness world.</p>",
        "language": "en",
        "author_name": "John Terilli",
        "slug": "johnterilliuniverse",
        "cover": "20230605_110637_be1075fabaf8011f4397c7ab8a2d9e70.jpg"
    },
    {
        "podcast_id": 213582,
        "title": "The Clear Skin Chronicles",
        "description": "<p>Welcome to The Clear Skin Chronicles, the podcast that's here to help you achieve the skin you've been craving! Join hosts Katie Stewart and Cris Brown, Registered Holistic Nutritionists &amp; Acne Experts, as they dive deep into the world of clear, healthy skin.</p><p>Now this isn't just surface-level solutions here. Katie &amp; Cris believe in taking an inside-out approach to banishing acne for good. Say goodbye to those pesky breakouts by addressing the root causes and nurturing your body from within.</p><p>In each episode, they'll explore the fascinating connections between acne and the imbalances happening inside your body. Katie &amp; Cris will be dishing out expert tips and guidance to support your body's acne-clearing systems: the gut, detox organs and hormones.</p><p>And they know that achieving clear skin is not just about what you put in your body, but also about how you feel mentally and emotionally. So get ready for some uplifting discussions on self-care practices, stress management, and mindset shifts that will have you glowing from the inside out.</p><p></p><p>And of course, Katie &amp; Criss will be sharing all the juicy details on nourishing skincare. They'll debunk myths, explore ingredients, and share their favourite clean beauty products to help repair your skin barrier.</p><p></p><p>So grab a cup of herbal tea, get cozy, and join us on The Clear Skin Chronicles. It's time to embrace your natural beauty and discover the confidence that comes with healthy, glowing skin.</p><p></p><p>Instagram: @katiestewartwellness</p><p>Website: katiestewartwellness.com</p>",
        "language": "en",
        "author_name": "Katie Stewart, RHN & Cris Brown, RHN",
        "slug": "the-clear-skin-chronicles",
        "cover": "20230606_110621_2a661a0ca59db383b9ad07e7b31c2b14.jpg"
    },
    {
        "podcast_id": 215011,
        "title": "Older Adult to Geriatric Nutrition Answers",
        "description": "<p>Find more information at: <a href=\"https://longtermcarerd.com/the-top-5-foods-a-dementia-patient-needs-to-eat/\">https://longtermcarerd.com</a></p>",
        "language": "en",
        "author_name": "Michelle Saari",
        "slug": "top5dementiafoods",
        "cover": "20230613_090656_5e968288421fe46d3a89c296334323dc.jpg"
    },
    {
        "podcast_id": 216475,
        "title": "TrailRunning Ukraine",
        "description": "<p>Розмови з атлетами, тренерами, організаторами змагань, волонтерами, фотографами, та всіма цікавими людьми з світу Українського Трейлранінгу</p>",
        "language": "uk",
        "author_name": "Andrii Oleskiv",
        "slug": "trailrunningukraine",
        "cover": "20230623_110609_2a57c3bc658a0e7b0ea107b925bbe444.jpg"
    },
    {
        "podcast_id": 217582,
        "title": "The Big Bank Show",
        "description": "<p>Host \"Big Bank\" Michael Bankston speaks with special guests Russ Allen (Director of NFL Alumni Wellness Program) and Richard Walker (Coaching and Media Coordinator for NFL Alumni \"Tackle Obesity\" Challenge and Podcast</p>",
        "language": "en",
        "author_name": "Michael Bankston",
        "slug": "bigbankshow",
        "cover": "20230701_100759_90291c7bb574eb743a050c82838e99c5.jpg"
    },
    {
        "podcast_id": 218107,
        "title": "The Doctors Guide to Healthy Living ",
        "description": "<p>At NasonCare, our North Charleston medical center believes that finances should never stand between patients and optimal health – especially since having good health is deserving of all individuals. Our Charleston area medical professionals are committed to providing genuine medical relief to all seeking help throughout the Lowcountry.</p>",
        "language": "en",
        "author_name": "NasonCare",
        "slug": "nasoncare",
        "cover": "20230705_010719_1f540e68f7829a5870352664d5fbf661.jpg"
    },
    {
        "podcast_id": 218130,
        "title": "El Ojo de Dios",
        "description": "<p>Cultiva la espiritualidad. </p><p>Todas nuestras redes aqui: <a href=\"https://linktr.ee/ELOJODEDIOS\">https://linktr.ee/ELOJODEDIOS</a></p>",
        "language": "es-mx",
        "author_name": "El Ojo de Dios",
        "slug": "el-ojo-de-dios",
        "cover": "20230705_040727_2913bfcb8dc0c3209b84ef24c7c4ab18.jpg"
    },
    {
        "podcast_id": 218265,
        "title": "The Marian Flaxman Network Podcast",
        "description": "<p>Welcome to the Marian Flaxman Network Podcast! This podcast will feature interviews, reviews, and commentary within the space of public health, nutrition, health policy, fitness, personal development, and professional and academic growth. Tune in and hear from experts in the field, and learn how policy development, human health, and the field of public health can benefit from leaning into lived experiences and human stories. </p>",
        "language": "en",
        "author_name": "The Marian Flaxman Network Podcast",
        "slug": "themarianflaxmannetwork",
        "cover": "20230706_020746_e986fced32256fd03f8acdfd98778c65.jpg"
    },
    {
        "podcast_id": 218444,
        "title": "The Vegan Report",
        "description": "<p>The Vegan Report offers you a window into the global fight for animal rights. If you are an animal lover, subscribe now! Don't miss out on educational, fascinating, and inspiring conversations for a more compassionate and just world.</p><p>Episodes are posted every Tuesday. The Vegan Report is also on YouTube (@veganreportpodcast) and Instagram (@veganreportpodcast).</p>",
        "language": "en",
        "author_name": "Ryan",
        "slug": "veganreport",
        "cover": "20230707_060732_7791c20acf4f92aa6114d1399f5db64b.jpg"
    },
    {
        "podcast_id": 218510,
        "title": "nuut-ed",
        "description": "<p>Introducing nuut-ed: Your Bite-Sized Wellness Podcast!</p><p>Join nutritionist Eesha Anand and host Dani Kavanagh on an exciting journey through the world of nutrition, fitness, and wellness. Get ready for bite-sized episodes packed with powerful advice, expert insights, and fun discussions.</p><p>At nuut-ed, we're here to simplify the complex world of health and fitness. We break it down into digestible nuggets of wisdom, making it easy for you to nourish your body and mind.</p><p>Tune in for a dose of inspiration and practical tips to fuel your wellness journey. Visit <a href=\"http://nuut.com.au\">nuut.com.au</a> for more information.</p>",
        "language": "en",
        "author_name": "nuut",
        "slug": "nuut-ed",
        "cover": "20230708_070740_ee1c271137ba1d05b43c04b16ba47f79.jpg"
    },
    {
        "podcast_id": 218567,
        "title": "Built By Balance ",
        "description": "<p>A podcast to help individuals lose fat and gain muscle. Covering all things fitness related and busting the myths in the fitness industry</p>",
        "language": "en",
        "author_name": "Dawson Tomich",
        "slug": "builtbybalance",
        "cover": "20230708_080746_9fba0b2e14e93cfb45c63ded0fb5b264.jpg"
    },
    {
        "podcast_id": 218810,
        "title": "The Healthful Her",
        "description": "<p>If you're overwhelmed by the amount of information in the health and wellness world, look no further. On the healthful her podcast we'll get back to the basics of what make you feel your best and explore the keys to living a vibrant and fulfilling life</p>",
        "language": "en",
        "author_name": "Maegan Chant ",
        "slug": "thehealthfulher",
        "cover": "20230710_050706_743a4033cc5d697d7dc075242ad9a3b9.jpg"
    },
    {
        "podcast_id": 219200,
        "title": "Food: A Luxury?",
        "description": "<p>With millions affected by the cost-of-living crisis, this podcast talks about its affects on food and people's diets.</p>",
        "language": "en",
        "author_name": "Shreeyashi Ojha shreeyashiojha096@gmail.com",
        "slug": "foodpoverty",
        "cover": "20230716_090715_f292323c5ffbb7a12f12466cb85dcccb.jpg"
    },
    {
        "podcast_id": 219371,
        "title": "Whole Healing Podcast",
        "description": "<p>Mind, Body &amp; Food - Discover the profound impact that your thoughts, emotions and beliefs can have on your overall health and learn how to cultivate a positive mindset for lasting change</p>",
        "language": "en",
        "author_name": "Jenna Moore, RD, CSSD",
        "slug": "whole-healing-podcast",
        "cover": "20230714_120709_6e958ac2dc9530341ad9165247f5611f.jpg"
    },
    {
        "podcast_id": 220459,
        "title": "USF Corgo - A tua equipa de saúde! ",
        "description": "<p>A  21 de junho 2011 é criada a USF Corgo. Passados 12 anos nasce um novo projecto - O Podcast USF Corgo. :Mais uma forma de estarmos mais próximos de si. Venha connosco nesta aventura. </p>",
        "language": "pt-pt",
        "author_name": "USF Corgo",
        "slug": "usfcorgo1",
        "cover": "20230720_080751_b7a082c6524e503f689b596e793e301a.jpg"
    },
    {
        "podcast_id": 220796,
        "title": "GLUTENSİZ SOHBETLER",
        "description": "<p>Diet LABS, beslenme ve sağlıklı yaşam konularında bilgilendirici ve eğlenceli içerikler sunan bir Youtube kanalıdır. Kanalımızda, sağlıklı beslenme nasıl olmalı, sağlıklı tarifler, kilo verme ipuçları, besin takviyeleri hakkında detaylı bilgiler ve daha birçok konuda faydalı videolar yer almaktadır. ''GLUTENSİZ SOHBETLER'' adlı podcast yayınlarımızda da, bu konuların daha derinlemesine işlendiği, konuklarımızla yapılan keyifli söyleşiler, beslenme alanındaki son trendler ve bilimsel çalışmalar hakkında tartışmalar yer almaktadır. Bu sayede, dinleyicilerimize sağlıklı yaşam ve beslenme konusunda doğru bilgiler sunmayı hedeflemekteyiz.</p>",
        "language": "tr",
        "author_name": "Diet LABS",
        "slug": "glutensizsohbetler",
        "cover": "20230723_040703_7eea686674936ce0373a7d244d3b5fc1.jpg"
    },
    {
        "podcast_id": 221216,
        "title": "ALL IN PODCAST",
        "description": "<p>Hey hey welcome to my first podcast episode- I wanted a place to have deeps chats all things about my favourite topic BODYBUILDING!</p><p>I wanted a place to have a ramble and not share short form content and have some fun and dive deep- so welcome to the podcast, please be aware I am just having some fun diving deep and sharing experiences I am no expert 🤪</p><p>We al love a podcast whether you listen it in cardio or car journeys right?</p>",
        "language": "en",
        "author_name": "Jade Hall",
        "slug": "theallinpodcast",
        "cover": "20230726_100746_bf0832e2620c008626d272b63feda16d.jpg"
    },
    {
        "podcast_id": 221235,
        "title": "CHAMBERÍ TELEVISIÓN",
        "description": "<p><a href=\"http://www.chamberi.tv\">www.chamberi.tv</a> - PUBLICO ASISTENTE Desde el Mercado de Chamberí emitimos en Directo nuestro Programa \"CHAMBERÍ, TU PUNTO DE ENCUENTRO\"</p>",
        "language": "es-mx",
        "author_name": "CHAMBERÍ TELEVISIÓN ",
        "slug": "chamberitv",
        "cover": "20230726_020728_b510fe107a2fabbaf8c1be2d392679b8.jpg"
    },
    {
        "podcast_id": 221244,
        "title": "Summer time nutrition and food talk",
        "description": "<p>Are there bad foods? Are some better than others? I am going to dive into the reasons behind negative food relationships and how we can come together and change the way we think about food.</p><p>After each episode, I will provide links to outside resources so that you can also become educated.</p>",
        "language": "en",
        "author_name": "Summer Davis",
        "slug": "summernutrition",
        "cover": "20230726_030721_a62e754de89fd7f0e84fb7f70eb73d8a.jpg"
    },
    {
        "podcast_id": 221321,
        "title": "The Stromcast DOWNUNDER",
        "description": "<p>Join Thomas from Strom Sports Nutrition DOWNUNDER as he talks with experts, coaches, and members of the fitness community about supplements, nutrition, fitness, and many other topics.</p>",
        "language": "en",
        "author_name": "Strom Sports Nutrition DOWNUNDER",
        "slug": "the-stromcast-down-under",
        "cover": "20230829_030835_4213cef37ab21fbdbd17db76bb38bf0e.jpg"
    },
    {
        "podcast_id": 221835,
        "title": "No Fungi, No Future: Celebrating the Impact of Fungi, Mushrooms, and Mycelium in our Lives",
        "description": "<p>Welcome to \"No Fungi, No Future,\" the podcast that explores the fascinating world of fungi, mushrooms, and mycelium and their incredible impact on our lives. Join us to discover their essential role in shaping our environment, health, and future. Get ready for captivating stories, expert insights, and the untold wonders of these remarkable organisms, celebrating their profound impact on our past, present, and most importantly, our future. Let us enlighten and inspire you with the magnificent world of fungi.</p>",
        "language": "en",
        "author_name": "Sempera Organics",
        "slug": "nofunginofuturepodcast",
        "cover": "20230817_070818_d68e3aec5961bde78a62ecf3239fc7e4.jpg"
    },
    {
        "podcast_id": 222513,
        "title": "My type 1",
        "description": "<p>Hosted by Max Marcus and Skye Karapetian.</p><p>For business inquiries email us at <a href=\"mailto:mytype1podcast@gmail.com\">mytype1podcast@gmail.com</a></p>",
        "language": "en",
        "author_name": "Max Marcus",
        "slug": "mytype1",
        "cover": "20230804_020807_371a0cb45452465c9b2295416cd57184.jpg"
    },
    {
        "podcast_id": 222730,
        "title": "Tsorenity Now: Organizational Leadership and Development",
        "description": "<p>We discuss leadership in transition and culture change, draw out lessons learned from challenges and how each person was able to overcome obstacles.</p><p>And apply it to all aspects of life, such as family, business, military.</p><p>And discuss the unique differences in all leadership experiences</p>",
        "language": "en",
        "author_name": "James Cheng",
        "slug": "tsorenitynow",
        "cover": "20230805_110827_c87fad5edee67a7e1f221ed81ad4f06f.jpg"
    },
    {
        "podcast_id": 222882,
        "title": "Nutri Management",
        "description": "<b>Human beings with anemia have lots of blood, but they don’t have the specified quantity of crimson blood cells, or those cells are not containing their regular payload of oxygen to offer them energy. There are many types of anemia, however the most commonplace is iron- deficiency. </b>",
        "language": "en",
        "author_name": "Mercy Grace",
        "slug": "nutri-management",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 223569,
        "title": "Kam Izzwan Podcast (KIP)",
        "description": "<p>Explore the realms of <em>health </em>and <em>fitness </em>with <strong><em>\"KAM IZZWAN PODCAST\"</em></strong>. Discover expert insights, actionable tips, and inspiring stories to elevate your well-being. Join us for a transformative journey toward a healthier, more vibrant life. Subscribe now and unlock your full potential!</p>",
        "language": "en",
        "author_name": "Kam Izzwan",
        "slug": "kamizzwanpodcast",
        "cover": "20230811_080808_79201ebfa114d410f1a51a5ee4632e4d.jpg"
    },
    {
        "podcast_id": 223601,
        "title": "The Nutrient Nerd Podcast",
        "description": "<p>Welcome to The Nutrient Nerd Podcast! I'm your host, Kaley Larson. As a current second-year physician assistant (PA) student at Drexel University, I made this podcast to provide primary care clinicians with more information about the Mediterranean diet. Hopefully this podcast will equip listeners with the knowledge to better assist patients in achieving a healthy lifestyle. </p>",
        "language": "en",
        "author_name": "Kaley Larson",
        "slug": "thenutrientnerd",
        "cover": "20230811_030832_064b47d5fa564deeea285551e7384df8.jpg"
    },
    {
        "podcast_id": 223920,
        "title": "Eat Well To Be Well",
        "description": "<p>انا اسمي أسماء عمار، استشاري تغذية علاجية معتمدة واستشاري التغذية الشاملة و العلاجات المكملة. تجربتي الممتدة لأكثر من ١٥ سنة، أتاحت لي الفرصة للعمل مع حالات من جميع أنحاء العالم من خلال باقات متنوعة عبر الإنترنت. ساعدتهم على دعم وتحسين صحتهم للوصول للوزن المثالي والحفاظ عليه باستخدام التغذية الوظيفية Function Nutrition.</p><p>نشر الوعي الغذائي وتعزيز الاهتمام بالصحة في جميع مراحل العمر، هو هدفي الذي دفعني لبدء البودكاست ده وأسعى من خلاله إلى تقديم المعلومات والنصائح المفيدة للجميع</p><p>Facebook: Registered Nutritionist Asmaa Ammar</p><p>Facebook Group: Eat Well To Be Well With Asmaa Ammar</p><p>Website: <a href=\"http://Eatwelltobewell.ca\">Eatwelltobewell.ca</a></p>",
        "language": "ar",
        "author_name": "Asmaa Ammar",
        "slug": "eatwelltobewell",
        "cover": "20230813_100841_2e3883acade79fa97a9e5b43f371f7fc.jpg"
    },
    {
        "podcast_id": 224216,
        "title": "Midlife, Munching and Movement",
        "description": "<p><strong>Hosted by Jen &amp; Ky, two boy Mums navigating the tween and teenage years discussing all things nutrition, exercise, midlife, lifestyle and more....</strong></p>",
        "language": "en",
        "author_name": "Midlife Munchers",
        "slug": "midlifemunchers",
        "cover": "20230815_050818_d5a8041f37c78224f77d56e8dbf7d156.jpg"
    },
    {
        "podcast_id": 224222,
        "title": "Manky Physiques",
        "description": "<p>Fitness and physique advice for new gym-goers looking to build confidence at the gym and improve their physique,</p><p>Manky.co,uk</p>",
        "language": "en",
        "author_name": "Nathan Rubin",
        "slug": "manky",
        "cover": "20230815_060822_e93ff77aad319b04724755553dea17de.jpg"
    },
    {
        "podcast_id": 225006,
        "title": "Is obesity a gateway disease to other NCDs?",
        "description": "<p>ECPO Podcast discussing with patients and healthcare professionals the links between obesity and other NCD's</p>",
        "language": "en",
        "author_name": "ECPO",
        "slug": "obesitygateway",
        "cover": "20230822_010817_e4141bbd39a41c140a102671d268f416.jpg"
    },
    {
        "podcast_id": 225584,
        "title": "The Health Profiler Podcast ",
        "description": "<p> Pamela Wingert, the host, has her INHC certification as a health and wellness coach from IIN. She is also certified as a health specialist and board certified by AADP internationally. She has been MSA certified as a Bioenergetic technician for 12 years with Qest4 and provides training for Solex AO Scanner.  Pamela Wingert has been in the health and wellness industry for 35+ years. She and her husband own a healthfood store that has been in business since 1970. Pamela created and opened a wellness center in September 2018, known as the BioEnergy Center, that provides a different approach for an integrative wellness experience using bioenergetic therapies.</p>",
        "language": "en",
        "author_name": "Pamela Wingert",
        "slug": "thehealthprofiler",
        "cover": "20230824_030833_183390d8a47cce4a388c1a7820a501e7.jpg"
    },
    {
        "podcast_id": 227045,
        "title": "Find Your Nutrition",
        "description": "<p>The Find Your Nutrition podcast brings you conversations about nutrition, healthy eating, and a healthy lifestyle. These tips will help you feel more energic than you've ever felt, and you'll learn tools that you can implement into everyday life. </p><p>You'll find your nutrition here every Tuesday! So stay tuned! </p><p>Contact me: findingyournutrition@gmail.com</p>",
        "language": "en",
        "author_name": "Steven Joseph",
        "slug": "findyournutrition",
        "cover": "20230903_120915_293a696a90211a08396e8f5d225b4145.jpg"
    },
    {
        "podcast_id": 227192,
        "title": "Basic Nutrish",
        "description": "<p>Welcome to \"Basic Nutrish\" with Lauran Martyn – the podcast that fills in the gaps in your nutritional knowledge, from childhood straight through to the complexities of adulthood. 🎧🥦</p><p>Lauran Martyn is a Certified Nutrition Coach, Strength &amp; Conditioning Specialist with 6+ years of coaching and training experience working with local, in-person clients and virtual clients all over the world.</p><p>In a world overflowing with diet trends and conflicting information, it's time to get back to the basics that should have been part of our foundational education.  Join Lauran as she breaks down essential nutrition principles in a clear and engaging way, making sure you have the tools you need to make informed choices about what you put on your plate.</p><p>Whether you're a recent graduate navigating your newfound independence, a busy professional juggling responsibilities, or anyone seeking to better understand the impact of food on your well-being, Basic Nutrish has something for you. Lauran's passion for demystifying nutrition shines through as she explores topics that are relevant to your everyday life.</p><p>Bonus Content for those who hunger for a deeper dive. By becoming a Patreon subscriber, you'll unlock a treasure trove of exclusive content. Enjoy extended podcast episodes where Lauran goes beyond the basics, delving into the nuances of nutrition that truly matter, downloadable worksheets and comprehensive guides will help you translate knowledge into action, turning intentions into habits.</p><p>Click this link to become a Patron - <a href=\"http://patreon.com/basicnutrish\">patreon.com/basicnutrish</a></p><p>\"Basic Nutrish\" isn't just a podcast; it's a journey towards empowerment. It's about understanding the essential building blocks of a healthy life and equipping yourself with the information you need to thrive. So, whether you're on your daily commute, hitting the gym, or simply unwinding at home, let Lauran Martyn be your guide to a more informed and nourished you.</p><p>Subscribe now and become a valued member of the \"Basic Nutrish\" community. Together, let's embrace the knowledge we all deserve and create a healthier future, one fundamental at a time. 🌱🍎 </p><p>Let's Connect!</p><p>Instagram: <a href>@lauranraefit</a></p><p>Facebook: <a href>www.facebook.com/coachlauran</a></p><p>Learn More about Fitness &amp; Nutrition Coaching - <a href>www.coachlauran.com</a></p>",
        "language": "en",
        "author_name": "Lauran Martyn CPT, CNC, CSCC",
        "slug": "basicnutrish",
        "cover": "20230904_060953_0cc0be1ddf2ffab13a770add91a3724a.jpg"
    },
    {
        "podcast_id": 227351,
        "title": "Sanctify Health Podcast",
        "description": "<p>Hello and welcome to the Sanctify Health podcast with the Ramseys! Through our own personal trials and triumphs we believe that we are to lead lives full of balance, grace, and discipline in and out of the gym. We look forward to discussing lots of fun health, nutrition, and wellness topics with you!</p>",
        "language": "en",
        "author_name": "Julianna and Lee Ramsey",
        "slug": "sanctifyhealthpodcast",
        "cover": "20230905_060929_e425a3f6b89ac6b4a97485a310fbdee1.jpg"
    },
    {
        "podcast_id": 227446,
        "title": "Doctoria lui Chiotea",
        "description": "<p>Sanatatea pe intelesul tuturor, cu cei mai buni doctori din Romania! Util si gratis, aboneaza-te!</p>",
        "language": "en-us",
        "author_name": "Doctoria lui Chiotea",
        "slug": "doctorialuichiotea",
        "cover": "20230906_110948_495bb00c73211edee2d1fe7e9db7b84a.jpg"
    },
    {
        "podcast_id": 227468,
        "title": "Boas  vindas",
        "description": "<p>Muito legal </p>",
        "language": "pt-br",
        "author_name": "Notavel ",
        "slug": "thenoto",
        "cover": "20230906_020944_1a4b3d2c6cc060727cad650e129bbf4a.jpg"
    },
    {
        "podcast_id": 228114,
        "title": "Chats with Chels | Grad School & Coffee",
        "description": "<p>Hi everyone! My name is Chelsie, a Nutrition PhD student at Colorado State University. I wanted to start a podcast to share my experiences, the good, the bad, and everything in between. My first episode is coming next, so stay tuned!</p>",
        "language": "en",
        "author_name": "Chelsie Miller",
        "slug": "chats-with-chels",
        "cover": "20230911_120920_7a5818c2c3e7c8c93f0d92bfe8c92943.jpg"
    },
    {
        "podcast_id": 228968,
        "title": "Run, Lift, Achieve",
        "description": "<p>Welcome to 'Run, Lift, Achieve' - the ultimate podcast dedicated to unlocking your full potential in health, fitness, and well-being. Join your host, Henrique Martins, as he explores the secrets to living a healthier, more active life. Our episodes dive deep into topics like stretching, nutrition, workout routines, mental health, and more. Discover expert insights, inspiring stories, and actionable advice that will empower you to achieve your fitness goals. Tune in, subscribe, and embark on a journey towards a healthier, happier you with 'Run, Lift, Achieve'!</p>",
        "language": "en",
        "author_name": "Henrique Martins",
        "slug": "stretching-for-health-wellnes",
        "cover": "20230916_080912_ccb98d353229e6a2298ddd50ae64128c.jpg"
    },
    {
        "podcast_id": 229260,
        "title": "Living Well with the Mind-Body Connection",
        "description": "<p>Welcome to Living Well with the mind-body connection! Here, you'll find all the information and tools you need to live your best life. Our goal is to help you make positive changes in your life that will last a lifetime. And here is your host, Doctor Rudy Kashmann.</p>",
        "language": "en",
        "author_name": "Dr. Rudy Kachmann",
        "slug": "livingwellwiththemindbodyconnection",
        "cover": "20230918_110935_90e1acb41b4dfa0c9d81092fa7232f54.jpg"
    }
]