[
    {
        "podcast_id": 7102,
        "title": "Equestrienne",
        "description": "Equestrienne Life: \n• Dressage Rider & Barrel Racer \n• California & Virginia\nAthlete Psychology, Lifestyle Truths\nManagement & Industry Commentary",
        "language": "en",
        "author_name": "Annie and Caroline",
        "slug": "equestrienne",
        "cover": "20200326_152742_a3651ea12e73e93383b720921dbb1a4b.jpeg"
    },
    {
        "podcast_id": 14494,
        "title": "Tréidlia ar glao",
        "description": "Is mise Cathal Ó Baoill. Is mac léinn tréidlia mé i mBaile Átha Cliath agus seo é mo podcraoladh 'Tréidlia ar glao'. Sa phodcraoladh seo bím ag plé alán ábhair ón spórt go tréidliacht agus i bhfad níos mó. Beadh daoine éagsúla agam ar an seó ag caint liom. Tá an podchraoladh seo lán le craic agus comhrá maith trí Ghaeilge. \nÉisteacht sona.",
        "language": "en-gb",
        "author_name": "Cathal Ó Baoill",
        "slug": "treidliaarglao",
        "cover": "20201111_194211_050cdd563f6c9ff563931760924ff204.jpg"
    },
    {
        "podcast_id": 14670,
        "title": "what the woof?!",
        "description": "Entiende mejor a tu mascota con este podcast.\n¡HOLA! mi nombre es Paloma Siliceo y soy veterinaria , quiero ayudarte a entender mejor a tus mascotas, a conocer más su mundo y a tener una mascota más sana y feliz \nSi tienes temas de los que te gustaría que hablara, no dudes en enviarme tus preguntas o temas que quisieras conocer:\nhttps://www.instagram.com/palomavet_dogtor/\nDame follow y  mantente informado! ",
        "language": "es",
        "author_name": "Paloma Siliceo Trueba",
        "slug": "petsworld",
        "cover": "20201129_184953_34dd5cbd6a784867bb02befd72d0b2d0.jpg"
    },
    {
        "podcast_id": 14695,
        "title": "The Dog Pod",
        "description": "Canine Curated Content",
        "language": "en",
        "author_name": "Rebecca Tompkins",
        "slug": "thedogpod",
        "cover": "20201118_000430_a1907e785459dcd71944f8b603e1bd20.jpg"
    },
    {
        "podcast_id": 17242,
        "title": "SquadCast",
        "description": "Get your weekly dose from the Sausage Squad and life living with 5 sassy sausages. Covering all things dachshund related and confronting important topics and taboos in the sausage world. ",
        "language": "en",
        "author_name": "Harriet Birch",
        "slug": "sausagesquadcast",
        "cover": "20201205_204637_b8f1d34f862222d2a3868380c998ff23.jpg"
    },
    {
        "podcast_id": 36359,
        "title": "It's Reigning Cats and Dogs",
        "description": "Do your pets rule your house like ours do? Join host Joel Baardseth and his guest as they discuss all things pet from whole food nutrition, behavioral tips, and other trends in the pet kingdom. ",
        "language": "en",
        "author_name": "Joel @ Steve's Real Food ",
        "slug": "stevesrealfood",
        "cover": "20210226_232641_af2e63dc875952aedc903d1dc1d3b2b8.jpg"
    },
    {
        "podcast_id": 38060,
        "title": "Eläimellistä viestintää",
        "description": "Eläimellistä viestintää on podcast, jossa tutkittu tieto ja eläinlähtöisyys kohtaavat.\n \nEläimellistä viestintää -podcastissa eläinten hyvinvointiaiheisiin erikoistunut Art Director ja viestinnän asiantuntija pohtii eläinten hyvinvointikysymyksiä, eläinten ja median välisiä suhteita sekä eläinten hyvinvointiin liittyviä ilmiöitä tieteellisellä, analyyttisellä ja kriittisellä otteella.",
        "language": "fi",
        "author_name": "Sari Toivola",
        "slug": "elaimellistaviestintaa",
        "cover": "20210302_120210_78cc845bacd5545add11fb52139d4326.jpg"
    },
    {
        "podcast_id": 39702,
        "title": "Petexpert.lv Akadēmija ",
        "description": "Petexpert.lv Akadēmija, tā ir vietas kur gūt zināšanas par to, kas notiek un kam jāpievērš uzmanība tava mīluļa dzīvē. Raidījums vēltīts suņu un kaķu dzīvei no piedzimšanas brīža līdz pilnīgam vecumam. Kopā ar veterinārāsrtiem un speciālistiem apkoposim dažādus padomus un ieteikumus, lai jūsu mīlulis augtu laimīgs.\n\nDivas reizes mēnesī, katru otro un ceturto ceturdienu, mēs publicēsim raidierakstu (podkāstu) par tēmām, kas paredzētas par un ap suņu un kaķu tēmu. \nJa ir kādi jautājumi, laipni aicināti ar mums sazināties kādā no sociālajiem tīklie:\n1. https://www.facebook.com/petexpertlv\n2. IG: petexpert.lv\n\nRaidījumu vada: Edgars Zaikovskis, petexpert.lv Akadēmijas vadītājs\n\nVisas preces un papildus informāciju par produktiem meklē www.petexpert.lv\nRaidījums tapis sadarbībā ar Prins suņu un kaķu barībām.\n\nRaidījumā ir izmantota produktu ievietošana.",
        "language": "lv",
        "author_name": "Petexpert Akadēmija",
        "slug": "petexpert",
        "cover": "20210308_121910_f1d997104220dbba4ada350f180e143a.jpg"
    },
    {
        "podcast_id": 42144,
        "title": "All Things Wise and Wonderful (an animal welfare podcast)",
        "description": "This podcast, hosted by Dr Henrietta Linnemann and Jody Gordon, is about all things animal welfare and veterinary with discussions about welfare and vet related issues, news items related to animals and discussions with experts working in the animal welfare and veterinary world.\nEmail the show at askthingswiseandwonderful@gmail.com\nfacebook.com/allthingswiseandwonderfulpodcast",
        "language": "en",
        "author_name": "Jody Gordon & Dr Henrietta Linnemann",
        "slug": "allthingswiseandwonderful",
        "cover": "20210317_092551_b63dad56473f3afe6050879a1e6a0ee8.jpg"
    },
    {
        "podcast_id": 58948,
        "title": "Laboratorio Canino",
        "description": "Gustavo Estrada y Román Urrutia conversan sobre Educación Canina desde una posición crítica no-dogmática. Desmenuzando temas que pocos quieren hablar en el área y entrevistando a personas importantes dentro de la industria. ",
        "language": "es",
        "author_name": "Gustavo Estrada y Román Urrutia",
        "slug": "laboratoriocanino",
        "cover": "20210525_042830_ff2f3b5b00513b4a3404e05784d6518f.jpg"
    },
    {
        "podcast_id": 81910,
        "title": "Marvin Pierce Dog Teacher",
        "description": "Marvin Pierce Dog Teacher Podcast \n\nMarvin pierce has been doing obedience training for over 20 years and shares his experience in the field on this podcast.\nYou will hear about obedience training tips and many other dog training discussions!\nVisit our website at www.marvinpiercedogteacher.com",
        "language": "en",
        "author_name": "Marvin Pierce Dog Teacher",
        "slug": "marvinpiercedogteacher",
        "cover": "20221021_021032_5ed98ce0031a23e31c8c466088d8e92d.jpg"
    },
    {
        "podcast_id": 83007,
        "title": "Rappin' With ReefBum",
        "description": "Rappin' With ReefBum is a weekly talk show with host Keith Berkelhamer and guests from the reef keeping community.",
        "language": "en",
        "author_name": "Keith Berkelhamer",
        "slug": "rappinwithreefbum",
        "cover": "20211005_122623_ae6e8c395f9cd22daaa04bf9191e1dc8.jpg"
    },
    {
        "podcast_id": 83997,
        "title": "Crime, Pisici si Cafea",
        "description": "Podcast de True Crime în română unde veţi asculta cele mai interesante cazuri şi mistere adevărate întâmplate peste tot în lume. De la dispariţii misterioase, la lideri de cult şi ucigaşi în serie, vom discuta despre toate în acest podcast. Urmareşte-ne pe Instagram pentru hint-uri şi sneek peak-uri ale următoarelor episoade, dar şi fun facts care sigur vă vor părea interesante.",
        "language": "ro",
        "author_name": "Alerina",
        "slug": "crimepisicisicafea",
        "cover": "20211008_131053_7e64772cc79a54e8dca13a563c4decc0.jpg"
    },
    {
        "podcast_id": 87218,
        "title": "SPCA Tampa Bay Animal Tails Podcast",
        "description": "SPCA Tampa Bay is helping to bring useful and timely information to the community with our Animal Tails podcast series (previously the For-All Pawdcast). Our podcast will be tackling topics around pet safety, local happenings for pets and their people, pet health care and more.",
        "language": "en",
        "author_name": "SPCA Tampa Bay Marketing Team",
        "slug": "spcatampabay",
        "cover": "20230117_080113_3ec468ce4bf60a130d38799c0ef2cd5c.jpg"
    },
    {
        "podcast_id": 91240,
        "title": "Emancipated",
        "description": "This 5 part series is hosted by the fabulous KC Armstrong which originally aired on the Podcast Business News Network (PBN).  \n\nI am thankful for the opportunity to have connected with KC and for PBN gifting me with these episodes so that I can share them with you! \n\nEach episode we reveal more about me and how I got to this beautiful place in my life - from Pentagon employee to Reiki Master, Author and Speaker! We discuss the many the services provide to support your connection with you soul, building your spiritual toolkit and the support I provide to your animals! \n\nWe also discuss my two books, \"The Adventures of Cleo and Sophie - Trip to the Moon\" and \"Enslaved - The Lady and Her Pentagon\".\n\nI am thankful for this series as I now continue on my own reaching others and providing support and healing around the world! \n\nFrom here forward we will discuss how to free ourselves from the lives we have enslaved ourselves in and how to live abundant limitless lives with alternative healing and Ayurveda practices!",
        "language": "en",
        "author_name": "Tara Reynolds",
        "slug": "erickatarareynoldsshow",
        "cover": "20211118_041328_aa8e664f20e9b79207f69a8543e60913.jpg"
    },
    {
        "podcast_id": 92934,
        "title": "DogRRR Nation",
        "description": "The new Dallas DogRRR Nation podcast to discuss all topics around fostering, volunteering, and adopting dogs in North Texas.",
        "language": "en",
        "author_name": "Dallas DogRRR",
        "slug": "dogrrrnation",
        "cover": "20211128_061149_e343af7ddf65a079bdc38adfdf7bd287.jpg"
    },
    {
        "podcast_id": 94570,
        "title": "Talking Country with Brad and Chancey",
        "description": "On our podcast we discuss things going on in the woods, on the creek banks, in the pastures and farms! Join life long friends, Brad and Chancey, as we discuss the things we love! Thank you for listening!",
        "language": "en",
        "author_name": "Brad Vaculin, Chancey Lewis",
        "slug": "talkingcountry",
        "cover": "20211208_041221_95d82fc3903d5aea14adb693dbfb1cee.jpg"
    },
    {
        "podcast_id": 96364,
        "title": "The Dog Manual",
        "description": "The goal is to create high quality content that helps people understand dog/animal behavior to help improve their lives together, as well as create a welcoming community that is willing to constructively help other owners. Dogs (and all animals) are something we are very passionate about and would love to help others understand through our experiences. Please, come pull up a seat by our table, get cozy and enjoy.",
        "language": "en",
        "author_name": "The Dog Manual",
        "slug": "thedogmanual",
        "cover": "20211218_041253_9586bc759874b754cb269e2b8834354d.jpg"
    },
    {
        "podcast_id": 101955,
        "title": "Rideear",
        "description": "Rideear är en podd där du kommer få möjlighet att utveckla din ridning tillsammans med flera olika ridtränare, du kommer få en lektion som du kan lyssna på när du rider. \n\n\n\n\nAnsvarig utgivare: Amanda Norenius",
        "language": "sv",
        "author_name": "Amanda Norenius",
        "slug": "rideear",
        "cover": "20220119_020127_dd0f98df1168aeb9182a094b23fb2ecd.jpg"
    },
    {
        "podcast_id": 105592,
        "title": "Equine's and Ego's",
        "description": "This is a podcast for the horse. Whether it be raising awareness or improving knowledge on anatomy and psychology, this podcast separates fact versus fiction, doing the best we can to be advocates for these voiceless animals!",
        "language": "en",
        "author_name": "Jasmine Moody",
        "slug": "equinesandegos",
        "cover": "20220202_010232_8a980f722a588803d5875cf79f5b6889.jpg"
    },
    {
        "podcast_id": 108527,
        "title": "In For the Night ",
        "description": "In For the Night is a podcast that discusses movies, random topics and gives you an excuse to just stay in for the night",
        "language": "en",
        "author_name": "Katharine Rowe",
        "slug": "inforthenightpodcast",
        "cover": "20220213_050217_71a6f56a31615d0ccf03fcd35110b406.jpg"
    },
    {
        "podcast_id": 117502,
        "title": "The Cavefish Chronicles",
        "description": "Understanding how the same fish could look so different is a question that scientists have been investigating since the discovery of the blind Mexican cavefish, Astyanax Mexicanus in the 1930’s. The cave fish, pale pink without eyes, lives in underground caves below its surface cousin which is silvery gray with black eyes. Today Astyanax is a model to study genetics, disease and behavior.\n\nThe story includes jungle explorers braving plane crashes and venomous snakes to find the cavefish and the scientists who studied it including a renowned German professor who fled Nazi Germany and a female Turkish scientist, Perihan Sadoglu who did some of the first genetic work in the 1950’s, but who mysteriously disappeared mid-career. The podcast follows the stories of scientists past and present revealing clues along the way to find out what had happened to Dr. Sadoglu and why it matters now.",
        "language": "en",
        "author_name": "Andrea Carter Mincer",
        "slug": "cavefish",
        "cover": "20220325_120323_dc8db0874e193d3f8c5f7e5d1e875fe5.jpg"
    },
    {
        "podcast_id": 117878,
        "title": "Pokeology 101",
        "description": "Welcome to Pokelogy 101!\nThese lectures are taught by Professor Reed and Professor Lee who are colleagues with Professor Rowan studying Pokemon Evolution. Specifically, we study why Pokemon evolve and how they are related to each other. For example why is a Greninja form a clade with Politoad, but not Seismitoad? Who is Dunsparce and Shuckle's closest relative? All this and more discussed here!",
        "language": "en",
        "author_name": "Professor Reed and Professor Lee",
        "slug": "pokeology",
        "cover": "20220326_060342_6f2c13167b4792be1a0cddb9b1045bc4.jpg"
    },
    {
        "podcast_id": 122832,
        "title": "O zvířatech jinak",
        "description": "<p>Pet Heroes přináší rozhovory o nevšedních tématech, které se jakkoli dotýkají domácích zvířat. Jako nezisková organizace se zasazují o lepší život pro zvířata už téměř deset let, a tak se rozhodli své působiště přenést i na vlny podcastů. Užijte si poslech a nezapomeňte zanechat lajk. Podcast vychází vždy na konci měsíce. V případě dotazů nás můžete kontaktovat na info@petheroes.cz</p>",
        "language": "cs",
        "author_name": "Pet Heroes z.s.",
        "slug": "petheroes",
        "cover": "20230531_020521_7513927059090c6ac1b65d5866c9115b.jpg"
    },
    {
        "podcast_id": 123577,
        "title": "Happy Paws",
        "description": "Happy Paws is a podcast where experts and animals lovers of all stripes and colors can get together to talk about how we can best take care of our beloved furry friends. You’ll be both educated and entertained by credentialed pet experts who will bring you the latest and greatest in improving and protecting animals’ physical and emotional health. And those burning questions you have about why your dog or cat does that weird thing, what it means, and how to fix it? We’ll talk about those, too, by answering listeners’ questions about their pets’ behavior and other needs. Tune in today!",
        "language": "en",
        "author_name": "Fear Free Happy Homes",
        "slug": "happypaws",
        "cover": "20220421_040422_e0983dae8be0c296017cd392e95ec5a6.jpg"
    },
    {
        "podcast_id": 124223,
        "title": "The Orangutan Podcast",
        "description": "The Orang Utan Republik, a rainforest education and conservation organization, lets you dive into their world of adventures, as host Anthony Porter and Gary Shapiro take a look into what makes the rainforest such a special place. ",
        "language": "en",
        "author_name": "The Orangutan Podcast",
        "slug": "torangutanpodcast",
        "cover": "20220424_060403_8306f098b57cd1b12185c4401da97650.jpg"
    },
    {
        "podcast_id": 124629,
        "title": "Proefdiervrij de Podcast: we zijn verder dan je denkt",
        "description": "Het gebruik van proefdieren in de wetenschap is niet nieuw. Maar in een tijdperk van zelfrijdende auto’s en commerciële ruimtereizen, vragen wij ons toch af… hoe lang moeten dieren het nog ontgelden in de naam van de wetenschap?\n\nProefdiervrij de Podcast is dé podcast over proefdieren en vooral over hoe we die zo mogelijk de wereld uitkrijgen. Collega’s Saskia en Romy dagen elke maand een andere proefdiervrije pionier uit om ons te laten zien dat Nederland zonder die vreselijke dierproeven kan. Wat is er nodig voor een proefdiervrije wereld? En moeten we het niet eens gaan hebben over een dierproevenverbod? Dit (en nog veel meer) bespreken we elke laatste vrijdag van de maand om 16.00 uur in Proefdiervrij de Podcast.",
        "language": "nl",
        "author_name": "Saskia & Romy (Proefdiervrij)",
        "slug": "proefdiervrijdepodcast1",
        "cover": "20220426_020419_2ffc0fa4c87d0adb5008bd514aa72e22.jpg"
    },
    {
        "podcast_id": 125138,
        "title": "EQUILIBRIUM BY P.E.A.C.E.",
        "description": "Come listen as P.E.A.C.E. co-founder Sarien Slabbert is joined by humans in the movement to discuss subjects about farm sanctuary, farmed animal rescue, and the vegan world. Let's come together to create some waves of unbalance for change and explore the shades in between black-and-white, while learning something new together. ",
        "language": "en",
        "author_name": "Sarien Slabbert",
        "slug": "equilibriumbypeace",
        "cover": "20220428_050405_70fce0ed9c9a41e013bbcc22160bfc91.jpg"
    },
    {
        "podcast_id": 129250,
        "title": "Canine Fitness Fanatics Podcast",
        "description": "Do you think your dog might benefit from a little extra fitness? Maybe you want to tighten those left turns in agility or tighten their box turn in flyball? Or maybe they are a bit clumsy and just need a little more body awareness? Welcome to the Canine Fitness Fanatics podcast! With your host Hannah Johnson join us as we talk dog fitness and other areas of canine health too! Our mission is to help condition dogs to reduce the risk of injury and increase longevity, whether that’s in sporting dogs, working dogs or pet dogs. All dogs can benefit from a little extra fitness! ",
        "language": "en",
        "author_name": "Hannah Johnson",
        "slug": "caninefitnessfanatics",
        "cover": "20220519_100505_49a4050d4245e552200f7410e9ea048e.jpg"
    },
    {
        "podcast_id": 130094,
        "title": "Le podcast de Jersey Québec",
        "description": "Jersey Québec propose des discussions entre passionnés de l'élevage de sujets bovins de race Jersey. On y parle d'expositions, d'alimentation et de coûts et bien plus encore.",
        "language": "fr",
        "author_name": "Jarold Dumouchel",
        "slug": "jerseyquebec",
        "cover": "20220524_010510_4c31d99fc2042741a05fa6903ce02b59.jpg"
    },
    {
        "podcast_id": 149674,
        "title": "A Wild Life featuring Michael the Wild Life Detective",
        "description": "Introduction to Michael the Wild Life Detective and his non profit Research Wild hosted by Jim Fisher.",
        "language": "en",
        "author_name": "Jim Fisher",
        "slug": "awildlife",
        "cover": "20220830_120827_7f103b777cbcbe20914ee2712e0388e9.jpg"
    },
    {
        "podcast_id": 151166,
        "title": "Kids Two Kids",
        "description": "Coleman (6), Vaughn (4), and Grampa explore lots of stuff that kids care about. Sports, games, toys, family, pets, health topics are all on the table to be discussed through the eyes and lives of kids.\n\nWe have special guests from to time and even some surprises. Kids from 4 to 10 will enjoy these episodes.\n",
        "language": "en",
        "author_name": "Kevin Wixom",
        "slug": "kidstwokids",
        "cover": "20220909_040921_92d1c6a2acb051cfe8a8b998113b2777.jpg"
    },
    {
        "podcast_id": 151309,
        "title": "El Stake-out",
        "description": "El podcast del mushing en España.\nUn espacio dedicado a compartir experiencias, aprendizajes y buenas prácticas de mushing.\nEl Stake-out lo formamos una comunidad de personas unidas por una misma pasión y desde unos mismos valores:\n\n– Practicar deporte junto a nuestras manadas.\n– Disfrutar de la naturaleza.\n– Aprender y mejorar sobre las buenas prácticas, metodologías y cuidados.\n\nhttps://wina.es/el-stake-out/\n",
        "language": "es",
        "author_name": "El Stake-Out",
        "slug": "el-stake-out",
        "cover": "20220905_050914_ffb54bea955882991bacdfd60a426a1f.jpg"
    },
    {
        "podcast_id": 152310,
        "title": "Just Me & My Cats Podcast",
        "description": "Hello! Welcome to the Just Me & My Cats Podcast, hosted by Megan and her two fuzzy co-hosts, Jasper and Opal. On this show, we will be talking about a variety of topics, including: history, true crime, conspiracy theories, and the paranormal, as well as lighter topics like celebrities, cooking, books, movies, and tv shows. If this sounds like your cup of tea, we'd love to have you join us! ",
        "language": "en",
        "author_name": "Megan Girbach",
        "slug": "justmeandmycats",
        "cover": "20220909_040910_5bd554f132920c6dd53f619d7d138896.jpg"
    },
    {
        "podcast_id": 152376,
        "title": "Kraft Your Dog",
        "description": "www.k9krafters.com\n419-631-1732\n\nTimmy and Christina from K-9 Krafters (Galion, Ohio) give you some training insight and some general knowledge of how to be the best dog owner.  We discuss the following: Crate Training, Correction Tools, Limiting Freedom, Limiting Human Affection, Preventing Separation Anxiety, Holding Dogs Accountable, Potty Training tips, Teaching New Behaviors, Correcting Unwanted Behavior and more. Check us out and let us help you Kraft your dog into excellence!",
        "language": "en",
        "author_name": "K-9 Krafters",
        "slug": "k9krafters",
        "cover": "20220921_110953_c374aa69172a08721681a14c65e04747.jpg"
    },
    {
        "podcast_id": 153909,
        "title": "WildBrewed",
        "description": "Join me for a conservation chat over a cup of coffee. Explore topics like sustainability, animal species, conservation, minimalism and how to be a better steward of the planet.",
        "language": "en",
        "author_name": "PB Crotinger",
        "slug": "wildbrewed",
        "cover": "20220916_010951_5d630ae6c08e6de8b871a906a51582eb.jpg"
    },
    {
        "podcast_id": 159418,
        "title": "Emma I Dyrenes Verden",
        "description": "Vidste du, at verdens stærkeste dyr er en bille? At geder har dialekter? Eller at der findes en flagermus der ikke vejer mere end 2 gram? Alt det, og meget mere kan du blive klogere på i Emma i Dyrenes Verden, en podcast om verdens mange dyr, lavet i en højde, hvor alle kan være med.\n\nBag podcasten sidder Emma, en 23 år ung og farverig biologistuderende med en brændende passion for dyrenes verden. Emma har nørdet dyr siden hun var barn og fascinationen for dyreriget, er over tiden ikke blevet mindre.\n\nFølg med, og se billeder af alle dyrene på Instagram: @emma.i.dyrenes.verden",
        "language": "da",
        "author_name": "Emma Jensen",
        "slug": "emmaidyrenesverden",
        "cover": "20221010_111052_95b0717b6e04b1a37fd0633a35399555.jpg"
    },
    {
        "podcast_id": 160080,
        "title": "The MSD Animal Health Podcast",
        "description": "This podcast is on animal health and agricultural technology solutions which are driving greater efficiency, improved animal welfare and more sustainable food production on Irish farms.",
        "language": "en",
        "author_name": "MSD Animal Health",
        "slug": "udder-health",
        "cover": "20221102_051139_6efc2f7e0491ff38bce18de6c8d81850.jpg"
    },
    {
        "podcast_id": 161782,
        "title": "Dog in the Dorm",
        "description": "<p>A podcast featuring a college student with a dog in the dorm! Katie talks about her experiences with a four-legged roommate on the college campus, as well as go into depth into dog related topics, including training, health, nutrition, and dog sports and the role young adults in the future of the dog world. Research, pervious knowledge and experiences, and interviews will be used to deliver the newest information to listeners, focused on educating both audiences and each other on a variety of dog topics.</p>",
        "language": "en",
        "author_name": "Katie",
        "slug": "doginthedorm",
        "cover": "20221020_021044_1e35b0f39f9dde0cdcb6bbdcf3b10c0f.jpg"
    },
    {
        "podcast_id": 161856,
        "title": "Programa radio GATS",
        "description": "Los miércoles, cada 15 días, la voluntaria de la asociación Gats de Carrer Cubelles, Marta López, presenta en Radio Cubelles el Programa GATS, un espacio donde hablamos de las últimas actuaciones de la asociación así como de temas relacionados con los michis con invitados como veterinarios, peluqueros felinos, miembros de la administración pública... Si te gustan los gatos, no te lo pierdas!",
        "language": "es",
        "author_name": "Gats de Carrer Cubelles ",
        "slug": "gatscarrercubelles",
        "cover": "20221020_071036_10d06489ce17ebb7f0ffd8723475327c.jpg"
    },
    {
        "podcast_id": 163329,
        "title": "Bizzo's Holiday Secret",
        "description": "Bizzo’s Holiday Secret is the magical story of a dog matriarch, Bizzo, and her two young companions, Bindi and Crikey.  In winter, during the time of the white fluff, legend tells of a supernatural two-legger who leaves toys and treats for animals everywhere on one special night.  After encountering this magical being, Bizzo begins a fantastical journey of discovery, leading to an incredible holiday secret she can share.  ",
        "language": "en",
        "author_name": "Bonzer Productions™",
        "slug": "bizzosholidaysecret",
        "cover": "20221026_021030_0084cafc1f5d7b728dc0ba84859efee2.jpg"
    },
    {
        "podcast_id": 164540,
        "title": "Drinks and Dogs",
        "description": "Connecting dog trainers and perspective on training from across the world. ",
        "language": "en",
        "author_name": "Primal TV",
        "slug": "drinks-and-dogs",
        "cover": "20221101_011133_413e85e917dd247e73735efa5cdc4243.jpg"
    },
    {
        "podcast_id": 165141,
        "title": "Witches get Stitches",
        "description": "2 girls from the Midwest take on podcasting. From crochet to witchcraft and all things spooky; enjoy the banter, one shared brain cell and a rediculous amount of dog talk with Jasmine and Jaymee your resident witches.",
        "language": "en",
        "author_name": "Jasmine Marie and Jaymee E",
        "slug": "witchesgetstitches",
        "cover": "20221111_121155_0ac9bc2bd6196ddd87d0ae67b3ba4f12.jpg"
    },
    {
        "podcast_id": 167516,
        "title": "Two Weirdos In The Woods",
        "description": "<p>In this podcast we will talk about all sorts of topics that span over a multitude of categories, primarily creepy/horror related subjects</p>",
        "language": "en",
        "author_name": "Heath & Jasper Boss",
        "slug": "twoweirdosinthewoods",
        "cover": "20221113_071107_b916438ca6e1a58c14b9159f1fe2dd72.jpg"
    },
    {
        "podcast_id": 168264,
        "title": "K9SL Live",
        "description": "<p>A podcast about the personal protection dogs, and the dog sport world. We bring in guests from all of over the industry. </p>",
        "language": "en",
        "author_name": "primalcanineuniversity@gmail.com",
        "slug": "k9sllive",
        "cover": "20230421_050453_b037a76ff740b8a392c6b45b281d2fdf.jpg"
    },
    {
        "podcast_id": 172331,
        "title": "The Canine Classroom Podcast",
        "description": "<p><strong>Welcome to The Canine Classroom, a podcast for dog training professionals and dog enthusiasts, where we discuss training, behavior and everything in between! </strong></p><p><strong>We are two friends and dog trainers who share a passion for dogs. We're constantly learning, exploring, and questioning each other's ideas, as well as our own, so we can become better at what we do. </strong></p><p><strong>We are here to providing helpful advice, have open conversations, ask questions, get answers, as well as hear from colleagues and experts in the industry, regardless of method and training style.</strong></p>",
        "language": "en",
        "author_name": "Anthony De Marinis & Vinny Viola",
        "slug": "thecanineclassroompodcast",
        "cover": "20221204_031224_eb026e94a90f328e191fef8e1bf646b7.jpg"
    },
    {
        "podcast_id": 176895,
        "title": "Naukowo, w prostych słowach",
        "description": "Cykl podcastów \"Naukowo, w prostych słowach” to propozycja dla Wszystkich, którzy szukają solidnej dawki wiedzy, popartej badaniami naukowymi i podanej w ciekawej formule. W naszych podcastach chcemy rozmawiać przede wszystkim o zdrowiu domowych pupili i wszystkim, co zdrowia dotyczy.",
        "language": "pl",
        "author_name": "Virbac Polska",
        "slug": "naukowo-w-prostych-slowach",
        "cover": "20230116_020134_63b97a62575bfb5e073fa89ba62d30de.jpg"
    },
    {
        "podcast_id": 179000,
        "title": "S'N'A Network Presents Trade Time",
        "description": "Trade Time is a series of interviews from UK Reptile Shop owners and Managers.\nWe seek to hear their stories about their time in the 'trade'. Reptile shops owners come from every walk of life, with vastly differing experiences and attitude towards the arena they work within. \n\nAs the series develops we will also introduce manufacturers and product developers specific to herpetoculture. \n\n",
        "language": "en",
        "author_name": "Charles Thompson",
        "slug": "snanetwork",
        "cover": "20230108_110150_2bfc8f7458e1494df804a803370c049e.jpg"
    },
    {
        "podcast_id": 182825,
        "title": "Les chiens - Cani Curieux - By Centre Canin Éduc'stucieux",
        "description": "<p>Bonjour les amis des chiens ! Bienvenue sur nos podcasts ! Ici nous parlons chiens mais surtout nous vous écoutons et répondons à toutes vos questions ! N'hésitez pas à nous adresser toutes vos questions par email à info@educstucieux.com ou directement sur notre Instagram Neji_the_lazy_sam !</p>",
        "language": "fr",
        "author_name": "Centre Canin Éduc'stucieux",
        "slug": "educstucieux",
        "cover": "20230515_060558_61c37b548d132ed91d7262b94e216c26.jpg"
    },
    {
        "podcast_id": 183592,
        "title": "Dog Spaw",
        "description": "All things Canine Wellness, Nutrition & Behaviour.\nHosted by Muso&Spaw's owner Melanie Ferreira who posesses a college degree in animal health and is certified in behaviour, force-free grooming, canine nutrition and zoocosmetology.\nCo-hosted by Muso&Spaw's first employee and assistant-manager, Katie Thomson who is well versed in canine nutrition and well-being, and is currnetly in training for dog grooming, canine behaviour and the force-free method.\n",
        "language": "en",
        "author_name": "Melanie Ferreira",
        "slug": "musospaw-dogspaw",
        "cover": "20230125_070133_996bb2ab65b807b1cd3fc339458c72ea.jpg"
    },
    {
        "podcast_id": 185681,
        "title": "Cremascota",
        "description": "Tanatorio de mascotas ubicado en Madrid, España.\n\nAmamos a los animales! Es por eso que a través de este espacio compatiremos información sobre el proceso de despedida así como tips para llevar el duelo por tu amigo peludo e información varia sobre las mascotas en general.\n\nSiempre, con amor hasta el final!",
        "language": "es",
        "author_name": "Cremascota",
        "slug": "cremascota",
        "cover": "20230201_070208_9a606159195ccd4b54ea592e3e2d3688.jpg"
    },
    {
        "podcast_id": 186293,
        "title": "Flop. ",
        "description": "<p>Hi friends! Welcome to Flop Pet Talk. Here we talk about, and amplify all things pets and animals in South Africa. We aim to strengthen the bonds of the animal community, as well as discuss, and promote anything and everything that fits into that category. We believe that education is key to eliminating ignorance. Responsible and ethical pet care- and ownership practices are our guiding light and with all the bad in the world, we want to shed some light on the good in our community. Let's do some good!</p>",
        "language": "en",
        "author_name": "Ilne Weyers",
        "slug": "flop",
        "cover": "20230203_080244_887347c33abae08c4c9267a078bd9e79.jpg"
    },
    {
        "podcast_id": 188176,
        "title": "4 Paws Sports",
        "description": "Join us while we discuss everything dog related, from training, to competing and everything in between!",
        "language": "en",
        "author_name": "Geoff and Mary",
        "slug": "4pawsports",
        "cover": "20230210_020224_a3d4b340ec19faccfffa4541d616570e.jpg"
    },
    {
        "podcast_id": 190070,
        "title": "Ranch Life by Kingdom Radio",
        "description": "<p>I must admit that we're the typical \"City Slickers\" that moved out to a small farm and we're trying to figure out this life. Our company <a href=\"https://kingdomchristmaslights.com/\">Kingdom Christmas Lights</a>, keeps us busy in the Christmas business during the holiday season and then we have about 4 months to work on the land and add to our \"flock\". With this being said, we're not expert farmers or in the same breath we don't own thousands of acres of land, we're just your everyday average people who are learning how to live life on a big piece or farm land property. :)</p><p>If you would like to network with Kingdom Radio, please email us at <a href=\"mailto:ron@whykingdom.com\">ron@whykingdom.com</a> or give us a call at 346-291-3131 to support or to be featured on our show.</p>",
        "language": "en",
        "author_name": "Kingdom Radio",
        "slug": "ranchlife",
        "cover": "20230216_050203_e902e83e0499175b15db16e67203e45a.jpg"
    },
    {
        "podcast_id": 190230,
        "title": "Ruff Life",
        "description": "<p>Background stories and behind the scene details inside the world of animal rescue.</p>",
        "language": "en",
        "author_name": "Katie Keeton",
        "slug": "rufflife",
        "cover": "20230223_090224_cc94cf198643cbef56d8a1fbaaafd08a.jpg"
    },
    {
        "podcast_id": 190606,
        "title": "The Dog Mom Show",
        "description": "<p>Weekly podcast talking to dog moms, industry experts, and dog influencers, sharing advice and insights to help you be the best dog mom ever.</p>",
        "language": "en",
        "author_name": "Chanda Gunter",
        "slug": "thedogmomshow",
        "cover": "20230218_100222_fe23e0aeb1dfa166b7a4b1817e6b9341.jpg"
    },
    {
        "podcast_id": 190887,
        "title": "Equestrian Girl",
        "description": "<p>Olivia McAdams is newly an adult amateur and has been riding for 9 years. She has a lot of opinions about the equestrian community. Listen for a laugh and for a safe place to be the horse girl geek you want to be🤩 New episodes every Sunday and Thursday! Follow her socials⬇️</p><p>instagram: @equestriangirlpodcast</p><p>my main instagram: @oliviamceq</p><p>email: oliviamceq2023@gmail.com</p>",
        "language": "en",
        "author_name": "Olivia McAdams",
        "slug": "equestriangirl",
        "cover": "20230302_110303_f18304b4a20160f7bff317dfdd12d932.jpg"
    },
    {
        "podcast_id": 191383,
        "title": "Peace Love and Pets",
        "description": "<p>About The Author</p><p>Sandy Kamen Wisniewski is the founder and director of Animal Education and Rescue, a charitable rescue and humane society. She’s an author and her books include: I Can’t Stop Shaking, The Animal Warrior, You Are My Sunshine and A Dog Named Walter.</p><p>Sandy is an intuitive healer, artist and inspirational speaker.</p><p>Sandy shares her home with her husband Chuck, her son Danny and countless rescue animals, some that come and go and others that stay for life.</p><p>Web sites:</p><p><a href=\"http://www.aear.org\">www.aear.org</a></p><p><a href=\"http://www.mindfulspirit.net\">www.mindfulspirit.net</a></p><p><a href=\"http://www.sandykamenwisniewski.com\">www.sandykamenwisniewski.com</a></p><p>Follow Sandy on Facebook at:</p><p>Animal Education and Rescue</p><p>Sandy Kamen-Wisniewski</p>",
        "language": "en",
        "author_name": "Sandy Kamen Wisniewski ",
        "slug": "sandy-kamen-wisniewski",
        "cover": "20230221_110209_64e62432036f9e709e65104209a5a776.jpg"
    },
    {
        "podcast_id": 194217,
        "title": "ANIMALNAUTAS EL PODCAST",
        "description": "<p><strong>Animalnautas</strong> es el podcast donde hablaremos de hechos históricos, música, chismecito e información relevante sobre nuestros animales de compañía con un enfoque científico, pero con un humor muy, muy ácido y muy, muy, incómodo para muchas personas.</p>",
        "language": "es",
        "author_name": "CHARLY KALIFORNIA & El ABOMINABLE DOCTOR RICK",
        "slug": "animalnautas",
        "cover": "20230304_120325_bd8ebf5188d8cbd2558b72165e490376.jpg"
    },
    {
        "podcast_id": 194484,
        "title": "Multiplayer Mingles",
        "description": "<p>Hey everyone! Welcome to \"Multiplayer Mingles\"!</p><p>My name is Lauren, and I operate Multiplayer Morphs! On this show, I interview some amazing breeders in our wonderful community!</p><p>You can check out all our social media here:</p><p>➡️<a href=\"https://linktr.ee/multiplayermorphs\">https://</a><a href=\"http://linktr.ee/multiplayermorphs\">linktr.ee/multiplayermorphs</a></p><p>multiplayer.morphs@gmail.com</p>",
        "language": "en",
        "author_name": "Lauren Grey",
        "slug": "muliplayermingles",
        "cover": "20230305_040304_0baf9cc9223bd07b3c7bbc7e019c3a53.jpg"
    },
    {
        "podcast_id": 195029,
        "title": "Honest K9 Connections ",
        "description": "<p>We are open-minded, informative and we have controversial conversations about all things dogs.</p><p>Erika, French bulldog breeder, trainer in training &amp; entrepreneur @madewithlovepups.</p><p>Mariah, Trainer, groomer in training &amp; entrepreneur @countypaws</p><p>Seneca, Trainer &amp; entrepreneur @senandco</p>",
        "language": "en",
        "author_name": "Erika Zelaya, Mariah Fraser & Seneca Goodsman",
        "slug": "honestk9connections",
        "cover": "20230307_030331_c7d506882b67ca4fd634ccb1f3812e0c.jpg"
    },
    {
        "podcast_id": 201171,
        "title": "Better Humans. Better Planet - Español",
        "description": "<p>Un podcast donde Cesar Millan y su manada continúan con su misión de hacer de este mundo un mejor al mejorar la forma en que nosotros, como humanos, tratamos a nuestros animales. Una frase muy común dice que \"el progreso de una nación se puede juzgar por la forma en que trata a sus animales\". César recorre sus historias, métodos, y pensamientos sobre eventos actuales, entrenamiento de perros y muchos, muchos más temas.</p>",
        "language": "es",
        "author_name": "Cesar MIllan",
        "slug": "cesarmillan-btbpesp",
        "cover": "20230404_120443_1296d45559bfdf1a02f23370645a07d1.jpg"
    },
    {
        "podcast_id": 201732,
        "title": "DogTalks",
        "description": "<p><em>Da più di 2000 anni l'uomo si evolve con i cani, nel 2023 è ancora possibile vivere con un cane? DogTalks affronta il tema della relazione che si instaura tra i cani e le persone, una delle relazioni che più tocca il cuore dell'essere umano. E' un podcast pensato e realizzato da Roberta Ponzoni e Costanza Desiderio - istruttrici cinofile esperte in area comportamentale - che ogni quindici giorni affronteranno una tematica ricorrente nella vita di tutti i giorni di coloro che condividono la quotidianità con un cane. Gli episodi saranno pubblicati il secondo e il quarto mercoledì di ogni mese.</em></p>",
        "language": "it",
        "author_name": "Roberta Ponzoni e Costanza Desiderio",
        "slug": "dogtalks",
        "cover": "20230406_050431_48ec3ef14195a1492b7824ec77104c29.jpg"
    },
    {
        "podcast_id": 202634,
        "title": "Better Humans, Better Planet",
        "description": "<p>Cesar Millan gets close and personal with guests at the Dog Psychology Center, to talk about life, humanity, behavior, animals and more; all while walking the pack, conquering challenges and having fun. New episodes every two weeks.</p>",
        "language": "en",
        "author_name": "Cesar Millan",
        "slug": "cesarmillan-btbpeng",
        "cover": "20230411_030411_6cabf14eb70e693f7c67b46e4066b853.jpg"
    },
    {
        "podcast_id": 205941,
        "title": "Käpapatrulli Podcast",
        "description": "<p>Podcastide sari \"Käpapatrulli podcast\", mille peamiseks fookuseks on koerad ja nende omanikud. Räägime paljudel erinevatel teemadel nagu kasvatus, areng, käitumine, naljakad juhtumid, aktuaalsed teemad ja palju muud. Saatejuhtideks on Siim Oja, kes on omanimelise kooli koolitus- ja arendusjuht ning Karl Kalme, kes on Käpajuht nõustamisagentuuri asutaja. Kahe peale kokku on meil üle 20 aasta koerte käitumismuredega tegelemise kogemust.</p>",
        "language": "ee",
        "author_name": "Siim Oja & Karl Kalme",
        "slug": "patrullijad",
        "cover": "20230809_050807_9149a3dd17bf1e8fff11ab42fa6f9591.jpg"
    },
    {
        "podcast_id": 206429,
        "title": "Bear in Mind",
        "description": "<p>Welcome to Bear in Mind! Join zoo educators Lisa and Emily and a variety of guests as they talk about all things bear and dive deeper into the conservation, well-being, and education efforts of the Bear TAG (Taxon Advisory Group).</p>",
        "language": "en",
        "author_name": "Emily Bisordi",
        "slug": "bear-in-mind",
        "cover": "20230430_010402_effe07bc6ef21fc48725fdc9cdba85d3.jpg"
    },
    {
        "podcast_id": 207881,
        "title": "Out The Kennel",
        "description": "<p>Welcome to the “Out the Kennel podcast”, where we bring you real bully breeders and real stats about the topics that matter in the bully community, with no bullsh*t ! Each episode, we dive deep into the world of the bully game and far beyond, with guests who are experts in their field. Get ready to learn, laugh, hear real answers ! join the conversation on \" Out the Kennel podcast\" “” where the dogs are set loose”” !!</p>",
        "language": "en",
        "author_name": "Out The Kennel",
        "slug": "outthekennel",
        "cover": "20230508_040554_5cc21f24b1a07876fec4a4c522882a33.jpg"
    },
    {
        "podcast_id": 208585,
        "title": "Silver Honey Ear Care Podcast",
        "description": "<p>Dr. Lucas Pantaleon visits with Bark N Wag to answer questions about Silver Honey Ear Care products and the causes and symptoms of ear infections.</p>",
        "language": "en",
        "author_name": "Animal Care Team",
        "slug": "silverhoneyearcare",
        "cover": "20230511_030504_69dccdd4b40d25714cd50da19216d6df.jpg"
    },
    {
        "podcast_id": 209322,
        "title": "INSIDE CENTERRA",
        "description": "<p>Inside Centerra invites listeners to sit in on conversations with Centerra Co-Op employees, vendors and members. Topics will range from grain and fuel market updates, livestock and pet nutrition, and crop and harvest advice to information about safety, new products and techniques, stories about farming and more.</p>",
        "language": "en",
        "author_name": "Centerra Co-Op",
        "slug": "inside-centerra",
        "cover": "20230515_020548_d625f35d2ea6d89846532a674d2e3c5d.jpg"
    },
    {
        "podcast_id": 211045,
        "title": "Storie da Cani",
        "description": "<p>Sei una mamma o un papà? Stai pensando di adottare un cucciolo e hai un bambino? Hai un cane e stai per diventare genitore? ALLORA DOVRESTI SAPERE CHE i bambini vengono morsi più frequentemente rispetto agli adulti e riportano ferite più gravi essenzialmente per tre motivi:</p><ul><li><p>La loro innata curiosità li porta a cercare un contatto con gli animali;</p></li><li><p>La loro inesperienza e la voglia di giocare li porta a interagire in modo sbagliato suscitando a volte reazioni aggressive;</p></li><li><p>Una volta aggrediti i bambini hanno una minore capacità di difendersi.</p></li></ul><p>In questo podcast \"Storie da Cani\" Martina e Elena vi guideranno nel mondo dei cani e dei bambini dandovi tutte le informazioni di cui avete bisogno per vivere a pieno il potenziale di una \"famiglia/branco\" senza ansie e in serenità.</p>",
        "language": "it",
        "author_name": "Martina Donà ed Elena Froldi",
        "slug": "storiedacani",
        "cover": "20230523_060529_7ee4623d901b1e08d7451dbcd71f0e5f.jpg"
    },
    {
        "podcast_id": 216435,
        "title": "#DigNoFurther",
        "description": "<p>Looking for answers to your dog training questions? At #DigNoFurther, we're working hard to put together an array of answers to the most common and frequently asked dog training questions, as well as do's &amp; don'ts, enrichment ideas, breed Facebook groups, product discounts, doggy news, and more! All of which is available at www.dignofurther.com</p>",
        "language": "en",
        "author_name": "Carlos Chacon",
        "slug": "dignofurther",
        "cover": "20230623_050644_31d86db1f7b3580da86ef4a8e9232641.jpg"
    },
    {
        "podcast_id": 216619,
        "title": "Trainer Talks and Tails",
        "description": "<p>Join co-hosts Tess &amp; Daisy on Trainer, Talks and Tails podcast where, with the help of fellow keepers, trainers, and industry experts we’ll discuss topics within the zoological and aquarium industry including animal training and conservation!</p>",
        "language": "en",
        "author_name": "Daisy Barrett & Tess McKelliget",
        "slug": "trainertalksandtails",
        "cover": "20230624_090651_45bfabfd48fa7ad2ebb91985649efc0b.jpg"
    },
    {
        "podcast_id": 217793,
        "title": "Bully Visionz Pawdcast ",
        "description": "<p>Welcome to Bully Visionz: The Vegas Vibe Podcast! Immerse yourself in the world of American bully kennels - a thrilling journey behind the eyes of pure power and strength. Join us as we dive deep into the breed with global kennels, and get expert insights from top-notch veterinarians specialized in bully health. </p><p>\"Unraveling the Mystery: American Bully Breed. We're paving the path to understanding these magnificent dogs. Through education, we're revolutionizing the breed. But let's start at the source. We, the breeders, must be the epitome of excellence. Join us in dismantling misconceptions. Together, we'll make change!</p>",
        "language": "en",
        "author_name": "Savanna ",
        "slug": "bullyvisionzllc",
        "cover": "20230703_050706_9fd6742ab859ad53b26110fe3448c18b.jpg"
    },
    {
        "podcast_id": 218841,
        "title": "Natural Equine Healing: From The Ground",
        "description": "<p>Hey Equine Enthusiast! Welcome to Natural Equine Healing's <strong>From The Ground Podcast. </strong>I'm your host Ryahn; certified equine bodywork practitioner and health &amp; wellness consultant.</p><ul><li><p>Has your horse suffered from an injury or trauma that has deemed them unridable?</p></li><li><p>Do you have no desire to ride horses but still enjoy forming a connection with your horse from the ground?</p></li><li><p>Are you looking for ground work activities or resources to help keep your horse active and engaged without climbing into the saddle?</p></li></ul><p>If you answered YES to any of these questions then equine enthusiast, I can assure you that you are in the right place! Each week I will share activities and resources that will help you</p><ol><li><p>Build a connection with your horse from the ground</p></li><li><p>Strengthen your horse's musculoskeletal system &amp; mind regardless of physical or behavioral limitations</p></li><li><p>Feel confident in your equestrian journey from the ground</p></li></ol><p>As you tune in each week my hope is to provide you with knowledge, support, guidance, and dependability to improve your equine's health and wellness from the ground because, <strong>YOUR EQUINE MATTERS</strong></p><p><strong>If you are ready to instill confidence in your equestrian journey from the ground, make sure to hit the subscribe button!</strong></p>",
        "language": "en",
        "author_name": "Ryahn Purvis",
        "slug": "fromtheground",
        "cover": "20230710_080723_7899c71b6cab904c683fc84244a19d69.jpg"
    },
    {
        "podcast_id": 218847,
        "title": "Animals Working in Conservation",
        "description": "<p>Did you know that human researchers are able to partner with highly trained working animals to improve wildlife conservation outcomes? These working animals may be contributing in more ways than you think! The truth is, we have just begun to scratch the surface of the potential of trained working animals to assist humans in their efforts to study, preserve, and restore wildlife and the environment.</p>",
        "language": "en",
        "author_name": "Anna Gustafson",
        "slug": "awic",
        "cover": "20230710_090749_e1ea974f2fec254e96ae36cf2bcf28dd.jpg"
    },
    {
        "podcast_id": 219288,
        "title": "The Pet Loss Journals",
        "description": "<p>Sharing my own pet loss journal entries each episode so that others going through pet loss don't feel so alone. Learn ways to heal after a major pet loss event in your life, you can heal, and know that your grief is completely valid.</p>",
        "language": "en",
        "author_name": "Louise Griffey",
        "slug": "thepetlossjournals",
        "cover": "20230713_010723_00fcbbb25a228013364727ea6f5dba9b.jpg"
    },
    {
        "podcast_id": 220164,
        "title": "Pawcast Bali Safari",
        "description": "<p>Hallo safari lovers! Selamat datang di Pawcast, the Bali Safari wildlife talk.</p><p>Di sini kami akan membahas seputar satwa dan lingkungan dengan mengundang langsung mereka-mereka yang berpengalaman di bidangnya. Follow Pawcast agar tidak melewatkan episode-episode menarik dari kami.</p>",
        "language": "id",
        "author_name": "Bali Safari Park",
        "slug": "pawcast-bali-safari",
        "cover": "20230720_050735_f510c5422caca000a4d618a1f417a2be.jpg"
    },
    {
        "podcast_id": 220177,
        "title": "first podcast ",
        "description": "<p>so this its the first podcast of more for come we are gonna  speak  spanish and english </p>",
        "language": "en",
        "author_name": "Braian Franco",
        "slug": "2006",
        "cover": "20230719_080714_c0015c727354841f3a33c4ee57dd549b.jpg"
    },
    {
        "podcast_id": 220182,
        "title": "Veterinerinize Sorun",
        "description": "<p>Veteriner hekim Süleyman Türkoğlu sizden gelen soruları cevaplıyor...</p><p>\"Kedi bakanların alması gereken ürünler nelerdir?\"</p>",
        "language": "tr",
        "author_name": "Süleyman Türkoğlu",
        "slug": "vetangeles",
        "cover": "20230719_090723_34d860a8f5bdc19a7801f12580f49d9d.jpg"
    },
    {
        "podcast_id": 223218,
        "title": "Mi primer podcast 🤠👍",
        "description": "<p>case 143 la nueva cancion del famoso grupo stray kids</p>",
        "language": "es",
        "author_name": "Stray kids",
        "slug": "holachanbeststraykidsmember",
        "cover": "20230809_020845_6f5ccf545831320dd57051bd76e0f4e8.jpg"
    },
    {
        "podcast_id": 223773,
        "title": "Q&A: Car alerts, night alerts, and hight alerts",
        "description": "<p>Demystifying Diabetic Alert Dog Training with Libby Rockaway and Maggie Kudla</p><p>Join us on a transformative podcast journey with two trailblazing figures in the world of diabetic alert dogs. Libby Rockaway, the visionary force behind MD Dogs, joins forces with Maggie Kudla, a seasoned service dog trainer, to unravel the enigma surrounding self-training these exceptional canine companions.</p><p>With a clear mission to empower those embarking on the self-training odyssey, we're determined to break down the barriers that often make diabetic alert dog training seem unattainable.</p>",
        "language": "en",
        "author_name": "Maggie ",
        "slug": "mddogspod",
        "cover": "20230812_060801_f7dca81e002f5a2e06baa1bf330e0f11.jpg"
    },
    {
        "podcast_id": 224244,
        "title": "The Xolos Ramirez Show ",
        "description": "<p>Weekly Twitter Gathering to Engage in Lively Conversations about The Fascinating World of Xoloitzcuintle.</p>",
        "language": "en-us",
        "author_name": "Fernando Ramírez",
        "slug": "thexolosramirezshow",
        "cover": "20230815_080830_6dcef31f0ce6ba15ca6ead4d177cc737.jpg"
    },
    {
        "podcast_id": 224305,
        "title": "THE BLOBTHECOB CAST",
        "description": "<p>Welcome to the Blobthecob Cast where we discuss all things horsey, from the sport, drama, guests and more! Join me on my new journey into podcasting! Kate</p>",
        "language": "en",
        "author_name": "Kate Lewis ",
        "slug": "blobthecobcast",
        "cover": "20230816_070814_5eceff0e39d94bcec1da234afd1fc805.jpg"
    },
    {
        "podcast_id": 224709,
        "title": "EQUK Chat",
        "description": "<p>Opening the stable door to the equine industry by sharing inspiring stories.</p><p>EQUK Chat is the podcast that shares stories about the real people who live, breathe and work within the equestrian industry and beyond. </p><p>Equine Qualifications UK is an education marketing company which reinvests its profits into widening access to grassroots equestrian sports and supporting people who may otherwise struggle to access the industry to do so.</p>",
        "language": "en",
        "author_name": "Equine Qualifications UK",
        "slug": "equk-chat",
        "cover": "20230818_060801_1c4e1805832808c04e5d9d2e991923aa.jpg"
    },
    {
        "podcast_id": 226434,
        "title": "Adapa Rafaela",
        "description": "<p>Acción de Defensa Animal y Protección Ambiental</p>",
        "language": "es",
        "author_name": "Ana Paula Rosillo",
        "slug": "adaparafaela",
        "cover": "20230829_070800_feff8baaf40492fa0abfd7a4e983700c.jpg"
    },
    {
        "podcast_id": 227092,
        "title": "VetNerds",
        "description": "<p>A podcast made by a veterinary student, for veterinary students, especially the nerdy ones who love practice clinical reasoning with cases.</p>",
        "language": "en",
        "author_name": "Ariel Tianjiao Li",
        "slug": "vetnerds",
        "cover": "20230903_080956_727823b4de4a3623c299669cb7e73ae9.jpg"
    },
    {
        "podcast_id": 227358,
        "title": "Astro and Siblings Podcast",
        "description": "<p>Dog training problems and daily life of a dog trainer</p>",
        "language": "en",
        "author_name": "Astro and Siblings",
        "slug": "astroandsiblingspodcast",
        "cover": "20230905_070904_b312725ffcc2d345f0683245086cfa03.jpg"
    }
]