[
    {
        "podcast_id": 2610,
        "title": "Josh & Tyler Talk Movies",
        "description": "Josh and Tyler every week talk movies from all over the globe, get in arguments, and have 0 dignity!",
        "language": "en",
        "author_name": "Josh McCormack",
        "slug": "joshandtylertalkmovies",
        "cover": "20200916_070918_1f3c3d78d2c1439d852dd94df0288551.jpg"
    },
    {
        "podcast_id": 5866,
        "title": "Chemistry - The Lab Podcast",
        "description": "Gerald and Tyquise are your hosts of the new podcast! Hear about dance news, pop culture, and hot topics of the week. We'll also be sitting down with local artists and super talented people to give you insight of the magic they create! LETS GOOOOOO!! #chemistry #podcast #artistpodcast",
        "language": "en",
        "author_name": "Gerald Lovelace & Thomas \"Tyquise\" Holbrook",
        "slug": "thelabchemistry",
        "cover": "20211005_210733_7048b73a2b8d299a6771c46e912016e4.jpg"
    },
    {
        "podcast_id": 6194,
        "title": "b2b social media etiquette",
        "description": "Quick tips on how to survive B2B etiquette in the social media world. ",
        "language": "en",
        "author_name": "Heather Halloran",
        "slug": "theweeklysocialbreeze",
        "cover": "20200212_224658_4f6e5da6eff232d2201947201eaf3b29.jpeg"
    },
    {
        "podcast_id": 6408,
        "title": "8SMIČKAST",
        "description": "Humpolecká zóna pro umění 8smička hrdě vstupuje do éteru. Podcastový kanál vysílá zprávy z Humpolce do celého světa. Na jeho vlnách si ti, kteří to mají do 8smičky daleko, mohou na dálku projít spolu s kurátory výstavy nebo se naladit na uměleckou vlnu a zaposlouchat se do rozhovorů o umění s nejrůznějšími hosty. ",
        "language": "cs",
        "author_name": "8smička - zóna pro umění/ art zone",
        "slug": "8smickast1",
        "cover": "20200321_130540_da499caae7bf4b0a0596424a1d4eae09.jpeg"
    },
    {
        "podcast_id": 7026,
        "title": "Pictures and Words",
        "description": "Pictures and Words is a series of conversations with artists, photographers, publishers, gallerists and curators hosted by Fall Line Press. \n",
        "language": "en",
        "author_name": "Fall Line Press, Inc",
        "slug": "picturesandwords",
        "cover": "20200323_230345_79ad70a2cfa2e67636ac53abd19623b7.jpeg"
    },
    {
        "podcast_id": 9801,
        "title": "MAD PAIN",
        "description": "Tattoo artist Doreen Garner delivers you MAD PAIN. This collection of conversations celebrates and amplifies the voices and experiences of marginalized tattoo artists while also discussing with white tattooers that are allies strategies for eradicating the most toxic components of the tattoo industry.\n",
        "language": "en",
        "author_name": "Doreen Garner",
        "slug": "madpain",
        "cover": "20200619_110627_63679523984b0b593882bc819ef6d47a.jpeg"
    },
    {
        "podcast_id": 10156,
        "title": "Godzilla Roundtable ",
        "description": "A Godzilla Podcast dedicated to chronicling the big Dinosaur's history in order featuring Mulder/Fae, TalesOfNine/ToN and Crashfan1ooo/Crash with a focus on diversity. Logo artwork done by Dan Hartles. Proud member of Fears, Futures, and Fossils.",
        "language": "en",
        "author_name": "Fae Basir, TalesOfNine, Crashfan1ooo",
        "slug": "godzillaroundtable",
        "cover": "20200723_043521_cd77d128729bf9f16db651bfd36c8d18.jpg"
    },
    {
        "podcast_id": 10233,
        "title": "The Hola Gwapa Podcast",
        "description": "Hola Gwapas! And welcome The Hola Gwapa Podcast! I'm your host and fellow Creative, Nisha Btesh. Each week I’ll be interviewing a brand new Artist from the Hola Gwapa community and we’ll be having REAL up close & personal conversations about the ups and downs of their unique journeys - highlighting all the different ways creatives at the top of their game are using to turn their passions into a paycheck! We’ll touch on topics like how to develop a solid morning routine, how to talk confidently about pricing your work, monetizing your talent & maintaining control of your finances as well as what it truly takes to build and grow a community in this digital age. Plus you know I’ll be asking for all their juicy tips, tricks and secret sauces to success! SO I hope this podcast provides you with tangible takeaways and introduces you to a wide variety of fabulous female creatives each with a different story, medium and message - but most of all I hope you walk away feeling a little less alone and more inspired than ever to keep your Artistic and Entrepreneurial hustle strong knowing that The Hola Gwapa community truly is your safe space to share, connect with and celebrate the creative in you.",
        "language": "en",
        "author_name": "Nisha Btesh",
        "slug": "theholagwapapodcast",
        "cover": "20200702_215352_3e8f33b84ff33b06ea5c3067ba68bf22.jpg"
    },
    {
        "podcast_id": 10284,
        "title": "The 804 Podcast",
        "description": "Nic, Alex, and Jesse 3 Different Personalities and 3 Different Backgrounds with the one thing they have in common is RVA. With the hottest topics going on around the globe and Local guests from The 804, they definitely keep the show Raw and Real.\nFollow the guys\n@_ja1day1films \n@solo_alford\n@ncarter04\n",
        "language": "en",
        "author_name": "Alex Alford, Jesse Chambliss, Nic Carter",
        "slug": "ja1day1",
        "cover": "20200704_213017_29c154e94422b39e2a58582e8afeefb0.jpg"
    },
    {
        "podcast_id": 10962,
        "title": "Whose Anime Is It Anyway?",
        "description": "A conversational podcast about every anime I've ever watched that has been finished. The discussion brings in a co-host every week from my personal life, in which the show is connected to that person and we rate the show at the end of the podcast.",
        "language": "en",
        "author_name": "Aaron",
        "slug": "waiia",
        "cover": "20200730_034556_79c007a718d7edd8c4dd6d3b6f92fdec.jpg"
    },
    {
        "podcast_id": 11188,
        "title": "D.A.E. Presents ARTPIT",
        "description": "The Art Pit is the eye of the storm. A swirling menagerie where artists, musicians, collectors and other interesting people collide to discuss their craft, share their ideas and pull no punches in the process.\nHosted by “The Jeremys” from the Dark Art Emporium Gallery in Long Beach California, this podcast is for anyone who loves art and isn’t afraid to venture into the darker side of life.",
        "language": "en",
        "author_name": "The Dark Art Emporium",
        "slug": "artpit",
        "cover": "20200806_231546_2810657cb625ca28afbb74c8f0977382.jpg"
    },
    {
        "podcast_id": 11438,
        "title": "BIG MAMA HEX - \"BEST OF\" EPISODES",
        "description": "<p>\"BEST OF\" EPISODES + BRAND NEW EPISODES!!!</p><p>A podcast about my rocky and rewarding journey to the land that my ancestors lived and finding my PA Dutch roots in the Oley Valley.</p>",
        "language": "en",
        "author_name": "Big Mama Hex ",
        "slug": "bigmamahex",
        "cover": "20221009_101020_c85cf72116b5a1ab4a7027aab5bebdf5.jpg"
    },
    {
        "podcast_id": 12276,
        "title": "Horario de artista ",
        "description": "Sumérgete en el mundo del arte y la creatividad... acompáñame.Este espacio va dedicado especialmente a todos aquellos apasionados por el arte y la vida. Hablaremos del trabajo de grandes artistas y creadores relacionando los temas de cine, poesía, literatura, música y pintura.\nBienvenido \n\n",
        "language": "es",
        "author_name": "Paulina Cruz ",
        "slug": "horariodeartista",
        "cover": "20210427_210644_617cfedfdc8d38a7d1236da0bc71888d.jpg"
    },
    {
        "podcast_id": 13311,
        "title": "Animanga",
        "description": "A podcast reviewing/discussing anime and manga in the context of art, philosophy, politics, and whatever else pertains.",
        "language": "en",
        "author_name": "lilianthium",
        "slug": "animanga",
        "cover": "20201011_080152_abcdb8873c48f568286927721a2a0fce.jpg"
    },
    {
        "podcast_id": 13398,
        "title": "Nieuwe Vide Radio",
        "description": "Nieuwe Vide is een kunstpodium en broedplaats, en is ontstaan uit de kraakbeweging. Vandaag de dag bouwen we voort op de activistische idealen en DIY-mentaliteit die aan de basis lagen van onze instelling. Vanuit deze wortels zoeken we constant naar manieren om kunst en maatschappij met elkaar te verbinden, met als kloppend hart onze community in de broedplaats. We zijn verbonden met elkaar door kunst, maar ook door eten en gezelligheid.\n\nWe verbinden op een laagdrempelige manier de onderwerpen en theorieën die ons inspireren met het alledaagse en herkenbare. We werken vanuit de overtuiging dat kunst ons kan helpen om na te denken over nieuwe manieren om de wereld te bekijken en in te richten. Graag gaan we zelfs nog een stap verder dan hierover nadenken, en proberen we de ideeën die we bespreken ook dagelijks in de praktijk te brengen. We verzetten ons tegen de patriarchale norm die in onze maatschappij nog steeds leidend is, en stellen in plaats daarvan collectiviteit, waardering, zorg, overleg en emotie centraal. Daarbij haken we aan op actuele onderwerpen, zoals kapitalisme, feminisme en digitale cultuur, en zijn we niet bang om mee te veranderen met de tijd.",
        "language": "en",
        "author_name": "Nieuwe Vide Radio",
        "slug": "nieuwevideradio",
        "cover": "20210310_113715_2e35f37fc663998163a9c711e5245f24.jpg"
    },
    {
        "podcast_id": 13440,
        "title": "Úrodná půda",
        "description": "Cyklus rozhovorů o všem, co se týká divadla, se všemi, kteří se jej (třeba jen jedním prstem) dotýkají. Uvádí dramaturgové Divadla Na zábradlí Boris Jedinák a Petr Erbes.",
        "language": "cs",
        "author_name": "Divadlo Na zábradlí",
        "slug": "urodna-puda",
        "cover": "20201014_104917_141c81ce1e114b9a5d6e0bfecc628cc7.jpg"
    },
    {
        "podcast_id": 13529,
        "title": "Pure Talks",
        "description": "Pure Arts Group in conversation with creatives, visionaries, shift makers and those that are making positive change in the world. Grab a coffee, settle down and join us for these entertaining and informative chats.",
        "language": "en",
        "author_name": "Lesley Samms",
        "slug": "puretalks",
        "cover": "20201016_082510_2ee717b1d6d35bc08b9239234c925248.jpg"
    },
    {
        "podcast_id": 14580,
        "title": "The LOL Podcast",
        "description": "This is The LOL Podcast, where we talk about Laugh Over Life, YouTube, Gaming, etc.",
        "language": "en",
        "author_name": "Laugh Over Life",
        "slug": "the-lol-podcast",
        "cover": "20201114_161421_917c87061b0529c74909beeaccd31c5b.jpg"
    },
    {
        "podcast_id": 14711,
        "title": "The Paper Towel Podcast",
        "description": "This Podcast takes a look at the entertainment industry by asking the hard questions to professionals in the industry.",
        "language": "en",
        "author_name": "Quinten Arellano",
        "slug": "thepapertowelpodcast",
        "cover": "20201118_125449_85e1910525185ac333df737bd66bc0ea.jpg"
    },
    {
        "podcast_id": 15637,
        "title": "Recorded Time",
        "description": "Welcome to Recorded Time. Hosted by Melbourne based artist, Julius Killerby, the podcast includes conversations about Art, History, Politics, Science and more. ",
        "language": "en",
        "author_name": "Julius Killerby",
        "slug": "recordedtime",
        "cover": "20201126_113253_241c2486ea45e05daf571aa643bdd74c.jpg"
    },
    {
        "podcast_id": 17263,
        "title": "This Week in Disney History",
        "description": "Each week we discuss events and happenings in the history of the Walt Disney Company. From Walt Disney's Birthday, to the opening day of Splash Mountain, to the World Premiere of Treasure Planet, we are chatting about it! Join us! ",
        "language": "en",
        "author_name": "Milo Beasley",
        "slug": "thisweekindisneyhistory",
        "cover": "20201205_232229_8a9ea5a9ac395688357a3c28f3c29681.jpg"
    },
    {
        "podcast_id": 18469,
        "title": "Unknowing Art Podcast",
        "description": "Art theory, philosophy and history podcast exploring the maelstrom of ideas that form the landscape of art. This is my way of sharing my passion with you. I hope you enjoy the show. If you would like to support the show I would be honoured:\nhttps://www.patreon.com/unknowingart",
        "language": "en",
        "author_name": "JBWW",
        "slug": "unknowingart",
        "cover": "20201212_223805_a29fc2085b05c266197d79e4c3d368a6.jpg"
    },
    {
        "podcast_id": 19642,
        "title": "Non Neurotypical Art Students",
        "description": "Non Neurotypical Art Students (NNAS) is a platform where neurodivergent art students helps or contact other neurodivergent art students. Neurodivergent means that someone’s neurological development and state is considered as atypical. It goes often hand in hand with neurotypes such as: ADHD, Autism Spectrum Disorder, ADD, Bipolar Disorder, Tourette’s, Dyslexia and many others. ",
        "language": "en",
        "author_name": "Non Neurotypical Art Students",
        "slug": "nonneurotypicalartstudents",
        "cover": "20201220_111558_3b98b8c486334b650ba6355329638d4f.jpg"
    },
    {
        "podcast_id": 22867,
        "title": "The SoCal Artist",
        "description": "<p>An oil painter and digital artist, taking you on my journey through the art world. Looking to inspire, educate, and entertain with all facets of artists in their journeys as well.</p><p>Email me questions and if you are interested in being on the podcast, please email me at: ryankindsethart@yahoo.com</p>",
        "language": "en",
        "author_name": "Ryan Kindseth",
        "slug": "ryankindsethart",
        "cover": "20210108_050748_70199c575375cc003252c21882e125ab.jpg"
    },
    {
        "podcast_id": 23115,
        "title": "Scout Trailblazers Podcast",
        "description": "The Scout Trailblazers Podcast features creators from Scout Comics!",
        "language": "en",
        "author_name": "Wayne Hall",
        "slug": "scouttrailblazers",
        "cover": "20210108_235517_b67520385d36af9581ae671f330d79eb.jpg"
    },
    {
        "podcast_id": 23675,
        "title": "Museum Het Valkhof - De Podcast",
        "description": "Museum Het Valkhof draagt met een indrukwekkende collectie het verhaal van 5.000 jaar geschiedenis uit. Zowel in deze podcast als in het museum willen we laten zien hoe kunst en geschiedenis ons wereldbeeld kleuren. Met de tentoonstelling De Pest (2021) werden de eerste podcasts gemaakt. In dit eerste seizoen nemen diverse experts je mee door de geschiedenis van deze bijzondere infectieziekte. Hoe heeft de pest zijn sporen nagelaten in kunst en cultuur? En wat zijn de paralellen met de coronacrisis? Een jaar later was het tijd voor een nieuwe, relevante, tentoonstelling: Moving Stories: de Rijkdom van de Limes. Met deze tentoonstelling worden de migratieverhalen van  2000 jaar geleden gekoppeld met migratieverhalen van nu. Als voorbereiding op de tentoonstelling spraken de curatoren van de expositie, Marie Stel en Marenne Zandstra met een groep mensen die in de regio woont en een migratieachtergrond heeft: het public-in-residence. Ook sprak het public-in-residence, de mensen met een migratieachtergrond dus, met hedendaagse kunstenaars, die naar aanleiding van die gesprekken nieuw werk maakten voor de tentoonstelling. Een gedeelte van die gesprekken kan je horen in het tweede seizoen van de podcast.  ",
        "language": "nl",
        "author_name": "Museum Het Valkhof",
        "slug": "museumhetvalkhof",
        "cover": "20220628_110634_f811aee24c63578bfe218dc51c0475c2.jpg"
    },
    {
        "podcast_id": 24114,
        "title": "GO HAM ! Podcast",
        "description": "Hello ! My names Abe , i am known to get very.....passionate and loud when it comes to topics i love and so i wanted to give the people on the opposite end of that energy and give them chance to \"go ham\" about the things they love. Things are about to get loud and weird.",
        "language": "en",
        "author_name": "Abraham Dorado",
        "slug": "goham",
        "cover": "20210113_011259_651db281270ae1786ce07b5c4d131715.jpg"
    },
    {
        "podcast_id": 24492,
        "title": "The Reel Girls Club",
        "description": "The Reel Girls Club, hosted by Lucie Rose, is a podcast to educate, inform, inspire and empower girls who want to work in cinema and television. In the podcast, I interview women in the industry, providing you with expert knowledge, tips and inspirational anecdotes about their careers.",
        "language": "en",
        "author_name": "Lucie Rose",
        "slug": "reelgirlsclub",
        "cover": "20210212_083124_212160dfd43616007aeca42fb2364cde.jpg"
    },
    {
        "podcast_id": 25123,
        "title": "GATCHA",
        "description": "Bienvenue sur GATCHA : votre podcast One Piece animé par Thomasama, Loïc la polémique, Great Teacher Wilfried et Adam.\nChaque semaine au programme : reviews des derniers chapitres, news, discussions et théories autour du chef d'oeuvre d'Oda.\nEnjoy !",
        "language": "fr",
        "author_name": "Thomasama, Loïc la polémique, GT. Wilfired & Adam",
        "slug": "gatcha",
        "cover": "20210116_203416_d81ebfdad2bab27198e59ebd4886f712.jpg"
    },
    {
        "podcast_id": 25970,
        "title": "The Arts & Learning Monthly Master Class Series ",
        "description": "Welcome, here we share our recorded Monthly Master Classes and Interviews with the Industry. These classes provide insight from industry professionals in the areas of: Theatre, Music, College Auditions, and More. With each added class, we strive to make high-quality arts education more accessible to all. You can always join us for next month's live zoom master class, by visiting us at www.artsandlearning.org",
        "language": "en",
        "author_name": "The Arts and Learning Conservatory",
        "slug": "artsandlearning",
        "cover": "20210226_072609_90c6d12be657fcfabe6f6d996c7ab485.jpg"
    },
    {
        "podcast_id": 26167,
        "title": "Okay, Last Try",
        "description": "\"Okay, Last Try\" is here to shine a light on the future faces of skateboarding culture. Elise Hedge and Larry Lanza interview up and comers with fresh minds, new brands, and intact hairlines.\n\nFollow @OkayLastTry on Twitter for updates and shitposts! \n",
        "language": "en",
        "author_name": "Larry Lanza & Elise Hedge",
        "slug": "okaylasttry",
        "cover": "20210629_181309_ecd32aeee5967bd0dd35b6df3d1ea935.jpg"
    },
    {
        "podcast_id": 26606,
        "title": "A Filmfreak's Conversation",
        "description": "Elke maand kun je genieten van de fantastische podcast van het filmblog 'a Filmfreak's Guide to Life' genaamd 'A Filmfreak's Conversation'. In deze podcast bekijken Maureen en Marre een film, die ze nog niet hebben gezien, en gaan deze bespreken en vertellen ze welke levensles zij eruit hebben gehaald. Elke maand een andere interessant onderwerp en een boeiende film. ",
        "language": "nl",
        "author_name": "Marre en Maureen",
        "slug": "afilmfreaksguidetolife",
        "cover": "20210131_112238_17df8b1388b34258300b72b9bf03892e.jpg"
    },
    {
        "podcast_id": 27783,
        "title": "Boiled Over",
        "description": "<p>A podcast all about animation! Listen to interviews with contemporary independent animators from around the world with host Lije Morgan.</p>",
        "language": "en",
        "author_name": "Lije Morgan",
        "slug": "straightahead",
        "cover": "20230411_020435_3636f55647c420950c529ba777b0bfc8.jpg"
    },
    {
        "podcast_id": 30791,
        "title": "SÕNAOKSE",
        "description": "SÕNAOKSE on ajuokse loomekollektiivi podcast, mille külalised on erinevad alternatiivsed ning maa-alused loomeinimesed. Saatejuht: Stina Leek, intro: Sattiva. www.instagram.ee/ajuokse & www.ajuokse.ee ",
        "language": "ee",
        "author_name": "ajuokse",
        "slug": "s6naokse",
        "cover": "20210207_112136_dac4a3891c7adec38397bb67c1147aeb.jpg"
    },
    {
        "podcast_id": 32830,
        "title": "The Careful Photograph",
        "description": "“The Careful Photograph” features the voices of photographers of color who are challenging, subverting, and highlighting some of the problems and paradoxes of the photographic medium in our current moment. In each episode we focus our conversation on a single photograph by the artist. From there, I try to let the artist shape the conversation, and what has emerged are nine episodes (so far) that can be used as a teaching tool, or a course in itself about how to look at photographs and look “with care.” Each episode ends with a praxis assignment, visual exercise, or creative prompt for students or listeners. I am looking forward to sharing them with you.\n\n“The Careful Photograph” is made possible by the MCSI at Pitzer College. As Director of the Monroe Center for Social inquiry this public podcast will serve as a companion to my MCSI course offering, “Photography and the Racialized Body,” a course which stems from my own long engagement with questions of identity, the body, and the history of photography and race in America.",
        "language": "en",
        "author_name": "Tarrah Krajnak",
        "slug": "thecarefulphotograph",
        "cover": "20210315_213632_de58eb04ed7b4c6c4ae0832c33464b5c.jpg"
    },
    {
        "podcast_id": 34025,
        "title": "Who Art Thou?",
        "description": "<p>Who Art Thou? is an Irish based podcast hosted by Barra Carlin that explores the creative processes and life experiences of artists, musicians, writers, and other creatives. Each episode features a different guest, who shares their personal journey and insights into their craft.</p>",
        "language": "en",
        "author_name": "Barra Carlin",
        "slug": "whoartthoupodcast",
        "cover": "20210218_232407_9c62f29f3cf7c9fe88c3b71bae37e454.jpg"
    },
    {
        "podcast_id": 35265,
        "title": "That's Nifty",
        "description": "In collaboration with digital collage artist, Slimesunday, we present: \n\n“That's Nifty”\n\na podcast that features a prominent digital artist and his two run of the mill NFT (Non-Fungible Token) collectors interviewing figures in the NFT Art space.  They don't always know what is going on, but they know it's nifty. Moments captured here will document the rising tide surrounding the NFT Space as it enters the zeitgeist.\n\nTwitter/Instagram: @ThatsNFT\n\nHosts:\n@slimesunday\n@CryptoKitch\n@TNobel33",
        "language": "en",
        "author_name": "Slimesunday",
        "slug": "thatsnifty",
        "cover": "20210222_025946_03e1c83859f8d2a63008fbfad8683063.jpg"
    },
    {
        "podcast_id": 36145,
        "title": "Teh Time",
        "description": "My podcast aims to highlight inspiring and creative women from underrepresented backgrounds.",
        "language": "en",
        "author_name": "Adilla Jamaludin",
        "slug": "tehtime",
        "cover": "20210301_231802_5d7733d54673640bf5d9978407ff0b92.jpg"
    },
    {
        "podcast_id": 36378,
        "title": "Kunstvolle Berufsberichte: Ein Podcast des FV des Kunsthistorischen Instituts der UZH",
        "description": "Als Fachverein ist es uns wichtig, für die Studierenden und ihre Anliegen da zu sein. Immer wieder taucht dabei die Frage auf, was man denn nach dem Kunstgeschichtsstudium damit machen kann. Wir haben uns daher das Ziel gesetzt den Studierenden die diversen Berufsfelder näher zu bringen, die das Studium eröffnet. Dazu führen wir mit verschiedenen Persönlichkeiten mit kunsthistorischem Hintergrund Gespräche, die wir in Form einer Podcast-Reihe vorstellen. Wir hoffen, damit zu inspirieren und neue Perspektiven nach dem Studium der Kunstgeschichte aufzuzeigen.\n\nProduktion: Viviane Maeder, Sebastian Rinderknecht, Noemi Wanner\nMusik: Flava Sauce",
        "language": "de-ch",
        "author_name": "FV KHIST",
        "slug": "fvkhist",
        "cover": "20210224_193642_e5f6fba2a88ce116de22c95c1ba6aa4a.jpg"
    },
    {
        "podcast_id": 37016,
        "title": "7CITY",
        "description": "The 7CITY podcast is dedicated to interviewing artists in the Chicagoland area, their supporters, and developers. Join hosts Emily Cox and Johanna Moffitt as they look at all aspects of the traditional seven arts.\n\n7CITY is produced by Elijah Lee for /kor/ productions, an NFP dedicated to bringing art to its audiences wherever they are. Check out our website: korproductions.org\n\n#operaisforeveryone",
        "language": "en",
        "author_name": "Johanna Moffitt",
        "slug": "sevencity",
        "cover": "20210226_163400_d626bc1a1c70f820eb81418aeaebd477.jpg"
    },
    {
        "podcast_id": 37053,
        "title": "Eyewitness Matrimony - The Wedding Podcast",
        "description": "From nuptials around the globe, your favorite wedding enthusiasts speak on what your guests are thinking but not actually saying. \n\nWe vow to answer honestly, the infamous question most wedding guests are posed with when the celebration ends: \nHow was it?\n\nFor better or for worse, we're here to tell you all about it!",
        "language": "en",
        "author_name": "Jenna Barrington and Simone Howard-Douglas",
        "slug": "eyewitnessmatrimonythepodcast",
        "cover": "20210308_040856_357e861a6625b15375fc851cb674c5eb.jpg"
    },
    {
        "podcast_id": 37270,
        "title": "Generation: Cyberpunk",
        "description": "In this podcast, discussion is made on all aspects of Cyberpunk. From movies and books to tabletop and video games. With new episodes each week, we hope to share our love for this genre. Voices include: Your host Brenden \"Lupus Daemon\" Sandifer, English Correspondent Sami “The Wolf” Knight, Mouth of reason Barry \"Gurdek/Khzhak\" Goldberg, Doppelgänger Gregory “Grim” Sandifer, the ever-distracted Melody, and the long-winded Wes.\n\nThe Podcast Twitter: https://twitter.com/GenCyberpunkPod",
        "language": "en",
        "author_name": "Brenden “LupusDaemon” Sandifer",
        "slug": "generation-cyberpunk-pod",
        "cover": "20210305_012130_998b71b1160f7374ff0f0ea5d489e9da.jpg"
    },
    {
        "podcast_id": 37758,
        "title": "Projects are prophecies, prophecies are projects",
        "description": "Projects are prophecies, prophecies are projects is a series of talks with artists, curators, writers and other creatives. In the first season, you can hear Stine Deja, Cécile B. Evans, Luca Lo Pinto and Jeanne Graff talk about the future through their own practices. The goal is to understand how they approach imagination and creation. \nTalks are in English and are moderated by Natalija Paunić, in partnership with British Council and supported by LUX and Eugster || Belgrade.\nSound edit: Žarko Komar, visuals: Stefan Unković\n",
        "language": "en",
        "author_name": "Natalija Paunic",
        "slug": "projectsprophecies",
        "cover": "20210301_103733_a7bbda279fcbe5ebca5d3353c484716b.jpg"
    },
    {
        "podcast_id": 38031,
        "title": "Castle Conversations ",
        "description": "Richwoods High School Podcast club talks about music, current events, high school advice advice, and anything our student body wants to hear.",
        "language": "en",
        "author_name": "Francesca Sandro & Sophia Suarez",
        "slug": "castleconversations",
        "cover": "20210302_064236_3bb527dd6c674fc3726253b432470e48.jpg"
    },
    {
        "podcast_id": 38033,
        "title": "First Impressionists",
        "description": "We talk about all things art- our favorite artists, what art is, what art we don’t like, art literacy and so much more!",
        "language": "en",
        "author_name": "Lucie Anderson",
        "slug": "firstimpressionists",
        "cover": "20210323_023858_dfd2faa2847187f8b9eb28d2fd78e9a9.jpg"
    },
    {
        "podcast_id": 38162,
        "title": "The Stew Simpson Show",
        "description": "Creativity comes in many shapes, sounds, sizes, smells, tastes, textures and feeling, here on 'The Stew Simpson Show' we explore the various worlds of creative pursuits and what they do for us and why we do them. Stew will chat to Artists, Musicians, Writers, Actors, Dancers, Poets, Chefs etc you name it, if it's creative we want to talk about it and if you are one of those creative sorts and you want to tells us about what you do please get in touch via www.stewsimpson.co.uk",
        "language": "en",
        "author_name": "Stew Simpson",
        "slug": "thestewsimpsonshow",
        "cover": "20210302_202556_0d3a1b1c15cec11b57610c23dceaf899.jpg"
    },
    {
        "podcast_id": 38377,
        "title": "ArtCollab",
        "description": "ArtCollab is a monthly zoomcast with artists Sarah Matthews and Nathalie Kalbach, sharing an inspiring and entertaining look at their artistic collaborations and discussing the artistic journeys they embark upon together.",
        "language": "en",
        "author_name": "Nathalie Kalbach and Sarah Matthews",
        "slug": "artcollab",
        "cover": "20210303_142043_68b418e5a1c4ce5257753c5dea5183b9.jpg"
    },
    {
        "podcast_id": 42565,
        "title": "Speaking from WATER",
        "description": "<p>Step into “Speaking from Water,” where host Sean Ruttkay engages with aquatic legends – from daring big wave surfers to skilled water photographers and surf lifesaving champions. In each immersive, long-form interview, uncover captivating life stories, unique methodologies, and boundless inspiration. Join us for compelling conversations that explore the depths of their experiences and the thrill of their expertise.</p>",
        "language": "en",
        "author_name": "Sean Ruttkay",
        "slug": "speakingfromwater",
        "cover": "20210318_214558_a8d5a90bb355024ec3ca52bf3ca85835.jpg"
    },
    {
        "podcast_id": 43262,
        "title": "The Con Hour",
        "description": "We cover all the conventions we can.  We are Texas based, so have a good portion there, but cover all who ask us to.  Not only do we cover conventions, but we also have interviews with actors, actresses, authors, artists, musicians, singers, songwriters and cosplayers among many things.  So, please tune in and subscribe to our channel, you never know who we will have on our line-up or what convention we will cover, it could be one near you.  The Con Hour is here to cover all your convention and panel needs and wants.  The majority of our shows are live, so you can ask questions during our show, see you each week.",
        "language": "en",
        "author_name": "GM Kelso",
        "slug": "theconhour",
        "cover": "20230131_090148_06e06ab0370e1fc78951df5ed52c4cf3.jpg"
    },
    {
        "podcast_id": 43983,
        "title": "AJUMÄHIS",
        "description": "Mähime videotest, filmidest, videoideedest, sarjadest ja ka ühiskonna probleemidest, kui tuleb mõni hea idee teeme ka sellest hea video!\n Vaata shitposte ja slaidi DM'idesse: www.instagram.com/ajumahispodcast/\n Kirjuta meile: ajum2his@gmail.com",
        "language": "ee",
        "author_name": "Mähkijad",
        "slug": "ajumahis",
        "cover": "20210324_140701_0789c6daaea4fa9d98ae491f9c334835.jpg"
    },
    {
        "podcast_id": 44026,
        "title": "EL DILETANTE",
        "description": "Conciliábulo de diletantes con Jacobo Bergareche como simposiarca, Lisandro Silva Echevarría “El Licha” como trovador residente, Diego Echévarri de productor, y varios invitados que juran no volver. ",
        "language": "es",
        "author_name": "Jacobo Bergareche",
        "slug": "eldiletante",
        "cover": "20210324_192201_28ad7562b4a8bc71320e66f5c500cc2f.jpg"
    },
    {
        "podcast_id": 45788,
        "title": "The Visual Artist's Spotlight",
        "description": "The Visual Artist's Spotlight is an interview based podcast that uncovers an artist's world. Miko Hayashi interviews various artists around the world with one question in mind: how does the world they experience shape their creative output? \nEach episode will feature one artist, each with their own artistic mediums. Find out how the life they live shape the art they make. \n\nTo find out when new podcast episodes will happen, follow Miko on Instagram @MimiHanaThreads. You can also hear the interviews live as they happen on Clubhouse at the \"Stitch and Bitch\" club. All members who join the live interview give permission to be recorded and shared on this podcast channel, and are notified beforehand that they will be recorded before joining. ",
        "language": "en",
        "author_name": "Miko Hayashi",
        "slug": "visual-artists-spotlight",
        "cover": "20210331_112608_73edeffc55752192b5586ba761687454.jpg"
    },
    {
        "podcast_id": 46144,
        "title": "Chopsticks Alley Podcast",
        "description": "Chopsticks Alley celebrates Southeast Asian cultural heritage through stories and the shared creative expression of art.\n",
        "language": "en",
        "author_name": "Chopsticks Alley",
        "slug": "chopsticksalley",
        "cover": "20220215_070251_a0c681d160330ba803d4aa6715d9a449.jpg"
    },
    {
        "podcast_id": 47276,
        "title": "Blue Cheese by Ebony L. Haynes",
        "description": "This podcast is a conversation between the host, Ebony L. Haynes, and an invited guest from the \"art world.\" Each guest is given the prompt: What is a song you currently have on repeat / What is one of your regular \"go-to\" songs? The conversation starts with that song and goes...wherever it wants to go.\nRecorded  by Montez Press Radio\nEdited by Taryn Collymore\nGraphics by Sebastien Pierre\n",
        "language": "en",
        "author_name": "ELH",
        "slug": "bluecheese",
        "cover": "20210422_113838_0539a992c711b415587eee9b99dad7df.jpg"
    },
    {
        "podcast_id": 50876,
        "title": "Little Things for Bonsai People",
        "description": "<p>Little Things for Bonsai People is a great listen for those who are new to the art of bonsai. The show is hosted by Evan Pardue, Mike Lane, and Carmen Leskoviansky where they discuss topics pertaining to bonsai techniques in the southeast United States, as well as how they can be applied in other regions. Support us by becoming a Bonsai Friend! https://www.patreon.com/littlethingsforbonsaipeople</p>",
        "language": "en",
        "author_name": "Evan Pardue",
        "slug": "bonsaisoutheast",
        "cover": "20230426_030447_90ce68f5db791759fe0bc5e395dc0d72.jpg"
    },
    {
        "podcast_id": 50965,
        "title": "Latitude Podcast",
        "description": "Latitude is a podcast about the built enviroment that investigates architecture, design, and visual arts, and how these relate to issues of territory, citizenship, and ecosystems.",
        "language": "en",
        "author_name": "Karla Aguiñiga",
        "slug": "latitudepodcast",
        "cover": "20210420_235953_fc0a364ce00eac9ace0f1813128c8158.jpg"
    },
    {
        "podcast_id": 52100,
        "title": "3D's Character Assassination",
        "description": "Podcast exploring films presented by Dr. Kevanne Sanger (PhD) and Dave (Actor). We are looking at films and their main protagonists through the lens of a psychologist and an actor. \n\nWhat motivates and drives their actions, what filming techniques speak louder than words, and what things just don’t really make that much sense… in our opinion, anyway. We’ll leave that for you to decide. \n\nFind us on Instagram @3dscharacterassassination\nSend us an email: characterassassins@yahoo.com\n\nThank you to:\nCover Art by James Boden @james.boden_laserlouts\nMusic by BeachVibes-Music from Pixabay",
        "language": "en",
        "author_name": "Dr Kevanne Sanger and David Charles-Hendy",
        "slug": "3dscharacterassasination",
        "cover": "20210428_092546_fd2ade86e18d289c946e0d115e3c1f1a.jpg"
    },
    {
        "podcast_id": 52307,
        "title": "iDoD (iDream of Dance) DanceTalk Podcast",
        "description": "DanceTalk Season 1 focuses on highlighting women leaders in Art, Health, Education and Innovation. From a 3x Guinness World Record Holder to the first woman to earn a computer science PhD from NCATU, we've lined up some super inspirational guests! Tune in to hear about their journeys, gain valuable advice, and get inspired.\n\nDanceTalk is a podcast under the nonprofit organization iDream of Dance, whose mission is to empower youth through dance and leadership. iDream is committed to countering the growing opportunity gap and providing creative outlets for youth who wouldn’t normally occupy them due to financial need. iDoD DanceTalk focuses on the history of dance, culture, important topics in dance, and also iDream happenings. This podcast also complements the impact that dance has on peoples lives through interviews.",
        "language": "en",
        "author_name": "Amanda Kossoff",
        "slug": "idreamofdance",
        "cover": "20220224_120224_3a9880d3c34cbe3e32cf947f350f94fa.jpg"
    },
    {
        "podcast_id": 52703,
        "title": "Framework: The Last Podcast About Film",
        "description": "A film-centric podcast featuring various young filmmakers as they talk about how a single frame relates to the bigger picture. Producers, writers, directors, and cinematographers break down films and dig deeper into the art form as a medium for storytelling in this modern world. \n\nYOUTUBE  ►  https://www.youtube.com/channel/UCNlJ-KQroklp-XQXqLjssyA",
        "language": "en",
        "author_name": "Cameron Thorpe",
        "slug": "framework",
        "cover": "20220130_100108_6f05e74d779ae9c48af960bcecb440a2.jpg"
    },
    {
        "podcast_id": 53187,
        "title": "Reel Collections w/ Edward Beasley",
        "description": "A film history podcast that dives into the more obscure titles and filmmakers that helped shaped my love of cinema. ",
        "language": "en",
        "author_name": "Edward Beasley",
        "slug": "reelcollections",
        "cover": "20210429_184638_d56631a67158747f9a7d1e00f6526bad.jpg"
    },
    {
        "podcast_id": 53921,
        "title": "How Great is Thou Art?",
        "description": "Here we talk about all forms of Art and the connections it may have to Christianity. I also discuss the scene of Christian Art today, how it has progressed, the issues with it and everything inbetween. Furthermore, I will be bringing on guests who can help you build your platform and get your foot into the creative industry.",
        "language": "en",
        "author_name": "Joshua Obeng-Boateng",
        "slug": "hgta",
        "cover": "20230115_050128_b232a5dddbadf751cc3eeb7ec4c0d123.jpg"
    },
    {
        "podcast_id": 54366,
        "title": "Art Works In Therapy",
        "description": "<p>Clinical conversations in this podcast are intended for educational and testimonial purposes. Jon Ehinger is a New York licensed and board certified psychotherapist in private practice at www.creativetherapies.nyc</p>",
        "language": "en",
        "author_name": "Jon Ehinger  LCAT, ATR-BC",
        "slug": "artworksintherapy",
        "cover": "20210515_184404_1a20a994581255b5a80433c54bf9d4cc.jpg"
    },
    {
        "podcast_id": 56501,
        "title": "Agora.Community",
        "description": "Agora.Community is a hub for digital artist whose purpose is to entertain, inspire, educate and provide opportunities to be mentored by industry veterans. ",
        "language": "en",
        "author_name": "David Hubert",
        "slug": "agoracommunity",
        "cover": "20210513_131903_ea557b5f5f59c6473a897cce466fc78e.jpg"
    },
    {
        "podcast_id": 57036,
        "title": "Ultramelodic",
        "description": "Stay tuned with co-hosts Dylan and Vinisha as they discuss everything music, from diving deep into artists' discographies to other topics regarding the music industry to discussing your hot music takes and fun trivia games! ",
        "language": "en",
        "author_name": "Vinisha Prajapati & Dylan Regenberg",
        "slug": "ultramelodicpodcast",
        "cover": "20210516_033935_017cd958743e1f51fbac797436f4772c.jpg"
    },
    {
        "podcast_id": 59659,
        "title": "REALITEA LLC",
        "description": "This podcast is to create a platform that brings exposure to artists and businesses: locally as well as worldwide . RealiTEA will become a safe haven for listeners to laugh, cry , learn , and be inspired ! Welcome to RealiTEA where the TEA is REAL !",
        "language": "en",
        "author_name": "Lady TreSciana Carter",
        "slug": "realiteallc",
        "cover": "20210528_151218_609859f40b881e5e666bcd8868da8fef.jpg"
    },
    {
        "podcast_id": 61195,
        "title": "Werktitel",
        "description": "In de kunst wordt veel gesproken over wat mensen doen, maar minder over hoe ze dat doen. In Werktitel buigen Alix de Massiac en Zoë Dankert zich over arbeidsvoorwaarden, netwerken, deadlines, afspraken en collega’s. In een marathon van gesprekken delen mensen verhalen en ervaringen in de hoop een collectief gesprek op gang te brengen. Praten is de eerste stap op weg naar het nieuwe werken; waar ruimte is voor solidariteit en wederkerigheid, waar werken werkbaar is én bespreekbaar. Hoe ziet het nieuwe werken eruit?",
        "language": "nl",
        "author_name": "Alix de Massiac & Zoë Dankert",
        "slug": "werktitel",
        "cover": "20220203_100209_84f06465937a4cd9b78331571409b76f.jpg"
    },
    {
        "podcast_id": 63999,
        "title": "Cable Trash Cast",
        "description": "Just a couple of friends talking about media in general in our free time",
        "language": "en",
        "author_name": "OccultTooner",
        "slug": "cable-trash-cast",
        "cover": "20210620_163606_cddd89938105397ad7bb4be5d8e8dbe4.jpg"
    },
    {
        "podcast_id": 64199,
        "title": "Beyond Bisexual Lighting",
        "description": "Beyond Bisexual Lighting is a world queer cinema podcast that dissects the nuances of queer identity and challenges cinematic homonormativity, creating a space that navigates global flows with intimate desires. ",
        "language": "en",
        "author_name": "Carolina Mulvey Videla & Alex Bobet",
        "slug": "beyondbisexuallighting",
        "cover": "20220418_090442_a8baa7ec3f8d31ec5e2fc2f4656e53fb.jpg"
    },
    {
        "podcast_id": 65348,
        "title": "Sound of Imagery",
        "description": "Sound of Imagery ignites a weekly conversation on photography and videography tech with a smattering of news. Join Leigh Diprose, Lee Herbet and Greg Cromie as they share their unscripted viewpoints on the industry with a hint of merriment.",
        "language": "en",
        "author_name": "Leigh Diprose",
        "slug": "soundofimagery",
        "cover": "20210628_033941_e4b4c5a0ac677470799fc9bbcf95756b.jpg"
    },
    {
        "podcast_id": 65387,
        "title": "泉",
        "description": "<p>「泉」是一档关注各种视觉与文本材料的播客节目，由两位不务正业的艺术史和电影学生主持。我们希望可以用这档节目展开不同角度的对话，为生活带来一点灵感与幽默感。如果有任何想对我们说的话，请电联：</p><p>Mila： <a href=\"mailto:yfwang.ivah@gmail.com\">yfwang.ivah@gmail.com</a></p><p> 大绿：yutongliuc@gmail.com</p>",
        "language": "zh",
        "author_name": "Ivah",
        "slug": "izumi",
        "cover": "20230221_020220_f011f31c17c533d5359ed114eb8bddfc.jpg"
    },
    {
        "podcast_id": 65939,
        "title": "Legacy &... An Art360 Podcast",
        "description": "<p>Legacy &amp; brings the conversations we're having behind the scenes with artists, archivists and those caring for archives out into the world. Our discussions are reflective of the ways we work with artists to empower them to shape their archives, and are joined by the thread of Legacy. What comes after the &amp;… can’t be prescribed and each episode is framed by speakers through their choice of title. Through informal dialogue we hope to create space for key voices in the archive to rise to the surface, and to provide a platform for artists to define themselves without a pre-determined agenda. Our conversations touch on the experience of building an archive from a practical and psychological perspective and explore parts of artists’ lives and work that may not have been shared publicly in the past. Our Podcast is co-produced and edited by Ellie Porter from Art360 Foundation and George Genn, with post-production and original score by George Genn.</p>",
        "language": "en",
        "author_name": "Art360 Foundation",
        "slug": "art360legacyand",
        "cover": "20210705_103941_9b609d1ceaa6f7c7bf161f7f4b08e290.jpg"
    },
    {
        "podcast_id": 67525,
        "title": "To See or Not to See",
        "description": "We got somethin' to say.",
        "language": "en",
        "author_name": "Aaron, Emily, and Michael",
        "slug": "toseepodcast",
        "cover": "20210711_165046_a615c23d25cec37191e28d16e9c9a53d.jpg"
    },
    {
        "podcast_id": 68260,
        "title": "COURTESY OF",
        "description": "<p>The official Te Pātaka Toi Adam Art Gallery podcast! This podcast channel is for material outside the exhibition space, be it recorded public programme, random series, occasional ponderings or curated content. If it is heard it may well end up here. Te Pātaka Toi Adam Art Gallery is the purpose-built gallery of Te Herenga Waka—Victoria University of Wellington. It initiates, produces and presents a highly-regarded programme of exhibitions, events and publications; manages and develops Ngā Puhipuhi o Te Herenga Waka—Victoria University of Wellington Art Collection, and provides a vital platform for critical thinking across media, disciplines, cultures and contexts.</p>",
        "language": "en",
        "author_name": "Adam Art Gallery Te Pataka Toi",
        "slug": "adamartgallerytepatakatoi",
        "cover": "20210724_212940_15ecbae4066fda3d9998c4d3e58f2bbe.jpg"
    },
    {
        "podcast_id": 68953,
        "title": "Joost mag het weten",
        "description": "Welkom bij de podcast 'Joost mag het weten'.  \n\nDe podcast waar je als luisteraar geen complete weergave krijgt, maar mag dwalen, om hier en daar een luikje open te maken; waarachter een versnipperd beeld wordt geschetst van het huidige afstudeer jaar te Sint Joost Breda, ART&RESEARCH 4 (2021). Het is juist die versnippering, die fragmentatie, die deze lichting typeert. \n\nDeze podcast legt de nadruk op de vertakkingen van het makerschap, haakt in elkaar waar nodig en deint mee op de golven van zij die al dobberend zoeken naar uitwisseling.\n\nDe structuur van de podcast is, net als de makers, aan verandering onderhevig. Er wordt gebruik gemaakt van bekende elementen maar is verder vrij in beweging, zo zijn er verschillende rubrieken, waarvan sommige terugkerend en andere eenmalig aanwezig. \n\n",
        "language": "nl",
        "author_name": "Noëmi Francoise Hofstede; Anika Hochstenbach; Femke van Heijningen; Esther van Zoelen; Doris Kolpa; Hanne van Beek; Isa Janssen",
        "slug": "joostmaghetweten",
        "cover": "20210719_093211_aacfd4324651ab877a84986845f8ff49.jpg"
    },
    {
        "podcast_id": 70052,
        "title": "Twi As We Light",
        "description": "In this Podcast two adults dive into the world of Twilight for their very first time. Hallie and Sydney made it through Elementary, Middle, and High School during the height of the Twilight Saga, and they are trying their best to read and enjoy the series. Join us for biweekly book clubs, and the occasional movie review as we dive into the critically acclaimed Stephenie Meyer novel: Twilight",
        "language": "en",
        "author_name": "Sydney Heim",
        "slug": "twiaswelight",
        "cover": "20210726_015919_a3ba28fe677f0c1711b8ae0b7f859dc9.jpg"
    },
    {
        "podcast_id": 72679,
        "title": "Dwudziestego o dwudziestej",
        "description": "rozmowy z polskimi fotografkami, foto edytorkami czy foto kuratorkami na tematy związane z fotografią i jej okolicami :)",
        "language": "pl",
        "author_name": "Polish Women Photogtraphers",
        "slug": "dwudziestegoodwudziestej",
        "cover": "20210809_183913_64afcd7481928e3c4cb224bea88153ab.jpg"
    },
    {
        "podcast_id": 73100,
        "title": "Twin Sun Talks",
        "description": "Welcome to Twin Sun Talks! This is the best podcast for both devoted and casual Star Wars fans. Whether you're trying to bolster your knowledge, wanting a starting point to dive into the franchise, or wanting some fresh takes on the existing canon, this podcast is for you! Whenever you are ready to take your first steps into this larger world, come and let us talk at you... May the Force be with you!",
        "language": "en",
        "author_name": "Jonah Lou",
        "slug": "twin-sun-talks",
        "cover": "20210812_202859_2deef6405d4d7921bf331715f4a42b8c.jpg"
    },
    {
        "podcast_id": 73970,
        "title": "Deeze Spaces",
        "description": "Join Deeze in a series of interviews and Twitter Spaces where he chats with the most interesting creators and collectors in the NFT world. \n\n\n\nDeeze can be found on Twitter: @DeezeFi and @DeezeSpaces\n\n\n\nArchived Episodes can be found at www.soundcloud.com/deezefi\n\n\n\nDeeze is an avid NFT collector and community manager for @fractional_art. Their work and dedication to fractionalized NFT works can be found at www.fractional.art. \n\nDisclaimer: The speakers on Deeze Spaces are not registered investment advisors. All opinions shared on Deeze Spaces or via Twitter, Discord, and other public channels are those of the respective individuals alone and do not represent any views or endorsements from The Fractional Token Company. Nothing discussed in this podcast should be relied upon for investment decisions nor is it investment advice. Deeze Spaces are solely for information and entertainment purposes only. Please consult and work directly with tax, legal, financial, and investment professionals before making any token creation, transferring, and purchasing decisions.\n",
        "language": "en",
        "author_name": "Deeze",
        "slug": "deezespaces",
        "cover": "20210817_201938_ec66ec054fb2c5d105dcaf2a6bcaa45f.jpg"
    },
    {
        "podcast_id": 74445,
        "title": "Relief Podcast",
        "description": "This monthly podcast brings listeners joy and comfort to your day. \n\nThe Akron Art Museum’s staff shares insights from their own lives combined with conversations about the collection and interviews with regional artists and musicians.",
        "language": "en",
        "author_name": "Akron Art Museum",
        "slug": "reliefpodcast",
        "cover": "20210819_133648_96f22ce7f889cd7588a52982a80dca6b.jpg"
    },
    {
        "podcast_id": 75008,
        "title": "who's you?",
        "description": "A podcast created by the Visual & Performing Arts Field of Interest at Chandler-Gilbert Community College that focuses on giving community members an inside look at what an education and career in the arts looks like. Each month, we interview a creative professional and get to the bones of what it looks like to create for a living.",
        "language": "en",
        "author_name": "Buzzy Sullivan",
        "slug": "whosyou",
        "cover": "20210822_224913_13794bda69ed28304723bf2876342707.jpg"
    },
    {
        "podcast_id": 76703,
        "title": "We are... Architecture!",
        "description": "Welcome to “We are… Architecture” an original podcast created by the American Institute of Architecture Students chapter at PennState. Inspired by the minds around us: from our professors, mentors, advisers, and more.. thank you for listening ",
        "language": "en",
        "author_name": "AIAS PennState",
        "slug": "wearearchitecture",
        "cover": "20210929_192526_f65790f503b23dc32d1eb0e55f26f6e9.jpg"
    },
    {
        "podcast_id": 77690,
        "title": "The Creative Trust ",
        "description": "The Creative Trust Podcast is a celebration of 20 years of Gloss Creative. Together with our Stellar Alumni we share everything we know to be true about the Creative Process and the business reality of a small but powerful design platform.\n\nSubscribe to The Creative Trust Podcast and you'll have access to behind the scenes workings of our scenography, installations, event design and creative processes. Our Creative Director Amanda Henderson chats with the creatives and makers who have 20 years of serious visual candy.\nThe Gloss Alumni share what they know, we promise there will be mountains of discussion and tips on the creative process, design knowledge shared and life experience hacks. Everything you need for a lifetime of creative work. \nAmanda is curious about where creativity starts, her first question to her guests always, how did you become creative? \nAmanda apologizes in advance for saying 'I guess' too many times but hey, you can only be yourself.\n\nWe acknowledge the traditional custodians of the land on which The Creative Trust Podcast is recorded The Wurundjeri people, Elders past and present of The Kulin Nations, Naarm (Melbourne, Australia)",
        "language": "en",
        "author_name": "Gloss Creative",
        "slug": "thecreativetrust",
        "cover": "20210906_114005_ff3563e2da9655e6df14d5117c236068.jpg"
    },
    {
        "podcast_id": 80928,
        "title": "Story Arcs",
        "description": "A Comic Podcast",
        "language": "en",
        "author_name": "Gavin Ware, Andrew Holmes",
        "slug": "storyarcs",
        "cover": "20211115_015752_04f7fc3dee46d02be0219b5ddee5cb69.jpg"
    },
    {
        "podcast_id": 81260,
        "title": "Movie Dudes",
        "description": "Join Phil and Alec every week as they discuss an individual movie in depth and talk about other media related topics.",
        "language": "en",
        "author_name": "Phil Brault & Alec Koble",
        "slug": "moviedudes",
        "cover": "20210927_030800_b5ce3369535763520964a4f5af23ade9.jpg"
    },
    {
        "podcast_id": 82896,
        "title": "Podvant Garde",
        "description": "Two art history majors and a comedian walk into a recording studio...\nNo, really. Podvant Garde is an art history podcast that delves into the often untold facets of an artists' life. Join Andrea Guzzetta, Katrina Davis and Jordan Leigh Williams as they discover more about the artists they love and themselves, with a decent amount of laughs along the way. ",
        "language": "en",
        "author_name": "Andrea Guzzetta, Katrina Davis, Jordan Leigh Williams ",
        "slug": "podvantgarde",
        "cover": "20211005_020809_4b9d00a1c63cc34b0af17cdeeab279fe.jpg"
    },
    {
        "podcast_id": 84423,
        "title": "Maidens of Metal and Mayhem",
        "description": "Join MJ and Sam as they talk about all things, metal & horror... with a touch of mayhem! \n\nFollow our socials!\nInstagram: maidensofmetalandmayhem\nTwitteer: @Maidensofmetal\nFacebook: @Maidensofmetalnmayhem \nEmail: maidensofmetalandmayhem@gmail.com",
        "language": "en",
        "author_name": "MJ and Sam",
        "slug": "momam",
        "cover": "20211011_003524_34e9a6ec5a1fbb9b6fd2f570d7230240.jpg"
    },
    {
        "podcast_id": 85218,
        "title": "Imperfectly Perfect Weddings",
        "description": "Weddings can often be sold as the perfect day, where everything runs like clockwork and at the end of it you'll be on the cover of a magazine. In reality, wedding days are real. Things go wrong, timings are out and it rains. Imperfectly Perfect Weddings dives into the stories of when things don't go quite as they planned but the day is still perfect. ",
        "language": "en",
        "author_name": "Brendan Creaser",
        "slug": "imperfectly-perfect-weddings",
        "cover": "20211015_014533_88a6448a903fec0104bc51345ecc3485.jpg"
    },
    {
        "podcast_id": 85517,
        "title": "But It's A Classic",
        "description": "A weekly discussion of a classic film from an expert and an idiot. Drop by for the worst hot takes on the internet!",
        "language": "en",
        "author_name": "Phoebe Morgan & Ferdinand Ray",
        "slug": "butitsaclassic",
        "cover": "20211022_154258_0ee936e11075ca93120c68156da6d1aa.jpg"
    },
    {
        "podcast_id": 87697,
        "title": "Webheads Comic Club",
        "description": "Join DA and JP as we read and discuss our way through every issue of the Amazing Spider-Man, all the way from Issue #1 back in 1963 to the most recent issues today!  ",
        "language": "en",
        "author_name": "DAComix",
        "slug": "webheadscomicclub",
        "cover": "20211028_220035_76cfb362c9380a18d66a30673afc013d.jpg"
    },
    {
        "podcast_id": 87837,
        "title": "Point Bleu",
        "description": "Point Bleu est un balado culturel qui explore le processus créatif des artistes derrière les expositions en cours à Occurrence - espace d’art et d’essai contemporains. \n",
        "language": "fr",
        "author_name": "Occurrence",
        "slug": "pointbleu",
        "cover": "20211107_193555_d78aa6c1a3081d2ce4db93117c388d3b.jpg"
    },
    {
        "podcast_id": 88236,
        "title": "The Milo Beasley Show",
        "description": "Welcome to The Milo Beasley Show (but now in Podcast form!) \nAfter 7 years, and 300+ episodes on the youtubes, we are finally moving to the podcast medium. Yeah, its about time, we know. \n\nCheck out hundreds of interviews with your favorite celebrities, professional wrestlers, bands, and more! We promise to throw some podcast-exclusive content this way as well. \n\nThanks for listening. TELL YOUR FRIENDS! ",
        "language": "en",
        "author_name": "Milo Beasley",
        "slug": "themilobeasleyshow",
        "cover": "20211101_160518_5397ffe0a2c8c3f1b281f4b9ed5f97f8.jpg"
    },
    {
        "podcast_id": 88814,
        "title": "PORNOLOGY",
        "description": "A Podcast analysing the good the bad and the camp of Porn and its sub-genres, ranging from the 80s craze of VHS B-movies and pompous Art House Eros to the deep ends of OnlyFans content. Pornology is brought to you by Unkanny  Mag (https://www.unkannymag.com/blog)\n(Instagram: @unkannymag)\nHosted by: Yevhen (Instagram: @yungyev) - Lulu (Instagram: @coolblockbustergirl)",
        "language": "en",
        "author_name": "Pornology ",
        "slug": "pornologybyunkanny",
        "cover": "20211104_154513_3d07ed0cfb1078f0a1d8f7410034e3e3.jpg"
    },
    {
        "podcast_id": 89393,
        "title": "Name Pending",
        "description": "Hello hello, welcome to my podcast. I talk about things I like, like crime, murder, ghosts, art and music or really anything that comes to my mind while recording. The name really is pending, but thinking of sticking with the name being 'name pending' just to confuse people. \n\n",
        "language": "en",
        "author_name": "Lila",
        "slug": "namepending",
        "cover": "20211107_224531_7e8a9a8f3b023309ca1c00974dc21b13.jpg"
    },
    {
        "podcast_id": 89715,
        "title": "X-Factor Files: Investigating the Marvel Universe",
        "description": "<p>Join Daryl and Phillip (and their silent partners, bunnies Nick, Nora, and Asta) as they review corners of the Marvel universe! The brand new season is taking a deep dive into the 1993 Marvel annuals, celebrating their 30th anniversary and the new character(s) each issue introduced! Find us on Instagram @xfactorfilespodcast</p>",
        "language": "en",
        "author_name": "Daryl and Phillip",
        "slug": "tworiverstwotakes",
        "cover": "20230613_090649_cc786b49bff6c8dfdb2d81c83882f481.jpg"
    },
    {
        "podcast_id": 89844,
        "title": "Glo's Dark Tales",
        "description": "Short Horror Stories",
        "language": "en",
        "author_name": "Gloria V Bueno",
        "slug": "618b634c1ba17306ef76f0e2618b63a34e19815ce15c5b02",
        "cover": "20211110_071909_eab8286bb522c1dc6a2c3d6bf736b33a.jpg"
    },
    {
        "podcast_id": 90352,
        "title": "Big Picture Podcast",
        "description": "Enter into the minds of local artists Grase and Lucy as we discover Edmontons events, music, blooming artists, local business and new perspectives.",
        "language": "en",
        "author_name": "Lucy and Grase",
        "slug": "bigpicturepodcastlucyandgrase",
        "cover": "20211112_222603_2625b6ba022f2bc25d8f960db79c7b87.jpg"
    },
    {
        "podcast_id": 90616,
        "title": "Petty Pods",
        "description": "Life as a 20 something entrepreneur can be volatile!\nJoin us as we converse about the ups & downs of attempting to shed generational, societal, and cultural habits that no longer serve our path to success.\nExplore the creative processes that lead us to fulfilling business ventures, and the struggles to bring them into reality.\nLet's talk the good, the bad, and the solution!",
        "language": "en",
        "author_name": "Latonya Bolling",
        "slug": "pettypods",
        "cover": "20211114_230210_d8a49c6b9db202d4d9e5a83de57df23c.jpg"
    },
    {
        "podcast_id": 90712,
        "title": "The Curious Creatives",
        "description": "A podcast which explores the world of art & design. Hosted by a collection of industry and teaching enthusiasts, join our discussion and listen to ideas, projects, and concepts within the creative industries sector and how you can transform your initial artistic instinct into a life-long passion and career.  Each episode will feature conversations from various disciplines within the world of art & design and invite panellists from the local and global stage to discuss their creations and concepts.\n \nThis podcast is sponsored by Wrexham Glyndŵr University.\nJoin the discussion today at @ArtDesignWales ",
        "language": "en",
        "author_name": "Various Hosts",
        "slug": "thecuriouscreatives",
        "cover": "20211115_135841_215b23be0df157b9fd0a0ef9b4b8e1b3.jpg"
    },
    {
        "podcast_id": 91109,
        "title": "721DAO CHATS",
        "description": "721DAO CHAT is a community-driven investment DAO. We are focusing on early stage web3/ gamefi/ NFT projects and protocols. \n\nNothing said in this show is financial or any kind of advice and is for entertainment purposes only.",
        "language": "en",
        "author_name": "CYBORG_654",
        "slug": "721dao",
        "cover": "20211123_051149_5f33cad0479389120cd191dc9818e752.jpg"
    },
    {
        "podcast_id": 91786,
        "title": "Silver Screen Podcast/Hit or Miss: Star Trek Podcast",
        "description": "HIT OR MISS: STAR TREK\n\nA Star Trek Podcast celebrating every visual part of the franchise, from 1966 to the present day. Honest but respectful reviews, episode discussions, general chat & interviews with Trekkies, Trekkers, prominent figures on Trek social media and anyone who's watched a Star Trek. Created by Michael Wilson. Hosted by Mike & D.K. Live long and enjoy! \n\nSILVER SCREEN\n\nFilm reviews and analysis from Film Studies BA graduate Michael Wilson, his knowledgeable but enigmatic co-host D.K and a host of fellow cinephile guests. In 60-90 minutes they'll review and analyse new releases, classics, guilty pleasures and films they love, hate, or love to hate.",
        "language": "en",
        "author_name": "Michael Wilson",
        "slug": "silverscreen",
        "cover": "20220220_120229_472056357997a853979e5b6e3dd5685c.jpg"
    },
    {
        "podcast_id": 92334,
        "title": "Exploring Creativity",
        "description": "Our goal is to inspire, educate and provide a community for creative people to do the best work of their entire lives.",
        "language": "en",
        "author_name": "Michael J. Morgan",
        "slug": "exploring-creativity",
        "cover": "20211124_051144_1e713820231d2395e45ca57147d987ef.jpg"
    },
    {
        "podcast_id": 92573,
        "title": "What's In Your Bag?",
        "description": "The Venice Photo Club is a camera community is West LA. This series profiles local artists, by talking about what everyone wants to know. What is in their bag? What gear do they use?  We ask a series of 50+ questions that skim just the top.  We shoot from the hip and cover a lot of ground. We learn what they are working on, and get all latest tea, and we get to the bottom of the bag. ",
        "language": "en",
        "author_name": "Venice Photo Club",
        "slug": "venicephotoclub",
        "cover": "20211126_121104_4658e1c1a950992808e1f1ce4a501ddf.jpg"
    },
    {
        "podcast_id": 93357,
        "title": "BUITEN HET BOEKJE",
        "description": "Podcast door Elien Van Aerschot waar ze de mens aan de andere kant van de microfoon beter leert kennen door diverse vragen te stellen binnen het boekje maar ook enkele vragen die niet in het boekje staan...",
        "language": "nl",
        "author_name": "Elien Van Aerschot",
        "slug": "elienvanaerschot",
        "cover": "20211130_091154_67ab082766e38ad5df31bc649a64e1f4.jpg"
    },
    {
        "podcast_id": 95098,
        "title": "Shitcom",
        "description": "Shitcom is a shitty podcast of two people talking shit. You don't have to listen to it. But you might as well do when you taking a doodoo. *scream in horror*.\n\n",
        "language": "en",
        "author_name": "We Do Good",
        "slug": "shitcom",
        "cover": "20211210_081228_50b755968a085305c7d631ec8f836d8a.jpg"
    },
    {
        "podcast_id": 95654,
        "title": "My Romelier: the Rome and Wine Experience",
        "description": "Meet Daniele, a passionate architect and sommelier, a true Roman local and follow him exploring the unexpected in matching wines with music, art, movies and literature.\nThe Eternal city is the scenery of this storytelling experience, a pleasant way to travel with your five senses...",
        "language": "en",
        "author_name": "Daniele Meledandri",
        "slug": "myromelier",
        "cover": "20211216_011209_8e9a2c663f653555f244b0f7251767f9.jpg"
    },
    {
        "podcast_id": 100758,
        "title": "Podcast Drama",
        "description": "Podcast Drama este un podcast lansat de adolescenții din trupa de teatru Brightside Drama în care personajele principale suntem noi. Alegem subiecte care ne interesează, invităm oameni de la care vrem să aflăm lucruri noi, ne punem întrebări și râdem. Uneori prea mult, dar avem o scuză. Vârsta. \nGăsiți mai multe despre comunitatea noastră pe toate canalele de socializare. Doar caută Brightside Drama.",
        "language": "ro",
        "author_name": "Podcast Drama",
        "slug": "podcastdrama",
        "cover": "20220114_080111_f5c21ba525d0fecd50b712f94c9a74cc.jpg"
    },
    {
        "podcast_id": 101564,
        "title": "The Idiot's Film Society",
        "description": "Hey! This is my film review podcast that I started with some friends. It isn't too serious so if you like movies as much as me, tag along.",
        "language": "en",
        "author_name": "Max Haynie",
        "slug": "theidiotsfilmsociety",
        "cover": "20220118_020135_433fb0afca3f898801bdc7eca2f5fc42.jpg"
    },
    {
        "podcast_id": 102429,
        "title": "Let's Take Shots",
        "description": "A photographer podcast to level up your shots.. while downing a shot. Join Bay (@bayreedphotography Bri (@studiob.photos) and Hay (@photoxhaylee) as we talk about all the tips to consistently grow your photography business. We'll cover all things social media presence, marketing yourself, how to get your dream clients, posing and prompt techniques, staying inspired, and our best advice on how to stay on top of your game. You might want to grab a drink for this one.",
        "language": "en",
        "author_name": "Bay, Hay & Bri",
        "slug": "letstakeshots",
        "cover": "20220125_090146_75a95049084cff6c097916e5d4d4847d.jpg"
    },
    {
        "podcast_id": 102430,
        "title": "RCAD Initiative: Interviews with Political Artists",
        "description": "Presenting a podcast interview series designed to inspire and encourage art-activist processes and plays to catalyze social change. Featuring global political artists and their stories of resilience and care in response to our times, and informed by our histories in the making, and the socio-political spheres of our everyday lives. ",
        "language": "en",
        "author_name": "RCAD Initiative",
        "slug": "rcadinitiative",
        "cover": "20220121_050100_2ab6d0cd5839a186e5fa79a7bee270e7.jpg"
    },
    {
        "podcast_id": 104145,
        "title": "Spoken Art Journaling and Well Being",
        "description": "This podcast will take listeners through her book, Spoken Art Journaling Vol. 1. and challenge you to look in, look up and look out to see what you might have to bring about. When you sync up the mind, heart, and spirit, it unlocks a whole new world. Welcome to the adventure of YOUR lifetime.  It's time to listen... doodle... and shine!\n \nSpoken Art Journaling is designed to be both meditative and mind blowing. Three years ago, Molly caught her husband staring out into space and thought for sure he must be thinking of something earth shattering. Nope! When asked what he was thinking about, he responded with, “Nothing.” Astonished at how a person could do such a thing, his comment put her on a journey of quiet time and self-discovery. What she discovered is that thinking about nothing was not her jam. She realized that allowing her mind to express itself through color and the impressions all around her (inside & out), tapped into her heart and spirit too. She coined the technique Spoken Art Journaling and 8 journals later, she’s a happier & healthier person because of it. \n\nMolly Nece is CEO of GOLDEN Age Leadership (.com) and dabbles in the spirituality side of life at MollySHINES.com. She believes every person drives results and deserves to shine. Reach out to Molly for help mining your gold--it doesn't always mean dollars and it doesn't always make sense.\n",
        "language": "en",
        "author_name": "Molly L Nece",
        "slug": "spokenartjournaling",
        "cover": "20220127_040157_0cdad18feb549404e2b039415237a8ef.jpg"
    },
    {
        "podcast_id": 104862,
        "title": "Amateur Movie Reviews ",
        "description": "The show of shows\nBe ready be dazzled and amazed and maybe just learn something as three mates share their opinions on some of the biggest films worldwide.\n\nListen in as they provide some banter, some laughter and give you the opinions that you did not know you needed\n\nWelcome to AMR",
        "language": "en",
        "author_name": "Harry Lee, Sam Lake and Louis Davies",
        "slug": "amateurmoviereviews",
        "cover": "20220130_080155_348e6c4e28b945d05e4fe5c3f5c961e9.jpg"
    },
    {
        "podcast_id": 104935,
        "title": "NFT Artist Spotlight",
        "description": "Join us as we speak with NFT artists from around the world and learn about their process, past and future projects, tips, and insight into the NFT space. ",
        "language": "en",
        "author_name": "AstroZero",
        "slug": "nft",
        "cover": "20220130_060144_ab1022f69278ed18648cc100e39f1729.jpg"
    },
    {
        "podcast_id": 105697,
        "title": "Museums and Chill",
        "description": "<p>Museums and Chill is a one-of-a-kind podcast, where museum practitioners and thinkers from all over the world will discuss their inspiration, strategies, innovations and challenges. Each of the episodes will be in a different language (English, French and Spanish) </p>",
        "language": "en",
        "author_name": "International Council of Museums",
        "slug": "icomvoices",
        "cover": "20230412_080448_1d3ce332348089a501018ae4a92bd624.jpg"
    },
    {
        "podcast_id": 106384,
        "title": "CINERDS",
        "description": "El Podcast y Canal de Cine que Nadie Pidió\n\nCon @Kaizzer, @Zomvieck, @ElGab y @Humberto_Ramos y producido por @iraamelnegro\n\nNoticias,  Cartelera del Cine, Recomendaciones de que ver en Netflix y en la Cartelera.\n\nVideo nuevo todos los Martes... en la noche. Ya cuando baje el solecito. ;)",
        "language": "es",
        "author_name": "Cinerds",
        "slug": "cinerds",
        "cover": "20220829_120821_9105631853086cc9de2b19b5ccfc969f.jpg"
    },
    {
        "podcast_id": 106969,
        "title": "Panelen LBS Göteborg",
        "description": "Om livet på LBS Kreativa gymnasiet, Göteborg ",
        "language": "sv",
        "author_name": "Andreas Hultberg",
        "slug": "lbsgbgpanelen",
        "cover": "20221005_091045_a0969f98f5a5fb15168eaa9b4f12d31d.jpg"
    },
    {
        "podcast_id": 107097,
        "title": "AdYack",
        "description": "The Official Podcast of the American Advertising Federation of the Greater Lehigh Valley. Our mission is to inspire creativity and enhance the professional development of the advertising and marketing communities where we live and work. I'm your host Bill Childs. And I'll talk with artists, designers, writers, directors, photographers, along with those who work in a creative capacity. Our aim here is to serve as a creative resource to help you stay informed, entertain, and above all, inspired.",
        "language": "en",
        "author_name": "American Advertising Federation of the Greater Lehigh Valley",
        "slug": "adyack",
        "cover": "20220207_070204_69d403d8884a328d3440a2d9569daf6e.jpg"
    },
    {
        "podcast_id": 109513,
        "title": "Documentum ",
        "description": "Documentum is your podcast for in-depth conversations with thought leaders in the photography + NFT space. The Documentum team interviews everyone with an important seat at the PhotoNFT table, photographic artists, collectors, curators, writers, scholars, technologists, and key players of every stripe. Documentum is hosted by artist William Boling, Founder and Publisher of Fall Line Press. For deep dives on the photographic medium follow along with Bill's Substack - Patient Letters. ",
        "language": "en",
        "author_name": "Documentum TV",
        "slug": "documentum",
        "cover": "20220217_040231_387a2937514b1a937259a34772bbff50.jpg"
    },
    {
        "podcast_id": 110225,
        "title": "THE LOVE OF FILM",
        "description": "THE LOVE OF FILM is a Video and Audio Podcast by Film Lovers, Critics, Students, Filmmakers, Directors, Producers, Actors and more.\nWe simply, voraciously love Film. We discuss films from every direction.\nThe Good, the Bad and the Ugly. The Large, the Small and the Independent.\nThe scenes and behind the scenes.\nThe Budgeted and the non-budgeted. Every decade. Specific Films, Art Films, Directors, Cinematographers, Actors. Sub-genres.\nEverything. US and Foreign Films.\nIt’s our game - Please join us on this adventure.\n",
        "language": "en",
        "author_name": "Chase Bailey",
        "slug": "leftbankfilms",
        "cover": "20220223_010245_8c522eaf21b293409674c448c5032e6e.jpg"
    },
    {
        "podcast_id": 111890,
        "title": "Sessions with Tyler Turnbull",
        "description": "People talk when they're in pain. 'Sessions' allows the listener to sit alongside artist Tyler Turnbull as he tattoos a new guest every week, poking and prodding them to extract the most interesting back and forth possible. No topic is too taboo and, without the safety bumpers on, anything can come up. Think conversational jazz.",
        "language": "en",
        "author_name": "Tyler Turnbull",
        "slug": "sesssionpodcast",
        "cover": "20220228_030239_213a73c8ff297f00f1c008ee72a8f9c9.jpg"
    },
    {
        "podcast_id": 112813,
        "title": "Paint with Lovejoy",
        "description": "Helping First-time & Beginner painters get comfortable with the painting process. We will discuss, how-to topics, perspective, and mindset for painting, as well as answer student questions in the \"Ask Lovejoy\" series. Much of the philosophy of what I teach can be applied to painting but also to life in general, so even if you are not a painter you can still enjoy the info and apply it to something in your life.",
        "language": "en",
        "author_name": "Lovejoy",
        "slug": "paintwithlovejoy",
        "cover": "20220303_100338_78567f7b582b6d2dedb19b338957c429.jpg"
    },
    {
        "podcast_id": 113578,
        "title": "Broken English",
        "description": "The 'Broken English Podcast' is hosted by Mila Panic and optional take-over hosts. In addition to various topics related to language, one of the goals of this podcast is comfort in listening to broken English.\n\nIn different episodes, we explore topics such as: What is 'broken' in the way we speak and for whom is 'broken', second language, native languages, \"pollution\" of English as an act of protest, class-related aspects of language, purity in language, writing, proofreading, and to what extent we should correct ourselves. We allow ourselves to go in different directions, such as humor, work, immigration, displacement or deal with topics from different regions of the world. \nAnd last but not least: we do not apologize for our broken English. \n\nEmail: podcast.brokenenglish@gmail.com\nInstgram: @brokenenglish_podcast\nCover design by Uroš Pajović\nSound: Nikola Kekerovic\n",
        "language": "en",
        "author_name": "Mila Panic",
        "slug": "brokenenglishpod",
        "cover": "20220321_090323_343c3a75467c7676b7006042e00d5234.jpg"
    },
    {
        "podcast_id": 114287,
        "title": "Steeping DIY ",
        "description": "<p>A Doors At Seven project to provide listeners with a close and intimate conversation with anyone and everything having to do with DIY music, art and more.</p>",
        "language": "en",
        "author_name": "DOORS AT SEVEN",
        "slug": "doorsatseven",
        "cover": "20230721_050707_ca20c49f5db9df0a5191713224bdb137.jpg"
    },
    {
        "podcast_id": 114928,
        "title": "Confessions of a Rock'n'Roll Cameraman",
        "description": "New episodes every Thursday! \n\ncornrc.com\n\nIn the 1980s, Culture was being shaped by immerging digital video technology.  Tony Wannamaker was one of the founders of Much Music “The Nation's Music Station”. The  messages playing out in music videos. Being a blue-collar cameraman gave Tony the ability to access and document this cultural revolution through the camera lens while adding to the cultural shift itself through his visual reporting.  \nAs Pat Canavan interviews Tony about his 40-year career, the podcast delves into the Canadian identity in pop culture outside of the US narrative. We get an inside look at Tony's adventures around the world, including encounters with celebrities like Sidney Poitier, musicians David Bowie, The Rolling Stones, Madonna, Lenny Kravitz and more. Then we will dive deep with sharks of unknown names or celebrity status, travel to Africa to shoot the BIG 5 and meet the Masai Prince and even explore a near-death experience.",
        "language": "en",
        "author_name": "Pat Canavan and Tony Wannamaker",
        "slug": "cornrc",
        "cover": "20220803_040810_db3ff856549bf25bd0100a43bda1b36d.jpg"
    },
    {
        "podcast_id": 115062,
        "title": "Arcvantgarde ",
        "description": "“Am I stupid if I don't get it?”\n \nIn countless instances, many individuals find it difficult to appreciate art. Our lack of interest in art may be due to the perception that it is difficult to access. We are terrified of not understanding because we are afraid of being foolish, yet truly accessing art doesn't require a strong academic grasp of the subject matter. Art that works and reaches us does not necessitate that we be aware of the artist or source of the work. Each person is able to communicate freely with the work of the artist. And each person experiences each piece of work in a unique way. In this podcast, we enjoy, discuss and talk about art books and photo books. Let’s be foolish together! \n \nพูดคุย แลกเปลี่ยน แสดงความคิดเห็นและความรู้สึก อย่างสนุกสนาน ไปกับพอดแคสต์ ‘อาร์ตวงการ์ด’ พอดแคสต์ที่จะพาเราไปทำความรู้จักกับหนังสือภาพ งานศิลปะ และนิทรรศการ ในบรรยากาศที่ความไม่รู้ ไม่เข้าใจ ไม่ได้เป็นเรื่องผิด แต่จะเป็นจุดเริ่มต้นของการแลกเปลี่ยน เราจะเรียนรู้และดูโฟโต้บุ๊คใหม่ๆไปด้วยกัน\n",
        "language": "en",
        "author_name": "Arc Tribe",
        "slug": "arcvantgarde",
        "cover": "20220315_010316_fa36201560a357a57a1177330b1167e7.jpg"
    },
    {
        "podcast_id": 117712,
        "title": "thr33som3s Left to Focus on Podcast",
        "description": "<p>Weekly recap of the shenanigans in the Grotto. https://youtu.be/_N6lhkml53U https://linktr.ee/thr33som3s</p>",
        "language": "en",
        "author_name": "Kitch, Lucha, and Crouton (Bl3ss3d by thr33som3s)",
        "slug": "thr33som3s",
        "cover": "20220326_030341_bd563be3ac2941c679e42a43eea3f94b.jpg"
    },
    {
        "podcast_id": 118122,
        "title": "The Fantastic Mr. Podcast",
        "description": "Justin Strange, Zack Briggs, and Jake Kremers explore the film universe by talking about movies, directors, TV, film styles, etc. ",
        "language": "en",
        "author_name": "Justin Strange",
        "slug": "fantasticmrpodcast",
        "cover": "20220501_060506_c5c7c253f0dc5637fb4388964a46cf50.jpg"
    },
    {
        "podcast_id": 118804,
        "title": "Black Love Now",
        "description": "Black Love Now is a contemporary art exhibition which exclusively features African-American artists living and working in Texas. The Black Love Now podcast is an accompaniment to the exhibition where we chat with the artists one on one to gain insight into their creative process and what informs their work all leading up to the opening of the exhibition November 5, 2022 at Nicole Longnecker Gallery in Houston, Tx.",
        "language": "en",
        "author_name": "Scarlett Wieliczki",
        "slug": "blacklovenow",
        "cover": "20220422_050440_dda752a48b7b4bdf7bff6c7931ada7d4.jpg"
    },
    {
        "podcast_id": 118845,
        "title": "Now Then Talks",
        "description": "NOW THEN! A podcast that discusses commercial and creative filmmaking. Our guests lay bare the ups and downs of finding a voice within an ever-changing and, at times, unforgiving industry.\n\nThis podcast is hosted by Ozzie Pullin and Craig Bingham, fellow directors and close friends.\n",
        "language": "en",
        "author_name": "Ozzie Pullin & Craig Bingham",
        "slug": "nowthentalks",
        "cover": "20220424_090423_8e1425708626c177983376aaa95f5a9e.jpg"
    },
    {
        "podcast_id": 119177,
        "title": "Espresso de Cine",
        "description": "Este es un podcast donde yo, Marcos, dedico unos pocos minutos para hablar de algo que tanto me gusta. Acá voy a dar mi opinión y compartir ideas sobre películas, cine y todas sus posibles ramas.\n\nig: https://www.instagram.com/espressodecine/",
        "language": "es",
        "author_name": "Marcos",
        "slug": "espressodecine",
        "cover": "20221129_031105_45c371b07eeeca08dc879046ff96b2e1.jpg"
    },
    {
        "podcast_id": 119307,
        "title": "The Mindful Musician with Ryan Yacos",
        "description": "A mindfulness based podcast with a focus on exploring and integrating mindfulness based techniques into the creation and performance of music, art, dance, and life.  Whether you are an artist or not you can benefit from being more present with the world around you.",
        "language": "en",
        "author_name": "Ryan Yacos",
        "slug": "mindfulmusician",
        "cover": "20220401_050406_34370fda2a4b167b6232acfbeae6437e.jpg"
    },
    {
        "podcast_id": 120183,
        "title": "The Magnuson Park Gallery Exchange with SPACE 101.1FM",
        "description": "The Magnuson Park Gallery Exchange with SPACE 101.1FM brings the artist talk out of Gallery and into the radio Station, giving you an up-close look at our past, current, and future exhibitions. \n\nThe Magnuson Park Gallery and SPACE 101.1FM are part of The Sand Point Arts and Cultural Exchange located in Building 30 West at Magnuson Park in Seattle Washington. \n\nMore information can be found at https://linktr.ee/SPACEatMagnuson ",
        "language": "en",
        "author_name": "The Magnuson Park Gallery",
        "slug": "explorespace",
        "cover": "20221213_011203_a5772a37dead0b7550021eb2ff13269b.jpg"
    },
    {
        "podcast_id": 121710,
        "title": "Design Is Not Neutral",
        "description": "Design is Not Neutral is a podcast built from a thesis project. As a present design master's student at the University of Notre Dame, I began a broader inquiry into the way design as a field was built and the way we now teach design. After doing more research, it became clear - that design in the United States has a diversity problem. The roots of our diversity issue are squarely in how we define and teach Graphic Design. Graphic Design was made for white, cis-gendered, able-bodied men in consumer-driven societies. With this foundation, how we determine what is ‘good design’ has become extremely exclusionary. Yet, despite increased conversation around equity, design education has yet to dramatically change. The designers and design educators interviewed on Design is Not Neutral have all deeply researched the field of design education in order to improve our field. This podcast will not only provide listeners with resources on how to challenge their own perceptions of what design has been defined by, it will also provide concrete examples of how this work is being done in classrooms. I hope you enjoy each conversation as much as I did and if you liked Design is Not Neutral please check us out on Instagram.",
        "language": "en",
        "author_name": "Grace Hamilton",
        "slug": "designisnotneutral",
        "cover": "20220412_080440_6cfe197f4c914f25395fd59eb27aebe9.jpg"
    },
    {
        "podcast_id": 122951,
        "title": "The Content Cookout",
        "description": "The Content Cookout highlights and celebrates Black streamers and content creators. Host, Kielen King, interviews those who bring life to the live streaming and content creation space with high-quality, entertaining, and innovative work.",
        "language": "en",
        "author_name": "Kielen King",
        "slug": "contentcookout",
        "cover": "20220418_090421_f8287d745c1dbfcb9c028203e2602d2a.jpg"
    },
    {
        "podcast_id": 123507,
        "title": "Salvados por la ficción",
        "description": "Hablamos de cine y series en un espacio en el que tienen cabida Farmacia de Guardia y Breaking Bad. El Padrino y Los Masters del Universo. Con cerveza o sin cerveza, Arturo Álvarez, Raquel Pérez y Jesús López se sientan a la mesa para navegar por la ficción. ",
        "language": "es",
        "author_name": "Arturo Álvarez, Raquel Pérez y Jesús López",
        "slug": "salvadosporlaficcion",
        "cover": "20220421_060412_d7764b6d7e69dcb7bcc0d59caf2c3fba.jpg"
    },
    {
        "podcast_id": 125075,
        "title": "wndrcast",
        "description": "The digital content world is constantly changing. In this podcast series by wndr, we speak to the people behind some of the top travel video content on social media and how they’ve built successful businesses doing what they love best. We explore the evolution of video in an ever-changing industry and what it means for those looking to create, distribute, manage or consume content.\n\n✨ How digital content creators are evolving\n✨ What's changing in video media\n✨ Who's driving innovation in digital marketing?\n✨ Digital content trends and innovations\n✨ Insights from industry leaders, as well as practical ways to create high-quality content\n✨ Hear from leading experts on how to get started\n✨ Learn about new trends and innovations in digital content\n✨ Hear from leading experts on how to get started, motivation and inspirations, fears, successes and failures\n✨ The future of video and content production",
        "language": "en",
        "author_name": "wndr",
        "slug": "wndrcast",
        "cover": "20220428_100425_5562071e56574a73068c5acf875fd350.jpg"
    },
    {
        "podcast_id": 125651,
        "title": "Passionsfrucht - Podcast",
        "description": "Im Podcast Passionsfrucht unterhält sich Florian Pfister mit jungen Kulturschaffenden aus Ob- und Nidwalden. Sie alle vereint eines: Sie haben eine Leidenschaft für etwas, eine Passion.",
        "language": "de-ch",
        "author_name": "Florian Pfister",
        "slug": "passionsfrucht",
        "cover": "20220501_090516_2029ad3848e58c07e971344434a4cb7e.jpg"
    },
    {
        "podcast_id": 127077,
        "title": "Not Just Pixels",
        "description": "Hi there! Not Just Pixels is a student-led UX Design podcast that strives to help you grow as a designer and get that next design internship or job. This is the podcast I wished I had as a design student. So, let's get started!",
        "language": "en",
        "author_name": "Guo Chen",
        "slug": "notjustpixels",
        "cover": "20220508_070507_6611cc01f51d40ec5ab88318bd40ab70.jpg"
    },
    {
        "podcast_id": 128478,
        "title": "Devrim'in Anlatacakları Var",
        "description": "Devrim'in Anlatacakları Var ve artık içime sığmıyor. Eski dostlarımı, yeni tanıdıklarımı, yeri geldiğinde tırnaklarımı boyayan ablayı yeri geldiğinde pazardan limon aldığım amcayı daha fazla düşüncelerimle sıkmamak için yüzünü hiç görmediğim insanları darlamaya karar verdim. Anlatacak çok şeyim var, hadi yola çıkalım.",
        "language": "tr",
        "author_name": "Devrimzzz",
        "slug": "devriminanlatacaklarivar",
        "cover": "20220515_080523_167f910e279428d5d395c64cd233a546.jpg"
    },
    {
        "podcast_id": 129133,
        "title": "Two Itchy Boys",
        "description": "A little show about little games from well documented bigfoot impersonator Bobby McCarthy and virtual heartthrob extraordinaire Hunter J Allen. Join these two intrepid game explorers as they delve through the depths of the itch.io game store for small specimens well worth your attention. It's a bi-weekly show-and-tell game show that's always under an hour but jam packed with oodles of good games for your perusal. So hop in and get itchy!",
        "language": "en",
        "author_name": "Bobby McCarthy and Hunter J Allen",
        "slug": "twoitchyboys",
        "cover": "20220519_060554_9e9805985519f24694f2455b466a9506.jpg"
    },
    {
        "podcast_id": 129839,
        "title": "Generative Dreaming",
        "description": "Generative Dreaming is a series of conversations around art-making. In each episode, two artists chat about what, why and how they make what they make, as well as their visions for the future and the wider world. Their conversations reveal how we persist through courage, community and creative strategy – not just as artists, but also as people.",
        "language": "en",
        "author_name": "Feelers",
        "slug": "feelers",
        "cover": "20221128_051142_dddcdf21f3177318388b71fbebd63928.jpg"
    },
    {
        "podcast_id": 129970,
        "title": "Editors Note",
        "description": " Editors Note is a deep dive into 3 film students perspective's on the plot, characters, and flow of todays popular tv shows and movies. We discuss the happenings within the media and what we would have changed if given the chance.",
        "language": "en",
        "author_name": "Jordan, Sawyer, and Octavian",
        "slug": "editorsnote",
        "cover": "20220804_060809_6a22d1fc3c61f3c666ade34493b9c9d9.jpg"
    },
    {
        "podcast_id": 130367,
        "title": "Matters of Experience",
        "description": "Matters of Experience is a podcast about the creativity, innovation, and psychology driving designed experiences and encounters. Each week Abby and Brenda dig into the who, how, so what and why of exhibitions, branded experiences, events, spectaculars, and all the crazy things designers and creatives are putting out there for people who just can’t get enough.",
        "language": "en",
        "author_name": "Lorem Ipsum Corp",
        "slug": "matters-of-experience",
        "cover": "20220525_080510_39741b085ae2e4a3000469fe3840a402.jpg"
    },
    {
        "podcast_id": 131576,
        "title": "Vcjart藝無所知",
        "description": "<p>平凡人的藝術雜談 透過介紹畫作分享一些浪漫不實的生活哲學 一週兩幅畫，讓你縱橫商場不害怕 閉上眼睛 吸吐吸吐 放輕鬆 明天不一定會更好 但今天過的快樂就好 YouTube/Apple podcast /Spotify /google播客/IG：藝無所知 週二、週五更新 btw我股癌腦粉 聽氣氛也開心 任何事都歡迎寄信給我: vcjart0819@gmail.com</p>",
        "language": "zh",
        "author_name": "陳榆恩",
        "slug": "vcjart0819",
        "cover": "20220601_010634_13f3f041367ccbc350a660db6c2e059b.jpg"
    },
    {
        "podcast_id": 131644,
        "title": "How to Wear Clothes",
        "description": "Fashion talk and Outfit Inspo",
        "language": "en",
        "author_name": "Jenna",
        "slug": "howtowearclothes",
        "cover": "20220602_010615_a5e832436f8de9f6201db22db33fd979.jpg"
    },
    {
        "podcast_id": 131672,
        "title": "Take a Lap Now - Episode 1",
        "description": "We introduce ourselves and talk about why this podcast exists.",
        "language": "en",
        "author_name": "Enso Media Firm",
        "slug": "takealapnow",
        "cover": "20220601_080652_937957159f79944fdd47f931f392978b.jpg"
    },
    {
        "podcast_id": 132146,
        "title": "PERSONIFIED SLEEP",
        "description": "where all poems go to die-spoken word ",
        "language": "en",
        "author_name": "Charlotte Beckett",
        "slug": "personifiedsleep",
        "cover": "20230129_080115_13bd1668d6c9be3ad410c25e64326feb.jpg"
    },
    {
        "podcast_id": 132298,
        "title": "Magellans at the Movies",
        "description": "<p>Welcome to Magellans at the Movies, the outrageously popular* new podcast about all things movies brought to you by Nathan “I-can’t-believe-I-ate-the-whole-thing” Magalhães and his brother Elliot “Who-on-Earth-is-going-to-listen-to-a-podcast-we-make” Magalhães! (*Outrageous popularity pending) Join the brothers Magalhães (Anglicized as Magellan) as they bicker and banter about movies no one has seen or cares about or that have already been analyzed by far sharper minds than their own every week, along with special guest stars of varying willingness and notoriety! Get ready to laugh along with Nathan’s meandering freshman film student level critiques of movies you’ve never heard of, and enjoy the bored, grumpy-senior-citizen-who-would-rather-be-feeding-pigeons energy that has made Elliot the toast of the greater Indianola area! Come for the lukewarm old-man-yells-at-cloud takes on modern movies, stay because you got distracted and left Spotify running. See you at the cinema! </p><p>Follow @nathandm799 on Instagram for updates</p><p>Check out our blog for more reviews and movie content!!! <a href=\"https://magellansatthemoviesblog.blogspot.com/?m=1\">https://magellansatthemoviesblog.blogspot.com/?m=1</a></p>",
        "language": "en",
        "author_name": "Nathan Magalhaes",
        "slug": "magellensmovies",
        "cover": "20220819_010834_d2c33ac23745a7b74c755160acd99fd4.jpg"
    },
    {
        "podcast_id": 132512,
        "title": "A lifestyle",
        "description": "Si eres una persona intensa que convierte su serie o libro favorito en su nueva personalidad y a la que le gusta analizar minuciosamente cada detalle, este es tu sitio.\n",
        "language": "es",
        "author_name": "Aly Soler",
        "slug": "alifestyle",
        "cover": "20220606_100621_19ab69a44a6a79767337f6f3398551bc.jpg"
    },
    {
        "podcast_id": 133064,
        "title": "KeyStyle Media Podcast ",
        "description": " This is a podcast with an inspirational and motivational spin for people from all walks of life. Hosted by Yev Zakharkin the founder of Keystyle Media.",
        "language": "en",
        "author_name": "Yevgeniy Zakharkin",
        "slug": "keystylemedia",
        "cover": "20220617_050623_0f9b5e404574cbae6ee1df572bf3e33a.jpg"
    },
    {
        "podcast_id": 136785,
        "title": "The Art Persists Podcast",
        "description": "<p>The Art Persists Podcast is a series offering a glimpse into the life of artists and activists bridging the arts, activism, and human rights around the world. Brought to you by <a href=\"https://www.boslaarts.com/\">Bosla Arts</a>. </p>",
        "language": "en",
        "author_name": "Bosla Arts",
        "slug": "theartpersistspodcast",
        "cover": "20230720_020739_48e9fb177eb18ebb6a61088c7328242b.jpg"
    },
    {
        "podcast_id": 137175,
        "title": "Control - Bad Gyal",
        "description": "Bad Gyal",
        "language": "es",
        "author_name": "Bygu",
        "slug": "control",
        "cover": "20220628_050608_8be3df5f80bf4948aaec01664b17f03f.jpg"
    },
    {
        "podcast_id": 138347,
        "title": "Where Art and Grief Meet",
        "description": "Where Art & Grief Meet is an exploration of the space where the creative spirit mingles with grief, loss and adversity.\n\nSophia, a compulsive artist who has experienced her own fair share of adversity and grief, talks with a range of notable and passionate creatives (visual, writers, musicians, entrepreneurs) to reflect and share observations and responses to the question of how their art practice is impacted by the slings and arrows of a life, acknowledging of course that grief comes in an infinite number of shapes and forms: personal and global and everything in between. \n\nThere is no hierarchy of grief here. Loss, in this context, is viewed as an inevitable part of life and a prism through which we explore artistic practice and expression. \n \nSophia is interested in building a space where creatives can openly discuss their observations, their stories and the resulting strategies in order to alleviate isolation, make broader connections and create a supportive community. \n\n\nWebsite here https://www.sophandson.com/\nPatreon: https://www.sophandson.com/whereartandgriefmeet \nPaypal: https://www.paypal.com/pools/c/8L9Ak8pJu3\n\n",
        "language": "en",
        "author_name": "Sophia Cosmas",
        "slug": "whereartandgriefmeet",
        "cover": "20220703_080756_b78c8653debc1fbdd584952812416014.jpg"
    },
    {
        "podcast_id": 138722,
        "title": "Estéril y Huérfana",
        "description": "Soy María Seghini, actriz, y hago teatro porque creo en su poder transformador. Florecer en el desierto, así, como pétalos al viento, por acá te cuento.\n\nProducción: Julio Pucci\nhttps://www.instagram.com/juliopuccilocutor/\n\nMúsica original: \nhttps://www.youtube.com/watch?v=FNVJSjzO9VY\n\nVoz y contenido: María Seghini\nhttps://www.instagram.com/mariaseghini/\nhttps://www.facebook.com/maria.seghini",
        "language": "es",
        "author_name": "María Seghini",
        "slug": "mariaseghini123",
        "cover": "20220705_110717_4694dc70ec0a38048df015603170b2ed.jpg"
    },
    {
        "podcast_id": 138942,
        "title": "The Gavel Strikes | Heritage Auctions",
        "description": "Listen to a replay of our live shows from the Heritage Auctions team. ",
        "language": "en",
        "author_name": "Heritage Auctions Experts ",
        "slug": "thegavelstrikes",
        "cover": "20221102_061153_7702b3621e28e8d77fe784552e2047c7.jpg"
    },
    {
        "podcast_id": 139144,
        "title": "ASF PODCAST ",
        "description": "Hey !! This podcast is basically just me giving my unwanted/unneeded opinion on everything pop culture related. Thanks for listening !!",
        "language": "en",
        "author_name": "Parker Lesser",
        "slug": "asfpod",
        "cover": "20220707_110759_734daf16185ba2146ea45f11089f1180.jpg"
    },
    {
        "podcast_id": 139148,
        "title": "desZerebradas",
        "description": "Somos Magdaleno y Tora; “rojas”, “viciosas”, “radicales”, “pavas”… ¿O solamente somos generación Z?.\ndesZerebradas, ¿Hay alguna falta de ortografía?.",
        "language": "es",
        "author_name": "Magdaleno y Tora",
        "slug": "deszerebradas",
        "cover": "20220707_110712_7286c11c48e91c569d088e8a80b94877.jpg"
    },
    {
        "podcast_id": 139437,
        "title": "4 Palancas",
        "description": "4 tipos hablan sobre juegos",
        "language": "es-mx",
        "author_name": "Alejandro Gutierrez Ortega",
        "slug": "4palancas",
        "cover": "20220709_060747_dae43b75a4ad81c8121281a64881f483.jpg"
    },
    {
        "podcast_id": 139621,
        "title": "La bufa la gamba",
        "description": "<p>El podcast que no sabías que necesitabas. Entérate de todo el arte que hay a los dos lados del vinalopó.</p><p><a href=\"https://linktr.ee/labufalagamba\">https://linktr.ee/labufalagamba</a></p>",
        "language": "es",
        "author_name": "La bufa la gamba",
        "slug": "labufalagamba",
        "cover": "20220727_070749_d6a8d4e286c5acb1de5724641bf44afc.jpg"
    },
    {
        "podcast_id": 139845,
        "title": "Those Art Teachers",
        "description": "In Those Art Teachers, Corbie and Kaitlyn discuss all things art education while taking listeners on the wild ride that is a normal conversation for these two best friends. Follow along to gain insight on what it's really like to teach art in US public schools. This podcast is not for the faint of heart, but neither is teaching, so buckle up buttercup, let's do this.",
        "language": "en",
        "author_name": "Corbie and Kaitlyn",
        "slug": "thoseartteachers",
        "cover": "20220712_030722_659c901cf9f0ed0b1bad22cb71c51a4c.jpg"
    },
    {
        "podcast_id": 142453,
        "title": "Quorum Live",
        "description": "Aqui encontraras el mejor contenido de arquitectura!",
        "language": "es",
        "author_name": "Mario Velazquez / Vicente Ocampo",
        "slug": "quorumlive",
        "cover": "20220725_030736_9eec42ae74e5472903bc1dad1ecf286a.jpg"
    },
    {
        "podcast_id": 143660,
        "title": "LifeAfterRender | Podcast nie tylko o montażu",
        "description": "W podcaście rozmawiamy na różne tematy dotyczące pracy w postprodukcji wideo, o montażu i programach, ale też o teorii, własnych projektach i doświadczeniu. \n\nA do tego, jak głosi nazwa podcastu - oczywiście nie zabraknie rozmów na inne życiowe tematy, czyli jak spędzamy czas wolny, czym się zająć dopóki trwa render i co zrobić, kiedy już się skończył ;)\n\nMamy nadzieje, że podcast będzie ciekawy jak dla już pracujących w branży, tak i dla tych, którzy dopiero na początku swojej ścieżki twórczej.",
        "language": "pl",
        "author_name": "LifeAfterRender",
        "slug": "lifeafterrender",
        "cover": "20220731_070703_abc46d40fce6ca3d67c946240df3b1a7.jpg"
    },
    {
        "podcast_id": 144552,
        "title": "Mixed Media - A Podcast by Kavi Gupta",
        "description": "Mixed Media is a window opened unexpectedly onto a landscape of ideas, featuring a rotating cast of artists, curators, writers, art collectors, and members of the Kavi Gupta staff, casually discussing the sweetness and mystery and chaos of great art in front of a microphone.\n\nKavi Gupta amplifies voices of diverse and underrepresented artists to expand the canon of art history. Through innovative and ambitious exhibitions, multimedia programming, and rigorous publications, we foster an evolving conversation among international communities about art and ideas. In addition to hosting more than a dozen major exhibitions each year, and participating in vital international art fairs, we host artist talks, facilitate special programming in support of philanthropic causes, and foster intellectual discourse by regularly bringing artists, curators, and collectors together with academics and experts in the contemporary art field.",
        "language": "en",
        "author_name": "Kavi Gupta",
        "slug": "kavigupta",
        "cover": "20220804_100808_69a2c7c536c90dab93bd17f3a8e1c938.jpg"
    },
    {
        "podcast_id": 146622,
        "title": "The Study Podcast",
        "description": "<p>The Study Podcast follows co-hosts Brian Fuller and Matt Hahn through all things relating to storytelling. Analysis, breakdowns, guest stars on unique topics of expertise - as well as a general hilarity at one another's expense.</p><p>We release information and teasers regularly on our instagram page:</p><p><a href=\"https://instagram.com/the_study_podcast?igshid=MmIzYWVlNDQ5Yg==\">https://instagram.com/the_study_podcast?igshid=MmIzYWVlNDQ5Yg==</a></p>",
        "language": "en",
        "author_name": "Brian R. Fuller, Matthias Hahn",
        "slug": "thestudypodcast",
        "cover": "20230829_050832_ec4baedb2db7224086fd9c5dac4b64a6.jpg"
    },
    {
        "podcast_id": 146944,
        "title": "Parche Magistral",
        "description": "Parche Magistral es un espacio de difusión para artistas. Nos interesamos por los procesos creativos que van detrás de las obras. Aquí cualquiera puede hacerlo Magistral. ",
        "language": "es",
        "author_name": "Jacobo Ortiz y Julián Escalante",
        "slug": "parchemagistral",
        "cover": "20220816_100845_cf3b8a54a7e195e0bb99179b49b289bf.jpg"
    },
    {
        "podcast_id": 147565,
        "title": "Check the Method Podcast",
        "description": "Check the Method podcast, is a podcast about the artist/creative process. In this podcast, contemporary artist and host M.Tony Peralta interviews different creatives from Artist, Chef's, Designers, Photographers, etc about their process in making work. \n\nPodcast is created, produced & edited by: M.Tony Peralta",
        "language": "en",
        "author_name": "M.Tony Peralta",
        "slug": "checkthemethodpodcast",
        "cover": "20220819_060813_425d4f6593cddf5fed0eefab8628c132.jpg"
    },
    {
        "podcast_id": 147916,
        "title": "Made Rite Radio",
        "description": "<p>Welcome to Mad Rite Radio, The show that talks about our relationships to tattooing, and explores the constantly evolving culture that surrounds it.</p>",
        "language": "en",
        "author_name": "John Biswell",
        "slug": "maderiteradio",
        "cover": "20230429_110409_4050fc81ea2813c767027d72cbcb1257.jpg"
    },
    {
        "podcast_id": 148521,
        "title": "Two Lacquered Ladies",
        "description": "A podcast about nail art and polish by the ladies who stream it, starring DanieShout and Fanaticure!",
        "language": "en",
        "author_name": "Fanaticure",
        "slug": "twolacqueredladies",
        "cover": "20220826_010801_f37b7bfd2aa41aaacf040099f7ab7b04.jpg"
    },
    {
        "podcast_id": 149773,
        "title": "uncharted",
        "description": "share the creative space with co-hosts ashley zibiza & lydia banjo as they discuss insightful and entertaining topics that vary from the industry and creatives to current affairs.\ninitially a space created to inform themselves on the world around them, later grew widespread as a way of sharing experiences with listeners by collaborating with a plethora of influential guest speakers. together they gain insight, grow and delve into uncharted territory. ",
        "language": "en",
        "author_name": "ashley & lydia",
        "slug": "uncharted-edition",
        "cover": "20220830_050827_6d843f802e8a09d01bda981e36340ac8.jpg"
    },
    {
        "podcast_id": 154370,
        "title": "Cocktail Hour with Michael & Leia | A Madlovemedia Podcast",
        "description": "Hello friends! We're Michael and Leia from madlovemedia! We wanted to start this podcast to share our experience as photographers and videographers in the wedding industry. We are also passionate business owners who love talking about how to start, run, and work with your significant other. We're so happy you stumbled across our podcast and we hope you stay and enjoy a cocktail with us while we dive into a variety of wedding and business-related topics! ",
        "language": "en",
        "author_name": "Michael Barreiro",
        "slug": "madlovepodcast",
        "cover": "20220918_110957_5ca0677c2b5ccf4c8fac7ee86b4ec815.jpg"
    },
    {
        "podcast_id": 155227,
        "title": "Pardon Our Promotion",
        "description": "Join hosts Scot Johnson and Bob Masewicz as they discuss what they've learned over their decades in Live Events, Sports Promotion, and Marketing. Each week, they'll dive into a new subject, sharing what works, what doesn't, and most importantly, why? ",
        "language": "en",
        "author_name": "VirtCh Productions",
        "slug": "pardonourpromotion",
        "cover": "20220923_020946_3d1a3d5194de88f1bba5db769e6faaed.jpg"
    },
    {
        "podcast_id": 155326,
        "title": "The Retired IT Guy and Musician",
        "description": "Thoughts and ideas for the day",
        "language": "en",
        "author_name": "Phil Melius",
        "slug": "philsplace",
        "cover": "20220923_120901_c5f6ccc9740c48a3d58cc4535ba9b81c.jpg"
    },
    {
        "podcast_id": 155343,
        "title": "The Jonesonthelens Podcast",
        "description": "<p>Photographer, musician, gamer, crappy chef. I'm gonna talk to you about what I talk to myself about. Maybe throw in a guest or two. Follow my rantings here and on my socials! Be a part of the conversation! <a href=\"http://www.jonesonthelens.com\">http://www.jonesonthelens.com</a> </p><p>All my links <a href=\"http://solo.to/jonesonthelens\">solo.to/jonesonthelens</a> </p>",
        "language": "en",
        "author_name": "Seth T Jones",
        "slug": "jonesonthelens",
        "cover": "20220923_010904_aebb61ea77037a1384c48a6bdce6d1ee.jpg"
    },
    {
        "podcast_id": 157075,
        "title": "Expedition Cinema Podcast",
        "description": "<p>Join me as I explore the world of film!</p>",
        "language": "en",
        "author_name": "Jeremy & Others",
        "slug": "expeditioncinemapodcast",
        "cover": "20230530_070506_3fee43d99c61ad41f032e70a6e518f8c.jpg"
    },
    {
        "podcast_id": 157819,
        "title": "Dimescared ",
        "description": "MFA status is redacted ",
        "language": "en",
        "author_name": "Mike and Anna ",
        "slug": "dimescared",
        "cover": "20221003_101054_73b407c104c57432ca4581e316d43c9f.jpg"
    },
    {
        "podcast_id": 158561,
        "title": "Film Dicks",
        "description": "Writer/Director Blaise Weller and Actor Ray Dzhorgov discuss great filmmaking and not so great filmmaking, the power of story or the failure of it, good acting and not so great performances over drinks and their experience.  ",
        "language": "en",
        "author_name": "Blaise Weller",
        "slug": "blazelev23",
        "cover": "20221014_111025_218dd663d06773b9fd491a95442da9da.jpg"
    },
    {
        "podcast_id": 158638,
        "title": "Friendly Shadows ",
        "description": "<p>Interviews with the shadows In entertainment every Thursday. </p>",
        "language": "en",
        "author_name": "Kelly Kintner",
        "slug": "friendly",
        "cover": "20230309_110327_00a3540c5dd7d669922692f3e2f8f5a6.jpg"
    },
    {
        "podcast_id": 158647,
        "title": "WHOISTRADI",
        "description": "<p>Whoistradi es un programa presentado por Damià Morales y realizado por Huc Garcia y Aida Atencia, un proyecto de entrevistas a tatuadores donde hablaremos de técnicas, estilos, anécdotas y novedades.</p>",
        "language": "es",
        "author_name": "Damià Morales, Huc Garcia, Aida Atencia",
        "slug": "whoistradi",
        "cover": "20221007_091035_57e884533034292e580cb924e70cac33.jpg"
    },
    {
        "podcast_id": 158954,
        "title": "Disecciones -  Podcast ",
        "description": "Conversaciones para disfrutar y discutir el cine . \nDirigido por los Mtros Guillermo Vaidovits y Carlos Torrico . \nAnécdotas de salas de cine en tiempos remotos.\n",
        "language": "es-mx",
        "author_name": "Guillermo Vaidovits & Carlos Torrico ",
        "slug": "disecciones001",
        "cover": "20221009_011007_52b6578d29948d988a8cef51cc74a5cf.jpg"
    },
    {
        "podcast_id": 159902,
        "title": "the Betaverse",
        "description": "Gordo Matt and Nathan explore this beautiful Betaverse",
        "language": "en",
        "author_name": "Gordo Matt Nate",
        "slug": "betaverse",
        "cover": "20221021_111055_1aef842c572dbec4170376eea4f5fa46.jpg"
    },
    {
        "podcast_id": 161307,
        "title": "Walking and Talking",
        "description": "Walking and Talking is a four-part conversational Podcast series by The Line. Featuring artists, creatives and members of the local community who discuss themes and ideas related to The Line and the areas that it connects by visiting Greenwich Peninsula, the Royal Docks, Cody Dock and Queen Elizabeth Olympic Park.\n\nWhether you’re on the route or somewhere else in the world, we hope you enjoy discovering more about The Line and its context.",
        "language": "en",
        "author_name": "The Line London",
        "slug": "walkingandtalking",
        "cover": "20221018_101009_8cee868e926d7580b04830177b75b3f5.jpg"
    },
    {
        "podcast_id": 161905,
        "title": "Vivere l'arte",
        "description": "Vivere l'arte per farne parte, raccontare gli eventi a Roma e dintorni. \nStorytelling di personaggi, di sogni, miti, leggende, sentimenti e tutto ciò che fa cultura. Un tuffo nel passato per immaginare il futuro.\nPuoi trovare diversi articoli interessanti su:\n\nhttps://viverearteblog.wordpress.com/\nhttps://www.facebook.com/groups/518230221668587\n\n\n",
        "language": "it",
        "author_name": "Roberto Benatti e Patrizia Cantatore",
        "slug": "viverelarte",
        "cover": "20221023_011057_7a6d2ad8beb051410fb9cdc4e4c05180.jpg"
    },
    {
        "podcast_id": 161954,
        "title": "Creative Footnotes ",
        "description": "Interviews with the makers of rad things and their personal Creative Footnotes. \nWhat is a footnote? \nWebsters says: a note of reference, explanation, or comment usually placed below the text on a printed page. \nFootnotes enhance a reader's understanding of the text by giving references and commentary from the creator. There is value as an artist, in understanding your process. So, come sit with us and chat about how these cool people make their dream art visions come to life. \nNew Episodes every second and fourth Thursday ",
        "language": "en",
        "author_name": "Lea Audrey",
        "slug": "creativefootnotes",
        "cover": "20221020_051009_49af71114a83299a32859ae4f4fecccb.jpg"
    },
    {
        "podcast_id": 163435,
        "title": "my burning questions",
        "description": "personal narratives and conversations against my most burning questions.",
        "language": "en",
        "author_name": "Luka Gotsiridze",
        "slug": "myburningqs",
        "cover": "20221026_111021_8cd752e68f62fd10e83ea280cbfe2d0c.jpg"
    },
    {
        "podcast_id": 164002,
        "title": "Terms of Service",
        "description": "Terms of Service is about the concepts behind the web3 field, unpacked for the arts and culture industries.  Web3 has been served to us cloaked in buzzwords and hype, often hiding the real intentions and goals of those who push the field forward",
        "language": "en",
        "author_name": "Parallel.art",
        "slug": "termsofservice",
        "cover": "20221029_111003_83f22c2689014a3d2ff5a21f302d2479.jpg"
    },
    {
        "podcast_id": 164775,
        "title": "Cisne, el podcast.",
        "description": "Cisne, el podcast.",
        "language": "es",
        "author_name": "Cisne Revista",
        "slug": "cisneelpodcast",
        "cover": "20221102_011148_4d04f497d8a9098f9862032e79d0e6ba.jpg"
    },
    {
        "podcast_id": 164828,
        "title": "THE SKATEROOM Podcast ",
        "description": "THE SKATEROOM Podcast unites art, skate & social change through conversation. Hosted by Oisín Tammas.\n\ntheskateroom.com\n@theskateroom",
        "language": "en",
        "author_name": "THE SKATEROOM",
        "slug": "theskateroom",
        "cover": "20221102_091109_c34d791e932fa5fc3b78001b068983ee.jpg"
    },
    {
        "podcast_id": 165494,
        "title": "The Sage Arts",
        "description": "Supercharge your creativity, motivation, and artistic style through novelty, story, conversation, and community. The Sage Arts podcast offers artists ways to further hone their unique voice, increase their joy and productivity, and create their version of meaningful artistic success. \nPart advice and inspiration, part thought-provoking diversions, this podcast is a varied mix of artist interviews, historical and listener stories, productivity advice, design guidance, and motivational ponderings. There will be a-ha moments, laughs, avalanches of creative inspriation, and ideas for new and novel experiences to shake up your muse.\nJoin artist, writer, publisher, and creativity coach Sage Bray Varon, for these energizing  forays into cultivating a fun and meaningful creative life. ",
        "language": "en",
        "author_name": "Sage Bray Varon",
        "slug": "thesagearts",
        "cover": "20221122_121133_e492c2389fb2e02ffd16d10f78b9b96e.jpg"
    },
    {
        "podcast_id": 165753,
        "title": "Nest-Cast ",
        "description": "Welcome to My PODCAST THE NESTCAST \n\nThis is something ive wanted to do for a while so here it is I HOPE YOU ENJOY AND CONSIDER FOLLOWING OR SUBCRIBING !!!",
        "language": "en",
        "author_name": "Nestor Perez",
        "slug": "nest-cast",
        "cover": "20221106_031112_5efb8bc33c51c6640f2d57b34e014785.jpg"
    },
    {
        "podcast_id": 166110,
        "title": "Let's Look",
        "description": "Ever wonder who the women working in the art world today are? I will interview women working in the visual arts about their stories and work. I want to make women artists visible to women artists. So... Let's Look. ",
        "language": "en",
        "author_name": "Emily Van Meter",
        "slug": "lets-look",
        "cover": "20221107_011129_c2d38f48b45aa145dd11600d0de8484f.jpg"
    },
    {
        "podcast_id": 166543,
        "title": "The Aaron Mello Podcast",
        "description": "The Aaron Mello Podcast features conversations with photographers, artists, makers, changers and the doers. From entrepreneurship to self-improvement and more, this is a podcast for the creative who may be in limbo from moving from their 9-to-5 job to a lifestyle built on their own artistry.",
        "language": "en",
        "author_name": "Aaron Mello",
        "slug": "mellopodcast",
        "cover": "20221109_021158_7d5c80fa5f5fbc98fcf3c3191d08021c.jpg"
    },
    {
        "podcast_id": 167233,
        "title": "Frazetta Fridays w/Frazetta Girls ",
        "description": "Frank Frazetta has reigned as the undisputed godfather of fantasy art for 50 years, his fame only growing in the 12 years since his death. Frazetta has captured our collective imagination and took it to places it had never been before. Frazetta Girls was founded by his family in 2013 to preserve and honor Frazetta's enormous legacy.  Frazetta Fridays w/Frazetta Girls, hosted by Sara Frazetta, is a show dedicated to providing an intimate look into the master's life and career. \n\n",
        "language": "en",
        "author_name": "Frazetta Fridays w/Frazetta Girls",
        "slug": "frazettagirls",
        "cover": "20221111_051140_db5b2674e2ad602a4b2a373fdceac5d0.jpg"
    },
    {
        "podcast_id": 167811,
        "title": "The Aquarium Everything Podcast",
        "description": "The Aquarium Everything Podcast, hosted by Jeff Senske of Aquarium Design Group, covers every aspect the aquarium design, hobby and industry. Guests from every category and angle of both fresh and saltwater as well as the movers and shakers of the aquarium industry will bring insight and understanding, entertainment and enrichment to everyone who loves aquariums.",
        "language": "en",
        "author_name": "Jeffrey Senske",
        "slug": "aquariumeverythingpodcast",
        "cover": "20221117_041140_00b2010bff31d54b476a08feb4d6f21f.jpg"
    },
    {
        "podcast_id": 167969,
        "title": "Blank Radio",
        "description": "Blank Radio is your podcast into the minds of NFT icons and artists. We interview NFT artists, collectors, builders, and genuine degens within the forever expanding NFT space. Our podcast is hosted by Metalogist, the founder of Blank Studio. ",
        "language": "en",
        "author_name": "Metalogist",
        "slug": "bs-podcast",
        "cover": "20221118_021151_6703702b294d1b080e7ec1b10a0cc155.jpg"
    },
    {
        "podcast_id": 168358,
        "title": "Pomo d’oro",
        "description": "Mentre i musei sono sempre più esposti ai pericoli di danneggiamento da parte degli attivisti ambientali, esploriamo il mondo con Pomo d’oro, una rassegna che attraverso le opere d’arte, spiega i principali temi di attualità e i cambiamenti ambientali che minacciano la nostra terra. Notizie scelte e raccontate ogni martedì, giovedì e sabato da Ludovica Imparato.\nSeguici su Instagram con @pomodoro_pod",
        "language": "it",
        "author_name": "Pomo d’oro",
        "slug": "pomodoro",
        "cover": "20221116_121106_957d325630aa037620e50b882e05e419.jpg"
    },
    {
        "podcast_id": 168459,
        "title": "The Movie Rubric",
        "description": "Many critics assign numbered scores to movies, but very few use a universal system across the board that the audience themselves can use. Here on The Movie Rubric, we narrowed down the 5 most important categories to a films success, and made a grading rubric that we will use to score each movie, much like a teacher would grade a paper, to make sure we give each movie a fair shake, and the same criteria. \n\nJoin us as we do our best to sound smart, and try even harder to not sound stupid, and review some of the best and worst movies coming out today! ",
        "language": "en",
        "author_name": "The Movie Rubric",
        "slug": "themovierubric",
        "cover": "20221116_071106_dc768e883e5d76d1fbfad8af8a89f7e8.jpg"
    },
    {
        "podcast_id": 169079,
        "title": "Arte Contemporáneo | #SENDATalks",
        "description": "Arte Contemporáneo | #SENDATalks por Galeria SENDA presenta:\nExposiciones, encuentros entre artistas, charlas, experiencias de galeristas y coleccionistas, y mucho más... ",
        "language": "es",
        "author_name": "Galeria SENDA",
        "slug": "sendatalks",
        "cover": "20221119_121124_82d3c73f947e9947f26ecec38d5bf8ac.jpg"
    },
    {
        "podcast_id": 169310,
        "title": "EOTB (Beauty Is in The)",
        "description": "This is for the fun of entertainment, art, and discussions for those that may have the same situations. It is an imperfect podcast with very little edits and is a real as it can get. \n\nThis podcast will be to have a mental release for myself and for those willing to follow along on the ride. Sometimes there will be harsh language... there is your warning. ",
        "language": "en",
        "author_name": "Tony Deamer",
        "slug": "eotb",
        "cover": "20221121_011148_3b7e23b37513d92e0bfa167596669098.jpg"
    },
    {
        "podcast_id": 169489,
        "title": "Working Title",
        "description": "Working Title is a podcast hosted by Isha Jorgensen, a Cambridge film studies student, and Victoria Cerrada, a spanish actress and writer.\n\nThis is just like going for drinks after the cinema to talk about what you just saw with your friends.\n\nEvery two weeks, they dive into a film topic through specific examples.",
        "language": "en",
        "author_name": "Victoria Cerrada and Isha Jorgensen",
        "slug": "theworkingtitle",
        "cover": "20221121_101138_02ae94ac62aa5a4a498fbe339484e404.jpg"
    },
    {
        "podcast_id": 169548,
        "title": "Integrated OKC",
        "description": "An artist and a lifestyle  podcast connecting creative minds of music and art producing work in Oklahoma.\nIf you don't know, now you know. ",
        "language": "en",
        "author_name": "Wesley Luster",
        "slug": "integratedokc",
        "cover": "20221121_051104_8ffbaf00c9ed50acf26247bae623cf60.jpg"
    },
    {
        "podcast_id": 170295,
        "title": "EPISODE 23 LINK IN BIO",
        "description": "Hello and welcome to EPISODE 23 LINK IN BIO , the show that showcases Vegas culture, creatives and small businesses.",
        "language": "en",
        "author_name": "Kevin  Searcy",
        "slug": "searcyproductions",
        "cover": "20221125_121126_52135e6bf3fc9eeebaf1fa351d06f275.jpg"
    },
    {
        "podcast_id": 173010,
        "title": "How to Build Your Own Dreams Podcast",
        "description": "What does it mean to you to build your own dreams? Let us know in the comments ☁️✨  \nSubscribe to our channel: https://www.youtube.com/channel/UCIHv...   \nShop to support therapy for creatives: https://www.ShopBYOD.com \nFollow Us: https://ffm.bio/justbyod \nAbout Build Your Own Dreams: Build Your Own Dreams is a Creative Agency and Lifestyle Brand founded in 2020 by founders Erinn Knight (@theerinnaffect) and Brandon Boone (@iambboone). Their separate dreams brought them together for a common goal of empowering creatives to build their own dreams through ownership.   We are passionate about equipping creatives with the knowledge and resources to leverage their careers beyond the music industry.   We are the creative agency of the new age, specializing in Label Services, Digital Marketing, Brand Management, and Experiential Events. We exist to push the culture forward!",
        "language": "en",
        "author_name": "Build Your Own Dreams",
        "slug": "byodpodcast",
        "cover": "20221207_041239_53fa32a898a2f1556127c57d398d2abe.jpg"
    },
    {
        "podcast_id": 173844,
        "title": "Imposter Syndrome Podcast",
        "description": "Welcome to The Imposter Syndrome podcast, where we discuss the grind of the growing creator.",
        "language": "en",
        "author_name": "Quay Jones",
        "slug": "theimpostersyndrome",
        "cover": "20221211_081200_f27bb674b7c6d76c82cb32384c483d93.jpg"
    },
    {
        "podcast_id": 174250,
        "title": "The ARTIST: Incontri con i maestri dell'Arte Neo-Contemporanea",
        "description": "In questi podcast parleremo con artisti del nostro secolo, del loro operato e di cosa vuol dire essere un'artista nel 21esimo secolo. ",
        "language": "it",
        "author_name": "DYOS PROJ",
        "slug": "dyos-proj",
        "cover": "20221213_081238_cd6c96d9bac73fdbc3738ff902f8a888.jpg"
    },
    {
        "podcast_id": 174641,
        "title": "The Dankness",
        "description": "Putting cryptocreators at the front and center of the conversation, THE DANKNESS introduces new audiences to the artists and collectors behind some of the most beloved CryptoArt creations. \n\nHosted by Jason Bailey and Dan Sickles, each episode of THE DANKNESS showcases the stories from this emerging movement from the perspectives of the people who know it best.\n\nFollowing the release of each episode, a DANKTONE will be available to mint for free on the Ethereum blockchain at Async.art. Each DANKTONE is crafted with love by Stella and FFFFLOOD. \n\nNO HYPE, NO FROTH, \nJUST DANKNESS.\n\nLearn more at thedankness.xyz",
        "language": "en",
        "author_name": "dpop Studios",
        "slug": "thedankness",
        "cover": "20230104_020142_598e3547b8cad95c72b476d6b682eba9.jpg"
    },
    {
        "podcast_id": 175258,
        "title": "T1me:Capsule",
        "description": "T1me:Capsule to nasza własna kapsuła czasu, nasz róg obfitości i nasza puszka Pandory. Zapraszamy Was, byście razem z nami do niej zaglądali i odkrywali gry, komiksy i filmy, które przyczyniły się do tego, kim jesteśmy i jak widzimy świat",
        "language": "pl",
        "author_name": "T1me Capsule Crew",
        "slug": "t1mecapsule",
        "cover": "20221219_121251_120de4cb83d6fd0363fd1ed2dd0a6e72.jpg"
    },
    {
        "podcast_id": 176740,
        "title": "Not Sorry Art Podcast",
        "description": "A new podcast about art and creativity from artist and creator Sari Shryack, founder of Not Sorry Art and Not Sorry Art School.",
        "language": "en",
        "author_name": "Sari Shryack",
        "slug": "notsorryart",
        "cover": "20221228_081237_25953634ff1d9da9903573c204d2a7af.jpg"
    },
    {
        "podcast_id": 176953,
        "title": "Cinematic Pulse Podcast",
        "description": "<p>A commentary, critique, and recreational analysis of all things entertainment media — your guide to what you watch.</p>",
        "language": "en",
        "author_name": "Audrey Graham and Sharee Jackson",
        "slug": "cinematicpulsepodcast",
        "cover": "20221229_061208_b176e8f6156cc950692fb937ff35fdd3.jpg"
    },
    {
        "podcast_id": 176994,
        "title": "Web 3 Artist Spotlight",
        "description": "<p>This is a weekly podcast where I interview and highlight the amazing work of web 3 artists (i.e., artists that create and sell their artwork on blockchains such as Ethereum, Polygon and Tezos). The purpose of the podcast is to enable people to discover and/or learn more about web 3 artists, their journey, art, process and inspiration. In doing so, artists may expand their audiences and listeners may feel inspired to start creating and minting art of their own. Every episode is recorded via a live Twitter Space where attendees have an opportunity to ask the guest artist questions. This is a very inclusive space welcoming artists of all nationalities, backgrounds and artistic styles. Whether they have a huge following or are just starting their career, all are welcome. The show celebrates how art and creativity can bring us all together.</p><p><strong>RSSVERIFY</strong></p>",
        "language": "en",
        "author_name": "Jancarlo Sanchez",
        "slug": "web3artistspotlight",
        "cover": "20230105_100123_38f923325c2f25b7260b06d942340806.jpg"
    },
    {
        "podcast_id": 177362,
        "title": "It All StARTed When...",
        "description": "Welcome to 'It All StARTed When...' We will hear from young creatives making their way through the industry, maybe not always in the most traditional ways. We will talk with individuals in a range of careers from film to fashion to music to photography. Let’s learn about their beginnings, joys, challenges, path, and inspirations.",
        "language": "en",
        "author_name": "Taryn Snyder ",
        "slug": "itallstartedwhen",
        "cover": "20230103_110149_038cc1d442d28ec0410e26a027c7247b.jpg"
    },
    {
        "podcast_id": 178927,
        "title": "Rebels and Robots",
        "description": "Rach and Cam have turned their weekly Star Wars/Transformers night into a weekly chat about the galaxy far, far away and the robots in disguise. We will be discussing the new weekly Star Wars streaming episodes when they come out and supplement the gaps between shows with miscellaneous topics related to both franchises. \nMusic by Caleb Jacobi.",
        "language": "en",
        "author_name": "Rachel and Cameron",
        "slug": "rebelsandrobots",
        "cover": "20230202_040236_ea0d00206bb4a4f79dd697ca7cb91d2a.jpg"
    },
    {
        "podcast_id": 179941,
        "title": "Localmotive",
        "description": "LOCAL ART AND CULTURE IN OPEN CONVERSATION ",
        "language": "en",
        "author_name": "Bianca Velasquez & Parker Mortensen",
        "slug": "localmotivepodcast",
        "cover": "20230112_120137_9e7aa4303c1433cbd62e380a4697cf6a.jpg"
    },
    {
        "podcast_id": 181013,
        "title": "Fackindo y Flamindo",
        "description": "También conocidos como @fackinsaul y @flamiis_ Estaremos dando la brasa !!\nPodcast de dibujo y otras movidas.\n",
        "language": "es",
        "author_name": "saul serrano ",
        "slug": "fackindoyflamindo",
        "cover": "20230116_030103_60c08807497ae675def18f960b7e340a.jpg"
    },
    {
        "podcast_id": 181248,
        "title": "Viatge a Júpiter",
        "description": "<p>El pòdcast de la Filmoteca de Catalunya.</p>",
        "language": "ca-es",
        "author_name": "Filmoteca de Catalunya",
        "slug": "filmotecacat",
        "cover": "20230119_030142_30aea83af1369d0cf8b092f8e6dac2f0.jpg"
    },
    {
        "podcast_id": 181285,
        "title": "Sick AF",
        "description": "<p>\"Sick as fuck\"</p><p>A conversation with thr33som3s about art on the blockchain.</p>",
        "language": "en",
        "author_name": "Thr33som3s",
        "slug": "dwtm3",
        "cover": "20230423_110431_f148b64bb0995f6485a3d30d616b6f0f.jpg"
    },
    {
        "podcast_id": 181451,
        "title": "Combo Nice",
        "description": "Podcast de peliculas y un poco mas.",
        "language": "es",
        "author_name": "Pedro Duran & Lazaro del Pino",
        "slug": "combonice",
        "cover": "20230118_120105_e02d39707708d4efcf8f2e62db751b11.jpg"
    },
    {
        "podcast_id": 182083,
        "title": "LedgArt (Wonky Stonks)",
        "description": "The LedgArt Project is an active experiment exploring the vast NFT space. Our purpose is to develop and curate emerging technologies while facilitating the relationship between creators and collectors.\n\n\nThe flagship product, Wonky Stonks, is the first of its kind; a fully generative, financially-inspired NFT collection for investors, traders, and quants alike.\n\n\nJoin the Wonky Stonks community for the weekly, all-things NFTs chat. Tune in live every week on Twitter Spaces. Anyone and everyone are welcome.\n\n\nWebsite: https://www.ledgart.io/\n\nTwitter: https://twitter.com/ledgart_io\n\nOfficial OpenSea link: https://opensea.io/collection/wonky-stonks",
        "language": "en",
        "author_name": "LedgArt",
        "slug": "ledgart",
        "cover": "20230120_110111_031e3a1c7cb8ca4e7908f4b6bf98c912.jpg"
    },
    {
        "podcast_id": 182270,
        "title": "T.R.A.S.H. Podcast",
        "description": "El T.R.A.S.H. podcast es un espacio donde conocerás a diferentes artistas de la comunidad Furry de todas partes del mundo! Sobre todo de habla hispana.\n\nConducido por Allucard, un p!nch3 furro mexicano!\n\nDate la oportunidad de conocer a las personas detrás del arte, ilustraciones o eventos favoritos de la comunida furry. No te pierdas estos podcast's en vivo a travez del canal de Youtube: FurryTrash\n\n",
        "language": "es",
        "author_name": "Furry Trash",
        "slug": "trashpodcast",
        "cover": "20230124_070158_61b4af33bde602259f82f3de00488fb4.jpg"
    },
    {
        "podcast_id": 182396,
        "title": "Crashradio",
        "description": "<p>Hip hop</p>",
        "language": "en",
        "author_name": "BGL, Reggie Reg,Bobby Milk & Man-Mann",
        "slug": "crashradio",
        "cover": "20230124_060129_344ed2e1621e0b80598a2a0183785be5.jpg"
    },
    {
        "podcast_id": 182636,
        "title": "The Abby Normal Podcast",
        "description": "ROC City based Horror Movie Podcast. Our episodes consists of reviews & discussions, games & trivia's and guest host specials talking about all things horror. ",
        "language": "en",
        "author_name": "Alea Jones & Collin Bourne",
        "slug": "abbynormalpodcast",
        "cover": "20230122_040128_3db6257539578de0f39951df98b1dde4.jpg"
    },
    {
        "podcast_id": 183073,
        "title": "CotoRap",
        "description": "Siempre pensamos en conocer a las personas que escuchamos, así que decidimos ponernos a cotorrear con ellos. ¡Cotorrea y ya! ",
        "language": "es",
        "author_name": "Coto Rap",
        "slug": "cotorap",
        "cover": "20230124_020126_308069ec0819ccbde14f0cec5c272d0a.jpg"
    },
    {
        "podcast_id": 184736,
        "title": "Burly Boy Cinema",
        "description": "<p>A unique look at film and the art of cinema brought to you by the resident burly boys Zeke, Aidan, and Aaron.</p>",
        "language": "en",
        "author_name": "Aaron Baker",
        "slug": "bcripod",
        "cover": "20230518_110504_5e5b523ab9ea81dc5145ae8c16ade66a.jpg"
    },
    {
        "podcast_id": 185791,
        "title": "GenARTsis - Unfiltered Contents",
        "description": "GenARTsis is a student project focusing on music and two forms of visual arts (painting and filmmaking).\nIn the podcasts, GenARTsis welcomes fellow art lovers on set to share their thoughts, struggles, and artistic goals.",
        "language": "en",
        "author_name": "GenARTsis",
        "slug": "genartsis",
        "cover": "20230202_010224_1edaad29335513a6c39482847bb608f0.jpg"
    },
    {
        "podcast_id": 186467,
        "title": "Galerie Podcast",
        "description": "Mulan (GoMulan Gallery) en Paul (Enari Gallery) presenteren met veel plezier de Galerie Podcast, waarin deze twee jonge galeriehouders vertellen over de kunstwereld. De podcast heeft een luchtig en toegankelijk karakter met veel interessante onderwerpen. In de eerste afleveringen bespreken zij de basis van het kopen van kunst zodat het voor nieuwkomers gemakkelijk wordt om zich te navigeren door de galeriewereld: van gebruiken zoals de rode sticker tot het bespreken van de mooiste kunstproza. De afleveringen behandelen het verzamelen van kunst, hoe je te gedragen op een kunstbeurs en een kijkje achter de schermen in de galeriewereld. \n\nHeb jij vragen of tips voor onze podcast? Laat het ons vooral weten via info@galeriepodcast.nl ",
        "language": "nl",
        "author_name": "Paul van Gemen & Mulan Go",
        "slug": "galeriepodcast",
        "cover": "20230204_120222_dddee258e525b8a533d0ff84b50a6e43.jpg"
    },
    {
        "podcast_id": 186605,
        "title": "Worship Production Podcast",
        "description": "<p>Our goal is to further our understanding of the world of worship and production and the culture behind it and to entertain and help you understand as well!</p>",
        "language": "en",
        "author_name": "Tanner Patchett & Quinn Crossley",
        "slug": "worshipproductionpodcast",
        "cover": "20230818_070821_9a497a7f01bed1decdcf85861437a7be.jpg"
    },
    {
        "podcast_id": 187992,
        "title": "The Rising Arts Agency Podcast",
        "description": "Hello and welcome to The Rising Arts Agency Podcast, exploring how we use our radical imaginations to create meaningful social change in the arts and cultural sector. \n\nYOUNG PEOPLE ARE LEADERS NOW (not in the future).\n\nWe are Rising Arts Agency, a genuinely youth-led social enterprise based in Bristol. We support the city’s underrepresented young people (18-30) to fulfil their creative ambitions and mobilise to affect radical social change through the arts. We are anti-establishment, fiercely independent and co-created with and for young people. \n\nThings need to change. The cultural and creative sectors are not fit-for-purpose. As our unique ways of working, thinking and facilitating become more recognised, we work both locally and nationally advocating for radical sector and cultural change through activist campaigns, research, consultation, care and our creative agency services. This podcast is our gift to you. \n\nWe hope you find a home here. Connect with us: \n\nhello@rising.org.uk &gt; join our mailing list\n@RisingArtsAgency (instagram) \n@RisingArtAgency (twitter)\n",
        "language": "en",
        "author_name": "Rising Arts Agency ",
        "slug": "risingartsagency",
        "cover": "20230209_100217_1eb5f15f2fd2727d336181ba65a37a51.jpg"
    },
    {
        "podcast_id": 188109,
        "title": "Tarik Talk",
        "description": "<p>Brazilian artist, Tarik Mendes hosts Tarik Talk, a podcast committed to the art world. Listen in to unique interviews with talented guests artists, dealers, curators and more. At times with other talented guests from the music, acting, journalism industries. Find out the magic of art and it’s way of connecting us all! Check out @tariktalk for images of the guests and their works from each episode. Also follow @tarikmendes for his latest adventures!</p>",
        "language": "en",
        "author_name": "Tarik Mendes",
        "slug": "tariktalk",
        "cover": "20230724_080758_68ec4a21e2f765fabfea9ff30ecd80de.jpg"
    },
    {
        "podcast_id": 189167,
        "title": "Mimi",
        "description": "<p>A safe space for creativity - The Mimi Podcast brings you fun, exciting, enlightening conversations with modern artists, makers, illustrators, designers and more. Hosted by Melanie Johnsson, we hope Mimi brings you joy, comfort and inspiration to follow your wildest creative dreams!</p>",
        "language": "en",
        "author_name": "Melanie Johnsson",
        "slug": "mimiforcreativespodcast",
        "cover": "20230213_040235_07879fbe64f95a3533bc0d73e4fe921d.jpg"
    },
    {
        "podcast_id": 189755,
        "title": "All Art an Other Things. ",
        "description": "<p>Hello my name is Dylan I am a pipe maker from New England this is my podcast.  If you enjoy smoking, drinking, an all types of ill shit along with a few other things you should enjoy this podcast. </p>",
        "language": "en",
        "author_name": "Dylan Bailey",
        "slug": "allartanotherthings",
        "cover": "20230215_060225_e8c4e198782781d1f7de77109c72d7aa.jpg"
    },
    {
        "podcast_id": 191389,
        "title": "Paréntesis de Olvido",
        "description": "<p>El Paréntesis de olvido es un término mágico, que consiste en establecer una distancia temporal (y a veces espacial) entre el momento de la trampa y el de la revelación del efecto. Y de eso va esto, de olvidar los problemas del día a día para pasar un rato divertido. Como dijo aquella canción, “mientras la gente cuerda ríe y llora, a los locos nos verán bailando”, y eso somos, dos locos con ganas de disfrutar contando nuestras mas extrañas historias.</p><p>Bienvenidos a Paréntesis de olvido, un podcast creado por Patricia Ferrero y Jaime Copoví, donde nada es lo que parece y todo es falso, hasta que se demuestre lo contrario.</p>",
        "language": "es-mx",
        "author_name": "Patricia Ferrero y Jaime Copoví",
        "slug": "parentesisdeolvido",
        "cover": "20230221_090218_d8115e2636843da1ad3152f45559b945.jpg"
    },
    {
        "podcast_id": 191899,
        "title": "Tha Juice ",
        "description": "<p>Welcome to Tha Juice where we showcase DFW'S top artists, creators, and collaborators! Tune in to learn more about what they do and why they create. Become inspired by inspired people! You might just also discover your new favorite artist. It gets deep and very juicy! 🧃🧃🧃</p>",
        "language": "en",
        "author_name": "Iris Cordova and Dennis Lopez ",
        "slug": "thajuice",
        "cover": "20230411_030424_eafb6f49b0466ba6082cdb33a315d75b.jpg"
    },
    {
        "podcast_id": 191901,
        "title": "Hollywood Half Hour ",
        "description": "<p>An open discussion about all things related to movies. Movies we loved growing up, how the world of cinema came to be and has evolved. Some behind the scenes secrets.</p>",
        "language": "en",
        "author_name": "Andrew Jacob",
        "slug": "hollwoodhalfhour",
        "cover": "20230223_050206_e7621c4a97ad3c17aba474ec0a399644.jpg"
    },
    {
        "podcast_id": 192758,
        "title": "Angel Study Club",
        "description": "<p>Angels getting cultured</p>",
        "language": "en",
        "author_name": "Siege Sissy",
        "slug": "angelstudyclub",
        "cover": "20230227_030259_66a41773b05f0997e1d7d78ea6191560.jpg"
    },
    {
        "podcast_id": 192809,
        "title": "History of Animation",
        "description": "<p>This is a podcast about the amazing history of the animation medium.  We will look at the people, technology, and characters that have shaped animation till now.  So if you love animation or history please join us on this inspiring look through the past.</p>",
        "language": "en",
        "author_name": "Chelsea Thomas",
        "slug": "historyofanimation",
        "cover": "20230227_060250_5d78d7d8e79916db92aac360bb748881.jpg"
    },
    {
        "podcast_id": 194054,
        "title": "Podcast „Na Zachętę”",
        "description": "<p>W podcaście „<em>Na Zachętę</em>” odkryjemy najbardziej fascynujące miejsca Narodowej Galerii Sztuki w Warszawie, nie zapominając o tym, co w części wystawowej ma do zaoferowania Zachęta. Przed nami spotkania z artystami i artystkami oraz ich dziełami. „<em>Na Zachętę</em>” zaprasza dziennikarka Gosia Jakubowska. Nowe odcinki co dwa tygodnie w czwartki na Spotify!</p>",
        "language": "pl",
        "author_name": "Zachęta — Narodowa Galeria Sztuki",
        "slug": "zachetangs",
        "cover": "20230324_070301_5578c7dab688915ef3c228f43cfe1533.jpg"
    },
    {
        "podcast_id": 195651,
        "title": "senza peso",
        "description": "<p>Un podcast originale by <a href=\"https://www.notitlegallery.org\"><strong>No Title Gallery</strong></a>. </p><p>In ogni puntata verranno intervistati gli artisti a poche ore dall'inaugurazione della mostra. Capiremo assieme a loro quale sia <strong>il fuoco che li spinge a fare arte</strong> e cosa risieda alla <strong>base della loro creatività</strong>. Una chiacchierata informale tra riflessioni e ispirazioni. In totale libertà e, rigorosamente, senza peso.</p>",
        "language": "it",
        "author_name": "Francesco Liggieri e Riccardo Fano",
        "slug": "senzapeso",
        "cover": "20230309_090334_43565a1d1e48a4046ff16d2bf07e06c6.jpg"
    },
    {
        "podcast_id": 195792,
        "title": "YIC Podcast ",
        "description": "<p>YIC is a group of artist coming together to talk about art</p>",
        "language": "en",
        "author_name": "YIC PODCAST",
        "slug": "yicpodcast",
        "cover": "20230309_110312_28315e867186bd41d7b3c2326f836fe0.jpg"
    },
    {
        "podcast_id": 195926,
        "title": "Your Forever Stories",
        "description": "<p>Your Forever Stories is dé groeiplek voor bruidsfotografen. In deze podcast voer ik interessante en gezellige gesprekken met collega’s uit de trouwindustrie, deel ik mijn ervaringen als fotograaf én hoop ik je inspireren om jouw droom achter na te gaan. Met onderwerpen als fotografie, strategie, mindset en manifestatie.</p><p>Je kunt ons vinden op Instagram onder <a href=\"https://www.instagram.com/yourforeverstories/\">https://www.instagram.com/yourforeverstories/</a> en via onze website <a href=\"http://www.yourforeverstories.com\">www.yourforeverstories.com</a> </p>",
        "language": "nl",
        "author_name": "Your Forever Stories",
        "slug": "yourforeverstories",
        "cover": "20230310_020344_ad15e6180481ae5ee04247a9b8f00846.jpg"
    },
    {
        "podcast_id": 196571,
        "title": "DADAH Podcast",
        "description": "<p>Dadah Podcast is a podcast produced by the Department of Art, Design, and Art History at Webster University. In this podcast, we talk to DADAH faculty and instructors, designers, and artists. The topics are centered around art, design, technology, and any other fields that can be integrated into art and design and increase the student's knowledge. </p>",
        "language": "en",
        "author_name": "DADAH",
        "slug": "dadahpodcast",
        "cover": "20230313_050359_0987b7d57d3c0e75d069ed5a55c078b6.jpg"
    },
    {
        "podcast_id": 197102,
        "title": "The Multiverse Podcast",
        "description": "<p>The Multiverse podcast is put on by Sunny &amp; Vick who<strong> </strong>share their life experiences and unique perspectives to empower others to take action on bettering their well being.</p><p>Instagram: @themultiversepod</p><p>Youtube: @themultiversepodcast</p><p>TikTok: @themultiversepodcast</p><p>Discord: @themultiversepodcast</p>",
        "language": "en",
        "author_name": "Sunny & Vick",
        "slug": "themultiversepodcast",
        "cover": "20230315_050330_cbc1cd0b812d9b1f22bea61f15413761.jpg"
    },
    {
        "podcast_id": 197317,
        "title": "CRISIS EN LA MUSICA",
        "description": "<p>¿alguna vez has escuchado una canción o a un artistas y has dicho \"ok, esto va a triunfar\"? Si es así este es tu programa</p>",
        "language": "es",
        "author_name": "CRISIS",
        "slug": "crisisenlamusica",
        "cover": "20230325_080328_93cb57bdc27c86d7e6877aa613639363.jpg"
    },
    {
        "podcast_id": 197617,
        "title": "The Good Oil",
        "description": "<p>The Good Oil is dedicated to long form conversations with Aotearoa / New Zealand painters about their lives and practices.</p>",
        "language": "en",
        "author_name": "Graeme Douglas",
        "slug": "thegoodoil",
        "cover": "20230320_090312_d0ffca87060d41040aba2e90e593af9c.jpg"
    },
    {
        "podcast_id": 199117,
        "title": "M(other) Artist Podcast",
        "description": "<p>The M(other) Artist Podcast is a collaboration between Megan Hosmer, Claire Drummond and Rena Thomas. The term \"m(others)\" encompasses both \"mothers\" and \"others,\" including gender non-conforming and queer folks, who see themselves engaged in nurturing and sustaining life. In this podcast, we interview Kjipuktuk Halifax-based visual artists who are also primary caregivers about their experiences navigating parenting and the art world. We discuss the ways in which their art practices have been impacted by parenthood, navigating how care work can be both an exceedingly disruptive force as well as a profound emotional experience that can expand our conceptions of art-making, interdependency and existence.</p><p>Cover art by David Drummond</p>",
        "language": "en",
        "author_name": "M(other) Artist Podcast",
        "slug": "motherartistpodcast",
        "cover": "20230328_020325_dd4a498ffe7ab907453cc87e61a70f38.jpg"
    },
    {
        "podcast_id": 199494,
        "title": "Politicians",
        "description": "<p>When see what is happening, I shout, I wonder why</p>",
        "language": "en",
        "author_name": "Zzlastnumber",
        "slug": "pmachineprodction",
        "cover": "20230326_060311_9b26caad3c71253a5d0b1c92faf322e3.jpg"
    },
    {
        "podcast_id": 199931,
        "title": "Lens & Light",
        "description": "<p>Welcome to Lens &amp; Light, the podcast that invites photographers from diverse backgrounds to share their adventures and experiences. Your host, Amber Braxton, a fine art photographer, is excited to bring you valuable tips, tricks, and recommendations to help you take your photography skills to the next level. From hilarious moments to insightful conversations, join us as we explore the exciting world of photography together. So, sit back, relax, and let's dive into the fascinating world of photography.</p>",
        "language": "en",
        "author_name": "Amber Braxton",
        "slug": "lensndlight",
        "cover": "20230329_120304_25162394b270a3f24d6832cab6cee584.jpg"
    },
    {
        "podcast_id": 201023,
        "title": "The Land Behind: Conversations on Photography, Perception and Place",
        "description": "<p>Join photographer Peter Holliday in conversation with a range of guests including photographers, musicians and anthropologists as he explores questions of photography, perception and place.</p><p>Join the conversation on Patreon: <a href=\"https://www.patreon.com/thelandbehind\">https://www.patreon.com/thelandbehind</a></p>",
        "language": "en",
        "author_name": "Peter Holliday",
        "slug": "the-land-behind",
        "cover": "20230731_090700_494633b0bf281d14753ef22a9dae155f.jpg"
    },
    {
        "podcast_id": 201066,
        "title": "Prospero's Pit",
        "description": "<p>We are an 25 year old independent bookstore on 39th Street in Kansas City. We have a few thoughts we would like to share.</p>",
        "language": "en",
        "author_name": "Danny Mac",
        "slug": "prosperospit",
        "cover": "20230403_060429_7cf039a1d70f2540244750f2602985f1.jpg"
    },
    {
        "podcast_id": 201805,
        "title": "Marly Ramone's Mad, Mad House of the Dead",
        "description": "<p>This podcast is designed to talk about the artwork of Ryan Marlatt, a local, Rochester, NY artist; piece by piece, through the years and what’s behind each one. We’ll talk about influences and inspirations, periods in life and experiences. Some emotions just can’t be harnessed, so to help manifest them into something healthy was to put them down on canvas (or other media). Tune in each week to hear stories regarding the artistic process and full details from the artist himself.</p><p>Opening Theme</p><p>Music from #Uppbeat (free for Creators!):</p><p><a href=\"https://uppbeat.io/t/pecan-pie/pumpkin-hollow\">https://uppbeat.io/t/pecan-pie/pumpkin-hollow</a></p><p>License code: MKJM3UYKDTMG45CQ</p><p>Closing Theme</p><p>Music from #Uppbeat (free for Creators!):</p><p><a href=\"https://uppbeat.io/t/pecan-pie/halloween-time\">https://uppbeat.io/t/pecan-pie/halloween-time</a></p><p>License code: TCAQVFGKCKGUQF02</p>",
        "language": "en",
        "author_name": "Ryan G. Marlatt",
        "slug": "marly-ramones-mad-mad-house-of-the-dead",
        "cover": "20230407_120400_d3fe1958864abefbfd4549b54b0192f6.jpg"
    },
    {
        "podcast_id": 202402,
        "title": "The Robertson Stash ",
        "description": "<p>The Robertson Stash is a podcast about life and the pursuit of glass, hosted by counter-culture legend Matt Robertson and his cohost Sean Calahan. Matt Robertson is an award-winning borosilicate glass artist best known for his range of safari animal designs. The Robertson Stash is a space that houses unique conversations between artists and creators in the industry.</p>",
        "language": "en",
        "author_name": "The Robertson Stash ",
        "slug": "robertsonstash",
        "cover": "20230410_060459_088e7fe47a58de8ce45381d2542c5c2e.jpg"
    },
    {
        "podcast_id": 203378,
        "title": "Snapshot",
        "description": "<p>We speak to people who have dedicated their life to taking or thinking of photos.</p>",
        "language": "en",
        "author_name": "Cambridge Chronicles",
        "slug": "letstalkphotography",
        "cover": "20230415_090413_40c42016e70ad1dfde7bdba3a9994fd0.jpg"
    },
    {
        "podcast_id": 203406,
        "title": "Кастинг Толк",
        "description": "<p>Гильдия кастинг-директоров и звукостудия Vox records представляют:</p><ul><li><p>Кто такой кастинг-директор?</p></li><li><p>Почему практически никто из кастинг-директоров не имеет кинемотографического образования?</p></li><li><p>Где кастинг-директора ищут новых будущих кинозвезд?</p></li><li><p>Как сделать идеальный актерский ансамбль, который соберёт большую кассу?</p><p>Российский кинематограф делает новый огромный виток, ведь профессия кастинг-директора – уже не равно ассистент режиссера по актерам. В наших подкастах вы услышите реальные истории о том, как живут и работают люди, отвечающие за героев наших любимых фильмов и сериалов.</p></li></ul>",
        "language": "ru",
        "author_name": "Маргарита Ленских",
        "slug": "castingtalk",
        "cover": "20230415_040440_52c1a4b17d5e2b50fa2f915f1d96739e.jpg"
    },
    {
        "podcast_id": 203921,
        "title": "COM1C COUS1NS",
        "description": "<p>Com1c Cous1ns to podcast, w którym skupiamy się tylko, i aż, na komiksie.</p>",
        "language": "pl",
        "author_name": "Marcin Wilczek i Rafał Gralinski",
        "slug": "com1c-cous1ns",
        "cover": "20230418_080444_32b48611189d5bd3afb6c57483a9b518.jpg"
    },
    {
        "podcast_id": 204114,
        "title": "Magyar EXPO sikerek",
        "description": "<p>A Magyar Nemzeti Múzeum időszaki kiállítása, a Magyar EXPO sikerek (1851-2021) - A nemzeti identitás kultúrtörténete 170 év 32 világkiállítását, illetve az azokon résztvevő magyarok sikereit mutatja be.</p><p>Ragadjanak útlevelet és tartsanak velünk e majdnem két évszázados, kontinenseket átívelő utazáson!</p>",
        "language": "hu",
        "author_name": "Magyar Nemzeti Múzeum",
        "slug": "magyarexposikerek",
        "cover": "20230420_120453_ddebf2f7b368530bb9e5c341e9872150.jpg"
    },
    {
        "podcast_id": 204387,
        "title": "Hungarian EXPO Successes",
        "description": "<p>The temporary exhibition of the Hungarian National Museum, Hungarian EXPO successes (1852-2021) - The cultural history of national identity presents 170 years of 32 world exhibitions and the successes of the Hungarians who participated in them.</p><p>Grab a passport and join us on this almost two-century long, cross-continental journey!</p>",
        "language": "en",
        "author_name": "Hungarian National Museum",
        "slug": "hungarianexposuccesses",
        "cover": "20230420_120413_5d47e6c91080ac1d9adb734b89ae6736.jpg"
    },
    {
        "podcast_id": 204699,
        "title": "IN with LINDA DANO",
        "description": "<p>Interviews with people from Daytime, Fashion &amp; The Arts and just talking about everyday life.. Tune IN with Linda Dano!</p>",
        "language": "en",
        "author_name": "Linda Dano",
        "slug": "lindadano",
        "cover": "20230421_090459_f15a3c2afa4311a02cfa0bdde57ab148.jpg"
    },
    {
        "podcast_id": 205115,
        "title": "ProducHER Podcast",
        "description": "<p> Welcome to the ProducHER podcast, where we shine a spotlight on the talented women behind the camera. We'll dive deep into each creator’s process and hear about their challenges and successes to hopefully gain some advice and insight into the industry. </p><p>If you're an experienced video producer yourself or just a fan of great visual content, this podcast is for you. Join us as we celebrate the incredible talent and contributions of women in the video production world.</p>",
        "language": "en",
        "author_name": "Hunter Meredith",
        "slug": "producherpodcast",
        "cover": "20230424_050410_7b9d1bafab28f419b98d67f7419739b7.jpg"
    },
    {
        "podcast_id": 206272,
        "title": "FORMAE MENTIS - un'esposizione di arte inclusiva",
        "description": "<p><a href=\"https://www.lensart.it\">LENSart</a></p><p>Ascolta le <strong><em>podguides</em></strong> dell'esposizione!</p><p>FORMAE MENTIS</p><p></p><p>Uno stimolo per osservare l’arte, e il mondo in generale, con <em>formae mentis</em>, per l’appunto, diverse e per alcuni aspetti atipiche.</p><p>In entrambe le città l’esposizione è ospitata in due luoghi particolarmente simbolici per la crescita collettiva della comunità:</p><p>– il Salone del Palazzo dei Trecento di Treviso, edificio storico del XII secolo dove tutt’oggi si riunisce il Consiglio Comunale;</p><p>– la Biblioteca Civica di Verona, sede custode della cultura per antonomasia, due luoghi, di sapere, di incontro, di confronto e di crescita della vita cittadina.</p><p>Entrambe le esposizioni vogliono essere un punto di riferimento per una rivendicazione di diritti fondamentali della persona, perché non vengano giudicate ed etichettate in base al genere alla conformità verso dei paradigmi sociali.</p>",
        "language": "it",
        "author_name": "LENSart",
        "slug": "lensartproject",
        "cover": "20230502_080543_9a51a8f1edb462198f36b840cb45908f.jpg"
    },
    {
        "podcast_id": 206343,
        "title": "Did you enjoy your visit?",
        "description": "<p><strong>Whether you realize it or not, history is up for interpretation. Museums have the power to relay history through cultural heritage and creative expression. </strong></p><p><strong>At the end of the day, we trust museums to educate us on arts, culture, and history. But have you ever left a museum uneasy? Let’s talk about why...</strong></p><p><em>Disclaimer: The opinions expressed on this podcast are those of us and our guest as individuals. The claims and statements do not reflect the opinions or views of the Florida State University Department of Art History or FSU as a whole.</em></p>",
        "language": "en",
        "author_name": "Francesca Kern and Olivia Hackney",
        "slug": "didyouenjoyyourvisit",
        "cover": "20230429_100430_f93f80adab72d820d42933b139bbd193.jpg"
    },
    {
        "podcast_id": 206896,
        "title": "The Tattooed Mind",
        "description": "<p>Meeting at the intersection of self care and tattooing, the Tattooed Mind with Mike FisherDubois features tattoo artists sharing stories about their intimate struggles and emotions as well as the insights and wisdom they have learned during their lives and careers.</p><p>Follow on instagram <a href=\"https://instagram.com/the.tattooed.mind?igshid=OGQ5ZDc2ODk2ZA==\">https://instagram.com/the.tattooed.mind</a></p><p>Help support the show <a href=\"https://www.buymeacoffee.com/Tattooedmind\">https://www.buymeacoffee.com/Tattooedmind</a></p>",
        "language": "en",
        "author_name": "Mike FisherDubois",
        "slug": "thetattooedmind",
        "cover": "20230502_080550_7fb2c10c4d3289b30c5049dcc5db24e6.jpg"
    },
    {
        "podcast_id": 207328,
        "title": "AC23 - Arts Council of Greater Baton Rouge",
        "description": "<p>23 Minutes of the Baton Rouge Capital Region's Arts and Culture</p>",
        "language": "en",
        "author_name": "Arts Council of Baton Rouge",
        "slug": "artsbr",
        "cover": "20230504_060530_11ebb45a0de07ea13367f1ca88850ab1.jpg"
    },
    {
        "podcast_id": 207664,
        "title": "Comics Over Coffee",
        "description": "<p>Join Brady, Bo, and Joey on their journey through every major modern Marvel event. From 2004 to modern day, the boys are making their way through the most recent essential crossovers in Marvel comics. Who doesn't love a good team-up?!</p><p>Along the way, there will also be plenty of fun tangents, games, challenges, and general nerdy hijinks.</p><p>Read along with us by following the reading order below!</p><p>1. Avengers Disassembled &amp; Secret War</p><p>2. House of M</p><p>3. Civil War</p><p>4. World War Hulk</p><p>5. Secret Invasion</p><p>6. Dark Reign</p><p>7. Siege</p><p>8. Fear Itself</p><p>9. Avengers vs. X-Men</p><p>10. Age of Ultron</p><p>11. Infinity</p><p>12. Original Sin</p><p>13. AXIS</p><p>14. Spider-verse</p><p>15. Secret Wars</p><p>16. Civil War II</p><p>17. Inhumans vs. X-Men</p><p>18. Absolute Carnage</p><p>Want to get in touch with the hosts? Write in to us at <a href=\"mailto:comicsovercoffeepodcast@gmail.com\">comicsovercoffeepodcast@gmail.com</a>, or follow us on <a href=\"https://www.instagram.com/coffeecomicboys/\">Instagram</a> and <a href=\"https://twitter.com/CoffeeComicBoys\">X</a> @coffeecomicboys.</p>",
        "language": "en",
        "author_name": "Comics Over Coffee",
        "slug": "comicsovercoffee",
        "cover": "20230506_040544_f036c4b1bafd2c501959e2dad185bc6d.jpg"
    },
    {
        "podcast_id": 208352,
        "title": "Out of the Frame : Conversations about Photography",
        "description": "<p>A podcast that features conversations about photography, creativity and the world we live in. Photographer Pia Johnson talks to other photographers, curators, academics and researchers about their work, their artistic process, and how they feel about contemporary photography today.</p>",
        "language": "en",
        "author_name": "Pia Johnson",
        "slug": "outoftheframe",
        "cover": "20230516_120540_9562bc22c48f4d47da4d9761db9614c1.jpg"
    },
    {
        "podcast_id": 208931,
        "title": "No One Point Perspective",
        "description": "<p>Sofia has open, unrestricted conversations with other creative people. \"No One Point Perspective\" is all about exploring big ideas by talking them out with people that have widely different experiences to draw from (pun intended).</p><p>Keep up with me on IG <a href=\"https://www.instagram.com/manyspirits__/\">https://www.instagram.com/manyspirits__/</a> and give me feedback!</p><p>Music by Javier Suarez (Jahzzar)</p>",
        "language": "en",
        "author_name": "Sofia Raikow",
        "slug": "nopp",
        "cover": "20230513_050517_42dd0221eb89a2cae066a82b1520a613.jpg"
    },
    {
        "podcast_id": 208970,
        "title": "Cannesversations",
        "description": "<p>Cannesversations is a film podcast in which <a href=\"https://letterboxd.com/liyilaan/\">Eliana</a> and <a href=\"https://letterboxd.com/patrick_fey/\">Patrick</a> (<a href=\"https://twitter.com/PatrickPoetic\">Twitter</a>) deep-dive each episode into one film that has played at some point during the Cannes Film Festival.</p><p>During the festival, we loop you into the most recent discussions from the festival site, giving you a first impression of the variety of films that splash across the Croisette.</p>",
        "language": "en",
        "author_name": "Eliana Resnick and Patrick Fey",
        "slug": "cannesversations",
        "cover": "20230513_120555_996f920421b7fd6d4a7905b523383b8e.jpg"
    },
    {
        "podcast_id": 209162,
        "title": "Retrospection Connection",
        "description": "<p>Welcome to \"Retrospection Connection\", where we’ll re-examine tv and movies from formative times in our lives (adolescence, teen hood, and college years), but from our more mature, critically-inclined perspectives. The show seeks to bridge the gap between our current selves and the \"inner child\" in each of us, drawing from our favorite moments to understand the impact that a particular piece of media had on us and, potentially, so many others.</p>",
        "language": "en",
        "author_name": "Jalen Stevenson",
        "slug": "retrospectionconnection",
        "cover": "20230514_050505_940c7a583a06a285683939ed3d499c48.jpg"
    },
    {
        "podcast_id": 210259,
        "title": "songs that i like",
        "description": "<p>idek</p>",
        "language": "it",
        "author_name": "Itzz_Samu",
        "slug": "baviovio",
        "cover": "20230519_050555_8ad98e2cfb00c8b247ed4621de806f63.jpg"
    },
    {
        "podcast_id": 212103,
        "title": "Decomposing",
        "description": "<p>A weekly show featuring Movie soundtrack and Film Conversation, Hosted by Independent Film Director AD Lane and Film Music Composer Daniel White</p>",
        "language": "en",
        "author_name": "Daniel White",
        "slug": "decomposing",
        "cover": "20230529_060531_e217d3e6555a0a2346b226b7e6b7c198.jpg"
    },
    {
        "podcast_id": 213131,
        "title": "StreamerGenics What's it Like?",
        "description": "<p>Being a streamer helped me connect and meet so many different people a crossed the world and in so many ways. I want others to share their experiences in life with my audience to enlighten those who may not know \"What it's Like.\" Our guests will be people from everyday life and they may tell our listeners things that might give you pause! Or maybe you might even relate! Come join the show and get connected with us at StreamerGenics!</p>",
        "language": "en",
        "author_name": "Alex Parker",
        "slug": "streamergenics",
        "cover": "20230722_060709_87f506003871cf42557a6ca21b97d532.jpg"
    },
    {
        "podcast_id": 214162,
        "title": "Would You Give Me A Stagehand? ",
        "description": "<p>Hello! Welcome to the Would You Give Me A Stagehand? podcast. Join Tobi Pitan, an aspiring filmmaker, as he interviews friends, colleagues, and various professionals in the entertainment industry and asks them how they got there. Some topics covered include how necessary is film school, joining a union, and what is it like to be in a writer's room. The industry is huge, but there's a lot of room. Join him as he asks his guests, how far are you willing to go for a career in the entertainment industry?</p><p>Special thanks to Cash O'Brien(@cash.obrien) for making the theme music.</p><p>socials:</p><p>Instagram: @tobi.pitann</p><p>Website: <a href=\"http://tobipitanfilms.weebly.com\">http://tobipitanfilms.weebly.com</a></p><p>Youtube: <a href=\"https://youtube.com/@tobipitanmakingfilms?si=kv6SUGKvJiwm-t4d\">https://youtube.com/@tobipitanmakingfilms?si=kv6SUGKvJiwm-t4d</a></p>",
        "language": "en",
        "author_name": "Tobi Pitan",
        "slug": "wygmas",
        "cover": "20230609_060633_efee030a3d99b4f7bd662c2bb7e4d8fb.jpg"
    },
    {
        "podcast_id": 216197,
        "title": "Weird Medieval Guys",
        "description": "<p>Leaving no stone unturned in our quest for the weirdest stories, guys, and art from the Middle Ages.</p><p>The Weird Medieval Guys podcast is brought to you by <a href=\"https://twitter.com/olivia__ms\">Olivia</a>, the creator of internet sensation <a href=\"https://twitter.com/WeirdMedieval\">Weird Medieval Guys</a>, and <a href=\"https://twitter.com/aranptappers\">Aran</a>, a historian and fellow weird guy connoisseur.</p>",
        "language": "en",
        "author_name": "Weird Medieval Guys",
        "slug": "weirdmedievalguys",
        "cover": "20230621_040641_bed119044b0b7d7de00d451af68e29c2.jpg"
    },
    {
        "podcast_id": 216517,
        "title": "Steve Sas Schwartz Podcast",
        "description": "<p>The Steve Sas Schwartz Podcast addresses the wide world of contemporary art.</p>",
        "language": "en",
        "author_name": "Steve Sas Schwartz",
        "slug": "stevesasschwartz",
        "cover": "20230623_070612_57eee1781165c8209bfa74408080943b.jpg"
    },
    {
        "podcast_id": 216678,
        "title": "love bites - ld demo",
        "description": "<p>love dive demo by sophia brennan !! og by ive</p>",
        "language": "en",
        "author_name": "IVE",
        "slug": "lovebitesdemo",
        "cover": "20230624_080652_d2cb599a1c31352ad61ccdb25d771444.jpg"
    },
    {
        "podcast_id": 216737,
        "title": "Starving Artist ",
        "description": "<p>This podcast is about the struggles, the misconception and norms about artists.</p>",
        "language": "en",
        "author_name": "venus",
        "slug": "venuscanete",
        "cover": "20230627_090636_8b7cdd38788c809d1f9874812730a776.jpg"
    },
    {
        "podcast_id": 216750,
        "title": "Technology for Teaching",
        "description": "<p>This for project purpose only.</p>",
        "language": "en",
        "author_name": "June Rey L. Alfante",
        "slug": "teachnology-for-teaching-alfante",
        "cover": "20230625_030600_62c849b2f0de6b04de155548f1f0141c.jpg"
    },
    {
        "podcast_id": 217178,
        "title": "Scan Pro Video - Beyond the Frames ",
        "description": "<p>Scan Pro Video bring you the Beyond the Frame's Podcast, hosted by Games Director &amp; Producer, HaZ Dullul &amp; Animator and Producer, Rafi Nizam.</p><p>This series explores the latest in emerging technology, tools and practices across Media Production, featuring Industry renowned guests and experts from around the world.</p>",
        "language": "en",
        "author_name": "Scan Pro Video ",
        "slug": "beyondtheframes",
        "cover": "20230628_010646_ad0392413f72fd504aed55553ae46a9b.jpg"
    },
    {
        "podcast_id": 217216,
        "title": "Unskippable",
        "description": "<p>Discover how visionary founders, marketers, and brand leaders are using video to break through the noise.</p>",
        "language": "en",
        "author_name": "Fondu",
        "slug": "unskippable",
        "cover": "20230628_060639_d1c9f8de81bdc6092c5de68427171162.jpg"
    },
    {
        "podcast_id": 217671,
        "title": "Ruah Podcast",
        "description": "<p>Ruah Podcast is about bringing a word of life to all of the world. Spreading hope and a message of truth and life to the world. Through our podcast we hope you are able to encounter with God and experience real life through HIm.</p><p>Ruah Podcast es un medio que traerá vida al mundo entero con la palabra de Dios. Atravez de este podcast compartiremos la esperanza que trae la Biblia. Esperamos que atravez de este medio tu podrás tener un encuentro sobrenatural con Dios y experimentar la vida verdadera en El.</p>",
        "language": "es",
        "author_name": "Jennifer Barrera, Gloria Alvarez",
        "slug": "ruahpodcast",
        "cover": "20230702_040722_227c590cccf050e63d3de4f4abf3e273.jpg"
    },
    {
        "podcast_id": 217813,
        "title": ":3",
        "description": "<p> </p>",
        "language": "en",
        "author_name": "jun",
        "slug": "joscarl",
        "cover": "20230703_090705_945e675b9845eff88a64b3427b081b17.jpg"
    },
    {
        "podcast_id": 217983,
        "title": "ARTE+",
        "description": "<p>En el podcast de arte plus hablamos de movimientos contemporáneos: desde el impresionismo hasta la actualidad. Hacemos un repaso de la historia del arte y la situación en la que se encuentra el mundo del arte hoy. </p>",
        "language": "es",
        "author_name": "Amaia Tabuenca Lujambio",
        "slug": "arteplus",
        "cover": "20230704_120706_68afaaa98698115ae72a47df4f096b2f.jpg"
    },
    {
        "podcast_id": 218051,
        "title": "Electric Moon Podcast",
        "description": "<p>Arthur Autumn Interviews musicians and artists from around the world.</p>",
        "language": "en",
        "author_name": "Electric Moon",
        "slug": "electricmoon",
        "cover": "20230704_110726_19372ce193424db079355ffe401ed2c7.jpg"
    },
    {
        "podcast_id": 218238,
        "title": "#ETECHISEI",
        "description": "<p>Podcast dei Premi Internazionali Flaiano, condotto e diretto da Gabriella Simoni</p>",
        "language": "it",
        "author_name": "etechisei",
        "slug": "etechisei",
        "cover": "20230706_090747_8ced963b5c0231cbd9552596c0d408f5.jpg"
    },
    {
        "podcast_id": 218706,
        "title": "Late Bloomers",
        "description": "<p>Late Bloomers is a podcast about two 30-somethings and their journey to break into the VFX and CGI industry while maintaining regular 9-5 jobs. Expect discussions about technology like motion capture and rigging, as well as creative disciplines like Motion Design. On top of that will be casual conversations about the future of digital media, forming habits and memes/jokes.</p>",
        "language": "en",
        "author_name": "Alexander Prestrelski & Shane Antrim",
        "slug": "late-bloomers",
        "cover": "20230710_010748_04508fd4e596b411ebedbd738a5f588d.jpg"
    },
    {
        "podcast_id": 218918,
        "title": "Let's talk about life",
        "description": "<p>Welcome to \"Let's Talk About Life,\" the podcast where we dive deep into the complexities, wonders, and challenges of existence. Join host [Host's Name] as we explore love, relationships, self-discovery, career choices, mental well-being, and more. Through insightful conversations with experts, everyday individuals, and sometimes even celebrities, we aim to inspire personal growth and foster a deeper understanding of ourselves and the world. Subscribe now and embark on this remarkable journey of self-reflection and shared human experiences. Let's Talk About Life—because it's best understood together.</p>",
        "language": "en",
        "author_name": "Manuela",
        "slug": "letstalkaboutlifepodcast",
        "cover": "20230711_080718_fba04ed8c276abd494b9226f74d08b46.jpg"
    },
    {
        "podcast_id": 218995,
        "title": "ProArt",
        "description": "<p>- Кто написал картину, вдохновляясь сыром камамбер? И можно ли назвать современное искусство - искусством?</p><p>- Ответы на эти, и многие другие вопросы вы найдете в подкасте PRO искусство “ProArt” </p>",
        "language": "ru",
        "author_name": "Arina",
        "slug": "proart",
        "cover": "20230711_060731_9ddaa215cbe04b05725c8962dfb932d7.jpg"
    },
    {
        "podcast_id": 219504,
        "title": "constant as the stars above",
        "description": "<p>♡</p>",
        "language": "en",
        "author_name": "lenka",
        "slug": "barbielover",
        "cover": "20230714_080743_44fcfdf2a13c82353d2a4ca33ba51cdc.jpg"
    },
    {
        "podcast_id": 219508,
        "title": "Vamos a InspirArte",
        "description": "<p>El Arte es para todos. En este Podcast queremos compartir nuestra pasión y conocimiento para que disfrutes del Arte tanto como nosotras. Esperamos que al escucharnos puedas apreciarlo con una nueva perspectiva más amena y quieras seguir ampliando tu gusto por el Arte. Vamos a InspirArte, el Podcast donde conocerás de artistas, técnicas, museos, exposiciones, historia y en general todo lo relacionado con el arte de una manera divertida.</p><p>Nos puedes contactar en Instagram: vamosainspirarte, TikTok: @vamosainspirarte y puedes enviar tus comentarios o sugerencias al correo: <a href=\"mailto:vamosainspirarte@gmail.com\">vamosainspirarte@gmail.com</a></p><p>#técnicas #museos #arte #pintura #escultura #historiadelarte ##exposicionesde arte #vamosainspirarte #historiadelarte #veronica_fernandez_esp #vivianamartinezminutti #vivianamminutti #eumaarte #estamosunidosmexicanosartistasyarte #clasesdearte #clasesdehistoriadelarte #clasesdeescultura #arteterapia #hablemosdeartevf</p>",
        "language": "es-mx",
        "author_name": "Verónica Fernández Espinosa y Viviana Martínez Minutti",
        "slug": "vamosainspirarte",
        "cover": "20230714_100703_6d770c6dc8a430495a84edd8d627bd03.jpg"
    },
    {
        "podcast_id": 219527,
        "title": "Robeats (Angelic Jelly)",
        "description": "<p>this song is so beautiful 😩</p>",
        "language": "en",
        "author_name": "CL0UDSK1ES",
        "slug": "cloudskies",
        "cover": "20230715_110726_937e7981ae158a63a28ce1a275ab7150.jpg"
    },
    {
        "podcast_id": 219613,
        "title": "FYC",
        "description": "<p>Welcome to For Your Childself!</p><p>We will be exploring Children's media from an adult perspective and having fun reliving our childlike wonder.</p>",
        "language": "en",
        "author_name": "For Your Childself",
        "slug": "fyc",
        "cover": "20230715_070749_4c6a6a0e18dd024d620e283db481ce7d.jpg"
    },
    {
        "podcast_id": 220091,
        "title": "Oddio Oddcast",
        "description": "<p>A dive into everything that is everything media.</p><p><strong>RSSVERIFY</strong></p>",
        "language": "en",
        "author_name": "Some Odd Strangers",
        "slug": "someoddstrangers",
        "cover": "20230718_090739_c46f951ea39aec7ead5d0816956f5136.jpg"
    },
    {
        "podcast_id": 220417,
        "title": "The Shorter Artist Hour",
        "description": "<p>The Shorter Artist Hour is where I, Susan Shorter (artist/author/art director) talk to my superbly talented friends that I think the world needs to know more about. I have been very lucky in this life to have become acquainted with so many talented and just flat-out cool people from fantasy and comic book artists, sculptors, and puppeteers, to voice and film actors and professional dancers, and I enjoy chatting with them about the business of art, what they are working on, and just giving everyone a glimpse inside the door to their creative worlds.</p><p>You can watch the podcast videos over on YouTube at <a href=\"https://youtube.com/playlist?list=PLDpuCx31fMQtWI0H-QusJtHTfvH0lJMWa\">https://youtube.com/playlist?list=PLDpuCx31fMQtWI0H-QusJtHTfvH0lJMWa</a></p>",
        "language": "en",
        "author_name": "Susan Shorter",
        "slug": "shorterartisthour",
        "cover": "20230720_030745_f02d8ad016eab7644d5f835445a71174.jpg"
    },
    {
        "podcast_id": 220557,
        "title": "Videorock",
        "description": "<p>Milko Palma, periodista y locutor, nos introduce al mundo del cine, series, con rock. Jueves en vivo 19:00 hrs vía YouTube, y en Spotify Viernes 14:00 hrs</p>",
        "language": "es-mx",
        "author_name": "Orlando Cisterna",
        "slug": "videorock",
        "cover": "20230721_010713_f7e84d98f33fbf9ef2448cfcba5c7451.jpg"
    },
    {
        "podcast_id": 220681,
        "title": "Captured Polity ",
        "description": "<p>CP exists to facilitate communication amongst community groups in London. It aims to do so and to create room for authentic unity and facilitate the understanding of the redemptive purpose of nations as manifested in smaller people groups in line with the redemptive purpose of the United Kingdom. The primary execution is through the creative industry (in dance, in film and literary devices).</p><p>We aim to challenge the norms in practice within the creative industry by approaching the creative industry as not merely those accredited as creatives but by integrating the community activities directly with activities and the creative process within the industry.</p>",
        "language": "en",
        "author_name": "Joy Miracle ",
        "slug": "capturedpolity",
        "cover": "20230722_030715_75be53e1e09b3175f6eff74c4d911d34.jpg"
    },
    {
        "podcast_id": 221147,
        "title": "Blank Drawings",
        "description": "<p>A platform where I share my experiences in the creative and graphic design industry and hopefully those experiences help the creative who is just starting out and the more mature creative who has seen it all. Sometimes it feels like in the industry you are on your own but you really aren't, I am still learning and growing and I hope we grow together!</p>",
        "language": "en",
        "author_name": "Tinotenda Vashibe",
        "slug": "blankdrawings",
        "cover": "20230725_090705_40dc46355554c49c6e7b29a28f34ec10.jpg"
    },
    {
        "podcast_id": 221211,
        "title": "Run Cinema Run",
        "description": "<p>The subject of movies is prolonged. As long as there are films, there will be us. So listen to us garbling but at this time surrounded by mics and recorders. Run Cinema Run is a podcast hosted by Vinayak Mohan and Harikrishnan, exploring the medium to its full extent. And be alert, all your favourite films are up for hellfire.</p>",
        "language": "ml",
        "author_name": "Vinayak Mohan, Harikrishnan",
        "slug": "run-cinema-run2023",
        "cover": "20230726_090742_e3baac541b537311e874e05090cfaaf7.jpg"
    },
    {
        "podcast_id": 221241,
        "title": "lebih indah dari angaksa",
        "description": "<p>formalitass</p>",
        "language": "id",
        "author_name": "laavie",
        "slug": "laavie",
        "cover": "20230726_030727_0e4dd2bc78289bf3ceed80053ee15c56.jpg"
    },
    {
        "podcast_id": 221474,
        "title": "CheapSkate Tuesday Movies",
        "description": "<p>Join the Doom Prophet and BigSip Mc as they watch a new movie every Tuesday for 5 bucks and hope it's not trash.</p><p>There's no rhyme or reason to the movies we will choose.</p><p>We're not critics, but we're happy to give our opinions.</p>",
        "language": "en",
        "author_name": "BigSip & Doom",
        "slug": "cheapskatetuesday",
        "cover": "20230728_120755_510dd68403b310a3d15b6f98a5248588.jpg"
    },
    {
        "podcast_id": 221721,
        "title": "Kris Krüg's MØTLEYKRÜG Podcast",
        "description": "<p>Join host <a href=\"https://www.kriskrug.co\">Kris Krüg</a> on an enigmatic journey of disruptive ideas, gripping interviews, and mind-bending explorations. Welcome to <a href=\"https://kriskrug.co/motleykrug-podcast/\">MØTLEYKRÜG</a> the cyberpunk symphony that challenges the status quo and unites rebels of art, technology, and alternative living</p><p>Tune in to MØTLEYKRÜG and become a part of the extraordinary movement that dares to rewrite the rules and paint a canvas of change.</p><p>--------------------------</p><p>Make sure you're part of our digital tribe across all platforms. Trust me; you don't want to miss out on what's coming next.</p><p>Don't forget to hit that like button and subscribe to my channel for more exciting content on the intersection of creativity and technology.</p><p>Your support goes a long way! For more insights and behind-the-scenes peeks, find me here:</p><p><a href=\"https://kriskrug.beehiiv.com/subscribe\">✅ <strong>Subscribe to free Kris Krug Newsletter</strong></a></p><p>🎧 <a href=\"https://open.spotify.com/show/7g6UPLB...\"><strong>The MØTLEYKRÜG Podcast on Spotify</strong></a></p><p>🎧 <a href=\"https://podcasts.google.com/feed/aHR0...\"><strong>The MØTLEYKRÜG Podcast on Google</strong></a></p><p>🎧 <a href=\"https://podcasts.apple.com/us/podcast...\"><strong>The MØTLEYKRÜG Podcast on Apple</strong></a></p><p>🎧 <a href=\"https://music.amazon.com/podcasts/369594c8-9548-47ed-9dee-b61dae6c7c5a\"><strong>The MØTLEYKRÜG Podcast on Amazon Music / Audible</strong></a></p><p>🌐 <a href=\"https://www.kriskrug.co/\"><strong>Website</strong></a><strong>: </strong><a href=\"http://KrisKrüg.co\"><strong>KrisKrüg.co</strong></a></p><p>🎥 <a href=\"http://www.youtube.com/kriskrug\"><strong>YouTube: Kris Krüg</strong></a></p><p>📸 <a href=\"http://www.instagram.com/kriskrug\"><strong>Instagram: @kriskrug</strong></a></p><p>🐦 <a href=\"http://www.twitter.com/feelmoreplants\"><strong>Twitter: @feelmoreplants</strong></a></p><p>🔗 <a href=\"https://www.linkedin.com/in/kriskrug/\"><strong>LinkedIn: Kris Krüg</strong></a></p><p>🎧 <a href=\"https://open.spotify.com/show/7g6UPLB...\"><strong>The MØTLEYKRÜG Podcast on Spotify</strong></a></p><p>🎧 <a href=\"https://podcasts.google.com/feed/aHR0...\"><strong>The MØTLEYKRÜG Podcast on Google</strong></a></p><p>🎧 <a href=\"https://podcasts.apple.com/us/podcast...\"><strong>The MØTLEYKRÜG Podcast on Apple</strong></a></p><p>🎧 <a href=\"https://music.amazon.com/podcasts/369594c8-9548-47ed-9dee-b61dae6c7c5a\"><strong>The MØTLEYKRÜG Podcast on Amazon Music / Audible</strong></a></p>",
        "language": "en",
        "author_name": "Kris Krüg (KK)",
        "slug": "motleykrug",
        "cover": "20230823_040809_931f8cd42c916076c62af1033b7b102b.jpg"
    },
    {
        "podcast_id": 222037,
        "title": "Escuela Figari",
        "description": "<p>.</p>",
        "language": "es",
        "author_name": "Sofia abarno ",
        "slug": "escuelafiagari",
        "cover": "20230801_010809_09c22f9660d68584523b0a918b22fb07.jpg"
    },
    {
        "podcast_id": 222221,
        "title": "Mapache que porquería ",
        "description": "<p>4 enfermos sobre analizan series y películas animadas de la manera mas pseudo intelectual y mamadora posible </p>",
        "language": "es-mx",
        "author_name": "Uriel Badillo , Camila Gonzales, Roxan Apartado, Yarensy Cuenca, Santos Latour ",
        "slug": "mapache-que-porqueria",
        "cover": "20230802_050813_d950cd2768cdff7ddb9a6ea96105c901.jpg"
    },
    {
        "podcast_id": 222430,
        "title": "Butaca 39",
        "description": "<p>Charlas de cine, en una sala de cine.</p>",
        "language": "es",
        "author_name": "Espacio Solaris",
        "slug": "butaca39",
        "cover": "20230803_010830_7176484478e5289ce81db9c1adf6c625.jpg"
    },
    {
        "podcast_id": 222669,
        "title": "CREATIVE THERAPY",
        "description": "<p>Welcome to CREATIVE THERAPY, where we delve into the fascinating world of design and creativity. Join us as we engage in insightful conversations with designers, experts, and thought leaders, exploring the diverse realms of visual communication, problem-solving, innovation and creative process. From graphic design and branding to user experience and sustainability, we uncover the secrets behind great design and how it shapes the way we interact with the world. Whether you're a seasoned designer or an aspiring creative, this podcast offers inspiration, tips, and stories that will ignite your imagination and fuel your passion for all things design.</p>",
        "language": "ar",
        "author_name": "Ismail Abdessamed",
        "slug": "bdrdsgn-podcast",
        "cover": "20230805_110823_9c92d3228507ffde1c05aef5bd47ff29.jpg"
    },
    {
        "podcast_id": 223693,
        "title": "Mixed Media with Mr. Rager and Mr. Toast",
        "description": "<p>Join Mikeynikeyrager and Convicted Toast as they discuss various forms of media along the lines of movies, tv shows, anime and video games</p>",
        "language": "en",
        "author_name": "Mike G and Keegan L",
        "slug": "mixedmediawithragerandtoast",
        "cover": "20230914_050945_0ebe0db67f621f29aabb49fb874fdf85.jpg"
    },
    {
        "podcast_id": 223751,
        "title": "That's A Them Problem",
        "description": "<p>Description : That’s a Them Problem — story of my life! Not really ,lol. A space where we -yes we, we are a community now- dive into the turbulent anxiety ridden often times beautiful misadventures of life and the big weird and wonderful feelings that go along with that. Yes, it will be a little queer. Yes it will be a little serious and dark BUT I promise I’ll make you laugh somehow - I mean I think I’m hilarious. Anyways - it’s always a them problem so how do we solve it - let’s talk about it? Or let’s listen to be spiral about it and you let me know after yeah? Okay luv ya :p :)&lt;3 ew</p><p>Objective/Mission : create space to have artsy and intellectual conversations about art, life, navigating and celebrating queer stories and issues as well as tackling topics of 20 year old's existentialism and the pathways to success through the lens of a queer femme person of colour on the African continent. Build vocabulary for specific queer and youth issues that pertain to the perspective of many young queer kids but does not speak for all if them.</p><p></p><p>Show break Down:</p><p>-Produced Intro (20 secs)</p><ul><li>Main Topic discussed [new topic each week] (30-45 mins)</li><li>videos as accompaniment to the podcast in new venues that relate to topic</li><li>outro produced(00:05) </li><li>That's A Them Problem Imaging on Socials also produced.</li></ul>",
        "language": "en",
        "author_name": "Nik Dawson",
        "slug": "thatsathemproblem",
        "cover": "20230812_040833_d8189d92e0925e327eb69e1a0fbbf3df.jpg"
    },
    {
        "podcast_id": 223784,
        "title": "ATMO Interview With David Luong (Senior VFX Environment Artist/Matte Painter)",
        "description": "<p>Join ATMO as we hang out with David Luong, a veteran senior environment artist and matte painter. We'll learn about how he got started in the industry and take a look at some of his incredible work from his time at Blizzard, which you can find on our website (<a href=\"http://www.atmovfx.com\">www.atmovfx.com</a>). David will share some of the challenges he's faced throughout his career, as well as his strategies for success. David served as a cinematic artist at Blizzard Entertainment for 15 years working on titles such as World of Warcraft, Overwatch, Diablo, StarCraft 2, Hearthstone and Heroes of the Storm. He brings over 17 years of film &amp; games industry experience with deep knowledge in lighting, compositing and digital matte painting. David is also known as “Eleven” at Imagendary Studios and is currently the Lead Digimatte artist for the studio. He is an enthusiastic mentor and educator in digital matte painting through the online community and co-authored the book d’Artiste: Matte Painting Vol. 3 Signup on our site and share your work! If you're a senior, we'd love to interview you! So upload your work so we can find you. :)</p><p>Website: <a href=\"http://www.atmovfx.com\">www.atmovfx.com</a></p><p>Instagram: <a href=\"https://www.instagram.com/atmovfx_off\">https://www.instagram.com/atmovfx_off</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbklOVU9HYkZDREc2Zm95N1I4RmFoZUJDZW0xUXxBQ3Jtc0ttZGJDcnd3M0N6aTM4b1FCN3N2RTN4d3p6cDBDZkRLbTk3azZHdmh1ajVMblVmQjdsRjNSTzEzQ1RBZS1HS0VzUVFDc1R6WERMcHRUWElhTi00R0RlYmxUc042d0Q2ZFlxV1FXQ1NLZFVqYWJpS2g3MA&amp;q=https%3A%2F%2Fwww.instagram.com%2Fatmovfx_official%2F&amp;v=RDFUIo3gJw4\">...</a></p><p>Linkedin: <a href=\"https://www.linkedin.com/company/atmo\">https://www.linkedin.com/company/atmo</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbDBjTk1yNnFvUG9IVFFCZm1VVG9fRFExc2o4UXxBQ3Jtc0tubW1XQU1XVW1RRll4eHZqUFo0dWQtVUUzQUNKRUp2SGV3ck4tRFNMLXFvdzU5dnZ4UmpCM2xpbTRMMlJaZ2VrOVJjWXA2Z21aRE5HLWVScXo1ckd4bXBQbTVnQ3RscllGekNwQmp4N3ZvaXVscGduMA&amp;q=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fatmo-vfx%2F&amp;v=RDFUIo3gJw4\">...</a></p><p>Facebook: <a href=\"https://www.facebook.com/ATMOVFX\">https://www.facebook.com/ATMOVFX</a></p><p>ATMO Discord: <a href=\"https://discord.gg/aTRJxR3VnD\">https://discord.gg/aTRJxR3VnD</a></p>",
        "language": "en",
        "author_name": "ATMO",
        "slug": "atmo",
        "cover": "20230812_080823_76af8043402699e58adecc7b1dc72f4b.jpg"
    },
    {
        "podcast_id": 223875,
        "title": "speed up music",
        "description": "<p>songs in speed up version</p>",
        "language": "es",
        "author_name": "Producciones Ferrer S.A.",
        "slug": "speedupmusic-ferrer-prod",
        "cover": "20230813_050805_a8c48959eff46fcced4dbb9ace6b077e.jpg"
    },
    {
        "podcast_id": 224175,
        "title": "SoundAi",
        "description": "<p>Is a AI Generative Music Generator platform that enables video content creators and music artists to create unlimited tracks and monetize music.</p>",
        "language": "es",
        "author_name": "Dj. Ai",
        "slug": "soundai",
        "cover": "20230818_030808_6b03a4c571c5152e5f0a2aa78bbba8ee.jpg"
    },
    {
        "podcast_id": 224231,
        "title": "The Art of Connection",
        "description": "<p>Welcome to The Art of Connection — a space created to explore true connection with the arts and conscious creators in our community.</p><p>Thank you for being here. I’m Yana — host, conscious creator, teacher, mother and founder of Oak &amp; Haven ceramics. TAOC explores how art led connection guides us to satiating, soulful fulfilment, and welcomes us home to ourselves.</p><p>I can’t wait to unravel and discuss the vast tapestry of connections life brings us, alongside insightful guests who are recognising the same in their own lives. Thank you for being here — it’s a pleasure to have you.</p><p>With love, Yana x</p>",
        "language": "en",
        "author_name": "Tatyana McKenzie",
        "slug": "theartofconnectionpod",
        "cover": "20230815_070830_68853117b734331904c2238c58aaa0b5.jpg"
    },
    {
        "podcast_id": 224293,
        "title": "lesserafim",
        "description": "<p>lesserafim stuff</p>",
        "language": "en",
        "author_name": "夢でKiss me",
        "slug": "lesserafim",
        "cover": "20230816_050835_7f109ab980033781b4715b25fdc013fe.jpg"
    },
    {
        "podcast_id": 224323,
        "title": "Latitudes Podcast",
        "description": "<p>Latitudes Podcast is the voice of art from Africa. Hosted by Refiloe Mpakanyane, the podcast explores new ways of accessing and thinking about the contemporary visual arts from Africa, while also seeking to build strong community and a robust archive of thought leadership. The Latitudes Podcast is sponsored by iTOO Artinsure and is brought to you by Latitudes Online, the world's leading marketplace for art from Africa.</p>",
        "language": "en",
        "author_name": "Latitudes Online",
        "slug": "latitudes-podcast",
        "cover": "20230816_100822_9807aa0d15744448c466eb59af973c1f.jpg"
    },
    {
        "podcast_id": 224670,
        "title": "ChillRoom",
        "description": "<p>Présenté par Corentin Louis et Rémi Hay--Rimbault</p>",
        "language": "fr",
        "author_name": "Corentin Louis, Rémi Hay--Rimbault",
        "slug": "chillroompodcast",
        "cover": "20230818_120834_1a8eb5504e6194a2b77c518261dfcbd5.jpg"
    },
    {
        "podcast_id": 224860,
        "title": "¿Que son las TIC´s?",
        "description": "<p>Se hace mención acerca de las TIC´s y como facilitan nuestra vida</p>",
        "language": "es-mx",
        "author_name": "CAROLINA JUAREZ BERISTAIN",
        "slug": "innocacion-y-tecnologia-aplicada-a-la-educacion-cjb",
        "cover": "20230819_070807_8e18357dc51ba84a40f72db9a8919231.jpg"
    },
    {
        "podcast_id": 225395,
        "title": "Ava's Audible Art Studio",
        "description": "<p>This podcast is all about the art community. It's a fun place for artists to come and listen and be inspired to create whatever they love to create. Please draw along with this podcast, listen to this in the background while you paint, sculpt, doodle, crochet, whatever you do. I made this to inspire you guys and I am going to be talking about all different forms of art, all different artists both small and big, lots of art history, and much much more. Enjoy y'allllllll 💗</p>",
        "language": "en",
        "author_name": "Ava Noelle Mosley",
        "slug": "avasaudibleartcorner",
        "cover": "20230901_080907_f916d59fe87d984f6305659607a1a03b.jpg"
    },
    {
        "podcast_id": 225467,
        "title": "Doodles to Dazzle: The Illustrated Path to Success and Happiness - A Podcast for Artists & Creatives",
        "description": "<p>This podcast is hosted by Charli and Barbra. We'll share our own art journey and offer valuable tips and tricks for fellow artists along the way.</p><p><strong>Explore the Intersection of Art and Life</strong></p><p>In each episode, we'll delve into a range of topics, from art and relationships to entrepreneurship, all within the context of personal growth as artists.</p><p>Whether you're seeking inspiration as an artist, navigating the complexities of relationships, or simply passionate about self-discovery, this podcast is designed with you in mind.</p><p><strong>Sharing Stories and Insights</strong></p><p>We'll be sharing our own stories, exploring practical insights, and sparking aha moments that resonate with you.</p><p><strong>Join Us on the Journey</strong></p><p>To learn more about how we turned simple doodles into dazzling creations and how you can too.</p><p><strong>Stay connected with us on social media:</strong></p><p><a href=\"https://www.instagram.com/charbi.online\">https://www.instagram.com/charbi.online</a></p><p><a href=\"https://www.instagram.com/barbra.creative.corner\">https://www.instagram.com/barbra.creative.corner</a></p><p><a href=\"https://www.instagram.com/charlies.creative.corner\">https://www.instagram.com/charlies.creative.corner</a></p><p><a href=\"https://tiktok.com/@charbi.online\">https://tiktok.com/@charbi.online</a></p><p><strong>Visit our Etsy Shop:</strong></p><p><a href=\"https://www.etsy.com/shop/CharbieDesigns\">https://www.etsy.com/shop/CharbieDesigns</a></p><p>Thank you for being part of the 'Doodles to Dazzle' community. Let's create, inspire, and dazzle together!</p>",
        "language": "en",
        "author_name": "Charbi",
        "slug": "charbi-doodles2dazzle",
        "cover": "20230823_010831_4e52aca8dbd06c70bda6c169b8588d6d.jpg"
    },
    {
        "podcast_id": 225676,
        "title": "La Situación Podcast",
        "description": "<p>La Situación: Un podcast para hablar sobre arte y sobre la vida. Desde Madrid, esta ciudad sin mar, te invito a que me acompañes en este trasiego por la situación, un lugar donde las palabras tienen el poder de construir la realidad; un lugar donde el arte está intrínsecamente relacionado con todo \"lo otro y por ende con el mundo\". Soy Yudinela Ortega y entre vivir la experiencia y contártela, intentaré hacer mejor lo segundo.</p><p>¡Nos vemos por ahí!</p>",
        "language": "es",
        "author_name": "La Situación Podcast",
        "slug": "lasituacion-elpodcast",
        "cover": "20230824_040804_d0ca6b5cf5924ac8b391f1108c3b7825.jpg"
    },
    {
        "podcast_id": 225725,
        "title": "Highbrow Honey",
        "description": "<p>Welcome to your biweekly bite of art history! Together we will make our way through today's ever-expanding visual culture by focusing in key moments in the subject: the weird, the infamous, the hilarious, and even the seemingly pointless. Breaking down the visual past to understand its connections to the present, host Celia Bugno brings you all the fancy \"highbrow\" knowledge she can get her hands on in short, sweet episodes designed to keep you hooked and just maybe teach you a little something. This is Highbrow Honey!</p><p>Celia Bugno holds a Master's in Art History, specialized in Contemporary arts, from Arizona State University (2023), and a B.A. Art History from Miami University (2016). Her primary goal in podcasting is to inspire the same love of learning in her listeners that her professors and mentors have inspired in her. Check the weekly show notes for complete source lists per episode.</p>",
        "language": "en",
        "author_name": "Celia Bugno",
        "slug": "highbrow-honey-podcast",
        "cover": "20230829_120804_940d915047e2207c32d9fa045897c091.jpg"
    },
    {
        "podcast_id": 225735,
        "title": "Famous Art Show",
        "description": "<p>Brief description is as follows:</p><p>Impromptu, random thoughts of an artist's mind of \"JUAN GOMEZ\", some historical references related to topics. A personal perspective of my life &amp; events also influences.</p><p>Smorgasbord of experiences what can inspire a painting or groups of them. I love progressive music especially by early \"GENESIS\" Peter's era... also Phil's. This experiment of literature I'm going into will be RAW, some calculated and unexpected adventures.</p>",
        "language": "en",
        "author_name": "Juan Gomez",
        "slug": "famousartshow",
        "cover": "20230825_120826_819518c7b4078a9d5b20df74d6bf88c9.jpg"
    },
    {
        "podcast_id": 225914,
        "title": "Unreleased / taken down songs",
        "description": "<p>mostly for person use</p>",
        "language": "en",
        "author_name": "Shenanigans ",
        "slug": "cxrpse",
        "cover": "20230826_080812_ce6b41249e40cf6a5d61b8aa887e1906.jpg"
    },
    {
        "podcast_id": 226347,
        "title": "SOUTHPARK AI COVERS",
        "description": "<p>idk homos :3</p>",
        "language": "en",
        "author_name": "awesome person",
        "slug": "sillyhomossingingsillysongs",
        "cover": "20230829_080839_82697dff5c44e62cd876ee4aa3593850.jpg"
    },
    {
        "podcast_id": 226350,
        "title": "I Hurt Everywhere",
        "description": "<p>I Hurt Everywhere, a tattoo based podcast featuring Mike Stockings &amp; Joe Penn.</p>",
        "language": "en",
        "author_name": "Michael Stockings",
        "slug": "ihurteverywherepodcast",
        "cover": "20230913_110900_1b97fb259a933cf806c24689c0a084c8.jpg"
    },
    {
        "podcast_id": 226477,
        "title": "MW2 THE PODCAST OF DESPARE",
        "description": "<p>where nice people talking about mw2 and the current problem in the game</p>",
        "language": "en",
        "author_name": "HAUSEMIST",
        "slug": "the-show-of-despaire",
        "cover": "20230830_120844_5cfd1d3bdb561fb8e49b024c186a437f.jpg"
    },
    {
        "podcast_id": 226753,
        "title": "Metaphora Sessions",
        "description": "<p>En este podcast nos sumergimos en un espacio de conversación tranquila y reflexiva en Metaphora. Acompáñanos mientras exploramos el fascinante mundo del arte y la artesanía a través de diálogos con artistas y artesanos destacados.</p><p>En cada episodio, nos adentramos en las mentes creativas detrás de obras que abarcan desde la cerámica, la joyería, hasta el tejido y la escultura. Exploramos las historias que inspiran cada creación, desde las raíces de la cultura indígena hasta símbolos del tarot y la magia.</p>",
        "language": "es",
        "author_name": "Metaphora ",
        "slug": "metaphora",
        "cover": "20230831_080820_0a16c62dbbd37d7e384b17fce5334747.jpg"
    },
    {
        "podcast_id": 226793,
        "title": "Painting Insights",
        "description": "<p>A podcast about painting. Interviews and conversations with top contemporary painters on process, inspiration and what it means to be an artist.</p>",
        "language": "en",
        "author_name": "Richard K Blades & Simon Renshaw",
        "slug": "paintinginsights",
        "cover": "20230901_050937_979895826bb50ea13e56047f389d870a.jpg"
    },
    {
        "podcast_id": 226825,
        "title": "Rhythm & Wit",
        "description": "<p>Rhythm &amp; Wit is a new series that will discuss and explore the creative and artistic expressions of performers and artists in Oklahoma City and it's neighboring cities.</p><p>Hosted by David Steele and Nicholas Campbell.</p>",
        "language": "en",
        "author_name": "David Steele and Nick Campbell",
        "slug": "rhythmandwitpod",
        "cover": "20230901_030919_cac837929bdf056345ba5dd66931da6f.jpg"
    },
    {
        "podcast_id": 226945,
        "title": "Two Pennies Photography Podcast",
        "description": "<p>Two Pennies podcast is about photography and the journey that it is. We talk about our own perspectives and give \"our two cents\". The hosts Kyle and Ruby have been friends for 5 years. We discuss our thoughts on the photography trends, community, and what drives us to do photography. Hopefully this drives you to have thoughts of your own and become more involved in the creative process. So, join us and relax to our ramblings, thoughts, and discussions. We hope you enjoy listening to it as much as we enjoy making it.</p><p>Instagram-</p><p>Kyle - <a href=\"https://www.instagram.com/axley865/\">https://www.instagram.com/axley865/</a></p><p>Ruby - <a href=\"https://www.instagram.com/rubyroddzombie/\">https://www.instagram.com/rubyroddzombie/</a></p>",
        "language": "en",
        "author_name": "Kyle Axley / Alstroja Cunningham",
        "slug": "twopennies",
        "cover": "20230902_030911_20fa0dc64a61ab1c49169e62a786c976.jpg"
    },
    {
        "podcast_id": 227009,
        "title": "NECEANDO",
        "description": "<p>Discusiones genéricas por unos genéricos sobre lo ultimo en cine, series y comics...</p>",
        "language": "es",
        "author_name": "Teresita, Debi, Pablito e Ixito",
        "slug": "neceando",
        "cover": "20230903_040918_a35f1d6f78b791d80749331e3ad1092d.jpg"
    },
    {
        "podcast_id": 227071,
        "title": "Manik || মানিক",
        "description": "<p>Manik মানিক</p><p>voice artist</p><p>:</p><p>Manik: Anime Ankit</p><p>Manik a baba : OsAmu Universe 3</p><p>Manik a dad : Supriyo Mallick</p><p>Police officer: Anime Ankit</p><p>Police constabale : Niladri</p><p>Manik's wife: Debosmita</p><p>Officer's wife: Sanah</p><p>Side character: Ankit Nayak, Anime Ankit</p><p>Editing by : Anime Ankit, Niladri</p><p>Sound design by : Anime Ankit, Niladri</p><p>Thumbnail design by: Anime Ankit</p><p>- Enjoy and stay connected with us!! ► Subscribe Us <a href=\"https://youtube.com/@Bangaliya_Adda\">/ @bangaliya_adda </a>► Follow us on Instagram: <a href=\"http://instagram.com/bangaliya_adda_official\">instagram.com/bangaliya_adda_official</a> ►Anime Ankit - <a href=\"http://instagram.com/animator_ankit_\">instagram.com/animator_ankit_</a> ►Niladri - <a href=\"http://instagram.com/niladrimitra7/\">instagram.com/niladrimitra7/</a> ►Supriyo - <a href=\"http://instagram.com/supriyo_malick\">instagram.com/supriyo_malick</a> ►Ankit Nayak - <a href=\"http://instagram.com/ankit._.nayak1854\">instagram.com/ankit._.nayak1854</a> ►Amar - <a href=\"http://instagram.com/amar_the_great_1\">instagram.com/amar_the_great_1</a> ►Sanah - <a href=\"http://instagram.com/_q_o_boss\">instagram.com/_q_o_boss</a> ►Debosmita - <a href=\"https://www.instagram.com/_._yeah_._me\">https://www.instagram.com/_._yeah_._me</a> <a href=\"https://www.youtube.com/hashtag/bengalistory\">#bengalistory</a> <a href=\"https://www.youtube.com/hashtag/golpo\">#golpo</a></p>",
        "language": "en",
        "author_name": " Bangali_Adda",
        "slug": "bangaliadda",
        "cover": "20230903_060942_824063ec8add81d5765787f6eb03a8c3.jpg"
    },
    {
        "podcast_id": 227252,
        "title": "Crafting Joy",
        "description": "<p>Crafting Joy provides a writer's voice to crafter's hands. Join host Joy Giovanini as she carves out a space for makers to feel connection and renewal through a shared yarn.</p>",
        "language": "en",
        "author_name": "Joy Giovanini",
        "slug": "craftingjoy",
        "cover": "20230905_030937_d113d94ea66fc0f3b61ca2a042e933b5.jpg"
    },
    {
        "podcast_id": 227363,
        "title": "How to start creating art ?!",
        "description": "<p>In this episode we're going to talk about, how you can start creating art from nothing. Even If you don't have any experience. Stick around and let's learn and growth as artists !</p>",
        "language": "en-us",
        "author_name": "Audrey Gonçalves Evangelista",
        "slug": "audreygoncalves",
        "cover": "20230905_080911_b4bf4d69eb6ea4193f9fafc1a7dbc2bb.jpg"
    },
    {
        "podcast_id": 227684,
        "title": "dedirafiga",
        "description": "<p>Arada tək, arada dostlarla və bəlkə məşhurlaşsam lap elə yadlarla söhbət edirəm.</p><p>Gələcək üçün xatirələr yığıram</p>",
        "language": "en",
        "author_name": "Rafiga Seyidova",
        "slug": "dedirafiga",
        "cover": "20230907_080923_cd687d78eb644e93230eeaded9df6842.jpg"
    },
    {
        "podcast_id": 228567,
        "title": "ALFILMBET",
        "description": "<p>In each episode of ALFILMBET, hosts Alec and Sam explore a different film, sharing their individual opinions and analyses to uncover hidden meanings and offer valuable insight. The alphabetical structure (one letter per episode, with both the filmmaker's name and the film title beginning with the same letter) allows us to discuss everything from beloved classics to little-known gems. Join us for a fun, alphabetical journey through film!</p>",
        "language": "en",
        "author_name": "Alec Dubois and Sam Maynard",
        "slug": "alfilmbet",
        "cover": "20230913_100912_a608a45d5deb51a445aeddad3c5eeb93.jpg"
    },
    {
        "podcast_id": 228815,
        "title": "#ARTSTAYSHERE's Culture Crisis Conversations",
        "description": "<p>Culture Crisis Conversations is the new podcast series from the #ARTSTAYSHERE Coalition. We talk with those who are impacted most by arts/music/cultural displacement, including artists, musicians, advocates, operators, developers, government, policy-makers, planners, funders &amp; more--and discuss the causes &amp; potential solutions.</p><p>#ARTSTAYSHERE is a volunteer-run, non-profit advocacy effort to prevent arts/music/cultural displacement across Greater Boston. Sign our online petition, sign up for email updates, and learn more at <a href=\"http://www.artstayshere.org\">www.artstayshere.org</a>.</p><p>In partnership with New Alliance East, New Alliance Audio &amp; The Record Co.</p>",
        "language": "en",
        "author_name": "#ARTSTAYSHERE Coalition",
        "slug": "artstayshere",
        "cover": "20230915_060952_bd466511b36ecc75f0385f74464f47ff.jpg"
    },
    {
        "podcast_id": 229107,
        "title": "Talking Pasta",
        "description": "<p>Impastaqqq and Calem from Rabid Mushrooms Studios interview random artists from tik tok or youtube. We help to get a better insight at the lives of small creators online.</p>",
        "language": "en",
        "author_name": "impastaqqq",
        "slug": "talkingpasta",
        "cover": "20230918_020916_c54f8a846bb694c8eb583d232e47c654.jpg"
    }
]