[
    {
        "podcast_id": 38465,
        "title": "AUVB - Off Court Show",
        "description": "Kevin Barnett and Salima Rockwell preview and breakdown the Competition Weekends and Drafts of Athletes Unlimited Professional Volleyball.   Tune in, Know More, Laugh a lot.",
        "language": "en",
        "author_name": "Kevin Barnett & Salima Rockwell",
        "slug": "auoffcourt",
        "cover": "20210305_153628_f369202f67758b635f105b4d7f859351.jpg"
    },
    {
        "podcast_id": 100060,
        "title": "Pin to Pin Volleyball Podcast",
        "description": "Listen as your hosts Ryan Tolman and William Robinson help you navigate the exciting world of the fastest sport on the planet. You will learn everything you need to know about volleyball and all of its moving parts.\n\nWatch on YouTube! https://www.youtube.com/channel/UCjdNEFVDoLoTs0LCOWEHGcw\n\nFind us on Instagram @pin2pinpodcast",
        "language": "en",
        "author_name": "Ryan Tolman and William Robinson",
        "slug": "pintopinvolleyballpodcast",
        "cover": "20220110_100145_d0d671d10bbeb973bc0a1f661e417c0c.jpg"
    },
    {
        "podcast_id": 145937,
        "title": "Victoria Advocate - The Grid",
        "description": "The Victoria Advocate's sports team discuss prep and college sports in the Crossroads and South Texas. Sponsored by Victoria College.",
        "language": "en",
        "author_name": "Victoria Advocate Sports Team",
        "slug": "advosports-thegrid",
        "cover": "20230203_010207_2c3a88dda53d55203e390719eef45f7a.jpg"
    },
    {
        "podcast_id": 152091,
        "title": "The 7th Rotation",
        "description": "The 7th Rotation is a podcast committed to advancing Summit League women's volleyball and praising its student athletes. We are here to #StanTheSummit and De-stigmatize the Mid Major label.",
        "language": "en",
        "author_name": "Madison VanWalleghen-Baustian",
        "slug": "seventhrotationpod",
        "cover": "20220929_030917_17fde137395cee01b22b05a399580985.jpg"
    },
    {
        "podcast_id": 153351,
        "title": "G-Rangers Radio",
        "description": "Host Ethan talks to some of our Grange student athletes after some of our Rugby, Rugby League and other sporting events throughout the year.",
        "language": "en",
        "author_name": "Grange Sport Science",
        "slug": "grangers-radio",
        "cover": "20221031_081056_518c7ee9817f6ff5dc961d79289e9cc8.jpg"
    },
    {
        "podcast_id": 156060,
        "title": "i pallavolisti indiscreti",
        "description": "avviciniamo i ragazzi al mondo della pallavolo giovanile con ospiti che ne raccontano.",
        "language": "en",
        "author_name": "i pallavolisti indiscreti",
        "slug": "pallavolistiindiscreti",
        "cover": "20220930_010943_22d468ee49a90ee0cfef09ae4cd23c14.jpg"
    },
    {
        "podcast_id": 161554,
        "title": "V Brand Sports Talk",
        "description": "<p>A radio station that is a place to talk sports of all kinds. To broadcast games and just have a great time talking sports.</p>",
        "language": "en",
        "author_name": "Rob Vasquez",
        "slug": "v-brand-sports-talk",
        "cover": "20230616_060650_70f15f0dc04986986d5180f0480a2437.jpg"
    },
    {
        "podcast_id": 162758,
        "title": "El podcast de Teika",
        "description": "La actualidad de \"Juegan ellas, ganamos todos\" en el Podcast de Teika que dirige y presenta Esther Collado. La información de los 17 clubes que forman parte de la iniciativa \"Juegan ellas, ganamos todos\" cada martes, con todos los resultados, la agenda y las principales protagonistas.  ",
        "language": "es",
        "author_name": "Teika",
        "slug": "el-podcast-de-teika",
        "cover": "20221024_081004_d366bc2a47861bf9582eadb04513fdb4.jpg"
    },
    {
        "podcast_id": 176592,
        "title": "The Volleyball Experience",
        "description": "All things volleyball talk, podcasts and interviews with coaches, players from around the world. In-depth interviews that you won't hear anywhere else about volleyball. We ask the questions you want the answers to. Interviews from podcaster Jim Seidel, the NCVBCA Coach of the Year, 3x state championship appearances, and one of the winningest club coaches in the Charlotte area the past two years. ",
        "language": "en",
        "author_name": "Jim Seidel",
        "slug": "coachingvolleyball",
        "cover": "20230116_110135_0c8aee355ad1ddf6430dc32f39e08db5.jpg"
    },
    {
        "podcast_id": 203647,
        "title": "Bump Set Bear",
        "description": "<p>Welcome to \"Bump Set Bear,\" the volleyball podcast where we bring you the latest news, insights, and stories from the east coast's vibrant volleyball community. Our goal is to provide a platform where coaches, players, and fans can come together to share their love of the game and learn from the best in the business.</p><p>Each episode, we'll be joined by some of the most experienced coaches on the east coast to share their knowledge, expertise, and personal stories from the world of volleyball. We'll cover everything from the basics of the game to advanced strategies and trends, and explore the unique culture and community that surrounds this exciting sport.</p><p>Whether you're a seasoned player, a dedicated coach, or simply a fan of the game, \"Bump Set Bear\" is the place for you. Our aim is to provide a fun, informative, and inclusive space where everyone can learn, grow, and connect through the shared passion for volleyball.</p><p>So join us as we bump, set, and spike our way through the latest news, insights, and stories from the east coast volleyball community. Let's go \"Bump Set Bear\"!</p>",
        "language": "en",
        "author_name": "Bump Set Bear",
        "slug": "bumpsetbear-pilot",
        "cover": "20230417_010430_f1b6452fc9a3d47740f8327b27ad50d7.jpg"
    },
    {
        "podcast_id": 226096,
        "title": "Volleyball Insiders",
        "description": "<p>A show about all things volleyball, and all sorts of other things.</p>",
        "language": "en",
        "author_name": "The Volleyball Insiders",
        "slug": "volleyballinsiders",
        "cover": "20230827_060820_230b4a7af7cc04e266a1f67f00f39b0c.jpg"
    }
]