[
    {
        "podcast_id": 20578,
        "title": "Spacepodden",
        "description": "Spacepodden - romsnakk i sofakroken. \n\nEn podcast laget av Space NTNU som er en student-dreven paraplyorganisasjon for space-relaterte aktiviteter på NTNU. Her snakker vi om interessante romrelaterte temaer og selskaper, gjør dem lett tilgjengelig, lett å lytte til og lett å forstå. Vi nevner også det vi selv driver med, det som skjer med våre medlemsorganisasjoner og våre sponsorer. \n",
        "language": "nb",
        "author_name": "Space NTNU",
        "slug": "spacepodden",
        "cover": "20220322_100343_7e33d7cbc55f2f8924f0b539c779408b.jpg"
    },
    {
        "podcast_id": 24680,
        "title": "What the fuck is up?",
        "description": "podcast about conspiracies, spirituality, esotericism, random things, astrology",
        "language": "en",
        "author_name": "Morgan thornton",
        "slug": "whatthefuckisup",
        "cover": "20210115_051340_42c3b58a748b13a4edf48596e64db1ff.jpg"
    },
    {
        "podcast_id": 43945,
        "title": "The Comic Cosmonaut",
        "description": "Hi ya! My name is Bek, and this podcast is aimed toward anything and everything space related! So come hang out and chill with me :) Let's listen to music and talk about space!",
        "language": "en",
        "author_name": "Rebekah Denton",
        "slug": "thedowntimedentons",
        "cover": "20220618_070621_7eadcdbb78e1e3814aedbdf4fc029f82.jpg"
    },
    {
        "podcast_id": 59780,
        "title": "The Black Science Guy Podcast",
        "description": "Do you have a curiosity about all things science? Do you enjoy learning about science? Well this is the podcast for you! Each episode we cover everyday science topics from astronomy to microscopy. Then if it's something you're curious about, you can ask the black science guy! ",
        "language": "en",
        "author_name": "Chris Edwards",
        "slug": "blackscienceguypodcast",
        "cover": "20210530_021905_3de06922d6f88792c052059c114790d9.jpg"
    },
    {
        "podcast_id": 65337,
        "title": "ShuttlePod Cast // Space and Astronomy",
        "description": "Follow along with Nic and Echo as they share their love for astronomy and all things space-y! On this podcast, you will find space facts, astronomy news, and general banter about space-esque topics.",
        "language": "en",
        "author_name": "Nic and Echo",
        "slug": "shuttlepodcast",
        "cover": "20210628_020050_2ea589e9ac36ab33d6647790be36a52f.jpg"
    },
    {
        "podcast_id": 73476,
        "title": "Le Shack politique ",
        "description": "Le Shack Politique est un podcast de science politique dont l'animateur est Alexis Giraldeau. Chaque semaine, il tentera d'éclaircir un enjeu de politique et ce, en établissant des faits scientifiques tout en étant drôle! C'est ta chance pour écouter un podcast rempli de blagues, de comparaisons scientifiques déroutantes, de beaux lapsus et de paranthèses de soccer, sport qui passionne Alexis! \nLa 1ère série d'épisodes porteront sur la compétition entre les milliardaires Elon Musk, Jeff Bezos et Richard Branson pour conquérir l'espace! Enfile ton casque d'écoute pour vivre une odyssée spatiale rocambolesque! \nLe Shack politique commencera dans 3...2...1...0! ",
        "language": "fr",
        "author_name": "Alexis Giraldeau",
        "slug": "le-shack-politique-espace-cie",
        "cover": "20210814_044246_b68713490a9211928d5692d0b15480b2.jpg"
    },
    {
        "podcast_id": 85560,
        "title": "The Final Frontier",
        "description": "Today we will be taking a journey through time and space, from near earth orbit to the farthest reaches of the Milky Way. We will explore strange worlds and the vastness of the void, and seek to understand the greatest mysteries of the cosmos. This… is the Final Frontier.\n",
        "language": "en",
        "author_name": "Matt Walz",
        "slug": "thefinalfrontier",
        "cover": "20211016_224117_ab036871d7fd19865fcdcd3c355c4837.jpg"
    },
    {
        "podcast_id": 99106,
        "title": "Alchemy Academy: A Podcast",
        "description": "<p>I have created the AA Podcast to help guide us all through life's mysterious challenges. My goal is to help all of YOU live the most fulfilling life you possibly can during one of the most interesting times in human history.</p>",
        "language": "en",
        "author_name": "AA Podcast",
        "slug": "alchemyacademypodcast",
        "cover": "20220106_120152_5fba68be2198b93e605067d50666141e.jpg"
    },
    {
        "podcast_id": 106631,
        "title": "The Bottled Water Podcast ",
        "description": "A podcast about everything from UFOs to whatever is going on in the world. ",
        "language": "en",
        "author_name": "Tony",
        "slug": "thebottledwaterpodcast",
        "cover": "20220218_010207_dd9f0818e3d96b9e26c19dba29f82780.jpg"
    },
    {
        "podcast_id": 107159,
        "title": "Joe's Odd Podcast",
        "description": "plz keep open mind\n\nlmk what ya think!",
        "language": "en",
        "author_name": "Joseph Arthur Horton",
        "slug": "joesoddpodcast",
        "cover": "20220207_110225_0d19140a79c9be5339a9db60adb4d0fd.jpg"
    },
    {
        "podcast_id": 122688,
        "title": "Cosmos Crusaders",
        "description": "Podcast created to highlight the stories and achievements of people of color, minorities, and underrepresented individuals in the fields of astronomy and physics. Created by Gokul Srinivasaragavan and Simi Bhullar.",
        "language": "en",
        "author_name": "Gokul Srinivasaragavan and Simi Bhullar",
        "slug": "cosmoscrusaders",
        "cover": "20220417_040408_fbd7929051076a166d25d2b307e87c50.jpg"
    },
    {
        "podcast_id": 135350,
        "title": "No Empathy",
        "description": "The thoughts and opinions of an average girl who struggles to understand what empathy is",
        "language": "en",
        "author_name": "Nikki Mastroianni ",
        "slug": "noempathy",
        "cover": "20220622_040642_9b39d91cf20c9231a98e118de0c108c6.jpg"
    },
    {
        "podcast_id": 141641,
        "title": "The Talk Hold",
        "description": "Where we just talk about things",
        "language": "en",
        "author_name": "Bianca James",
        "slug": "the-talk-hold",
        "cover": "20220816_060802_fba1f9a8922f6f7d8f94be1a010b25cc.jpg"
    },
    {
        "podcast_id": 148303,
        "title": "The 3D Session",
        "description": "The 3D Session podcast (Daily Dose of Dale Podcast) is about having thought provoking discussions with individuals from all different backgrounds of expertise along with fun and weird conversations with friends. ",
        "language": "en",
        "author_name": "Dale Pavitt",
        "slug": "the3dsession",
        "cover": "20220823_090834_ac37697e9b6b30b7082748baf8f73838.jpg"
    },
    {
        "podcast_id": 149106,
        "title": "into it",
        "description": "Hi! This is an English project? Well this podcast is about topics that interest me that I would love to talk about. I’ll mostly be talking about theology, paranormal experiences, astronomy, and analog horror. So stick around and find out what I am into this week",
        "language": "en",
        "author_name": "shamshamsss",
        "slug": "intoit",
        "cover": "20220826_070804_912a0141e5255ace38395f5ccdbf59bc.jpg"
    },
    {
        "podcast_id": 149448,
        "title": "JoBro Radio",
        "description": "In this cozy corner of the internet, we share our interests, passions, and grievances about nerd culture, as well as some of our favorite unhinged comedic stories and other fun side notes!",
        "language": "en",
        "author_name": "JoBro",
        "slug": "jobroradio",
        "cover": "20220828_030835_4f377048f9282d782dfd47dba5415c3a.jpg"
    },
    {
        "podcast_id": 155325,
        "title": "Call it a day",
        "description": "Call it a day while we sip on whiskey and discuss stories about space, our daily lives, and our opinions on common controversies.",
        "language": "en",
        "author_name": "Marco & Patrick",
        "slug": "callitaday",
        "cover": "20220923_010900_861bc6bb6e6f8b2cc61ba5bd343ccf7c.jpg"
    },
    {
        "podcast_id": 156590,
        "title": "The Black Hole",
        "description": "The Black Hole is a new podcast that will venture into the minds and hearts of the masses via two thought experts: Sancho D. Bayleaf and Doggie Boy J. Listen as the Bayleaf and the Boy outthink so called “Scientist” and “Doctors” by digging the sediment out of the woolly grundle of life and death and life again (The afterlife) and put it under a microscope and project the findings on a jumbotron (metaphorically). Hear the bigger picture and absorb every facet of yours and you neighbor’s mind.",
        "language": "en",
        "author_name": "Sancho D. Bayleaf & Doggie Boy J.",
        "slug": "thebhole",
        "cover": "20220928_080946_90d75bc2ee6b075eb2bf502dbcddbb5e.jpg"
    },
    {
        "podcast_id": 159879,
        "title": "Universe-ity",
        "description": "<p>The podcast where we challenge the way you think about Earth, existence and the unknown. Join us biweekly to explore the divide between science fiction and science fact.</p><p>Use our <a href=\"https://linktr.ee/universe_ity\">Linktree</a> to support us on all socials.</p>",
        "language": "en",
        "author_name": "AJ Perron, Judson Martin, and Cindy D'Almeida",
        "slug": "universe-ity",
        "cover": "20230828_010803_204b6981683f0b5aff632c1e53b64ebb.jpg"
    },
    {
        "podcast_id": 163041,
        "title": "Vortice de curiosidad ",
        "description": "Dos amigos compartiendo opiniones, experiencias y conocimiento sobre temas \"densos\" y variados.",
        "language": "es-mx",
        "author_name": "Carlos and Christian",
        "slug": "vorticedecuriosidad",
        "cover": "20221025_101047_12ee96058c3d19afd8c695e83e455ef7.jpg"
    },
    {
        "podcast_id": 170887,
        "title": "The Taurus Report",
        "description": "The James Webb Space Telescope (JWST) does disprove the Big Bang.  The Taurus Report presents an entirely new eternal, cyclic Cosmology with no Big Bang, no inflation, no dark matter, no dark energy.  There will be continuing commentary each week on new developments in JWST observations and theories about Cosmology.",
        "language": "en",
        "author_name": "Joe Bakhos",
        "slug": "taurusreport",
        "cover": "20221128_031108_4e64dc3d40a873708518d7848c06f80a.jpg"
    },
    {
        "podcast_id": 173699,
        "title": "The Orphic",
        "description": "Welcome to The Orphic, with Alyssa Sokol and Mikayla Morrison. The word Orphic means \"beyond ordinary understanding\": Alyssa and Mikayla are both intuitive channelers developing their connection to higher realms to bring through other-worldly information and wisdom. Alyssa is an Astrophysics PhD actively working on theories blending astrophysics and spirituality to describe the way the universe works. Mikayla is an empathic medium with her own business offering psychic readings, energy healings, and past-life regressions. Together they discuss their personal healing journeys and get into interesting topics within astrophysics, quantum physics, consciousness, astrology, aliens, and much more.",
        "language": "en",
        "author_name": "The Orphic",
        "slug": "theorphic",
        "cover": "20221210_081216_0f802fe48d4d2723ed849e548970fb45.jpg"
    },
    {
        "podcast_id": 175750,
        "title": "Astrolojik Dipnotlar",
        "description": "Sizlere bölümler halinde astroloji hakkında dipnotlar aktarmak istiyorum. Kanalımıza abone olmayı ve bildirimlerinizi açık tutmayı unutmayın. Yayınlarımızı beğenerek bizim azmimizi artırabilirsiniz. Böylece daha çok podcast yüklemek isteyebiliriz. :) Sevgiler.. :)",
        "language": "tr",
        "author_name": "İlker ŞAHİN",
        "slug": "ilkersahin",
        "cover": "20221221_101214_5a8f62b5842bbfcfa060bbba087fa179.jpg"
    },
    {
        "podcast_id": 184054,
        "title": "Lunita Mystical Podcast",
        "description": "<p>Welcome to Lunita mystical podcast, where we discuss astrology and spirituality every week, corresponding with the lunar cycle. We're you're hosts, Grace &amp; Anna. Follow us on instagram at @lunita.bcn for updates and to learn about handmade ceramics &amp; artisan products.</p>",
        "language": "en",
        "author_name": "Grace & Anna",
        "slug": "lunita",
        "cover": "20230129_040119_b06246d744c97014c8ae449ff61fecb2.jpg"
    },
    {
        "podcast_id": 184441,
        "title": "Zodiac Signs, Motivation, and More!",
        "description": "Determined by your date of birth our Zodiac signs represent our core personality, sense of self, basic preferences, and romantic compatibility.  Join us on the ZeNfinity podcast as we shed light on our innate gifts, as well as the things we did not know about our Zodiac signs.  This podcast is also all about Positivity- Covering topics not only surrounding the Zodiac signs, but Happiness, Success, Motivation and More!",
        "language": "en",
        "author_name": "Joshua W. M.",
        "slug": "zenfinity",
        "cover": "20230129_120107_a3c9579c8234b6b934e22874d456b9c3.jpg"
    },
    {
        "podcast_id": 192922,
        "title": "Targeting With JK-47 Paranormal",
        "description": "<p>In this <strong>Vodcast </strong>i will challenge video and picture  evidence of so called  paranormal captures. Once a week i will</p><p>go live on my facebook account discussing sverythibg</p><p>i love input from everyone so put your question up and lets work together!</p><p>Hit that like and subscribe please it helps more than u know</p>",
        "language": "en",
        "author_name": "Jonathan Keyworth",
        "slug": "targetingwithjk47",
        "cover": "20230227_050236_bd03d59643252caa48a55c861f0776ce.jpg"
    },
    {
        "podcast_id": 207976,
        "title": "Astrophysics with Azra",
        "description": "<p><strong>You're about to take a journey through the path of knowledge, of science. Are you ready to discover the secrets of our universe with Azra?</strong></p>",
        "language": "en",
        "author_name": "Azra Derin Sansal",
        "slug": "astrophysicswithazra",
        "cover": "20230508_050518_b34e31b68acd28a6d7a9737db5336535.jpg"
    },
    {
        "podcast_id": 209612,
        "title": "Intocable - Anuel AA",
        "description": "<p>BRRRRRR BEBESITA</p>",
        "language": "es",
        "author_name": "FANNYMDLR",
        "slug": "anuelel2blea",
        "cover": "20230516_060551_ac7af0397fe52e8e523528421ed2ddde.jpg"
    },
    {
        "podcast_id": 212726,
        "title": "Please Look Up",
        "description": "<p>Tune in each month for a guided tour of the night sky as seen from Perth, Western Australia.</p><p>Each episode highlights all of the fascinating constellations, planets, and asteroids that you should be keeping an eye out for in the night sky. And don't worry, we'll also be highlighting the latest in space news so you'll always be in the know when it comes to the extra-terrestrial.</p><p>Please Look Up is brought to you by <a href=\"https://particle.scitech.org.au/\">Particle</a> and powered by <a href=\"http://scitech.org.au/\">Scitech</a>.</p>",
        "language": "en",
        "author_name": "Particle WA",
        "slug": "please-look-up",
        "cover": "podcast_cover.png"
    },
    {
        "podcast_id": 212727,
        "title": "Audio Guide to the Galaxy",
        "description": "<p>A guided tour of the night sky as seen from Perth, Western Australia, exploring the stories and science of astronomy, space science and space travel. It's a planetarium presenter in your pocket - just download, head outside, and press play. The Audio Guide to the Galaxy is proudly presented by Scitech.</p>",
        "language": "en-AU",
        "author_name": "Scitech ",
        "slug": "the-audio-guide-to-the-galaxy",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 217131,
        "title": "Cosmic Conversation ",
        "description": "<p>This podcast talks about the cosmic creatures and life beyond earth.</p>",
        "language": "en",
        "author_name": "Kent Kyle Carulasan ",
        "slug": "malikhainpodcast",
        "cover": "20230628_060618_80d8a13e5069c27e64a35284ec088a0a.jpg"
    },
    {
        "podcast_id": 217773,
        "title": "Journey Through Time",
        "description": "<p>Hosted by Dave Gammon</p><p>Produced by Tyler Lopez</p><p>Recorded at WSOE Podcast Studio, Elon University</p><p>Theme music by Tyler Lopez</p>",
        "language": "en",
        "author_name": "Dave Gammon",
        "slug": "journeythroughtime",
        "cover": "20230703_020733_8bf320d3eae53a8ca1ff8a89ad0bd483.jpg"
    },
    {
        "podcast_id": 217858,
        "title": "مقالات باسين",
        "description": "<p>علوم، تاريخ، ثقافة</p>",
        "language": "ar",
        "author_name": "Yassin Khadraoui",
        "slug": "maqalatyassin",
        "cover": "20230703_060748_a01e456315b63cde396d514eddd9a872.jpg"
    },
    {
        "podcast_id": 221657,
        "title": "Cosmic Reader",
        "description": "<p>Welcome to Cosmic Reader, the podcast where we embark on cosmic journeys through the captivating world of science-related literature. In each episode, we delve into books published by science field authors, unlocking the mysteries of the universe through their insightful words.</p><p>In this podcast, we explore a diverse selection of books that cover a wide range of scientific disciplines, from astronomy and physics to biology and environmental science. Our cosmic bookshelf is filled with classics, modern bestsellers, and hidden gems, all carefully chosen to ignite your curiosity and deepen your understanding of the cosmos.</p><p>Join us as we read and review these literary wonders, uncovering the awe-inspiring ideas and discoveries shared by brilliant minds. We'll take you on an expedition through the pages of \"A Brief History of Time\" by Stephen Hawking, where the secrets of the universe unravel before your eyes. We'll dive into the enthralling world of astrophysics with Neil deGrasse Tyson's \"Astrophysics for People in a Hurry,\" making complex concepts accessible to all.</p><p>In each episode, we'll provide insightful takeaways, exploring the impact of these books on science and society. We'll introduce you to the visionary authors behind these works, shedding light on their contributions to the scientific community.</p><p>Whether you're a science enthusiast, an avid reader, or simply curious about the cosmos, Cosmic Reader has something for you. Our mission is to inspire wonder and appreciation for the intricacies of the universe, one page at a time.</p><p>Don't miss a single episode of Cosmic Reader; subscribe now and embark on a cosmic journey through the realms of science literature. Together, let's explore the universe and the boundless knowledge it holds.\"</p>",
        "language": "en",
        "author_name": "Ajith John",
        "slug": "cosmic-reader",
        "cover": "20230729_060745_2b16c4a5e1fb07e7069d7d9521b25010.jpg"
    },
    {
        "podcast_id": 223283,
        "title": "Tarkhan Tarlanzadeh",
        "description": "<p>Storytelling</p>",
        "language": "tr",
        "author_name": "Tarkhan Tarlanzadeh",
        "slug": "tarlanzadeh",
        "cover": "20230809_020800_7d1cc76c8bac13590ae795bc9767063a.jpg"
    },
    {
        "podcast_id": 224636,
        "title": "All About Area 51 in 2023",
        "description": "<p>On this channel we talk about everything related to conspiracy theories and also what I think about them. We also host guests with similar opinions to talk with them.</p>",
        "language": "en",
        "author_name": "BajjuBytes",
        "slug": "all-about-area-51-in-2023-episode-1",
        "cover": "20230818_050837_35e4a85b8d0ada0edd075b0520757932.jpg"
    },
    {
        "podcast_id": 224949,
        "title": "Подними голову",
        "description": "<p>Подкаст о Космосе и астрономии.</p>",
        "language": "ru",
        "author_name": "Иван Утешев",
        "slug": "upyourhead",
        "cover": "20230822_050827_e5486d2bc27696502109cd203740e1c5.jpg"
    },
    {
        "podcast_id": 225169,
        "title": "Titan",
        "description": "<p>Astronomy and astrophysics podcast. We will put the information in simple way follow us for more.</p>",
        "language": "ar",
        "author_name": "Marym fayyad ",
        "slug": "titan26",
        "cover": "20230821_080859_865157c180c4c307996981bd436c1040.jpg"
    },
    {
        "podcast_id": 225597,
        "title": " shifting subliminals under songs",
        "description": "<p>Shifting subs under songs that alr exist</p>",
        "language": "en",
        "author_name": "Sydney",
        "slug": "shifting-subliminals",
        "cover": "20230824_050822_b13f092ad79a28dc94fead3727596745.jpg"
    },
    {
        "podcast_id": 227063,
        "title": "Astronomy Wala",
        "description": "<p>Astronomy Wala</p>",
        "language": "en",
        "author_name": "Ankit Singh",
        "slug": "th3ankit",
        "cover": "20230903_040907_38aa1adc175d35ebb1ffb53ecb3e35eb.jpg"
    },
    {
        "podcast_id": 227245,
        "title": "Science, Actually Presents : The Nerd and the Scientist",
        "description": "<p>Astrophysicist Kovi Rose and scicommer Benjamin Salles love space, and bad puns, and are united in their shared belief that they're brilliantly funny.</p>",
        "language": "en",
        "author_name": "Science, Actually",
        "slug": "thenerdandthescientist",
        "cover": "20230905_010915_0fa3374dbb641ce75840de13a14568fd.jpg"
    },
    {
        "podcast_id": 228591,
        "title": "StarGuide: Your Map to the Universe",
        "description": "<p>Hey there stardust! Welcome to StarGuide: Your Map to the Universe! Ok, let's get this straight. We have SO many questions. Yet answers are limited, and so are resources. Chemistry, physics, and biology are the standard go-to science subjects taught extensively in schools, yet delving into astronomy is uncommon and restrained. But in an age dominated by space science, it is imperative that people have an understanding of it, and why not start this experience with some conversation? This podcast hopes to inspire everyone to never stop thinking about what lies there when you look up! We'll be delving into astronomy research, internship opportunities, interviews with professionals, and more! Stay tuned for more!</p>",
        "language": "en",
        "author_name": "SpaceTourist",
        "slug": "starguide",
        "cover": "20230914_030926_694ac6532300e53b9db8e43fa0ed2f1d.jpg"
    }
]