[
    {
        "podcast_id": 8889,
        "title": "The Aviation Spotters Podcast",
        "description": "The primary podcast for all things Aviation Photography! Made by an Aviation Photographer for Aviation Photographers!  This podcast will dive into the world of aviation photography by interviewing spotters from around the world, and getting to know them on a more personal level.  Question or profile suggestions for the show? Send an email to AvSpottersPodcast@gmail.com or, send a DM on twitter at Instagram @boispotter. Make sure to check out our Facebook page, the Aviation Spotters Podcast and feel free to send a message to us there as well! Know someone who you think will enjoy the show but doesn't have access to the normal streaming services? Point them to the Aviation Spotters Podcast Youtube page! ",
        "language": "en",
        "author_name": "Colin Moeser",
        "slug": "aviationspotterspodcast",
        "cover": "20200518_221202_a1d19061eef51feb430c86daab9d65a8.jpeg"
    },
    {
        "podcast_id": 12391,
        "title": "Planes on the Prairie",
        "description": "Planes on the Prairie is a podcast and YouTube channel all about delivering you information and discussions all about aviation, primarily focused on aviation in the Upper Midwest!",
        "language": "en",
        "author_name": "Max Sabin and Sam Kennedy",
        "slug": "planesontheprairie",
        "cover": "20200928_185241_0b902f993bb3b70ee4b9a3fd1cd78fe1.jpg"
    },
    {
        "podcast_id": 19359,
        "title": "Kaptan Baha",
        "description": "Havacılık konusunda ilginç bilgiler, haberler, dünyadan gelişmeler; ama sadece gerçekler.",
        "language": "tr",
        "author_name": "Bahadir Acuner",
        "slug": "kaptanbaha",
        "cover": "20210217_003106_b1b9890188b367570abe190606efbe7b.jpg"
    },
    {
        "podcast_id": 21614,
        "title": "Aviation Café Podcast",
        "description": "Join me Samer Sijbesma as I interview pilots and everyone else that is involved in aviation about their journey through the aviation world, their top tips and what their plans are for the future. ",
        "language": "en",
        "author_name": "Samer Sijbesma Hammoud",
        "slug": "pilot2pilot",
        "cover": "20211011_002945_a51d0498e7bba846a6054c0682b77834.jpg"
    },
    {
        "podcast_id": 30877,
        "title": "Let's Talk Drones",
        "description": "A podcast about anything and everything tailored to the interests of drone enthusiasts. The topics may not always include rotors and props, but they will always be hashed out by people in the drone community! You might laugh, you might cry, and you will always walk away having learned something new. ",
        "language": "en",
        "author_name": "Chris Fravel | The Drone Geek",
        "slug": "thedronegeek",
        "cover": "20221005_081012_0e74d6a64a952e6a2ba403c2347dc91d.jpg"
    },
    {
        "podcast_id": 57566,
        "title": "NSF Talks",
        "description": "NSF Talks is a brand new series to dive deeper than ever before into the complexity of Norwegian Spitfire Foundation, our mission, and the various of people that are involved in helping us achieve our goals.",
        "language": "en",
        "author_name": "Norwegian Spitfire Foundation",
        "slug": "nsftalks",
        "cover": "20210518_120559_22191fe1cefae5799678e8e31b45adc7.jpg"
    },
    {
        "podcast_id": 132596,
        "title": "FULL FLIGHT - WHITE NOISE by MW AERO",
        "description": "Experience full flights with all of it's sounds including passenger announcements, service and of course the engines.",
        "language": "en",
        "author_name": "MW AERO",
        "slug": "fullflightbymwaero",
        "cover": "20220606_060610_cdf7311c7e26141b5d3bbe988600dba0.jpg"
    },
    {
        "podcast_id": 136314,
        "title": "The Commuter Clause",
        "description": "Behind every flight deck door there’s a story to be heard! Join Pace and Rob as they team up with airline and corporate pilots, military aviators, freight dogs, air traffic controllers, and more! Their goal is to share an entertaining story of truth, triumph and tribulation in the aviation industry, and beyond. This is your chance to be part of a movement connecting fellow aviators, enthusiasts, and the flying public to make aviation more accessible to everyone. Let’s get into it!",
        "language": "en",
        "author_name": "Pace Zumoff and Rob Banta",
        "slug": "thecommuterclause",
        "cover": "20220623_100617_e50d4b2ac6cf1f2fb482d68f6213e33c.jpg"
    },
    {
        "podcast_id": 141125,
        "title": "Aviation Mentors",
        "description": "🚀 We are The Aviation Mentors, a twice weekly podcast dedicated to creating an amazing space where we aviators can hang out and enjoy a wide range of conversations about anything aviation. We're aviators, we're mentors, and we're entrepreneurs. Whether you're a student pilot, professional pilot, general aviation enthusiast, or just an AV Geek like us, this is the podcast for you!\n\n🌎 Join us weekly every Wednesday and Friday as we share our passion for flying!\n\nSponsored by Stratus Financial\nwww.stratus.finance",
        "language": "en",
        "author_name": "Brandon Martini & Carson Vasquez",
        "slug": "aviationmentors",
        "cover": "20220718_030745_3a6b582ca920a8277f4d231386091446.jpg"
    },
    {
        "podcast_id": 141782,
        "title": "Crester: A Purposeful Life, Driven By Endurance",
        "description": "Join Pat and Dan as they dive into the world of endurance sport, Naval Aviation and whatever happens to grab their attention this week!\n\nEmail any questions or feedback to cresterpodcast@gmail.com.",
        "language": "en",
        "author_name": "Pat and Dan",
        "slug": "crester",
        "cover": "20220721_080754_afc37cbcf16f4684bd62811da653357a.jpg"
    },
    {
        "podcast_id": 143828,
        "title": "Questo Podcast",
        "description": "E' questo Podcast.",
        "language": "it",
        "author_name": "Zito Pressafieno",
        "slug": "questopodcast",
        "cover": "20220801_030832_c2e225aa61bec74affb7a4b931603a0a.jpg"
    },
    {
        "podcast_id": 147108,
        "title": "SocialFlight Live!",
        "description": "SocialFlight Live! is an hour of fascinating discussion with some of the most inspiring people in aviation.  Previous guests have included Actor Treat Williams, FAA Surgeon General Susan Northrup, AOPA President Mark Baker, EAA President Jack Pelton, NASA Astronauts David Williams and John Herrington, Cirrus Aircraft Founder Dale Klapmeier, Rod Machado, Barry Schiff, Martha King, Dan Schwinn, SR-71 Pilots, Michael Goulian, Rob Holland, Julie Clark, Kirby Chambliss, Kevin Lacey (Airplane Repo), Ariel Tweto (Flying Wild Alaska), Mikey McBryan (Ice Pilots) and many more.  \n\nRegister for our LIVE VIDEO WEB SHOW at www.SocialFlightLive.com.  It airs every Tuesday evening at 8pm ET. ",
        "language": "en",
        "author_name": "Jeff Simon",
        "slug": "socialflight",
        "cover": "20220817_060855_ea56b5e812e8e5c12fbd6f0f8fb4d0fc.jpg"
    },
    {
        "podcast_id": 154796,
        "title": "Skiesnbeyond Radio",
        "description": "Welcome to Skiesnbeyond Radio! Where we talk about everything from planespotting to tips and tricks, bad experiences, and even good ones! Come on in and listen to the weekly rant on one of the fastest-growing photography genres out there!",
        "language": "en",
        "author_name": "Luke S.",
        "slug": "skiesnbeyondradio",
        "cover": "20220920_060918_5baf43814443cf4e7fb12cf726aa1062.jpg"
    },
    {
        "podcast_id": 162873,
        "title": "Well Travelled with ATPI",
        "description": "The last three years have emphasised the importance of open dialogue in the effort to restore the business travel industry. In this new series, ATPI brings together industry experts with the people who are working hard to keep-up the return of travel.",
        "language": "en",
        "author_name": "ATPI",
        "slug": "the-atpi-podcast",
        "cover": "20221031_101038_888531930a1775c65ff84e0ec252f9df.jpg"
    },
    {
        "podcast_id": 184204,
        "title": "Keys To The Jet",
        "description": "<p>A podcast about being a Military Aircraft Maintainer, designed by Aircraft Maintainers. A place where stories and memories of being in Aircraft Maintenance can be shared with all Maintainers from every branch. Join us where we plan to share the good, the bad, and the ugly of being in Military Aviation Maintenance in a lighthearted and goofy way as only maintainers can. A place where we will also share resources for Veterans and Active Duty each and every show to do our part in helping our country's war fighter both past and present.</p>",
        "language": "en",
        "author_name": " Red, Rhino, Black Beard, and Fab",
        "slug": "keys-to-the-jet",
        "cover": "20230129_010132_7700cefaecf8789dd2753c6bbccdc96f.jpg"
    },
    {
        "podcast_id": 191119,
        "title": "Aviatrix Airwaves",
        "description": "<p>Taking the aviation industry to new heights…</p><p>Welcome to Aviatrix Airwaves - hosted by Captain Georgie Arnold.</p><p>Growing up in the aviation industry, Georgie always cherished the stories her role models that raised her would tell.</p><p>Georgie felt that these stories needed to be told and the voices of legendary aviators across our nation needed to be heard….which is when she decided that a poddy would be the perfect place!</p><p>GET SOCIAL:</p><p>IG, Facebook, linkedin - @aviatrix_australia</p><p>Your Host:</p><p>IG- @georgie_arnold</p><p>Tik Tok - @georgiearnolddd</p><p>Have a story you think needs to be heard?</p><p>Contact us: <a href=\"mailto:info@aviatrix.com.au\">info@aviatrix.com.au</a></p><p><a href=\"http://www.aviatrix.com.au\">www.aviatrix.com.au</a></p>",
        "language": "en",
        "author_name": "Georgie Arnold",
        "slug": "aviatrixairways",
        "cover": "20230220_100206_667948340b7172cfa0ff957e2b8baec7.jpg"
    },
    {
        "podcast_id": 191849,
        "title": "From Flight Level 320: An Airline Pilot Podcast",
        "description": "<p>Welcome to 'From Flight Level 320', the airline pilot podcast from real world pilot and flight simmer 320 Sim Pilot! In this podcast we will discuss real world aviation, flight simulation, airline flying and anything in between. I have over a decade of airline piloting experience and I will be joined by guests including other real world airline pilots as well as experienced simmers and more!</p><p>YouTube channel: <a href=\"https://www.youtube.com/320simpilot\">https://www.youtube.com/320simpilot</a></p><p></p><p></p>",
        "language": "en",
        "author_name": "320 Sim Pilot",
        "slug": "fromflightlevel320",
        "cover": "20230223_030251_9b8fc582ac40447c505e1fb0e47749d0.jpg"
    },
    {
        "podcast_id": 192804,
        "title": "Radio Runway",
        "description": "<p>4 mates that share a love for all things aviation discuss the week's events across the industry, with plenty of laughs along the way.</p>",
        "language": "en",
        "author_name": "Tom, Nick, Christos and Ross",
        "slug": "radiorunwaypod",
        "cover": "20230227_060228_4b8add8530c02a96ed896d0bc4bd86b2.jpg"
    },
    {
        "podcast_id": 200300,
        "title": "Flightime",
        "description": "<p><strong>Flightime - Creating a platform for Our Voices to be heard and shared in the aviation and aerospace profession, industry, and community with a focus on safety, equality, honor, accountability, and leadership. Let’s not wait any longer to showcase our talent, contributions, participation, and experiences in aviation and aerospace. Malcolm X, “The future belongs to those who prepare for it today.” </strong></p>",
        "language": "en",
        "author_name": "Quentin D Miles",
        "slug": "flightime",
        "cover": "20230330_050326_b3c199dd19e98f9571a86850e69fd341.jpg"
    },
    {
        "podcast_id": 226318,
        "title": "Introduction To Aerospace Industry & Careers in India | Brahmastra Space Podcast | Episode 1",
        "description": "<p>Are you fascinated by the boundless skies and the mysteries of outer space?</p><p>Are you curious about the exciting world of aerospace and the incredible opportunities it offers? Look no further!</p><p>In Episode 1, we dive deep into the \"Introduction to the Aerospace Industry &amp; Careers in India.\"</p><p>Join us as we unravel the layers of the aerospace industry, from its inception to the cutting-edge technologies that propel us to the stars today. Whether you're a space enthusiast, an aspiring engineer, or simply curious about the cosmos, this episode will take you on an exhilarating journey through the realms of aerospace. 🌌</p><p>Discover the historical milestones that paved the way for modern aviation and space exploration. 🛰️ Explore the dynamic landscape of the Indian aerospace sector and its pivotal role in shaping the future. 👩‍🚀</p><p></p><p>Hear from industry experts who share their insights on the diverse career paths available, from aeronautics to astronautics. 🔬 Gain valuable tips on how to prepare for a career in aerospace, including educational pursuits and skill development. At Brahmastra Aerospace, we're passionate about igniting the spark of curiosity and knowledge in the minds of our listeners.</p><p></p><p>Whether you're a student considering your career options or a seasoned professional looking to pivot, this podcast is your compass to navigate the captivating world of aerospace.</p><p></p><p>Tune in to Episode 1 now and embark on a voyage that will expand your horizons and inspire your aspirations.</p><p></p><p>Don't forget to like, subscribe, and hit the notification bell to stay updated on future episodes that will delve even deeper into the cosmos! <a href=\"https://www.youtube.com/hashtag/aerospaceexploration\">#AerospaceExploration</a> <a href=\"https://www.youtube.com/hashtag/aerospacecareers\">#AerospaceCareers</a> <a href=\"https://www.youtube.com/hashtag/brahmastraaerospacepodcast\">#BrahmastraAerospacePodcast</a> 🌠🎙️</p>",
        "language": "en",
        "author_name": "Subash P Kuppusamy",
        "slug": "brahmastraspace",
        "cover": "20230829_030811_bca4954dc4be8c7f863702955fea5398.jpg"
    }
]