[
    {
        "podcast_id": 14402,
        "title": "The Otto Kramm Program",
        "description": "A place to discuss the human experience.",
        "language": "en",
        "author_name": "Otto Kramm",
        "slug": "okp",
        "cover": "20201109_193435_0ec14a31cf992177073de368cc4f18df.jpg"
    },
    {
        "podcast_id": 20923,
        "title": "26 Weeks of Awakening ",
        "description": "Emily is a Buddhist who has been discovering her Buddha Nature and the path of awakening since 2006. 26 Weeks of Awakening is about discovering the basic human suffering that exists in life, becoming aware of where and why it exists, and practicing staying present despite the appearance of suffering. In 26 Weeks Emily will guide you on her self-discovery and practice of becoming a Bodhisattva and introduce you to the teachers and teachings that have been profound on her journey. \n\nEmily is happily a former  executive in corporate America and former business owner with a BS in Applied Psychology from Regis University and a candidate in the Master of Science Psychology program at Arizona State University. Emily is a meditation instructor and wellness coach, and has been a nutrition instructor and personal trainer. She is also formerly incarcerated by the Federal Bureau of Prisons at the Phoenix Satellite Camp and thinks this is a very important aspect of her life and training experience. She learned a lot about people, the openness and beauty of all people, and became awakened to the sad state of affairs in our criminal justice system in the USA.  Emily lives with her husband and other family on a farm in Eastern Colorado. She has four grown children. ",
        "language": "en",
        "author_name": "Emily Strunk",
        "slug": "omliving",
        "cover": "20201228_214548_bd955c34d53b8255bf2553644e00e0a9.jpg"
    },
    {
        "podcast_id": 61142,
        "title": "Present Moment! Podcast",
        "description": "Thank you so much for being here and for listening :D ! I hope these ideas allow yourself to understand the importance of your feelings. The more we understand our relationship with our mind, the more successfully we navigate our lives and overcome challenges—and I am learning every day!",
        "language": "en",
        "author_name": "Tiffany Nguyen",
        "slug": "presentmoment",
        "cover": "20210606_015629_8843956cc5915804a0e6d6673bd81a73.jpg"
    },
    {
        "podcast_id": 109959,
        "title": "The Space of Possibility",
        "description": "<p>The Space of Possibility is a collection of free meditations by <a href=\"https://johndriggs.org\">John Driggs</a>, host of the <a href=\"https://podcasts.apple.com/us/podcast/love-understanding/id1657495978\">Love &amp; Understanding</a> podcast. Cultivate insight and wisdom by examining directly the truth of your own experience.</p><p>Know yourself. Love yourself. Embody yourself fully. Learn to walk your own path in peace.</p><p><a href=\"https://spaceofpossibility.org\">https://spaceofpossibility.org</a></p>",
        "language": "en",
        "author_name": "John Driggs",
        "slug": "johndriggs",
        "cover": "20230401_100406_b8dfb80666f5edfc69f0cbc22aa342ea.jpg"
    },
    {
        "podcast_id": 115950,
        "title": "Nature of Mind Podcast ",
        "description": "The mind is your most valuable asset and our most dangerous possession. It can be amazingly creative or terrifyingly destructive. Every experience we have, or could possibly have, is mediated through the mind. The health of our mind is the health of our life. From a Buddhist point of view our greatest danger is not realising the potential of our mind, and not finding ways of living out that potential.\n\nA season of events featuring prominent psychologists, neuroscientists, and meditators; including interactive seminars, meditation masterclasses, and retreats. From theory, to reflection, to practice: join us in exploring the Nature of Mind.",
        "language": "en",
        "author_name": "Nature of Mind",
        "slug": "natureofmind",
        "cover": "20220317_110326_1df45cd5c6283d36377fee693f04718d.jpg"
    },
    {
        "podcast_id": 139957,
        "title": "Dhammasomthob",
        "description": "Broadcast Dhamma core values to help enlighten humanity.",
        "language": "en",
        "author_name": "Dhamma Somthob",
        "slug": "dhammasomthob",
        "cover": "20220712_010730_1a6f62d30f72574d9be5453bfe201f90.jpg"
    },
    {
        "podcast_id": 164103,
        "title": "Carla Gianotti - Letture e Meditazioni",
        "description": "Carla Gianotti Tibetologa Autrice Istruttrice di Meditazione",
        "language": "it",
        "author_name": "Carla Gianotti",
        "slug": "carla-gianotti",
        "cover": "20221030_101049_d6bcd8c04322f2cb237cf9c21db50ec3.jpg"
    },
    {
        "podcast_id": 179057,
        "title": "EL LADRÓN DE TU FELICIDAD VIVE CONTIGO. \"CÓMO LIBERARSE DE LAS EMOCIONES NEGATIVAS\"",
        "description": "\"Ninguno de nosotros quiere sufrir, tampoco los animales ni otros seres en otros reinos de los que habla el budismo. Ningún ser quiere experimentar sufrimiento pero el sufrimiento surge y, en todos los casos, es el resultado de las emociones negativas llamadas engaños. Desde el punto de vista del budismo, si queremos felicidad y no queremos sufrimiento, tenemos que trabajar con los engaños, así que el trabajo principal que tenemos que hacer es con nuestra mente\".\nVen. Gueshe Tenzing Tamding (Monasterio Chu Sup Tsang, España)\n\nCada jueves de 18:00 a 20:00 (hora española peninsular) enseñanzas de Darma gratuitas con Tenzing Palmo, discípula del Ven. Lama Gueshe Tenzing Tamding, monja del Monasterio Chu Sup Tsang (Ourense, Galicia, España), vamos viendo qué emociones negativas nos dominan, cómo surgen, cómo disminuirlas y finalmente eliminarlas. El objetivo es alcanzar un estado de felicidad permanente desde el que podamos ayudar a todos los seres a salir de su sufrimiento. \n\nSi quieres conectarte a estas enseñanzas online en directo todos los jueves por videoconferencia, ponte en contacto con nosotros a través del mail: tenzingpalmo2015@gmail.com indicando tu nombre y desde qué país te conectarás.\n\nMonasterio Budista Chu Sup Tsang\nVentoselo de Beariz, 32455 San Amaro, Ourense, Galicia, España\nToda la info de Retiros y actividades en la página web: www.fundacionchusuptsang.org\n",
        "language": "es",
        "author_name": "MONASTERIO CHU SUP TSANG",
        "slug": "monasteriochusuptsang",
        "cover": "20230108_060121_432d51edda8989f3ac9321e6dc0041fc.jpg"
    },
    {
        "podcast_id": 182223,
        "title": "Reo and Theo Talk recovery",
        "description": "<p>Reo and Theo talk about the madness, hope and confusion of recovery.</p>",
        "language": "en",
        "author_name": "Reo",
        "slug": "reoandtheo",
        "cover": "20230301_040346_7d17ff88444af135bf9cfa350d85a3f4.jpg"
    },
    {
        "podcast_id": 199969,
        "title": "Buddhism",
        "description": "<p>Let's Learn Buddhism in simple English</p>",
        "language": "en",
        "author_name": "Buddhisminenglish",
        "slug": "buddhisminenglish",
        "cover": "20230329_050324_835949381e76d8328c72f1589f73cc40.jpg"
    },
    {
        "podcast_id": 209263,
        "title": "Path to Happiness",
        "description": "<p>Happiness is undoubtedly the most desirable state of being we all strive to achieve. Thus, every human being is continuously engaged in one experiment after the other in their own ways to experience new ways to attain fulfilling happiness and increase its intensity for a longer-lasting effect. Therefore, one of life’s most rewarding endeavours has to be to spend time discovering, exploring and studying what the Buddha – the foremost authority on the mind, expounded on this topic. Join us on this series as we make a somewhat unorthodox exploration into the ‘Philosophy of Happiness’.</p>",
        "language": "en",
        "author_name": "Ministry Of Nirvana",
        "slug": "ministry-of-nirvana",
        "cover": "20230515_050532_f0de2436c1e774e1bc557f81ccbf644a.jpg"
    },
    {
        "podcast_id": 214545,
        "title": "Talks by Lola McDowell Lee",
        "description": "<p>This is a series of newly digitized talks by spiritual teacher, Lola McDowell Lee, spanning two decades—from the early Seventies through the Nineties.</p><p>Lola was a Zen Roshi whose Rinzai lineage included Doctor Henry Platov and renowned Zen master, Shigetsu Sasaki. Lola was a religious scholar as well as an ordained Christian minister.</p><p>While the talks are focused mainly on Zen and Buddhism, Lola drew on many spiritual traditions—including those of Jesus, Plato, Lao-Tzu, the Hindu Vedas, Meister Eckhart and Gurdjieff.</p><p>If you find Lola’s talks valuable, more will be posted in days to come.</p>",
        "language": "en",
        "author_name": "I & A Publishing",
        "slug": "ing-publishing",
        "cover": "20230817_120814_85fafd61824aa95fd155cb2b0c194620.jpg"
    },
    {
        "podcast_id": 218357,
        "title": "Penguin Pebbling Podcast",
        "description": "<p>Two AuADHD adult students discuss neuroscience, Tibetan Buddhism, the Racist history of New Age Spirituality, Neuroscience's intersection w/ Neurodivergence, Anti-Fascism, as well as Tiktok Shit-posting and other Elder Punk/Goth Nonsense. Kelly is a Graphic design artist and student of Neuroscience, Meryle is a Voice actor/Singer and student of Vajrayana Buddhism and Tibetan Language. Join them as they share ideas and info-dumping the same way that Penguins share pretty, shiny stones w/ their favourite Penguin friends.</p>",
        "language": "en",
        "author_name": "Penguin Pebbling Podcast",
        "slug": "penguin-pebbling-podcast",
        "cover": "20230707_030713_47ca81d44d3f1423aa5ee41bd62095e2.jpg"
    },
    {
        "podcast_id": 221197,
        "title": "Tibetan Medication",
        "description": "<p>I will be teaching you how to meditate through the teaching of the Tibetan Buddhism.</p>",
        "language": "en",
        "author_name": "Michael Rehfeldt",
        "slug": "rehfeldttw",
        "cover": "20230726_050707_dd89be915d5c6c0f608d40b9f5d52e32.jpg"
    },
    {
        "podcast_id": 222041,
        "title": "សមាទិដ្ឋិ",
        "description": "<p>គំនិត ទស្សនៈ ដែលត្រឹមត្រូវតាមបែបបទធម្មជាតិ មានប្រយោជន៍ដល់មនស្ស និងសង្គម</p>",
        "language": "en",
        "author_name": "Nothing",
        "slug": "right-undersanding",
        "cover": "20230801_020837_d511f07442f1c0427f1dc55d8b7b507d.jpg"
    },
    {
        "podcast_id": 223831,
        "title": "Thầy Thích Trúc Thái Minh",
        "description": "<p>Tổng hợp các bài pháp thoại</p>",
        "language": "vi",
        "author_name": "Thầy Thích Trúc Thái Minh",
        "slug": "thichtructhaiminh",
        "cover": "20230813_090854_1ed16243be5448c56955ae670776ba12.jpg"
    },
    {
        "podcast_id": 226381,
        "title": "ທຳເວດສັນຕະຣະ Vessantara Jātaka",
        "description": "<p>ᨵᨾ᩠ᨾ᩼ᩅᩮᩔᨶ᩠ᨲᩁ</p>",
        "language": "th",
        "author_name": "ຄຳຕານ ທຳມະວົງ",
        "slug": "vessantara",
        "cover": "20230829_020807_743da7c5302e935b3edfac0fa2b9f864.jpg"
    },
    {
        "podcast_id": 228892,
        "title": "หลวงปู่สาคร ธัมมาวุโธ ป12-640617 นักวิทยาศาสตร์คนแรกของโลก",
        "description": "<p>12-640617 นักวิทยาศาสตร์คนแรกของโลก</p>",
        "language": "th",
        "author_name": "หลวงปู่สาคร ธัมมาวุโธ",
        "slug": "640617-1stscientist",
        "cover": "20230916_030918_c23799f132eaeef27dec8d1a54d32dcb.jpg"
    }
]