[
    {
        "podcast_id": 1278,
        "title": "Talent Experts",
        "description": "Análisis y tendencias de Talento Humano",
        "language": "es",
        "author_name": "Kudert",
        "slug": "talenttoday",
        "cover": "5d323e23d6f5c.png"
    },
    {
        "podcast_id": 3770,
        "title": "IDpodcast",
        "description": "#IDpodcast is brought to you by IDnow and Roger Tyrzyk.\nWe want to make content fun for the Gaming and Financial Services Industry.",
        "language": "en",
        "author_name": "Roger Tyrzyk",
        "slug": "idpodcast",
        "cover": "20201126_141915_fcc7b56ecffeaa508e717cbd19fe3913.jpg"
    },
    {
        "podcast_id": 7591,
        "title": "The Cristina Briseno Show",
        "description": "a place to grow, to share and to learn. ",
        "language": "en",
        "author_name": "Cristina Briseno",
        "slug": "cristinabriseno",
        "cover": "20200409_222504_8f6b5a1aaceebd6e95c8c88c45b78f03.jpeg"
    },
    {
        "podcast_id": 7766,
        "title": "The VC Podcast",
        "description": "Everything to do with Tourism in Ireland based in Carlingford, Co Louth, Ireland. \nI will be talking to Tourism businesses on how they are coping with Covid19, plans for the future and some tips for business. \nTourism is changing and the key is to change with it, we aim to give our listeners an insight into successful businesses which in turn may help them. ",
        "language": "en",
        "author_name": "Richard Brennan",
        "slug": "thevcpodcast",
        "cover": "20200507_211210_564df79c2bf0bf8564128ca519e2c1b7.jpeg"
    },
    {
        "podcast_id": 7797,
        "title": "The Moses and Methuselah Podcast",
        "description": "A weekly discussion on developments in the financial markets, and what they mean for governments, investors and tax payers. Hosted by Jonathan Davis and Peter Seilern. ",
        "language": "en",
        "author_name": "Jonathan Davis & Peter Seilern",
        "slug": "mosesandmethuselah",
        "cover": "20200415_103929_7bc49dd1df3a59eb2376e0d8a0090fb4.jpeg"
    },
    {
        "podcast_id": 8122,
        "title": "MarketTalk Podcast",
        "description": "The MarketTalk Podcast (sponsored by WealthPress) is where we believe if you’re investing uninformed, you’re screwed! Get the inside scoop on what’s driving the markets day-to-day and what that means for your money, all in just 15 minutes.\n\nYour host is Roger Scott, is an ex-hedge fund trader with over 25 years of trading experience who turned $20 million into over $900 million. \n\nHe is used to making money in any type of market. \n\nHe'll walk you through what the headlines really mean to your portfolio and uncover opportunities no one else is talking about.\n\nYou'll also hear from other world-renowned traders and investors that only he has access to.\n\nSubscribe now and stay on top of the market in just 15 minutes a day.",
        "language": "en",
        "author_name": "WealthPress",
        "slug": "markettalkpodcast",
        "cover": "20200424_035539_1609d7f7b7c5c7b464f2cb7bf11d717f.jpeg"
    },
    {
        "podcast_id": 8864,
        "title": "Startup Talks",
        "description": "Mariano Pamplona y Marco Martinez O'Daly discuten temas y comparten ideas de emprendimiento. Ahora con invitados de lujo.",
        "language": "es",
        "author_name": "Mariano Pamplona y Marco Martinez",
        "slug": "startuptalks",
        "cover": "20200518_020621_7f0f5faa04514b01fd04d8987ecdb627.jpeg"
    },
    {
        "podcast_id": 9362,
        "title": "ABC Noticias",
        "description": "Escucha el resumen de las noticias más relevantes del día en tu asistente de audio o servicio de podcast favorito.  Visita: abcnoticias.mx para toda la información en tiempo real.",
        "language": "es",
        "author_name": "ABC Noticias MX",
        "slug": "abcnoticiasmx",
        "cover": "20200604_160229_a39604c9a32544a400f0e36165ad9148.jpeg"
    },
    {
        "podcast_id": 9587,
        "title": "Smart Trader",
        "description": "\nNavigating the global outlook with the experts in oil trading and marine risk management\n\n",
        "language": "en",
        "author_name": "New Markets Media",
        "slug": "inatech",
        "cover": "20200629_091046_20e6e681c806947ab25b61c911751078.jpg"
    },
    {
        "podcast_id": 9714,
        "title": "Parámetro Informativo con Sareis Pineda Troch",
        "description": "<p>Con 41 años de transmisión en Panamá, Parámetro Informativo es un espacio radial de temas de actualidad nacional e internacional, dirigido por SAREIS PINEDA TROCH, junto a un selecto grupo de panelistas e invitados líderes y protagonistas del momento; quienes brindan información confiable de temas socioeconómicos, políticos, culturales y educativos.</p>",
        "language": "es",
        "author_name": "Sareis Pineda Troch",
        "slug": "parametroinformativo",
        "cover": "20200616_201359_ec973ededb8cbf39a126ac6822f84dbe.jpeg"
    },
    {
        "podcast_id": 11725,
        "title": "All Night Gamers Podcast",
        "description": "Welcome to the All Night Gamers Podcast! We are a group of Nintendo loving Gamers and just wanted a place to talk and discuss things going on in the world of Videogaming! We will cover weekly news, including rumors and announcements, as well as some more personal things, such as our currently playing games and any recent collector pickups! We will post weekly podcasts on Wednesday at 7AM CST. Find us where ever you listen to your podcasts. ",
        "language": "en",
        "author_name": "Grant Darling",
        "slug": "angcast",
        "cover": "20200825_214717_14baf77a32c372c7e5e53bcac1e07226.jpg"
    },
    {
        "podcast_id": 11951,
        "title": "BBRO BeetCast ",
        "description": "An insight into the world of sugar beet production in the UK, hosted by the British Beet Research Organisation (BBRO).  This monthly production provides an overview of the industry with timely updates and future forecasts to support sugar beet growers.  Hear from BBRO scientists and the field team, plus grower updates and industry comment.",
        "language": "en",
        "author_name": "Francesca Broom",
        "slug": "bbrobeetcast",
        "cover": "20200901_162234_0b818c23274552fcfb60fcf158b99ba5.jpg"
    },
    {
        "podcast_id": 12162,
        "title": "10 Things You Should Know about Stakeholder Capitalism",
        "description": "In 2019, the Business Roundtable announced that the purpose of business was no longer to maximize profits for shareholders.  The new purpose of business would be to maximize value for stakeholders.  While the announcement was applauded by many, charges of hypocrisy quickly followed as the practices of many Business Roundtable member companies suddenly seemed to contradict the new more egalitarian purpose they had proclaimed.\n\nA year later, if anything is becoming clear, it is that what the world is coming to know as “stakeholder capitalism”, lacks a clear definition against which to assess the performance of a firm, or even an economy.\n \nThis lack of definition is not the result of a lack of attempts.  For years a wide variety of thought leaders and pioneering practitioners have been refining models and frameworks to define a new paradigm for business.  But none has broken into the mainstream.\n \nIn response to this situation, a team comprised of members from a variety of organizations working within the “business as a force for good” movement attempted to create a common definition of the end-state they were all working to achieve.  Their work resulted in a brand-agnostic framework, endorsed by all, that identified six essential competencies of a business in the new paradigm.\n \nIn 10 binge-able episodes, this podcast will introduce, illustrate and popularize an ambitious and actionable definition for stakeholder capitalism.\n \nProducers/Hosts\nAmanda Kathryn Roman is a life-long convener and builder of infrastructure to scale a wide variety of movements you’ve heard of, and some you have not.  Most recently she was the Chief Innovation Office for Conscious Capitalism where she joined the frenzy of activity happening all around the world to catalyze an expanded paradigm of capitalism.  In 2018, she and Nathan Havey co-founded the year-long, comprehensive certification program for consultants of Conscious Capitalism\n \nNathan Havey has been a leader of, participant-in content provider for, and strategic consultant to many of the major entities in the “business as a force for good movement”.  A host and storyteller by training and passion, he has produced powerful live storytelling experiences in more than a dozen US cities and he wrote and directed the upcoming feature documentary Beyond Zero, and has been learning and refining a library.\n \nNathan and Amanda believe that each of the stories in this mini-series should be legend in business circles, and yet they are continually shocked to meet people, including some of the celebrity-status thought leaders and pioneering practitioners in their circles are unaware that these stories exist.  That must change.",
        "language": "en",
        "author_name": "Institute for Corporate Transformation",
        "slug": "stakeholdercapitalism",
        "cover": "20200908_024245_de851d2a5bf6438e1107598d774c678f.jpg"
    },
    {
        "podcast_id": 12975,
        "title": "XKwadraat Ambassadeurs",
        "description": "Verhalen die inspireren\n",
        "language": "nl",
        "author_name": "Wivina Briers",
        "slug": "geertmotmans",
        "cover": "20201001_125330_5710bdfc21607f79cf7f78111133df9f.jpg"
    },
    {
        "podcast_id": 13448,
        "title": "BPA UNIVERSITY PODCAST",
        "description": "BPA Worldwide, the global provider of assurance, brings you BPA UNIVERSITY podcasts, a collection of interviews and Q&As with media industry experts on a variety of topics that are important to you. Check them out and let us know what you think.",
        "language": "en",
        "author_name": "Glenn Hansen",
        "slug": "bpauniversity",
        "cover": "20201014_153218_f1db244d11756390804f814231d73e75.jpg"
    },
    {
        "podcast_id": 13486,
        "title": "CoinCash Hodler Magazin  ",
        "description": "A CoinCash Hodler Magazin úgy épül fel, hogy megkapj minden hasznos információt, amit egy kripto piacon jártas befektetőnek kell. A bitcoin árfolyamot, macro elemzést, az elmúlt időszak legfontosabb projektjeit és témáit, a magyar kriptoközösség legismertebb szakértőivel hozzuk el neked. 📈 \n\n",
        "language": "hu",
        "author_name": "CoinCash",
        "slug": "coincashweekly",
        "cover": "20220918_120952_872eb30096bfb5ee2743a99d385446ba.jpg"
    },
    {
        "podcast_id": 14155,
        "title": "Rocksalt Cafe Podcast",
        "description": "Gain a real insight into the day-to-day workings of one of Ireland's top lifestyle cafes, Rocksalt.\nHear interviews with our team, our customers and local heroes. We aim to give you a real feel of the highs, lows, challenges and success stories of operating our café.\n\nWhether you're interested in business, culture, coffee or all things food, this is the podcast for you!\nBe sure to subscribe to the podcast and leave us a review! We'd love to know what you think. Enjoy!\n\nKeep up to date with us on Instagram:\n@caferocksalt\n@rocksalt_dundalk\n\nwww.RockSaltCafe.ie",
        "language": "en",
        "author_name": "Emily Mcloughlin",
        "slug": "rocksaltcafepodcast",
        "cover": "20201102_144817_db8722f91bbc0d548fbaac7991fa347a.jpg"
    },
    {
        "podcast_id": 14362,
        "title": "Ponto de Fuga",
        "description": "E tu? Como é que vês?",
        "language": "pt-pt",
        "author_name": "Carolina Zamith & João Mota",
        "slug": "ponto-de-fuga",
        "cover": "20201108_142842_007e06bc5013853233b3d34ef9e176df.jpg"
    },
    {
        "podcast_id": 15292,
        "title": "Property Turkey Podcast",
        "description": "The world's only podcast on Turkish real estate from the minds of Turkey's #1 real estate consultancy. From the city center of Istanbul to luxury villas on the coast of the Mediterranean Sea and beyond, the Property Turkey Podcast gives foreigners vital information on the real estate market in Turkey, including news, opinions, advice, guides, and more to help navigate this broad new horizon on the world's real estate scene.",
        "language": "en",
        "author_name": "Property Turkey",
        "slug": "propertyturkey",
        "cover": "20201123_125457_8e74166544bc872854aacb0c955baed5.jpg"
    },
    {
        "podcast_id": 15772,
        "title": "Des Briques et Des Brocs",
        "description": "Des Briques et des Brocs a été créé pour échanger avec des professionnels de l’immobilier sur leur parcours, leurs expériences, les thématiques du moment et les fondamentaux du secteur.\nLe but de tout ça ? Simplement vous donner accès à un maximum de savoir et de connaissance sur le secteur.\nBonne écoute !",
        "language": "fr",
        "author_name": "Arnaud Romanet-Perroux",
        "slug": "desbriquesetdesbrocs",
        "cover": "20201127_133551_75adbdf1a00e8cff1ea206ddfcef49b3.jpg"
    },
    {
        "podcast_id": 23026,
        "title": "De Absolute Motors Podcast",
        "description": "Absolute Motors personaliseert, verbetert en beschermt auto’s\nuit het topsegment.",
        "language": "nl",
        "author_name": "Absolute Motors",
        "slug": "absolutemotors",
        "cover": "20211216_121257_6abe50bcc6323371048c2efb74e584ea.jpg"
    },
    {
        "podcast_id": 23657,
        "title": "(பிசினஸ்) கதை கேக்கலாம் வாங்க....",
        "description": "<p>Inspiring business stories</p>",
        "language": "ta",
        "author_name": "TiE Chennai",
        "slug": "business",
        "cover": "20210415_100137_8afb432d49c927e08a8619430af2d929.jpg"
    },
    {
        "podcast_id": 26063,
        "title": "Northern Business Podcast",
        "description": "<p>Take yourself off mute with host Graham Robb to discuss a different theme in the world of business every episode.</p>",
        "language": "en",
        "author_name": "Business Unmuted",
        "slug": "businessunmuted",
        "cover": "20230510_020547_e593a4a3b6599b606e0a8815df1d2244.jpg"
    },
    {
        "podcast_id": 26600,
        "title": "Frecuencia Resiliencia",
        "description": "Ciberataques, huracánes devastadores, pandemia y otros recién eventos mayores nos han recordado que de un momento a otro, todo puede cambiar. La resiliencia se presenta como una palabra mágica ante las crisis que han seguidos estos desastres. Pero como profesional de resiliencia organizacional, estoy convencido que debemos aprender más sobre la resiliencia para entender lo que puede significar para nosotros, especialmente para las empresas, comunidades y gobiernos, y como nos puede ayudar para enfrentar y superar situaciones dramáticas, sin “trucos de magia”. \n\nSoy su host, Timothé Graziani, Gerente General de Capresiliencia y les deseo una cordial bienvenida en Frecuencia Resiliencia. \n\nFrecuencia Resiliencia es el nuevo podcast donde hablaremos con pasión, profesionalismo y diversión de los dominios y temas actuales relacionados con la Resiliencia Organizacional. Sean profesionales de la continuidad del negocio, la seguridad de la información o de la gestión de riesgos, les esperamos aquí por un momento especial con Félix, Pedro y muchos más expertos, quienes animarán de forma regular esta nueva emisora.",
        "language": "es",
        "author_name": "Timothe Graziani",
        "slug": "frecuenciaresiliencia",
        "cover": "20210122_161021_e86e0348ed9957ae1f9dfe489af7649f.jpg"
    },
    {
        "podcast_id": 27380,
        "title": "Asuntos Varios",
        "description": "Conversaciones casuales donde analizamos los sucesos del sector empresarial y financiero.  Buscamos explorar de manera ligera como se relacionan los mercados y eventos económicos globales y locales a nuestras vidas y como navegarlos.",
        "language": "es",
        "author_name": "Pineal Asesores",
        "slug": "pineal",
        "cover": "20210308_231416_ac3e00fdc4f0765bc2fb35cce014246d.jpg"
    },
    {
        "podcast_id": 27568,
        "title": "SiGMA Spotify",
        "description": "SiGMA Spotify brings you all of our most engaging interviews in an easy-to-listen to format. Whether you are driving, working, walking or relaxing, the SiGMA podcast will bring you the most engaging interviews with the best of the best in the industry. Our podcast stream covers interviews from Executive Interviews, iGaming, Block Chain, Crypto, Deep Tech and Med Tech from all around the world. ",
        "language": "en",
        "author_name": "SiGMA Group",
        "slug": "sigma",
        "cover": "20210126_123653_a9425b88677e419be620b8aaf4c8cf75.jpg"
    },
    {
        "podcast_id": 29313,
        "title": "Buy a house - Sell a house",
        "description": "Market trends and real estate news as well as up to date tips and best practices for buying or selling real estate.",
        "language": "en",
        "author_name": "Marcus Tuttle",
        "slug": "buyahousesellahouse",
        "cover": "20210416_013951_1ce09db8e7b6de9dfbc211e757771e7a.jpg"
    },
    {
        "podcast_id": 29421,
        "title": "Právo k Ranní Kávě | Právo&Byznys | Právní novinky",
        "description": "PRK Partners je přední českou advokátní kanceláří a pravidelným vítězem nejvýznamnějších mezinárodních i lokálních ocenění. Naše právní firma působí na trhu již třicet let a během tohoto období vyrostla v mezinárodní společnost poskytující právní poradenství ve svých kancelářích v Praze, Bratislavě a Ostravě.\n\nJsme výhradním českým členem prestižního celosvětového sdružení významných a nezávislých advokátních kanceláří z více než 100 zemí světě – Lex Mundi. Díky úzké spolupráci s řadou špičkových mezinárodních právních firem můžeme své klienty provázet po celou dobu jejich cesty za obchodem v oblastech jurisdikce prakticky po celém světě.\n\nNaši specialisté jsou absolventy mezinárodních univerzit. Týmy sestavené právě z takto unikátních právníků a daňových expertů hledají vždy individuální cestu a to nejvhodnější řešení každé situace. Své mnohaleté zkušenosti poskytují jak těm největším hráčům světového byznysu, tak i lokálním společnostem. Právní služby PRK \n\nV PRK Partners jsme si velmi dobře vědomi své odpovědnosti vůči společnosti, ve které žijeme a podnikáme. Chceme díky svým nabytým zkušenostem spoluvytvářet okolní svět. Zaměřujeme se tak i na skutečné výsledky prostřednictvím našich pro bono projektů, mezi které patří například Nadace Terezy Maxové dětem, Randova nadace a mnoho dalších.  Naše firemní strategie klade velký důraz jak na obecně prospěšnou činnost a charitativní dary, tak i na sponzorství.",
        "language": "cs",
        "author_name": "PRK Partners",
        "slug": "prkpartners",
        "cover": "20220523_110544_26c55425fb1713b805eb6859ed4a5986.jpg"
    },
    {
        "podcast_id": 29990,
        "title": "Investment Insights by Select Property",
        "description": "<p>Make better investments by staying up to date with the very latest UK property news, data and trends from a leading developer. With key insights from industry thought leaders, this podcast discusses all things UK property, keeping global investors informed and helping them to identify the best new opportunities.</p>",
        "language": "en",
        "author_name": "Select Property",
        "slug": "property-insights-by-select-property-group",
        "cover": "20230427_060406_c8808fc082876f43ce1db49876dd08c0.jpg"
    },
    {
        "podcast_id": 30057,
        "title": "Digging - The HCRC Podcast",
        "description": "This is an exciting podcast on the heavy civil construction industry, and the only one to focus exclusively on that sector. We discuss trends, successes, new breakthroughs, recovering from failures, and so much more! We feature prominent industry authorities on our podcast, as well as finding diamonds in the rough that most of the industry may not be aware of. Let's dig in!\n\nhttps://hcrc.us/\n",
        "language": "en",
        "author_name": "Taylor Maurer",
        "slug": "hcrc",
        "cover": "20210204_180623_4d9601ade2ba7a3b95853f656e85bf94.jpg"
    },
    {
        "podcast_id": 32186,
        "title": "Quality InSites Podcast",
        "description": "The Quality InSites Podcast - helping shape a better future in clinical research. This podcast is run by members of the Future Shaper Holdings Limited group of companies (IAOCR, GCSA and ACORI Consulting).",
        "language": "en",
        "author_name": "Future Shaper Holdings Ltd",
        "slug": "qualityinsites",
        "cover": "20210212_100650_39d6688ced7b194e7210fe2c24c6772a.jpg"
    },
    {
        "podcast_id": 32278,
        "title": "Latin Securities",
        "description": "Somos una compañía de servicios financieros integrales e integrados, que se potencian entre sí, para brindar las mejores soluciones a nuestros clientes.\n\nContamos con una reconocida trayectoria de casi 30 años en los mercados de capitales locales e internacionales y poseemos alianzas estratégicas con las entidades financieras más prestigiosas del mundo.\n\nConozca más en https://www.latinsecurities.uy\n\n\n",
        "language": "en",
        "author_name": "Latin Securities",
        "slug": "latinadvisorsuy",
        "cover": "20220712_040711_54c474965ff67ddcf237f3fc0517b6aa.jpg"
    },
    {
        "podcast_id": 32766,
        "title": "Finansowy Preppers",
        "description": "PREPPERSI to ludzie przygotowani.\nFINANSOWI PREPPERSI to ludzie, którzy biorą odpowiedzialność za swój budżet domowy i za finanse swojej rodziny. \nPo więcej merytoryki zapraszamy na nasz kanał YouTube!\n\n",
        "language": "pl",
        "author_name": "Finansowy Preppers",
        "slug": "finansowyprepers",
        "cover": "20210228_172655_070b4d347bf76748a151a9e67e09b79a.jpg"
    },
    {
        "podcast_id": 33005,
        "title": "Coffee and Cannabis",
        "description": "Coffee and Cannabis is a series of coffee-length conversations with professionals, researchers, and thought leaders in cannabis that helps bring you deeper insight into who these individuals are, and how they’re shaping the industry.",
        "language": "en",
        "author_name": "Alex Jean",
        "slug": "coffeecannabis",
        "cover": "20210326_030342_a61ca6997a319c78797bb32672e7597c.jpg"
    },
    {
        "podcast_id": 33082,
        "title": "Immigration Coffee Talk",
        "description": "<p>TBC</p>",
        "language": "en",
        "author_name": "Greenspoon Marder LLP",
        "slug": "immigration-coffee-talk",
        "cover": "20210215_200439_f2710792af66e0b7760c150bc9702224.jpg"
    },
    {
        "podcast_id": 33235,
        "title": "We Take Care Podcast",
        "description": "Hallo beste kijker, dit is het podcastkanaal van WeTakeCare!\n\nHeel veel kijk plezier, en vergeet je niet te abonneren op ons kanaal!",
        "language": "nl",
        "author_name": "Rob Paulus",
        "slug": "wetakecare",
        "cover": "20210216_071425_497dbdcd9b83d2a0da5c8289b3eb2e85.jpg"
    },
    {
        "podcast_id": 34321,
        "title": "Catherine Murray in Conversation With",
        "description": "Equipped with 15 years on Wall Street and 10 years as a BNN Bloomberg anchor. Catherine brings you probing interviews and coherent analysis with leading business executives and investment professionals. Separating noise from facts. \n\nTune in weekly for informative and entertaining conversations.\n",
        "language": "en",
        "author_name": "Catherine Murray",
        "slug": "catherinemurrayinconversationwith",
        "cover": "20210219_171250_6d3c422df72b515ab5ae265722292574.jpg"
    },
    {
        "podcast_id": 35679,
        "title": "Much Ado about Economics",
        "description": "Two individuals using their economics knowledge to talk about as much economics as we can. ",
        "language": "en",
        "author_name": "Sibtain & Saad",
        "slug": "maaeconomics",
        "cover": "20210223_062737_a00f83b6889efd4f5f25595e155f9f52.jpg"
    },
    {
        "podcast_id": 38780,
        "title": "ReEnergizing Communities",
        "description": "Reducing energy use today means securing a safer, more affordable, and sustainable tomorrow. Hear from leaders across Southern California who are working to make a difference. Whether showing property managers and local governments better choices for energy use or highlighting opportunities for individuals in disadvantaged communities to pursue careers in energy and water efficiency, this podcast connects you to conversations that can help you influence change at home, at work, and in your community. ",
        "language": "en",
        "author_name": "SoCalREN",
        "slug": "reenergizingcommunities",
        "cover": "20210304_202510_538eb5e26841593d5b2dbca733f988a0.jpg"
    },
    {
        "podcast_id": 39963,
        "title": "Townsville ChamberCast",
        "description": "Welcome to the Townsville ChamberCast!\n\nEssential information, conversations, ideas and news that matters to the local business community of Townsville.\n",
        "language": "en",
        "author_name": "The Townsville Chamber of Commerce",
        "slug": "townsvillechambercast",
        "cover": "20220210_020231_192753f407688674bb03651d2b8a6046.jpg"
    },
    {
        "podcast_id": 40644,
        "title": "Albumedix",
        "description": "With more than 30 years of experience in the biopharmaceutical industry, we want to share our knowledge and insights with you. Through our supply of Albumin to biopharmaceutical companies worldwide we find ourselves deep in the most topical questions of our industry every day. Our in-house experts will address everything from technical scientific topics and regulatory dynamics to general market insights – and share them with you! \n\nTune in to get your dose of Science and Pharma updates. \n\nAlbumedix – Empowering excellence to enable advanced therapies and biopharmaceuticals worldwide.\n",
        "language": "en",
        "author_name": "Albumedix",
        "slug": "albumedix",
        "cover": "20221202_091202_3392b3f52a05276ef677ba8f77769d3c.jpg"
    },
    {
        "podcast_id": 42680,
        "title": "正经不良人",
        "description": "商业财经节目。不定期邀请专业领域的嘉宾。\n\n老虎：二级市场从业者，衍生品与债\nHana：商业银行从业者，前FPA\n辉姐：硅谷数据科学家，斯坦福毕业生\nOlivia: 咨询公司从业者，另类投资FoF",
        "language": "zh",
        "author_name": "老虎",
        "slug": "zjblrfm",
        "cover": "20210319_071533_f221877dc16c72e32436682843aa3f56.jpg"
    },
    {
        "podcast_id": 45652,
        "title": "Gibson & Perkins Income and Estate Tax Podcast",
        "description": "Join Gibson and Perkins, P.C. as they discuss new and interesting Income and Estate Tax updates in the United States",
        "language": "en",
        "author_name": "Gibson and Perkins, P.C.",
        "slug": "gandptaxtalk",
        "cover": "20210330_204902_2a328e2ce01bf08db85f31edfe3daa0f.jpg"
    },
    {
        "podcast_id": 46046,
        "title": "The Cocoa Pod Cast",
        "description": "The Cocoa Pod Cast is a place where we amplify voices in the Chocolate and Cocoa Industry in search for true sustainability. We will be interviewing knowledgeable people from along the entire supply chain, from cocoa farmers, to chocolate makers, activists, journalists, film makers, and more!",
        "language": "en",
        "author_name": "The Cocoa Pod Cast",
        "slug": "the-cocoa-pod-cast",
        "cover": "20210401_140242_c119fb1275036e33a817bc33b693effb.jpg"
    },
    {
        "podcast_id": 48171,
        "title": "Indiana Ag Shop Talk w/ Tanner Coulter",
        "description": "Welcome to Indiana Ag Shop Talk with Tanner Coulter, where we bring on industry experts to make your farm better, one show at a time.",
        "language": "en",
        "author_name": "Tanner Coulter",
        "slug": "indianaagshoptalk",
        "cover": "20210506_141402_28ba991e935a6a16135918fbde83d037.jpg"
    },
    {
        "podcast_id": 51642,
        "title": "Analytics Insight",
        "description": "Analytics Insight® is an influential platform dedicated to insights, trends, and opinion from the world of data-driven technologies. It monitors developments, recognition, and achievements made by Artificial Intelligence, Big Data and Analytics companies across the globe.",
        "language": "en",
        "author_name": "Analytics Insight",
        "slug": "analyticsinsightmagazine",
        "cover": "20210426_141514_f321e9d0a99a7d7a8be782b06d383afe.jpg"
    },
    {
        "podcast_id": 53346,
        "title": "Moor XR Podcast - A Moor Insights & Strategy Podcast",
        "description": "The Moor XR Podcast is a podcast that looks to inform people about the latest technologies and developments happening in AR, VR, the Metaverse and more! The Moor XR Podcast will also periodically have industry leaders to explain the latest technologies and is hosted by Moor Insights & Strategy's Senior Analyst, Anshel Sag.",
        "language": "en",
        "author_name": "Anshel Sag",
        "slug": "moorxr",
        "cover": "20210503_011533_ac5944ef78d9d1ea2f83e139703ebd56.jpg"
    },
    {
        "podcast_id": 54362,
        "title": "Pennies from Heaven with Jim Wiandt  ",
        "description": "Hosted by Jim Wiandt, founder of ETF.com and CEO of Spark Network, Pennies from Heaven is a podcast featuring choice insights and lively debate with all the biggest names in the ETF world and beyond. Join us each month to receive pennies from heaven, straight from the nattering nabobs of investment as they discuss hot button topics and what's to come.",
        "language": "en",
        "author_name": "Spark Network ",
        "slug": "penniesfromheaven",
        "cover": "20210504_173259_258b9f718735be1720733481f2e0ff93.jpg"
    },
    {
        "podcast_id": 55318,
        "title": "Quemando Llanta con Pablo Villarreal ",
        "description": "Lo mejor de el mundo automotriz. Consejos para comprar y vender tu auto en Dallas, TX. Todos los Sabados 9am solo por TUDN Radio 1270am \n",
        "language": "en",
        "author_name": "Pablo Villarreal",
        "slug": "qldallas",
        "cover": "20210512_221257_e8e4c03bb8642770123d2b6ddf2603d0.jpg"
    },
    {
        "podcast_id": 55854,
        "title": "The Equalizer Project Podcast",
        "description": "How do we fix historic inequities that continue to plague people of color… particularly in Corporate America?  It is clear that our citizens are no longer comfortable with the traditional approaches to addressing systemic challenges – i.e. ones that contain the “right language and practices” but are mostly symbolic and ultimately, yield slow, and often, insignificant change. \n\nAnd so, this podcast, The Equalizer Project was born. Through conversations with leaders who can share rich, complex, and powerful experiences of life in the corporate world, I hope to bring awareness, to heal, to inspire and to leave the audience with hope and a solution, yes, a solution! It is part of my calling or personal mission – to change lives and to leave others better off.\n\nThis is the work of The Equalizer Project.",
        "language": "en",
        "author_name": "Brenda Ross Dulan",
        "slug": "theequalizerprojectpodcast",
        "cover": "20210604_183732_c6187cfe89f3b5cbacb38c0bb6b23df4.jpg"
    },
    {
        "podcast_id": 55868,
        "title": "Vagos FM Podcasts",
        "description": "Aqui podem encontrar todos os episódios dos nossos podcasts. \nPara mais sigam até www.vagosfm.com",
        "language": "pt-pt",
        "author_name": "Vagos FM",
        "slug": "vagosfm",
        "cover": "20210511_113253_409c2742bbd0ab37887436d4fff21347.jpg"
    },
    {
        "podcast_id": 56212,
        "title": "SmartBill Podcasts",
        "description": "Asculta seriile Pastila de contabilitate si Prima mea afacere! Invitatii, specialisti din diferite domenii, raspund intrebarilor contabililor si antreprenorilor. ",
        "language": "ro",
        "author_name": "SmartBill & Contzilla",
        "slug": "smartbill",
        "cover": "20210528_084033_dd0ba720fe788cbb9b69522b1c39781c.jpg"
    },
    {
        "podcast_id": 57667,
        "title": "Ritchie Bros. Inside Edge",
        "description": "If your business involves heavy equipment and trucks, don’t miss our Inside Edge podcasts. You’ll get the inside scoop from industry experts and influencers about equipment trends, pricing, demand & macro trends impacting the construction, transportation & farming industries. Hosted by Ritchie Bros., a global leader in heavy equipment & truck management and disposition.",
        "language": "en",
        "author_name": "Ritchie Bros.",
        "slug": "ritchiebrosinsideedge",
        "cover": "20220906_020935_4fda7782df9df9f6870c170b9edbaa70.jpg"
    },
    {
        "podcast_id": 59200,
        "title": "The Million Dollar Traders Podcast",
        "description": "Hedge fund manager Lex van Dam joins James Helliwell to bring you expert insight into the world of trading with a special guest featuring in each episode. Subscribe for their investing tips, breaking news and stock market discussion. ",
        "language": "en",
        "author_name": "James Helliwell & Lex van Dam",
        "slug": "milliondollartraders",
        "cover": "20210526_085847_d3f0db897f23e7646254fcee12841c73.jpg"
    },
    {
        "podcast_id": 60241,
        "title": "Whatcha Got",
        "description": "On the Whatcha Got Podcast we talk topics A to Z and everything in between. Are we experts on the topics we discuss? No. Will we go off on random tangents that take a second to recover from? Yes. Will you enjoy listening to what we have to say? We hope so. ",
        "language": "en",
        "author_name": "Jordan Palmer and Charlie Budd",
        "slug": "whatchagot",
        "cover": "20211214_041234_3b765b7b84da1a2e2cf9ad465660dbaa.jpg"
    },
    {
        "podcast_id": 60949,
        "title": "Urbanitae Podcast",
        "description": "Cada semana te contamos lo más destacado sobre inversión inmobiliaria en España, las novedades del sector, el papel del crowdfunding y los proyectos que financiamos en Urbanitae.",
        "language": "es",
        "author_name": "Urbanitae",
        "slug": "urbanitae",
        "cover": "20220208_030229_2ad2ebb308d926615c93fc5d48f28bb2.jpg"
    },
    {
        "podcast_id": 64306,
        "title": "STAT Media Podcasts",
        "description": "STAT Media Group, founded in 1986, is a business to business publishing company for the global transport and logistics industries. The group’s flagship publication, The STAT Trade Times (stattimes.com), is a go-to news source of and for the global air cargo industry. Indian Transport and Logistics News (itln.in), the group’s second publication, is a news source on everything transport and logistics for and of the Indian subcontinent. The third publication from the group Logistics Update Africa (logupdateafrica.com) covers the African continent’s vibrant transport and logistics sectors.",
        "language": "en",
        "author_name": "STAT Media Group",
        "slug": "cargo-master-minds",
        "cover": "20220916_050914_fc325bb91a7a610e4d26b239adc45857.jpg"
    },
    {
        "podcast_id": 64733,
        "title": "SBT AUDIO ",
        "description": "SBT Audio is turning traditional publishing on its head. You can access a variety of interviews and articles from Sussex Business Times in an Audio format. So you can listen to great content wherever you are. Everyone absorbs content in different ways and SBT have you covered. ",
        "language": "en",
        "author_name": "Sam Thomas",
        "slug": "sbtaudio",
        "cover": "20210624_134135_a42b8af0f4f8f5707a1eafbe2ac5e322.jpg"
    },
    {
        "podcast_id": 65131,
        "title": "Parlons Macro",
        "description": "Le podcast qui décrypte les news économiques chaque semaine !",
        "language": "fr",
        "author_name": "La voix de Genève",
        "slug": "parlons-macro",
        "cover": "20210704_092234_623f0a3f4fced33b3168e8db692e3237.jpg"
    },
    {
        "podcast_id": 66218,
        "title": "Polaris Perspective",
        "description": "Welcome to the Polaris Podcast, a financial planning and investment management podcast featuring conversations with Jeff Powell and Jeremy Witbeck. The series features topics ranging from politics, economics, financial markets, and deep-dives into specific regions and industries. It's time for our weekly review of all the important things that have happened over the last several weeks. Time to not only look back but to start planning what happens in the months ahead.",
        "language": "en",
        "author_name": "Jeff Powell & Jeremy Witbeck",
        "slug": "polarisperspective",
        "cover": "20210710_032557_3a0f89f7625d504cd9bb88d351b1fda8.jpg"
    },
    {
        "podcast_id": 66595,
        "title": "RubiCast",
        "description": "Podcasts van onze Microsoft cloud specialisten. Over onze passie voor digitaal innoveren en de nieuwste cloud technologieën. ​",
        "language": "nl",
        "author_name": "Rubicon Microsoft Cloud Experts",
        "slug": "rubicast",
        "cover": "20210705_143124_e204e539c6eb93ecd0c45dda439ba28b.jpg"
    },
    {
        "podcast_id": 69031,
        "title": "ASCM NYC-LI presents Supply Chain Briefs -  with Joseph Moretta",
        "description": "ASCM NYC LI Podcaster, Joe Moretta, interviews Supply Chain professionals on current news and views in the current world of Supply Chain Management as it pertains to the business world around us - risks, challenges and along with technological changes that are making this world move bigger, better and faster. ",
        "language": "en",
        "author_name": "Joseph Moretta",
        "slug": "nycli-ascm-supply-chain-briefs",
        "cover": "20211007_194017_e8d048809d8b3a0fd995628bca0af9cc.jpg"
    },
    {
        "podcast_id": 69261,
        "title": "Specific Knowledge: Philosophy for the New Wave",
        "description": "\"Specific Knowledge: Philosophy for the New Wave\" is a podcast dedicated to exploring how people coordinate and build in a dynamic world where knowledge is distributed and ephemeral. With a focus on creative destruction and the role of blockchain as a decentralizing technology, we discuss new ways to reimagine and reshape the current social order.\n",
        "language": "en",
        "author_name": "Devin Marty",
        "slug": "specificknowledge",
        "cover": "20210721_020136_ae6af0c0ec1d20db0611328f337c6255.jpg"
    },
    {
        "podcast_id": 70771,
        "title": "Lunch with the Missouri Black Chamber of Commerce",
        "description": "Explore issues affecting Black Owned businesses with Ira Fowlkes, Elder Allen Lyles, Chuck DeBow and Guests",
        "language": "en",
        "author_name": "Ira Fowlkes, Elder Allen Lyles and Chuck DeBow",
        "slug": "fergusonusahottalkradio",
        "cover": "20210729_193713_41dafcbbf7b613d0c8d45c5960b34020.jpg"
    },
    {
        "podcast_id": 71593,
        "title": "Liwa Capital Advisors Fireside Chats ",
        "description": "Liwa Capital Advisors was founded in 2017 and follows the same diversification and manager selection principles that preserved and grew sovereign wealth funds' capital over the last 30 years. As early investors to the world's premier funds, we bring unique understanding and access to a wide variety of investment strategies.\n\nNothing contained in the Podcasts should be construed as a solicitation of an offer to buy or offer, or recommendation, to acquire or dispose of any security, commodity, investment, product, or to engage in any other transaction. Nor do these Podcasts constitute an offering or recommendation by Liwa Capital Advisors of any management service or advisory service. The information or opinions contained in the Podcasts should not be construed as an offer to sell or the solicitation of an offer to buy any security nor shall any such security be offered or sold to any person in any jurisdiction in which such offer, solicitation, purchase or sale would be unlawful under the securities laws of such jurisdiction. To the extent that Podcasts contain statements about the future, such statements are forward looking and subject to a number of risks and uncertainties. Investment entails risks including a possible loss of principal.\n",
        "language": "en",
        "author_name": "Liwa Capital Advisors",
        "slug": "liwacap",
        "cover": "20210810_150652_e70fec953601ac679e9d834b8cfa6031.jpg"
    },
    {
        "podcast_id": 73908,
        "title": "Procure Pulse",
        "description": "Procure Pulse is dedicated to third-party service optimization and supply chain improvement. Founded by Conductiv, the leader of supply chain success solutions, Procure Pulse will discuss third-party services to address what we are seeing in the market, to share best practices, how to handle difficult categories, and GPO best practices.\n\nOur goal is to elevate supply chain experts and lead the conversation.\nFollow us on Twitter at @conductivinc, or on LinkedIn at Conductiv.\nIf you have requests or questions, you can reach out to us on social media, or contact us through our website which is conductiv.com.\n\nContact us with questions at info@conductiv.com!\n",
        "language": "en",
        "author_name": "Conductiv",
        "slug": "procure-pulse",
        "cover": "20210816_191513_79e876adcc3a46b00e32e638584ef59f.jpg"
    },
    {
        "podcast_id": 74037,
        "title": "Transform your BIZ",
        "description": "Carsten Ley is the host of the \"Transform your Business\" Podcast by Asia PMO with guests to give us insights on Agile Management, OKRs, Customer / Employee Experience, Digital Tools and the right Leadership Skills to stay ahead of the curve.",
        "language": "en",
        "author_name": "Carsten Ley",
        "slug": "transformyourbiz",
        "cover": "20210817_105505_9b9a57e66b975d631abefb64b1770200.jpg"
    },
    {
        "podcast_id": 74411,
        "title": "Nyugtával dicsérd a NAV-ot",
        "description": "Egy podcast azoknak, akik eddig utálták, és még inkább azoknak, akiket érdekelnek az adózással összefüggő hírek. Adószakmai és közéleti kérdésekről közérthetően, néha viccesen, de leginkább lényegre törően. (powered by Andersen)",
        "language": "hu",
        "author_name": "Nyugtával dicsérd a NAV-ot podcast",
        "slug": "nyugtaval",
        "cover": "20210819_085142_65efbb213bf84ca45c9293366359ef0a.jpg"
    },
    {
        "podcast_id": 76771,
        "title": "FinteChile Podcast",
        "description": "Somos el podcast de las empresas Fintech de Chile. Nuestro invitados son los principales líderes de la industria fintech nacional, regional e internacional. \n",
        "language": "es",
        "author_name": "FinteChile",
        "slug": "fintechile",
        "cover": "20210901_150822_abcd745df013c3058b05892b2df76988.jpg"
    },
    {
        "podcast_id": 77888,
        "title": "Medigold Matters",
        "description": "The Medigold Health Group is one of the UK’s most trusted Occupational Health & Wellbeing providers - we have been helping businesses to keep their people in work, safe and well for over two decades. \n\nEvery month, broadcaster and podcaster, John Griff, will be talking to various members of the Medigold Health team on a whole range of different topics from mental health to the environment.\n\nSo go on, grab a cuppa, sit back and have a listen.",
        "language": "en",
        "author_name": "Nicole Corr",
        "slug": "medigoldmatters",
        "cover": "20210907_110852_2ae154eaad4dc998d2644667c6284701.jpg"
    },
    {
        "podcast_id": 77934,
        "title": "The Power Of Leverage 101 ",
        "description": "Welcome, welcome and thank you for being here. We are the Power of Leverage 101. There are many shows today that will give you textbook definition of how things should or could be done.  We wanted to separate ourselves from that style, our guests will be able to tell you exactly how they made it, in their selective fields. We didn't want to limit ourselves with topics so we have chosen a substantially broader spectrum of topics to cover, from business, entrepreneurship, personal finance, and personal development. To ethics, self love, self expression, joy and happiness. There will always be something for everyone!\n\nWe wanted to make sure that you were able to see, first hand, what the journey looks like and how you can make it work for you. Since we've all had different experience in life before embarking on this journey. It is nice to be able to add the perspective of other like-minded individuals.",
        "language": "en",
        "author_name": "Emile Blanc",
        "slug": "thepowerofleverage101",
        "cover": "20211111_170934_9b1a86c65494061989736948acfec175.jpg"
    },
    {
        "podcast_id": 78917,
        "title": "Now I Get It",
        "description": "<p>Evelyn is your bestie that loves pop culture. In a world where you're overwhelmed by email newsletters, hour-long podcasts, and news notifications, Evelyn is here to help! She helps distill what you need to know and why in today’s top entertainment business news in under 5 minutes.</p>",
        "language": "en",
        "author_name": "Evelyn Zhang",
        "slug": "nowigetit",
        "cover": "20211011_015921_6201ee943b5f2a9b236671f3ef87d0f0.jpg"
    },
    {
        "podcast_id": 79530,
        "title": "Talentnet Podcast",
        "description": "Official Talentnet Corporation Podcast Channel.\nBeing one of the first local HR companies laying the foundations for Vietnam’s fledgling HR industry, Talentnet was officially established at the end of 2007 from the HR Services team of PricewaterhouseCoopers. Since then, Talentnet has grown significantly to become a well-respected and professional strategic human resources consulting firm. \n",
        "language": "vi",
        "author_name": "Talentnet Corporation",
        "slug": "talentnet-corporation",
        "cover": "20210916_074041_5928b0ff4917afcd5188179d8d43b66d.jpg"
    },
    {
        "podcast_id": 79563,
        "title": "REDD Talks - Cancelling out the Noise",
        "description": "<p>Join us on REDD Talks Podcasts: REDD's new series of interviews and roundtables with Emerging Market experts around the globe. REDD's most recent project aims to reduce the market's noise - while increasing the volume on subjects that matter. About REDD Intelligence: REDD is a leading provider of news and intelligence on emerging market corporates as well as select sovereign and quasi-sovereigns. REDD provides global investors with access to proprietary forward-looking news and research reports on over 1,400 Emerging Markets names covering catalysts like potential M&amp;A, equity and debt issuance, spin-offs, regulatory and legal risks, shareholder/creditor activism and financial distress. REDD clients include all top global investment banks as well as many of largest hedge funds, pension funds and other institutional asset managers active in the space.</p>",
        "language": "en",
        "author_name": "REDD Intelligence",
        "slug": "reddtalks",
        "cover": "20211207_111206_c47c9a9026193d9d60d95ab5d99094e3.jpg"
    },
    {
        "podcast_id": 81005,
        "title": "Ten Gronde",
        "description": "Als advocaat gaat u ten gronde in op juridische twistpunten. De Orde van Vlaamse Balies gaat met deze podcast graag eens ten gronde in op een onderwerp dat u als advocaat kan interesseren.",
        "language": "nl",
        "author_name": "Orde van Vlaamse Balies",
        "slug": "ordevanvlaamsebalies",
        "cover": "20210928_150042_e5eb3ee3f01dcc9e4a203ea67b52f33b.jpg"
    },
    {
        "podcast_id": 81691,
        "title": "The Futurizts Podcast",
        "description": "<p>We interview financial experts, economists, founders, and entrepreneurs to bring you the most updated matters on all things finance.</p><p>To learn more about The Futurizts, visit us at <a href=\"https://linktr.ee/thefuturizts\">https://linktr.ee/thefuturizts</a> and subscribe to our <a href=\"https://thefuturizts.beehiiv.com/\">newsletter</a> to receive actionable insights on the markets weekly.</p>",
        "language": "en",
        "author_name": "Shinji Ong",
        "slug": "futuristsmy",
        "cover": "20230824_070852_3631d5298e07568ea0ff5432e19c174d.jpg"
    },
    {
        "podcast_id": 84082,
        "title": "QPD Podcast ",
        "description": "Investing in today's market environment requires asset managers to have foundational principles.  At Cambiar Investors, their three pillars are Quality | Price | Discipline (QPD).\n\nIn this podcast, host Kyle Helton dives deep into what QPD means and how the philosophy is applied across a variety of investments.\n\n\nDisclosure:\nCertain information contained in this podcast series constitutes “forward-looking statements”, which are based on Cambiar’s beliefs, as well as certain assumptions concerning future events, using information currently available to Cambiar.  Due to market risk and uncertainties, actual events, results or performance may differ materially from that reflected or contemplated in such forward-looking statements.  The information provided is not intended to be, and should not be construed as, investment, legal, or tax advice.  Nothing contained herein should be construed as a recommendation or endorsement to buy or sell any security, investment, or portfolio allocation. \n\nAny characteristics discussed are for illustrative purposes and accordingly, no assumptions or comparisons should be made based upon these ratios. Statistics/charts and other information presented may be based upon third-party sources that are deemed reliable; however, Cambiar does not guarantee its accuracy or completeness.  As with any investments, there are risks to be considered.  Past performance is no indication of future results.  All material is provided for informational purposes only and there is no guarantee that any opinions expressed herein will be valid beyond the date of each episode's publication.\n\nThe specific securities identified and described in each of the podcast episodes do not represent all of the securities purchased or held in Cambiar accounts on the date of publication, and the reader/listener should not assume that investments in the securities identified and discussed were or will be profitable. The holdings described may differ by account based on the account’s strategy, and other factors.  All information is provided for informational purposes only and should not be deemed as a recommendation to buy the securities mentioned.\n\n",
        "language": "en",
        "author_name": "Cambiar Investors",
        "slug": "qpd",
        "cover": "20211008_212134_063cff2491bfbe772c6f5e4abddbe9b0.jpg"
    },
    {
        "podcast_id": 85730,
        "title": "Gen Z Speaks ",
        "description": "Informative and engaging conversations on business, technology and politics from a Gen Z perspective.\n\n",
        "language": "en",
        "author_name": "Ibrahim Ahmed, Matthew Gutierrez, Jenish Thanki",
        "slug": "genzspeakspodcast",
        "cover": "20211018_064714_964c606c000bd555d327deb2f3f23d90.jpg"
    },
    {
        "podcast_id": 85972,
        "title": "Limbach Unlocked",
        "description": "<p>Since 1901, Limbach has been laying the foundation for a better world through the design, installation and maintenance of MEP systems. This podcast takes a deep dive into our business, the evolution of Limbach throughout the years, and the people that are essential to moving us forward. Listen in as co-hosts Kate Mistry and James Swanson explore Limbach’s culture, legacy, and the stories that have shaped Limbach’s footprint as a leader in the MEP industry.</p>",
        "language": "en",
        "author_name": "Learning & Engagement",
        "slug": "lmbpodcast",
        "cover": "20211019_124521_4a3114bec13d4731d156f4c0020a1b7b.jpg"
    },
    {
        "podcast_id": 87744,
        "title": "The Beanpod - Crypto and Stocks",
        "description": "Everything you need to know about crypto and stocks. Shane (The Jolly Green Investor) and Josh (The Nifty Investor) discuss what is going on in the market every week. Topics include current market trends, top picks, analysis on top projects and businesses, interviews with industry insiders, and more!",
        "language": "en",
        "author_name": "Beanstock",
        "slug": "beanpod",
        "cover": "20211029_041632_01710f160950448cfafd5f7e048d823e.jpg"
    },
    {
        "podcast_id": 88672,
        "title": "Carolynn's Corner",
        "description": "The straight talk you want direct from the real estate trenches.",
        "language": "en",
        "author_name": "Carolynn Santaniello",
        "slug": "carolynnscorner",
        "cover": "20211103_204742_d256d846c266458af73fa9ef9ffb1706.jpg"
    },
    {
        "podcast_id": 89458,
        "title": "Localizing Ideas",
        "description": "Localizing Ideas, making them resonate within a Middle Eastern market!\n\nWe are a dynamic and young team of middle-eastern internacionalistas driven by the relentless quest to empower great content by bringing it at the heart of the middle eastern culture, psyche, and attitude.\n\nwww.deafcatstudios.com",
        "language": "en",
        "author_name": "DeafCat Studios",
        "slug": "localizing-ideas",
        "cover": "20211108_094737_20f07220317e6a4b7385c8b046393762.jpg"
    },
    {
        "podcast_id": 91550,
        "title": "Vino el Viernes ",
        "description": "<p>Podcast empresarial para quienes disfrutan de temas sociales, financieros y empresariales. El canal es manejado por la CPA Johmary Melendez quien comparte el estudio con invitados educadores en temas contributivos, laborales y sociales. Para los aficionados del vino, algunos viernes degustamos vinos durante los temas, junto a Sommeliers para conocer acerca del vino y su historia. -Puedes acceder a nuestros VIDEO-Podcasts en nuestro canal de YouTube: Vino el Viernes: CPA y no olvides hacer click en la campanita para que te enteres primero de muchos otros temas. Subscríbete ahora y comienza a disfrutar de nuestros temas. </p><p>Canal de YouTube: <a href=\"https://www.youtube.com/channel/UC4163oqFuC7a5NvA58C4UfQ\">https://www.youtube.com/channel/UC4163oqFuC7a5NvA58C4UfQ</a></p><p>Instagram: <a href=\"https://www.instagram.com/vinoelviernespr/\">https://www.instagram.com/vinoelviernespr/</a> </p><p>Instagram CPA: <a href=\"https://www.instagram.com/PLANILLASPR_CPA/\">https://www.instagram.com/PLANILLASPR_CPA/</a></p><p> #CPA #VINOELVIERNESPR #PODCAST #NEGOCIOS #VINO #EMPRENDIMIENTO #WINEPODCAST #BUSINESS #COACH </p>",
        "language": "es",
        "author_name": "CPA JOHMARY MELENDEZ",
        "slug": "vinoelviernes",
        "cover": "20211119_202542_edab5c6e0702f5409b0bdb6da6f202ff.jpg"
    },
    {
        "podcast_id": 92607,
        "title": "The Small Business Leader's Podcast",
        "description": "Every business owner wants to be successful, but from time to time things happen and you wake up at 2 in the morning with your mind racing.  \nJoin successful veteran Small Business Leaders, Bryan Davis and Stephanie Warren, as they discuss the business problems that keep most small business owners awake at night and discuss strategies and tactics to both deal with them - or more importantly prevent them in the first place. \nIf you want to share everything they've learned over a combined 50 years of successful small  business leadership then don't miss an episode.",
        "language": "en",
        "author_name": "Bryan Davis",
        "slug": "xsion",
        "cover": "20220119_020137_38025735fa506a67481ab444da2f4df2.jpg"
    },
    {
        "podcast_id": 93304,
        "title": "Commodities, Mercados y otras Hierbas.",
        "description": "comentarios de mercado, dialogo sobre futuros, opciones, bases y anexas.“The risk of loss in trading futures and/or options is substantial and each investor and/or trader must consider whether this is a suitable investment. Past performance, whether actual or indicated by simulated historical tests of strategies, is not indicative of future results.”",
        "language": "es",
        "author_name": "ANTONIO OCHOA",
        "slug": "antonio8a",
        "cover": "20211130_041159_68d42b8e93b9bdc68ce9b59314eb17dc.jpg"
    },
    {
        "podcast_id": 93477,
        "title": "BOSS BABE BLOG PODCAST",
        "description": "Welcome to the BOSS BABE BLOG & PODCAST! Here we promote bosses and share their businesses with the world! We also provide Business Elevating Tips & Encouragement. Enjoy!",
        "language": "en",
        "author_name": "BOSS BABE BLOG BUSINESS TEAM",
        "slug": "bbbmbc",
        "cover": "20211201_011249_aebfffb82e958a6b9e123bf50be6b69d.jpg"
    },
    {
        "podcast_id": 93697,
        "title": "Ogilvy Podcasts",
        "description": "Το audio ανήκει αναμφισβήτητα στα trends της εποχής και η Ogilvy έρχεται να αφήσει το ηχητικό της αποτύπωμα. Ακούστε τα Ogilvy Podcasts, με συζητήσεις, αναλύσεις και συνεντεύξεις, γύρω από τον χώρο της διαφήμισης, των social media και του digital marketing. ",
        "language": "el",
        "author_name": "Ogilvy Greece",
        "slug": "ogilvygreece",
        "cover": "20211202_041252_2c599be3c9cf378453d521e97a59dda2.jpg"
    },
    {
        "podcast_id": 94073,
        "title": "Egy Exporter",
        "description": "أول واكبر منصة إخبارية متخصصة بالصادرات المصرية تشمل على كافة الاخبار والتقارير العميقة عن الصادرات المصرية والأسواق العالمية",
        "language": "ar",
        "author_name": "Egy Exporter",
        "slug": "egyexporter",
        "cover": "20211204_061210_1edf8d6891b2a9c842db1ae4c584c540.jpg"
    },
    {
        "podcast_id": 94807,
        "title": "REevaluate",
        "description": "REevaluate is Whiterock AI's 20-minute real estate podcast. Every month, we sit down with market leaders, investors, fund managers, developers, CRE brokers, and lenders to talk about the U.S. real estate market, major trends, opportunities, and ask challenging questions to evaluate, and REevaluate, the market.",
        "language": "en",
        "author_name": "Jordan Girard",
        "slug": "whiterock-ai",
        "cover": "20211214_031241_1511d14edc196fac69f80d4a519fd247.jpg"
    },
    {
        "podcast_id": 96010,
        "title": "Eating Habits ",
        "description": "The restaurant industry today is drastically different from the one Top Chef Alum Jamie Lynch stepped into 30 years ago. Follow along as he discusses the current climate of the industry alongside various food and beverage professionals.",
        "language": "en",
        "author_name": "Chef Jamie Lynch ",
        "slug": "eatinghabits",
        "cover": "20220208_090201_46d3066290b4461d4d115773ae4105f8.jpg"
    },
    {
        "podcast_id": 96173,
        "title": "FH&P Lawyers Law Talk",
        "description": "Business in the Okanagan continues to succeed despite the global pandemic. There are more and more buildings being constructed and tenants getting ready to move in. The business law team at FH&P Lawyers has been assisting clients for over 100 years in the Okanagan and are rooted in the community. The team provides legal services to people just starting out or that have been around for decades regardless if you are an individual with a small business or a large multi-jurisdictional corporation.\n\nThis FH&P Lawyers podcast will educate listeners on business matters including whether or not to incorporate, estate planning with a business and all other legal issues businesses face. The podcast is hosted by lawyers Clay Williams and Tanvir Gill.\n\nSend your business law related questions to podcast@fhplawyers.com",
        "language": "en",
        "author_name": "Ryan Watters",
        "slug": "fhplawyers",
        "cover": "20211217_021258_ab7eea139062b47b530fbb1e0cee3a1a.jpg"
    },
    {
        "podcast_id": 96850,
        "title": "UN CAFÉ Y DOS REALTORS",
        "description": "Podcast informativo de Real Estate del Sur de la Florida en español. Todo lo referente a la inversión inmobiliaria, desde nuevos proyectos, prestamos hipotecarios para nacionales y extranjeros, residencial y comercial. \nCreado por Rosa Calzadilla y Vanesa Eguillor, licenciadas en Real Estate en Miami, buscan proveer al publico de todas las herramientas necesarias, para el proceso de compra venta.\nLa llave a tu inversión!",
        "language": "es",
        "author_name": "Team USPBI Real Estate",
        "slug": "uncafeydosrealtors",
        "cover": "20211221_101252_fa7fa0586c26df3d74b6e41f91981122.jpg"
    },
    {
        "podcast_id": 97101,
        "title": "Onderaan de Streep",
        "description": "<p><strong>Onderaan de Streep</strong> is de podcast van de Vastelastenbond die je helpt om slimmer met je vaste lasten om te gaan. Host Frank van de Ven bespreekt in deze podcast de laatste ontwikkelingen op het gebied van energie, verzekeringen, verduurzaming en de WOZ waarde. Profiteer van handige tips om geld te besparen. Of je nu wilt weten hoe je je energierekening omlaag kunt brengen, hoe je de beste deal kunt vinden voor je autoverzekering, of hoe je je huis duurzamer kunt maken: je vindt het allemaal in deze podcast.</p><p>In <strong>Onderaan de Streep</strong> worden waardevolle inzichten gedeeld door de product specialisten van De Vastelastenbond. Deze specialisten hebben jarenlange ervaring op het gebied van energie, verzekeringen, verduurzaming, hypotheken en de WOZ waarde.</p><p>Door regelmatig te luisteren naar Onderaan de Streep, blijf je op de hoogte van de laatste ontwikkelingen en kun je slimmer omgaan met je vaste lasten.</p><p>Of je nu net begint met het managen van je financiën, of al jarenlang een ervaren bespaarder bent: deze podcast biedt voor iedereen waardevolle informatie en tips om meer uit je geld te halen. Met regelmatige updates en een schat aan kennis en expertise, is Onderaan de Streep de perfecte podcast voor iedereen die zijn vaste lasten serieus neemt. Abonneer je vandaag nog en ontdek hoe je kunt besparen op je vaste lasten!</p>",
        "language": "nl",
        "author_name": "Vastelastenbond",
        "slug": "vastelastenbond",
        "cover": "20211223_041206_d743193d7b43c1abf18f4efddb83e07b.jpg"
    },
    {
        "podcast_id": 97997,
        "title": "Coronation Podcast Series",
        "description": "Coronation Podcast Series is an ongoing engagement medium covering economic and market development trends. The podcast series is one of the many components that form the Coronation Podcast Series platform. Coronation Podcast Series aims to be a mix of informative and entertaining content for our listeners, to help them understand what's happening in the world economy.\n\nJoin the conversation and stay up-to-date on global economic and market development.",
        "language": "en",
        "author_name": "Coronation",
        "slug": "coronation-conversations",
        "cover": "20220801_030845_d83f81a1a77f7cd65ea8eb676d135d3b.jpg"
    },
    {
        "podcast_id": 98564,
        "title": "Le podcast des entrepreneurs",
        "description": "Avec plus de 2.000 membres, la CCI Liège Verviers Namur est la CCI la plus importante de Wallonie et est représentative des aspirations des chefs d’entreprises des provinces de Liège et de Namur.",
        "language": "fr",
        "author_name": "CCI Liège-Verviers-Namur",
        "slug": "ccilvn",
        "cover": "20220103_080114_8d9264a3b47bb92d45c7aed137f3f25c.jpg"
    },
    {
        "podcast_id": 98671,
        "title": "Chamber Bizz Buzz",
        "description": "<p>Chamber Bizz Buzz is the voice of Flagstaff's business community. President and CEO of the Greater Flagstaff Chamber of Commerce, Julie Pastrick takes the mic with business, non-profit and community leaders to get the story of the organizations that are the foundation of Flagstaff's economy. Bizz Buzz airs on KAFF Country Legends 93.5 on Saturday mornings at 8:00AM. We are now pleased to present Chamber Bizz Buzz in podcast format.</p>",
        "language": "en",
        "author_name": "Greater Flagstaff Chamber of Commerce",
        "slug": "chamberbizzbuzz",
        "cover": "20220307_060359_61b0238ba57842ef45e295f780ed2071.jpg"
    },
    {
        "podcast_id": 101381,
        "title": "#InsuringIndia - A Digit Insurance Podcast ",
        "description": "Unlike before, understanding insurance is no longer a cumbersome task. Companies like us are focused on simplifying insurance. In fact, the endeavour is to ensure that even 15-year-old kids are able to understand policy documents. Our ultimate goal is to cut through the clutter and make insurance more accessible.\n\nThrough #InsuringIndia, we aim to: \nA) Highlight the latest insurance trends\nB) Debug popular myths around insurance\nC) Break down complex jargon\nD) Improve the perception around insurance products to bring back the trust \nAnd most importantly, make insurance fun and interesting! \n\nWatch this space! Episodes out every month, starting 17th January.",
        "language": "en",
        "author_name": "Digit ",
        "slug": "insuringindiabydigitinsurance",
        "cover": "20220128_120157_4581ec1257c0675482259fae03a99f8e.jpg"
    },
    {
        "podcast_id": 101920,
        "title": "GAHE: Georgia's Association of Healthcare Executives",
        "description": "Connecting | Learning | Leading",
        "language": "en",
        "author_name": "Georgia Association of Healthcare Executives",
        "slug": "racial-diversity-in-healthcare-leadership",
        "cover": "20220608_100625_c645050bee10660a9ddca0cad911fdd1.jpg"
    },
    {
        "podcast_id": 102041,
        "title": "Rooflines ",
        "description": "Real Talk About Real Estate in Virginia.\n",
        "language": "en",
        "author_name": "Rooflines from Virginia REALTORS®",
        "slug": "rooflines",
        "cover": "20220119_090105_8b99eff2060b80c66fff0155e5bf842a.jpg"
    },
    {
        "podcast_id": 102527,
        "title": "TAXACIO CONSULTING ",
        "description": "Información y actualidad económica",
        "language": "es",
        "author_name": "FERNANDO FERNANDEZ RUIZ",
        "slug": "taxacioconsulting",
        "cover": "20220121_120104_af11903f5668ab33545e5eaf00812657.jpg"
    },
    {
        "podcast_id": 103390,
        "title": "Future Frontiers in Residential Real Estate",
        "description": "In the midst of an affordable housing crisis, the Canadian Real Estate industry must come together to find innovative solutions to build a stronger future. Future Frontiers in Residential Real Estate is a Canadian podcast produced by RAD Marketing and hosted by Sean Zahedi, VP, created to investigate the key factors affecting the residential market and find the solutions in revolutionary technology, design, and processes.  ",
        "language": "en",
        "author_name": "Sean Zahedi",
        "slug": "radmarketing",
        "cover": "20220131_010153_00eea19cdcf4eb9b366f7d0df417b080.jpg"
    },
    {
        "podcast_id": 103703,
        "title": "TechSHIFT",
        "description": "TechSHIFT provides educational mind-broadening discussions on the evolution of advanced manufacturing. Your host, Product Manager for Phillips Federal Dillan Drake, talks with special guests, as well as leading private organizations, who provide real-life examples of how manufacturing technologies are affecting the federal marketplace. From supply chain to cutting-edge technologies to government policies, find out how these decision-makers are helping the world transition into the next industrial revolution!",
        "language": "en",
        "author_name": "Phillips Federal ",
        "slug": "techshift",
        "cover": "20220125_070106_5d776959c4696e4fef62a45dd93c0d8e.jpg"
    },
    {
        "podcast_id": 104119,
        "title": "BeursInside",
        "description": "In de BeursInside podcast voor de nieuwe belegger behandelen wij alles omtrent beleggen, traden, crypto's en meer! ",
        "language": "nl",
        "author_name": "Kuuske",
        "slug": "kuuske",
        "cover": "20221219_061253_bd337a95b3ba66f8baacc3074b05378d.jpg"
    },
    {
        "podcast_id": 104943,
        "title": "The Vancouver Special",
        "description": "Josh Rosenberg, Managing broker of Royal LePage Sussex Klein Group and real estate extraordinaire explores Vancouver BC real estate and interviews local specialists on hot topics the public needs to know about.",
        "language": "en",
        "author_name": "Josh Rosenberg",
        "slug": "thevancouverspecial",
        "cover": "20220331_040335_5a0ce1d0f2b84e3e29c699718de281bc.jpg"
    },
    {
        "podcast_id": 106387,
        "title": "Mortgages: Let's Get Real with Kim Negron",
        "description": "Have you ever wanted to get a loan for a new home, a refinance or some renovations but had no idea where to begin? It's understandable...the mortgage process can be paralyzing as it's a subject that's not taught in schools or part of everyday communication.\n\nJoin Vermont native mortgage Loan Originator Kim Negron as she walks you through the mortgage process through the eyes of her guests! Learn every angle about the mortgage process, buying a home and what it all means for differing lifestyles.\n\nHear the perspectives of a realtor, realtors, builders, social media influencers, previous clients, business owners and more as we strive to educate the masses in the experience.\n\nLet's get real with mortgages!",
        "language": "en",
        "author_name": "Kim Negron",
        "slug": "mortgages-lets-get-real-with-kim-negron",
        "cover": "20220216_050234_d2857707d1129bc428520c1d4831f48c.jpg"
    },
    {
        "podcast_id": 107866,
        "title": "The Royalty Report",
        "description": "Indulge in a Delicious Brand Licensing Experience with a Tasty Twist! Hosts Peter Cross and Trevor Graham take you on a culinary journey as they grill industry experts on the ins and outs of brand licensing. For every question answered, our guests must take on a mouth-watering food challenge. From spicy IP-infused meals to trademark-themed treats, join us as we explore the industry in a whole new way. Subscribe now for a taste of the industry's hottest secrets on The Royalty Report!",
        "language": "en",
        "author_name": "Broad Street Licensing Group",
        "slug": "royaltyreport",
        "cover": "20230127_090108_d491676c893d5d838ff7b7895b1796cc.jpg"
    },
    {
        "podcast_id": 108525,
        "title": "The Young Buck & Old Goat Podcast ",
        "description": "Weekly Cryptocurrency and Digital Asset News and commentary.  Young Buck breaks down the technical analysis of the markets, what to expect in the coming weeks, and highlights potential high runner plays.  Old Goat provides macro market and news analysis affecting the market.  ",
        "language": "en",
        "author_name": "Young Buck & Old Goat",
        "slug": "youngbuckandoldgoat",
        "cover": "20220220_010215_fcbf22db80c9a0e02593d46d9d6a86a2.jpg"
    },
    {
        "podcast_id": 109181,
        "title": "Tony Byrne's View",
        "description": "Tony Byrne's View brings you an exclusive insight into the financial world from the perspective of a successful finance expert and Managing Director, covering topics that can bring you clarity on real-world finance and how they can affect and benefit you. ",
        "language": "en",
        "author_name": "Tony Byrne ",
        "slug": "wealthandtaxmanagement",
        "cover": "20221030_041045_dd92e03f4d05ac1dcb3b57c1c2631103.jpg"
    },
    {
        "podcast_id": 110561,
        "title": "AV WORLD UK ",
        "description": "A lighthearted look at the World of AV, hosted by Kiel, Mark and Andy as they talk through their experiences with a special guest each week.",
        "language": "en",
        "author_name": "AV World UK",
        "slug": "avworlduk",
        "cover": "20220222_090223_4dfbfcb727f41e40556c9a9b608e7213.jpg"
    },
    {
        "podcast_id": 112014,
        "title": "Everything's (NOT) Okay ",
        "description": "<p>With talk of an economic recession, the Russian invasion, and concerns over climate change, it seems that everything's just not okay. Tune in as Hannah and Shreyas interview experts, academics, friends, and foes about the fast-changing world. We'll let you know if everything’s gonna be fine.</p>",
        "language": "en",
        "author_name": "Stern Political Economy Exchange ",
        "slug": "spex",
        "cover": "20220727_100708_b3e5b2ad8e6c562c323f6fc4e1c2874a.jpg"
    },
    {
        "podcast_id": 112523,
        "title": "after3",
        "description": "In this weekly podcast hosted by Clayton, and co hosted by Arturo we talk about our everyday situations, conspiracy's, and daily news that is going on around the world.",
        "language": "en",
        "author_name": "Clayton",
        "slug": "candapodcasts",
        "cover": "20220709_050756_9d52ee431dc341c59a308c44f15aeff8.jpg"
    },
    {
        "podcast_id": 112679,
        "title": "Finanza.tech - Do you speak finance?",
        "description": "\"Do you speak finance?\" nasce dall'idea di Fabio, Gabriele e Stefano, alcuni dei componenti del team marketing di Finanza.tech, di raccontare attraverso i loro occhi il mondo del FINTECH! \nBuon ascolto!",
        "language": "it",
        "author_name": "Finanza.tech",
        "slug": "doyouspeakfinance",
        "cover": "20220303_120353_28bd68e3a1c024232ec02ffe4cacb544.jpg"
    },
    {
        "podcast_id": 113595,
        "title": "Balance & the Bar",
        "description": "<p>Welcome to Balance &amp; the Bar, a podcast designed to explore the issues that arise for lawyer business owners and executives as they navigate launching a new business or law firm.</p>",
        "language": "en",
        "author_name": "Elizabeth Magazine",
        "slug": "balanceandthebar",
        "cover": "20220324_010325_78f96194fd4c57ec0e51d6e3bf5f9293.jpg"
    },
    {
        "podcast_id": 113613,
        "title": "Pathfinder Podcast",
        "description": "The Pathfinder Podcast is a conversation with companies that have taken the journey in adopting Data and Artificial Intelligence into the operations business. Over the series we'll be talking to Startups, SMEs and Multi-National companies about how they've used data in their operations across Supply Chain, Production & Sales.",
        "language": "en",
        "author_name": "Iain Keaney",
        "slug": "pathfinder-podcast",
        "cover": "20220307_050312_8a569316b57df283fd292918945737a0.jpg"
    },
    {
        "podcast_id": 113875,
        "title": "CRE eyes wide open",
        "description": "CRE – Eyes Wide Open offers straight forward Commercial Real Estate advice by pairing unparalleled knowledge and experience with genuine commitment to helping borrowers. Host Ann Hambly, industry experts, and skillful business owners discuss the complicated and often mysterious world of Commercial Real Estate and securitized debt. Subscribe now and we will open your eyes to how the game is played and what you need to achieve your goals.",
        "language": "en",
        "author_name": "Ann Hambly",
        "slug": "cre-eyes-wide-open",
        "cover": "20220308_070339_39c17f78b8814c7a9049c6d2b236c58d.jpg"
    },
    {
        "podcast_id": 114251,
        "title": "PSG Financial Services",
        "description": "PSG's advice focused business is founded on personal service, lifelong relationships with clients, integrity, trust and transparency. \nThese values are encapsulated in the group's core business principles. The opinions expressed in these podcasts are the opinions of the series and not necessarily those of PSG. The information in these podcasts is provided as general information. It does\nnot constitute financial, tax, legal or investment advice and the PSG Konsult Group of Companies does not guarantee its suitability or potential value. Since individual needs and risk profiles differ, we suggest you consult your qualified financial adviser, if needed. PSG Wealth Financial Planning (Pty) Ltd is an authorised financial services provider. FSP 728.",
        "language": "en",
        "author_name": "PSG Financial Services",
        "slug": "psgfinancialservices",
        "cover": "20220310_120301_eca70d84dff470c9e8a1960b676b4e05.jpg"
    },
    {
        "podcast_id": 115111,
        "title": "Mesele Ekonomi",
        "description": "Mesele Ekonomi, 2018 yılından beri yayın hayatına devam eden bir dijital medya platformu. Amacımız, ekonomik ve siyasi gelişmelere ilişkin arka plan bilgilerini, bilgi odaklı analizleri ve uzman yorumlarını ilgi duyan herkese en basit anlatımıyla ulaştırmak.\n\nMesele Ekonomi tarafından hazırlanan tüm söyleşilere ve görüntülü içeriklere şu adreslerden ulaşabilirsiniz:\n\nYoutube: https://www.youtube.com/c/MeseleEkonomi/\nTwitter: http://www.twitter.com/MeseleEkonomi\nİletişim: info@meseleekonomi.com",
        "language": "tr",
        "author_name": "Mesele Ekonomi",
        "slug": "mesele-ekonomi",
        "cover": "20220314_010336_654a9cef279cda16a024c594ea261a3a.jpg"
    },
    {
        "podcast_id": 115180,
        "title": "Guía Traders Podcast",
        "description": "Nunca es demasiado pronto para empezar a pensar en su futuro financiero. Trabajamos con nuestros clientes para ayudarlos a comprender mejor qué opciones están disponibles y asesorarlos sobre las mejores decisiones de inversión que deben tomar. Juntos estableceremos, alcanzaremos y superaremos todas sus metas financieras.\nwww.guiatraders.org  info@guiatraders.org",
        "language": "es",
        "author_name": "Guia Traders Podcast Marzo",
        "slug": "guiatraders",
        "cover": "20220314_060326_dfefa9c3e053fe86e04d1177c97c75f9.jpg"
    },
    {
        "podcast_id": 115852,
        "title": "Dos:Puntos Al Aire",
        "description": "Somos Godoy Córdoba, firma colombiana con más de 35 años de experiencia en el sector legal y en este podcast hablaremos de los retos de la gestión del talento en las organizaciones, desde diferentes perspectivas legales y con un enfoque interdisciplinario.\n\nQuédate con nosotros, porque en Dos:Puntos te contamos algo más.",
        "language": "es",
        "author_name": "Godoy Córdoba",
        "slug": "dos-puntos-al-aire",
        "cover": "20220317_040359_24875940b6e328fb189865d66a782340.jpg"
    },
    {
        "podcast_id": 115988,
        "title": "WASKITALK",
        "description": "Podcast bincang santai Waskita Karya\nDari Kita, Untuk Kita, Demi Kejayaan Waskita\n\nSIAPA KITA!? WASKITA!\nWASKITA BISA!",
        "language": "id",
        "author_name": "InsanKita",
        "slug": "waskitalk-eps1",
        "cover": "20220318_030333_737ede4e7040d05cceecb4d47ed511d9.jpg"
    },
    {
        "podcast_id": 117656,
        "title": "The Savvy Podcast with Ernie Martin",
        "description": "The Savvy Podcast features in depth interviews with executives and leaders in fintech, buyer organizations, solution providers, and supplier organizations. Discussions center around how technology and automation helps streamline Order-to-Cash, Accounts Receivable, Payments, Invoicing, and more.",
        "language": "en",
        "author_name": "Ernie Martin",
        "slug": "the-savvy-podcast-ernie-martin",
        "cover": "20220325_040308_bcf2872ae5f86ebee0a06435e7bbc194.jpg"
    },
    {
        "podcast_id": 117658,
        "title": "Life UnLocked Partners Education Series",
        "description": "Welcome to Life UnLocked Partners Education Podcasts Series.\n\nAthletes and Entrepreneurs share a common problem - we change careers with uncertain futures. How do we manage our money for these pivot points?\n\nBy designing investment portfolios that provide risk-adjusted cash flows and cushions to power us through that change*.\n\n*and the other big stuff in life.",
        "language": "en",
        "author_name": "Mark Tennenbaum",
        "slug": "lifeunlockedpartners",
        "cover": "20220325_040305_c6b77a9118fa4e6cbd944c2a1ae91acb.jpg"
    },
    {
        "podcast_id": 118461,
        "title": "The Broadcast",
        "description": "<p>The Broadcast is a series of podcasts looking at the latest news and topics of the day covering pensions and savings. It is hosted by David Brooks, Head of Policy and Simon Kew, Head of Market Engagement at Broadstone. In each episode there will also be a special guest for a closer look at a particular topic in more detail.</p>",
        "language": "en",
        "author_name": "Broadstone Corporate Benefits",
        "slug": "the-broadcast",
        "cover": "20221130_111141_e8dc6346590c46c536211c427a8ca1df.jpg"
    },
    {
        "podcast_id": 120996,
        "title": "Equipment Talk",
        "description": "Equipment Talk is a podcast where we tackle news topics and discuss the latest in equipment innovation. Presented by IRAY Companies.\n\nSocial Media\nFacebook : iray.companies\nInstagram : iraycompanies\n\nIRAY Companies\nwww.iraymn.com\niray@iraymn.com",
        "language": "en",
        "author_name": "IRAY Companies",
        "slug": "equipment-talk",
        "cover": "20220410_040437_0869078763681afd2b92c3d67fb0cc5b.jpg"
    },
    {
        "podcast_id": 122009,
        "title": "InKnow 創新創業 101 by Innopreneur",
        "description": "《Innopreneur》旨在提供創科知識和激發創新思維﹐一起探索 Web3、NFT、Metaverse、Blockchain、MarTech、ESG 和創業的可能性，發掘更多嶄新的商機。",
        "language": "zh",
        "author_name": "Innopreneur",
        "slug": "innopreneur",
        "cover": "20220504_010515_ffc7ee62dcf04967859b6510ae0d9e18.jpg"
    },
    {
        "podcast_id": 122282,
        "title": "“MLC’s Big Show”   #NewsFrom #TheRoad #AgBasedPodcasting",
        "description": "Historical Review, News & Information, Educational Topics, Family Oriented Podcast Regarding The Latest In The Agriculture & Show Livestock Industry\n#New \nNominated For Best Show Cattle Podcast In 2023 “Best Of The Barns” Awards \n\n-www.mattlautnercattle.com\n-www.mlcbigshow.com\nCall/Text Matt Lauther Cattle Office @ 515.391.9540 To Order Show Cattle Semen For Same Day Shipment \n*Mention the “MLC Big Show” for a complimentary MLC “bull hat” shipped with your order \n\n#MLCBigShow #AgBasedPodcasting \n",
        "language": "en",
        "author_name": "Matt Lautner Cattle Social Media Network ",
        "slug": "thebigshow",
        "cover": "20220421_040449_249f62a0b17cc0ef3bc1783b2266c50b.jpg"
    },
    {
        "podcast_id": 122811,
        "title": "The Brand & Trademarks Podcast - Presented by John McKeown ",
        "description": "Learn all you need to know about the latest case law relating to brands, trademarks and copyright law. Each episode contains at least 20 minutes of quick and easy-to-understand information for SMBs, students and legal professionals.\n\nNew episodes will be advertised in the monthly newsletter - subscribe today!",
        "language": "en",
        "author_name": "John McKeown",
        "slug": "johnmckeown",
        "cover": "20220418_050420_36dc5b6cfe54fb62425eaed0f03526ea.jpg"
    },
    {
        "podcast_id": 123255,
        "title": "Barbers Only Magazine Presents.... The week in barbering w/ Mr. Taper",
        "description": "Mr. Taper Of BOM talks about the best and most interesting topics in the world of barbering.",
        "language": "en",
        "author_name": "Mr. Taper",
        "slug": "barbersonlymagzine",
        "cover": "20220420_070420_c09b55100840bd0aa88a08b8f6824a28.jpg"
    },
    {
        "podcast_id": 125308,
        "title": "ADM Fertilizer Updates",
        "description": "Monthly fertilizer updates from your trusted ADM partner.",
        "language": "en",
        "author_name": "ADM Fertilizer",
        "slug": "admfertilizer",
        "cover": "20220429_010428_07db814d40d3af757b2a68ea976ffa7c.jpg"
    },
    {
        "podcast_id": 126014,
        "title": "\"Love & Money\" - The Internet Television Show of @prosperityullc",
        "description": "Follow @prosperityullc on all social media platforms.",
        "language": "en",
        "author_name": "Owner/Found of Prosperity U. LLC",
        "slug": "loveandmoney",
        "cover": "20221023_061016_511588d13ee5100a09cf28d4764ef7ff.jpg"
    },
    {
        "podcast_id": 126182,
        "title": "UnSpun with Jody Vance and George Affleck",
        "description": "Welcome to UnSpun - A Canadian current events Podcast and YouTube show. Every week, Jody Vance and George Affleck unspin the latest news in local, provincial, federal politics, and much more.\n\n-\n\nNeed to reach out, email info@unspunpodcast.com\n\n-\n\nStay updated!\n\nJody Vance https://twitter.com/jodyvance\n\nGeorge Affleck https://twitter.com/george_affleck\n\nUnSpun https://twitter.com/unspunpodcast\n\n-\n\nInterested in sponsoring? Email george@curvecommunications.com\n\n-\n\nTheme song: Piers Affleck Produced at: https://curvecommunications.com/",
        "language": "en",
        "author_name": "Jody Vance and George Affleck",
        "slug": "unspun",
        "cover": "20220512_100526_a742f2aeff3409703028efd5ff9ad271.jpg"
    },
    {
        "podcast_id": 126884,
        "title": "Sense to Dollars",
        "description": "Driven by curiosity and a need to understand the world around us. Featuring guests of value with insight to a variety of topics. Mainly focused on keeping tabs on the news, business and tech through the lens of critical thought.",
        "language": "en",
        "author_name": "Miki Furman",
        "slug": "sensetodollars",
        "cover": "20220507_040523_424b80379987b014ea6331278f08da59.jpg"
    },
    {
        "podcast_id": 127552,
        "title": "BUILDING STRONG WITH NEW YORK DISTRICT ",
        "description": "USACE NEW YORK DISTRICT PODCAST ",
        "language": "en",
        "author_name": "PA STAFF",
        "slug": "building-strong-with-new-york-district",
        "cover": "20220510_060542_2e33aaf9024907e5bf4cbb14f2d2bb98.jpg"
    },
    {
        "podcast_id": 128333,
        "title": "TV Florida USA",
        "description": "TV Florida USA é uma TV Brasileira feita para brasileiros que vivem fora do Brasil.",
        "language": "pt-br",
        "author_name": "otavio souza",
        "slug": "tvflorida",
        "cover": "20220516_100548_c062d19e5b22f2d6181ebe3c5a60b453.jpg"
    },
    {
        "podcast_id": 129416,
        "title": "Monday With The Mills Crew!",
        "description": "Join us every Monday with one of our Co-Owners Michael Woodward to discuss all you need to know about home ownership maintenance, small business tips & more! ",
        "language": "en",
        "author_name": "Michael Woodward & Mills Roofing Crew!",
        "slug": "mondaywiththemillsroofingcrew",
        "cover": "20220520_060536_fbca96d0829ec609d4953586928f46b4.jpg"
    },
    {
        "podcast_id": 129482,
        "title": "Reel Talk with Hapa & S3VYN",
        "description": "<p>Just a couple dudes talking about reel ish!</p><p>Audio can be found on just about any app that you listen podcasts on, just search for our name! If you have idea's for topics, questions, comments, send us an email!</p>",
        "language": "en",
        "author_name": "Hapa and S3VYN",
        "slug": "reel-talk-with-hapa-and-s3vyn",
        "cover": "20220720_070738_aea5e9eb22f06c40aeb71866b1f12397.jpg"
    },
    {
        "podcast_id": 129919,
        "title": "Hablando en Construcción | CMIC Veracruz",
        "description": "Programa de entrevistas a especialistas del ramo constructor sobre temas de actualidad, producido por CMIC Veracruz Puerto. |\n\nSiguenos tambien en YouTube como 𝗖𝗠𝗜𝗖 𝗩𝗲𝗿𝗮𝗰𝗿𝘂𝘇 𝗣𝘂𝗲𝗿𝘁𝗼  |\nhttp://lnnk.in/iFci    ||\n\nhttps://cmicveracruz.org\n",
        "language": "es",
        "author_name": "CMIC Veracruz",
        "slug": "cmicveracruzpuerto",
        "cover": "20220523_060519_7960cbbd540e5d2b8ea5d8acee568baa.jpg"
    },
    {
        "podcast_id": 130021,
        "title": "7-Gründe warum Sie Arbeitssicherheit und Gesundheitsschutz digitalisieren sollten",
        "description": "7 Gründe, warum Sie Arbeitssicherheit und Gesundheitsschutz digitalisieren sollten.\n\nArbeitssicherheit und Gesundheitsschutz hat in allen Branchen oberste Priorität und sollte von allen Mitarbeitenden, vom Arbeitnehmer bis zum Arbeitgeber gelebt werden. Auch gibt es viele Gesetze und Richtlinien, welche es zu berücksichtigen und einzuhalten gilt. Ein Verstoss gegen dies Gesetzte oder Richtlinien der Arbeitssicherheit und Gesundheitsschutz, kann auch Ihrem Unternehmen eventuell teuer zu stehen kommen. Zur Umsetzung aller Vorgaben braucht es einiges an Kommunikation, Dokumentation und Organisation. Da kann man schon mal den Überblick verlieren, und dadurch indirekt auch die Rechtskonformität.\n\nWir nennen Ihnen im Folgenden sieben Gründe, weshalb die Digitalisierung der Arbeitssicherheit und Gesundheitsschutz auch für Sie viele Potential mitbringt.",
        "language": "de-ch",
        "author_name": "7-Gründe",
        "slug": "sieben-gruende",
        "cover": "20220524_040523_fc11dda8e84f4d9592a339c674045bd1.jpg"
    },
    {
        "podcast_id": 130202,
        "title": "HOA 101 with Joe Holland & Industry Experts",
        "description": "Sit down with Joe Holland and other industry experts while they discuss all things property management. With over 30 years of managing community developments and investment properties, Joe will educate, inform, and provide you with a good laugh or two through this podcast. ",
        "language": "en",
        "author_name": "Property Management Systems, Inc.",
        "slug": "pmsystems",
        "cover": "20220524_110541_36d39c74c9b010752d3720bfde66ade9.jpg"
    },
    {
        "podcast_id": 130753,
        "title": "The FX Money Show",
        "description": "Navigating Society to Discover Profits.  Discussing trade ideas, market analysis and helping traders develop profitability. Forging through to expose market transparency the way it was meant to be.",
        "language": "en",
        "author_name": "N Vendetti",
        "slug": "iforex",
        "cover": "20220528_060556_d4da76a32889391d23180a1bf0e6682e.jpg"
    },
    {
        "podcast_id": 131997,
        "title": "The Bred Fund Podcast",
        "description": "Questo è il Podcast di Bred Fund, un canale in cui trovare momenti di riflessione e condivisione su come si sta evolvendo il mondo finanziario e su come possiamo muoverci al suo interno, in maniera consapevole. \nQuesti podcast sono estrapolati dalle dirette Youtube che teniamo sul nostro canale. ",
        "language": "it",
        "author_name": "Bred Fund",
        "slug": "bred-fund",
        "cover": "20220603_100647_cfd37f7b230be3266256724509a03687.jpg"
    },
    {
        "podcast_id": 133470,
        "title": "Leaked Lunch with The Blind Spot",
        "description": "Join Izabella Kaminska as she lunches her way through markets, economics and finance with a host of top tier guests. Warning: Sessions are recorded \"as live\" and may contain refreshments. ",
        "language": "en",
        "author_name": "Izabella Kaminska",
        "slug": "leakedlunch",
        "cover": "20230210_030237_e77ab5935c5dee374bc27bfbe159b1fa.jpg"
    },
    {
        "podcast_id": 133901,
        "title": "Bitcoin Cash Hangout",
        "description": "Bitcoin Cash Hangout with Fiendish Crypto.",
        "language": "en",
        "author_name": "Fiendish Crypto",
        "slug": "fiendishcrypto",
        "cover": "20220626_050631_f59826892e963f27c441a603573a7eb7.jpg"
    },
    {
        "podcast_id": 134522,
        "title": "Beyond Wealth ",
        "description": "Hunter Coleman is a registered representative and investment adviser representative of Hilltop Securities Inc. HilltopSecurities is a registered broker-dealer and registered investment adviser that does not provide tax or legal advice. This website is only intended for clients and interested investors residing in states in which HilltopSecurities or its financial advisors are qualified to provide brokerage services or investment advisory services. HilltopSecurities does not attempt to furnish personalized investment advice or services through this website. Certain places on this site offer direct access or \"links\" to other websites that contain information that was created, published, maintained or otherwise posted by institutions or organizations independent of HilltopSecurities. HilltopSecurities does not endorse, approve, certify or control these websites and does not assume responsibility for the accuracy, completeness or timeliness of the information located therein. Visitors to these sites should not use or rely on the information contained therein until after consulting with an independent finance professional. HilltopSecurities does not endorse or recommend any commercial product or service described on these independent sites. HilltopSecurities is a wholly owned subsidiary of Hilltop Holdings, Inc., (NYSE:HTH) with offices at 717 N. Harwood Street, Suite 3400, Dallas, TX 75201, (214) 859-1800. Past performance is no guarantee of future results. \n\nhttps://advisors.hilltopsecurities.com/hunter-coleman/\n",
        "language": "en",
        "author_name": "Hunter Coleman",
        "slug": "hunter-coleman-financial-advisor-austin-texas",
        "cover": "20220616_050653_51d10d7a30b96309d48fc78992683f12.jpg"
    },
    {
        "podcast_id": 134728,
        "title": "Mortgage Chicks With Hot Tips",
        "description": "Mortgage Chicks with Hot Tips is a podcast made for anyone looking to gain expert insight into the mortgage industry. \n\nFrom tips on how to navigate the current housing market to in-depth interviews with experts in the field, this podcast is made for homebuyers, sellers, real estate agents, and mortgage industry professionals looking to increase their knowledge of the lending industry and find homebuying success.\n\nEach week, the Mortgage Chicks discuss the various loan programs, services, and resources we offer at VanDyk Mortgage and share how they have helped hundreds of realtors and homeowners achieve their goal of homeownership.\n\nKim Harestad NMLS# 224710:\nPhone: (727)-458-2821\nEmail: kharestad@vandykmortgage.com\n \nElizabeth Hole NMLS# 375232:\nPhone: (813) 928-0126 \nEmail: ehole@vandykmortgage.com\n\nCindy Walker NMLS# 320523:\nPhone: (727) 460-3171 \nEmail: cwalker@vandykmortgage.com\n \nStacey Van Schenck NMLS# 657366:\nPhone: (727) 439-9288 \nEmail: staceyv@vandykmortgage.com\n\nThis podcast is sponsored by VanDyk Mortgage Corporation NMLS# 3035 | nmlsconsumeraccess.org | Equal Housing Lender | VanDykMortgage.com | 2449 Camelot Ct. SE, Grand Rapids, MI 49546 | 888-482-6395",
        "language": "en",
        "author_name": "Stacey Van Schenck, Cindy Walker, Kim Harestad, and Elizabeth Hole",
        "slug": "mortgagechickswithhottips",
        "cover": "20220616_020615_eb172814e08531269c88c83e18cf28fa.jpg"
    },
    {
        "podcast_id": 135785,
        "title": "But Does It Sell Cars?",
        "description": "“But, Does it Sell Cars” is an audio collaboration exploring social advertising results that will positively affect your dealership’s bottom line. Answering the question: Does social media actually help you sell more cars?",
        "language": "en",
        "author_name": "SOCIALDEALER",
        "slug": "butdoesitsellcars",
        "cover": "20220621_060635_a1606ffd90221f16337159d1dfaa3a55.jpg"
    },
    {
        "podcast_id": 135959,
        "title": "A Spin on Offshore Wind",
        "description": "A Spin on Offshore Wind is the brand-new podcast brought to you by Energi Coast, North East England’s offshore wind cluster.\n\nIn this series of podcasts join NOF’s Caroline Lofthouse as she brings you insights, project updates and interviews from key cluster members who are shaping offshore wind. From subsea cables to the US supply chain and regional development, A Spin on Offshore Wind has all aspects of the industry covered.\n\nYou can find A Spin on Offshore Wind on Spotify, Apple Podcasts, Soundcloud and Youtube, alternatively you can visit energicoast.co.uk\n",
        "language": "en",
        "author_name": "Energi Coast",
        "slug": "aspinonoffshorewind",
        "cover": "20220622_090647_b172c1404bfbc70b2864be3f4cc1c09f.jpg"
    },
    {
        "podcast_id": 136243,
        "title": "GamesHUB | Talk Show",
        "description": "A new talk show and podcast by GamesPad. Join our discussion with TOP experts, big investors, world-known influencers, and successful GameFi entrepreneurs.\n\n",
        "language": "en",
        "author_name": "GamesPad",
        "slug": "gameshub",
        "cover": "20220625_060639_b17c0a21770dfa66c1e123d7681122f9.jpg"
    },
    {
        "podcast_id": 136252,
        "title": "Foliko Live",
        "description": "Travis Nixon and Tyler Tucci discuss stock market insights derived from Artificial Intelligence and Machine Learning",
        "language": "en",
        "author_name": "Travis Nixon",
        "slug": "folikolive",
        "cover": "20220623_050607_deca080733e6ea66005a54a7375863b4.jpg"
    },
    {
        "podcast_id": 136667,
        "title": "BullCaster | Talk Show by BullPerks",
        "description": "Crypto talk show by BullPerks - the fairest and most community-dedicated multichain launchpad. Join a discussion with top industry experts, investors, and influencers on BullCaster.  \n\n",
        "language": "en",
        "author_name": "BullPerks",
        "slug": "bullcaster",
        "cover": "20220625_090603_029032ddf3ceac07ae46bf27a4b1d1bc.jpg"
    },
    {
        "podcast_id": 136901,
        "title": "Web3guys",
        "description": "Lets meet the team and dive in to our new project upcoming project and what's happening with life and business",
        "language": "en",
        "author_name": "Nick Fraser",
        "slug": "web3guys",
        "cover": "20220713_040728_0cebd047b5d39b9e2648e87947d34ecc.jpg"
    },
    {
        "podcast_id": 136972,
        "title": "Aravis Presents",
        "description": "<p>Join the team at Aravis Capital and guests, as they dig into the ideas, themes and strategies that make the investment management world tick.</p>",
        "language": "en",
        "author_name": "Aravis Capital Limited",
        "slug": "aravispresents",
        "cover": "20230821_070806_27cd3a806aea53f3af803f8fc8e1567f.jpg"
    },
    {
        "podcast_id": 137318,
        "title": "Quinto Piso",
        "description": "Las cosas tal y como son; tu fuente de noticias destacadas y capsulas informativas.\n\nSigámonos en twitter: @MarioBautOff\n",
        "language": "es",
        "author_name": "Mario Bautista",
        "slug": "quinto-piso",
        "cover": "20220628_090621_63e05c1b87faf6027d08e98aecae775e.jpg"
    },
    {
        "podcast_id": 137408,
        "title": "Your Investing Questions Answered by Jason Kelly",
        "description": "<p>Bestselling author Jason Kelly answers your investing questions. Call 303-747-4428 to leave a message with your question. Topics regularly covered include: stocks, bonds, ETFs, the Federal Reserve, interest rates, yields, and retirement.</p>",
        "language": "en",
        "author_name": "Jason Kelly",
        "slug": "kellyletter",
        "cover": "20230201_090239_77eda617d5d1a7e67d29cd6e382315cd.jpg"
    },
    {
        "podcast_id": 137434,
        "title": "The We-Are-HR Podcast",
        "description": "Being a professional isn't easy. Irrespective of your field, we have to keep up with this fast-paced world and all its shenanigans, on a daily basis. This can result in our work-life balance going for a toss and most of the time there is little to no advice on how to get our life back on track. Join the We-Are-HR podcast where our host Natasia Hieber speaks with guests from varied walks of life, on different topics. These topics include career advice, conflict management, and well-being to name a few. ",
        "language": "en",
        "author_name": "Natasia Hieber",
        "slug": "we-are-hr",
        "cover": "20220629_110634_30b69aaefc736cbc9553ab3d20c94c49.jpg"
    },
    {
        "podcast_id": 137757,
        "title": "Jobs for Women",
        "description": "<p>Step into the world of <strong>Jobs for Women</strong>, where real-life experiences from women in the workplace take centre stage. Each episode delves into heartfelt stories of determination, obstacles, and achievements, addressing pivotal issues like discrimination, the gender pay gap, and the seldom-discussed gender health gap. Join us as we connect listeners with progressive companies championing diversity and inclusion. Seeking the truth about women's experiences in their careers? Jobs for Women is your essential listen. 🔊👩‍💼🌟</p>",
        "language": "en",
        "author_name": "Zoe Haydn Jones",
        "slug": "jobsforwomen",
        "cover": "20220926_120916_fd77182333bd693909830446198504fe.jpg"
    },
    {
        "podcast_id": 138632,
        "title": "Test_Editoria",
        "description": "Il sistema integrato di informazione Euroconference garantisce aggiornamento e approfondimento per il mondo dei Professionisti.\nLa varietà di riviste consente di essere aggiornati tempestivamente su tutte le principali novità del settore, di avere le soluzioni per le varie problematiche di studio nonché di poter approfondire accuratamente le tematiche di interesse.\n\nOgni testata ha un Comitato Scientifico che garantisce sull'autorevolezza dei contenuti.\n\n<a href=\"https://www.euroconference.it/editoria/riviste\">Scopri il catalogo completo delle riviste Euroconference</a>",
        "language": "it",
        "author_name": "Ec Test",
        "slug": "20220705ectest1",
        "cover": "20220915_080934_62fb7a0be34d32cf445ac47ba5a30b9c.jpg"
    },
    {
        "podcast_id": 140366,
        "title": "Let's Chew Podcast",
        "description": "Welcome to the Let’s Chew Podcast, presented by Gulfood,The Largest Annual F&B Sourcing Event In The World. I am your host Juweyria Hersi bringing you compelling stories and insights into a wide range of topics in the food and beverage industry from farming, behind the scenes, to the culinary world, to foods we simply love to chew on.\n\nIn this podcast series, we talk to people, brands, and businesses across the food and drinks spectrum to find out more about why they do what they do and how in their way they are championing change and shifting the future of food and drink.",
        "language": "en",
        "author_name": "Gulfood",
        "slug": "letschewpodcast-gulfood",
        "cover": "20220720_100702_9fc4f30a65fb51ec66e13b929c276c22.jpg"
    },
    {
        "podcast_id": 140396,
        "title": "El Podcast de Dosmedia",
        "description": "En este podcast iremos tratando temas que nos interesan, novedades, tips, noticias y polémicas relacionadas con lo que más nos gusta: el marketing.",
        "language": "es",
        "author_name": "Dosmedia Agencia de Marketing",
        "slug": "dosmedia",
        "cover": "20220714_030715_bcac282070840ef8c945f0b45c85c76d.jpg"
    },
    {
        "podcast_id": 140398,
        "title": "IMGA PODCASTS - Mensal",
        "description": "Programa mensal da responsabilidade da IMGA que coloca profissionais da indústria de gestão de ativos a falar sobre os temas económicos e financeiros mais relevantes da atualidade e sobre desafios a enfrentar nos próximos tempos.",
        "language": "pt-pt",
        "author_name": "IM Gestão de Ativos",
        "slug": "imgapodcastsmensal",
        "cover": "20220714_030723_443ab0cfd8315efa62895ce040996d98.jpg"
    },
    {
        "podcast_id": 140483,
        "title": "Crypto Confidential",
        "description": "il primo talk show di crypto e cucina condotto dal crypto chef Giorgio Gramegna e dal crypto nerd Alessio Cappuccio",
        "language": "it",
        "author_name": "Giorgio Gramegna & Alessio Cappuccio",
        "slug": "cryptoconfidential",
        "cover": "20220715_120721_964fcf669fd53a0dea853c92abfd35e3.jpg"
    },
    {
        "podcast_id": 141332,
        "title": "GAWDA Media Podcast",
        "description": "The official podcast of the Gases and Welding Distributors Association.",
        "language": "en",
        "author_name": "GAWDA Media",
        "slug": "gawdamedia",
        "cover": "20220719_040742_7f707af10024d534c609f8da2f9caefd.jpg"
    },
    {
        "podcast_id": 141594,
        "title": "Calgary Real Estate Investing",
        "description": "A breakdown of real estate investing in Calgary with realtor Abby Everingham and guests. Listen in for market updates, tips, and hear from some of Calgary’s most successful investors.\n\nInstagram: abby.everingham\nWeekly investor email signup: http://eepurl.com/h1xB_b",
        "language": "en",
        "author_name": "Abby Everingham",
        "slug": "calgaryrealestateinvesting",
        "cover": "20220720_090750_535646becee2c70e3f8d9a29adaff927.jpg"
    },
    {
        "podcast_id": 142764,
        "title": "Builders of Biotech",
        "description": "Builders of Biotech is a show about innovation in the biotech sector, told through the experiences of industry experts and influential scientists. Host Lucas Carter investigates scientific breakthroughs with the people who made them happen, making sure to appreciate the technical wonder and human element of each discovery. Join us for stories from biotech that are informative, personal, and always fascinating. ",
        "language": "en",
        "author_name": "Lucas Carter",
        "slug": "buildersofbiotech",
        "cover": "20220727_010724_3941113ef871c195fd9ef5cb7e569d4d.jpg"
    },
    {
        "podcast_id": 142986,
        "title": "Color for Empowerment",
        "description": "Our mission is to educate children about relevant, ongoing issues such as human trafficking and ocean pollution through coloring and activity books with fun elements included such as mazes, word puzzles, and more. Our podcasts aim to educate and go in depth of issues with an older generation who might already have background of these. We hope you enjoy!",
        "language": "en",
        "author_name": "Arushi Choudhury",
        "slug": "colorforempowerment",
        "cover": "20220802_020830_b43a18a52f0bd332818bb12f944bfeb1.jpg"
    },
    {
        "podcast_id": 143115,
        "title": "Unusual Whales",
        "description": "Unusual Whales covers financial topics and market news. We help navigate various topics in finance, from options, to equities, and get some of the experts in the field to help you follow the flow. 🐳",
        "language": "en",
        "author_name": "Unusual Whales",
        "slug": "unusualwhales",
        "cover": "20220728_050701_20c5da8bba5b87ada093241f2d1f29c4.jpg"
    },
    {
        "podcast_id": 143522,
        "title": "Red, White & True: Re-Defining \"Progress\"",
        "description": "<p>Talking about the policies and ideas coming from our Gov't and the media's failure to tell us the truth. The past and present facts, statistics, and truth about the issues shaping and changing America and where our current leadership is taking us in the future. Discussing the rise of Marxism and cultural Marxism in America. Looking at the massive lies the Gov't is telling us and where it's leading us. Factual and statistical based talking points and arguments identifying the real narrative of what issues are impacting American's lives and how.. A LOOK AT WHETHER THIS IS GOOD FOR AMERICA, AMERICANS, AND THE WORLD. TRYING TO ANSWER THE QUESTION, \"IS AMERICA BETTER UNDER THIS NEW LEADERSHIP AND IS THE MEDIA TELLING US THE TRUTH IN ORDER TO COME TO AN INFORMED CONCLUSION?\". This is the GOAL and MISSION of the RW&amp;T Podcast, to provide and make fact based arguments to attempt to answer this ever important question.</p>",
        "language": "en",
        "author_name": "Andrew Britton",
        "slug": "redwhiteandtrue",
        "cover": "20220731_100753_7d0783353863641732b8565d6fc44c24.jpg"
    },
    {
        "podcast_id": 144103,
        "title": "Northwest Now",
        "description": "<p>Join host Tom Layson in taking a closer look at issues and people of Western Washington.</p>",
        "language": "en",
        "author_name": "Tom Layson",
        "slug": "northwest-now",
        "cover": "20230802_030839_84a7eed5b573c3d08308474f74ae6e2b.jpg"
    },
    {
        "podcast_id": 144218,
        "title": "Accountancy on Prescription ",
        "description": "<p>RBP are one of the leading medical specialist firms of chartered accountants in the UK. RBP have over 30 years’ experience in the medical field and they will be sharing their broad and experienced knowledge through their fortnightly Accountancy on Prescription podcasts. Listeners who will be interested in subscribing to these informative and relevant shows are doctors in general practice, locum doctors, hospital consultants, practice managers and PCNs. RBP can be contacted via their website, www.rbp.co.uk, by email info@rbp.co.uk, or call 020 8370 7777. We are always here to help. The content of RBP’s podcasts has been obtained from, or is based on, sources that we believe to be accurate and reliable. Although reasonable care has been taken in gathering the necessary information, we cannot guarantee the accuracy or completeness of any information we broadcast in our shows. We accept no liability for any errors or omissions in information provided by the RBP team or their guest speakers. You should always carry out your own independent verification of facts and data prior to making any investment, legal or tax decisions.</p>",
        "language": "en",
        "author_name": "RBP Chartered Accountants",
        "slug": "rbp",
        "cover": "20220803_010839_7591f932819bcc88e05ceb3ae3b458d6.jpg"
    },
    {
        "podcast_id": 144391,
        "title": "inDebt ",
        "description": "<p>inDebt with Ulrika Lobo dives into all things business, economics, and private debt. If you're looking for critical insights and current news, look no further. We have it all. You won't want to miss the unbelievable deals, the surprising indicators, and the ever changing Australian economy. Join Ulrika Lobo from Sparrow Loans to hear more!</p>",
        "language": "en",
        "author_name": "Ulrika Lobo",
        "slug": "ready-set-debt",
        "cover": "20221121_041115_bd7ceb476432a41627db2e2e748ed6aa.jpg"
    },
    {
        "podcast_id": 145288,
        "title": "Real Estate Wise Guys",
        "description": "Sean Waeiss and Zac Barger are the Real Estate Wise Guys!  Join them for updates, tips and guidance for the current real estate market in Austin, Texas and beyond.",
        "language": "en",
        "author_name": "Zac Barger",
        "slug": "realestatewiseguys",
        "cover": "20220910_060907_9e79f3bbb05637e4268ae37b96f50eee.jpg"
    },
    {
        "podcast_id": 145606,
        "title": "SAMVAD - JEWELLERS TALK SHOW ",
        "description": "Delhi Jewellery and Gem Fair by Informa Markets in association with SVAR - The Voice of Jewellers is excited to present to you A REVOLUTIONARY PODCAST SERIES “SAMVAD -JEWELLERS TALK SHOW” An exclusive series wherein you learn about the success stories of the top brands, the challenges they faced and how they overcame them. Learn and explore about the latest technologies, new trends and developments in the gems and jewellery industry.",
        "language": "en",
        "author_name": "Delhi Jewellery and Gem Fair ",
        "slug": "jewellerspaathshalabyinformamarkets",
        "cover": "20220812_040826_9065f86018b5f07cbbbaa370fb94fe46.jpg"
    },
    {
        "podcast_id": 146831,
        "title": "Protalk - Aangeboden door Protecta Solutions",
        "description": "In deze podcast behandelt Protecta Solutions diverse thema's omtrent de opslag van gevaarlijke stoffen, het gebruik van vloeistoffen en het bestrijden van lekkages. ",
        "language": "nl",
        "author_name": "Protecta Solutions",
        "slug": "protectasolutions",
        "cover": "20220816_120846_2fe86847aa15a5125e0f4424cec764cc.jpg"
    },
    {
        "podcast_id": 147141,
        "title": "The Clear to Close Podcast",
        "description": "Learn how to mortgage with ease with Heath and Tim!",
        "language": "en",
        "author_name": "Tim and Heath",
        "slug": "clear-to-close",
        "cover": "20220817_080812_eb4bc67df3b431cd693b4f984b515e18.jpg"
    },
    {
        "podcast_id": 147289,
        "title": "Hawksman Real Estate",
        "description": "Drumroll please…here is our very first Hawksman Podcast where we chat houses, holidays and Harry Styles. We were both well out of our comfort zones but at least the Gin was real.",
        "language": "en",
        "author_name": "Hawksman",
        "slug": "hawksman",
        "cover": "20220818_110855_1ecbc1b3e9e4f890fd970d9217166213.jpg"
    },
    {
        "podcast_id": 147681,
        "title": "Secondo Stock Gain",
        "description": "<p>In questo podcast illustriamo il contesto economico attuale, fornendo diversi spunti per aiutare gli investitori ad ottenere buoni rendimenti dai mercati finanziari. Iscriviti per non perdere nemmeno una puntata!</p>",
        "language": "it",
        "author_name": "Stock Gain",
        "slug": "stock-gain",
        "cover": "20221020_031007_6c23e7d51c007b6b94a9b92c12f51c3d.jpg"
    },
    {
        "podcast_id": 148457,
        "title": "Out on a Limb - Where Traditional Finance and the New Digital Economy Converge",
        "description": "Tim Enneking gives high-level commentary on current events and other global macroeconomic factors that are shaping the fiat/crypto spaces and their growing inter-relationship. This podcast is designed for a broad range of audiences including those only beginning their journey into traditional finance and/or the digital asset space to those with an intermediate to professional understanding of global economics. Tim gives brief, thematic, and highly-focused updates and viewpoints in an easy-to-digest and time-efficient format. \n\nMr. Enneking is the Chief Investment Officer of Mana Companies Asset Management, a nine-digit multi-generational family office and trust based in San Diego. Tim is also the founder and Principal of Digital Capital Management, LLC (“DCM”). DCM manages Crypto Asset Fund, which was awarded the \"#1 hedge fund in 2021\" in terms of absolute performance. He is also currently engaged as a Partner at three other crypto asset management companies, Psalion, BlockLabs and Hexis Management. Prior to founding DCM, Mr. Enneking was the founder and investment manager for the Crypto Currency Fund (“CCF”), one of the world’s first private funds focused on cryptocurrencies. Simultaneously, in 2013, he was engaged to manage the world’s first Bitcoin fund. He also has extensive international M&A experience, having completed more than 70 transactions with an aggregate transaction value of over US$12 billion. Tim is a retired Lieutenant Colonel and was a company commander during Desert Storm 1. He is Airborne, Ranger, and French Commando qualified. During his time in the military, he worked at embassies in London, Brussels, Moscow and Paris. Tim has five university degrees, all in international business and law. He speaks English, near-native Russian and French, and German.\n\nDisclaimer:\n\nPLEASE READ THE FOLLOWING DISCLAIMER, DATA PROTECTION AND PRIVACY POLICY AND LEGAL NOTICES BEFORE USING THE PODCASTS.\n\nThe Podcasts are for information purposes only. This should not be relied upon as a basis for investment decisions. Before making any investment, you should carefully seek independent legal, tax and regulatory advice. In particular, you should seek the advice of a licensed financial adviser regarding the suitability of the investment product, taking into account your specific investment objectives, financial situation, any particular needs and your ability to assume the risks involved, before you make a commitment to purchase the investment product. These podcasts are for general evaluation only. Any claims are not to be perceived as recommendations and do not take into account the specific investment objectives, financial situation or particular needs of any particular person. We make no recommendation and accept no responsibility or liability of any kind, with respect to the accuracy or completeness of the information presented here nor for any loss (whether direct, indirect or consequential) that may arise from any use of the information contained in or derived from these podcasts.\n\nThis podcast occasionally contains explicit language.",
        "language": "en",
        "author_name": "Tim Enneking",
        "slug": "out-on-a-limb-tim-enneking",
        "cover": "20220929_040939_503e58a434eda7f5e133c6d6f5d45b09.jpg"
    },
    {
        "podcast_id": 148909,
        "title": "Oil News - Oil Investments - By Sean Pruitt Pres. of Kingdom Exploration LLC",
        "description": "Oil and Gas News Channel",
        "language": "en",
        "author_name": "Sean Pruitt",
        "slug": "kingdomexploration",
        "cover": "20220907_090957_c31ab470c4c3e62c0a7801b72547b64d.jpg"
    },
    {
        "podcast_id": 149903,
        "title": "The Specialist - a Pepper Money Podcast",
        "description": "Get the lowdown on what’s going on in the mortgage industry in around 20 minutes with our very own Rob Barnard and special guests. In this podcast series we’ll be talking to mortgage industry thought leaders who aren’t afraid to address pressing issues happening in the here and now.\n\nThe content of this podcast is for UK based mortgage intermediaries.\n\nThe opinions expressed in this podcast are personal to the presenter and guest and may not reflect the views of Pepper Money.\n\n#PepperSpecialistPodcast",
        "language": "en",
        "author_name": "Pepper Money",
        "slug": "thespecialistapeppermoneyproduction",
        "cover": "20220908_030930_9ef4496a71340e74f7a03ede70fe285c.jpg"
    },
    {
        "podcast_id": 150216,
        "title": "Aprendiendo a Invertir",
        "description": "En nuestro podcast te pondremos al día con las noticias financieras y bursátiles más importantes del momento. También hablaremos sobre lo que está ocurriendo en el mercado e valores para poder detectar oportunidades  de inversión así como los activos que no vale la pena invertir.\n",
        "language": "es",
        "author_name": "Invierte Hoy",
        "slug": "inviertehoy",
        "cover": "20221206_061225_59ffab99a3d99c068dcbfcbf212ee592.jpg"
    },
    {
        "podcast_id": 150228,
        "title": "Relatable Real Estate Podcast",
        "description": "Welcome to the Relatable Real Estate Podcast! Here we talk about the Greater Vancouver Real Estate market in simple terms so you can understand and relate to the presented topics.",
        "language": "en",
        "author_name": "Daniel Santos & Cade Perkins",
        "slug": "relatablepodcast",
        "cover": "20220831_100806_3c29e81e0779ab2812909d5efeb7d6a9.jpg"
    },
    {
        "podcast_id": 151848,
        "title": "Interprise Design Industry Insights",
        "description": "We are excited to announce our upcoming video podcast series called Interprise Industry Insights! We intend to address current topics in the Commercial Real Estate industry. Our expert guests will provide innovative approaches to key issues in today's market place. ",
        "language": "en",
        "author_name": "Interprise Design",
        "slug": "interpriseindustryinsights",
        "cover": "20220907_070906_b8cc09bd0cfcaa84d1c73caf9673ffa2.jpg"
    },
    {
        "podcast_id": 152153,
        "title": "Driving Mobility",
        "description": "The mobility industry is undergoing unprecedented growth, innovation, and disruption. \n\nThere are new EVs hitting the market, ambitious electric vehicle goals, alternative fuels, EVTOLs and so much more. \n\nTo get a grasp on all of this, the hot trends and the direction the industry is headed, Driving Mobility is sitting down with the biggest thinkers and innovators who are leading the way in the mobility space.",
        "language": "en",
        "author_name": "ParkMyFleet",
        "slug": "drivingmobility",
        "cover": "20220908_100904_221232509450f5a2ab8d8fdeceef745d.jpg"
    },
    {
        "podcast_id": 154745,
        "title": "Un café con GROWTH",
        "description": "Un café con GROWTH es un espacio distendido para hablar con expertos/as de marketing digital, creación de contenido, UX, diseño, inteligencia artificial, street art… Y todo lo que se nos ocurra.\n\nEmitimos en directo a través de la plataforma Contrast y puedes estar al día siguiéndonos en redes o suscribiéndote a nuestra newsletter",
        "language": "es",
        "author_name": "GROWTH.LAND",
        "slug": "un-cafe-con-growth",
        "cover": "20220920_020959_e926d367ee5e59a9c60373d418a6d074.jpg"
    },
    {
        "podcast_id": 155283,
        "title": "The Real Talk with Claudia Mostaghasi- Presented by HomeSouce Mortgage ",
        "description": "A podcast that tackles problems and solutions that people in the real estate industry face. We go in depth at how to analyze the real estate market, and also go into the real world situations that occur in our lives. ",
        "language": "en",
        "author_name": "Claudia Mostaghasi",
        "slug": "therealtalk-with-claudia-mostaghasi",
        "cover": "20220927_050916_358d03056e375d4e89bf6609409d0a5f.jpg"
    },
    {
        "podcast_id": 156017,
        "title": "Euroconference",
        "description": "Il sistema integrato di informazione Euroconference garantisce aggiornamento e approfondimento per il mondo dei Professionisti.\nLa varietà di riviste consente di essere aggiornati tempestivamente su tutte le principali novità del settore, di avere le soluzioni per le varie problematiche di studio nonché di poter approfondire accuratamente le tematiche di interesse. \n\nOgni testata ha un Comitato Scientifico che garantisce sull'autorevolezza dei contenuti.\n\n<a href=\"https://www.euroconference.it/editoria/riviste\">Scopri il catalogo completo delle riviste Euroconference</a>",
        "language": "it",
        "author_name": "Gruppo Euroconference Spa",
        "slug": "euroconference",
        "cover": "20220926_080915_244f58ee693b72dd3923e430bc533fb0.jpg"
    },
    {
        "podcast_id": 156064,
        "title": "Mole Valley Farmers",
        "description": "The Mole Valley Farmers’ podcast covers the latest farming news, technical advice and business and market matters using top experts from across the UK. So, whether it’s grassland management, market conditions, feed prices or policy changes, our Podcasts are here to help. Produced in association with Seth Conway Media. \n\nDon’t forget to subscribe to keep up to date when every new episode is out.  ",
        "language": "en",
        "author_name": "Mole Valley Farmers",
        "slug": "mvf",
        "cover": "20220926_020931_f48b13efe747b83305b92400114a16fe.jpg"
    },
    {
        "podcast_id": 156075,
        "title": "Pensar, Amasar, Crecer. El podcast de panadería de Arturo Blanco. ",
        "description": "Arturo Blanco es Asesor técnico - comercial en Panadería y empresas del sector. En este Podcast Arturo trata temas relevantes sobre la panadería y bollería, y además, conversa con algunos de los profesionales más relevantes del sector. \n",
        "language": "es",
        "author_name": "Arturo Blanco",
        "slug": "arturo-blanco",
        "cover": "20230117_050108_007e77ef9954fff1d25131ff050adf40.jpg"
    },
    {
        "podcast_id": 156630,
        "title": "Uplifting Conversations, The Impact Engagement Podcast ",
        "description": "Our work must lift us up, and our capital should do the same. Welcome to UPLIFTING Conversations - The Impact Engagement Podcast with Toussaint Bailey, Founder, and CEO of Uplifting Capital. On this show, we dive into the endless possibilities of personalized impact with influential business leaders, to discuss investments and beyond. Join us on an UPLIFTER’S journey to create impact through giving, living, learning, and advocating. \n\n",
        "language": "en",
        "author_name": "Toussaint Bailey ",
        "slug": "uplifting-conversations",
        "cover": "20230110_100153_4c4acbf28ec8612895119e30bd9104a3.jpg"
    },
    {
        "podcast_id": 156671,
        "title": "The BDN Content Podcast",
        "description": "<p>Welcome to the BDN Content Podcast, where I talk about things related to marketing, economics, entrepreneurship, and Bitcoin. I'm here to share what I've learned on my journey to becoming financially stable, so you can help yourself do the same.</p>",
        "language": "en",
        "author_name": "Brian Dean Nibley",
        "slug": "bdncontent",
        "cover": "20220929_030931_3a53d5930a122ff1044fce45fa5a9958.jpg"
    },
    {
        "podcast_id": 157753,
        "title": "The BASH",
        "description": "Join Matthew Bagell, CPA and Scott A. Shaw, CFA®, CFP® on The BASH, where they bring the Analyst and the Planner to the table to discuss relevant financial and investment topics.\n\nwww.bashcapital.com\n\nSecurities and advisory services offered through LPL Financial, a Registered Investment Advisor,\nMember FINRA/SIPC.\n\n",
        "language": "en",
        "author_name": "Matthew Bagell",
        "slug": "bashcapital",
        "cover": "20221107_021146_1f05dd50105b8d9360657810116b1798.jpg"
    },
    {
        "podcast_id": 157824,
        "title": "Change Before Change",
        "description": "In our everchanging global health landscape clarity is vital! Healthcare has become the center of major changes throughout the world. \n\nThe Change Before Change Podcast hosted by Dr. Fadi Manuel will look to highlight & address new technologies and innovations that will impact the healthcare ecosystem.\n\nThrough our discussions with industry experts we will assess health economic patterns, discuss market access trends, and provide a global perspective on healthcare issues and news. \n",
        "language": "en",
        "author_name": "AESARA",
        "slug": "changebeforechange",
        "cover": "20221005_101008_de52eda2feeb9ae19301fa5636506bfc.jpg"
    },
    {
        "podcast_id": 158517,
        "title": "Green Light with The LTW Group at Fairway Mortgage",
        "description": "Most mortgage companies are competitive, not collaborative.\nYou get one loan officer, and what your LO can do is limited to their experience and knowledge. The LTW Group takes a different, client-first approach. Our mortgage advisors have complementary skills and areas of specialization, and we work together as one cohesive unit.\nIf your mortgage advisor can’t answer a question for you, they will pull in the right expert. You get a smooth application process, the right advice, and the best loan for your unique situation. We don’t just talk about genuinely caring about your success. We show that we care by keeping up with changes and guidelines. We also show it with clear communication. Do you have updates, questions, or concerns? Do you need a pep talk? We always have time to educate and encourage you. That’s why we’ve created an after-hours line for you. You won’t be left wondering where we are in the process or the status of your application.\n\nSo if you prefer fun, approachable advisors over stiff, starched officers, let’s talk. Huzzah!",
        "language": "en",
        "author_name": "The LTW Group",
        "slug": "theltwgroup",
        "cover": "20230118_050140_3ffc89e4833df02420120ced7311938a.jpg"
    },
    {
        "podcast_id": 159261,
        "title": "Traders of the Lost Charts",
        "description": "The Rocky Outcrop community presents Traders of the Lost Charts hosted by Sarah Ristaino! \n\nThe friendly financial show for traders discussing trading, technical analysis (T.A), finances and life with members of the Rocky Outcrop community.",
        "language": "en",
        "author_name": "Rocky Outcrop",
        "slug": "traders",
        "cover": "20221010_121044_cf17c440d152550626bfa307d3001d37.jpg"
    },
    {
        "podcast_id": 160191,
        "title": "Let's Do Business hosted by Alma D. Bañuelos",
        "description": "<p>Alma D. Bañuelos, Business Outreach Coordinator at San Diego Unified School District, and invited guests provide information on how to grow your business and contract with local public agencies. If you are a new business finding your way or an established one hoping to grow, this is the podcast for you. Episodes are grouped by business topics like free resources, valuable professional organizations, tips for profitable contracting, things successful contractors wish they knew early on, and more!</p>",
        "language": "en",
        "author_name": "San Diego Unified School District",
        "slug": "sdusd-lets-do-business",
        "cover": "20230512_090539_20a93eb61ef1c4424cc1e1d8d276be87.jpg"
    },
    {
        "podcast_id": 160682,
        "title": "Hot Commodity: the collision of mental health and tech",
        "description": "When investors started pouring millions of dollars into the field, they created a whole new industry:\n\n\"Mental Health Tech.\"\n\nBusiness leaders and therapists promote the same agenda - improving mental health outcomes - but their strategies and worldviews couldn't be more different.\n\nHot Commodity aims to bring light to the tension in the industry, hear from leaders, and chart a way toward sustainable, ethical growth - because mental health is too important to \"move fast and break things.\"\n\n  ​Megan Cornish, LICSW is a mental health clinician who now freelances with mental health startups on content, marketing, and strategy.\n",
        "language": "en",
        "author_name": "Megan Cornish, LICSW",
        "slug": "hotcommodity",
        "cover": "20221015_101059_c041632ac5b2a50726761b5c0fc99285.jpg"
    },
    {
        "podcast_id": 161036,
        "title": "30 Minutes in Finance",
        "description": "<p>Bi- Weekly Finance Podcast focusing on SME businesses that operate and revolve around finance. A focus on Property finance but we are looking to expand into all areas! We are UK based and focus mostly on the UK market, but much of the takeaways from the episodes are very transferable to all markets. Our youtube channel: https://www.youtube.com/channel/UC0oEviecI12YP-5IzrPLQAQ</p>",
        "language": "en",
        "author_name": "30 Minutes in Finance - David Garbett",
        "slug": "30minutesinfinance",
        "cover": "20221017_091010_4e6d08bda37d56c3fbc7fde471e3097b.jpg"
    },
    {
        "podcast_id": 162026,
        "title": "Trading Insights with FXT",
        "description": "Join Tim Muirhead, Chief Investment Officer of Arbidyne Capital, and Michael Berman, CEO of FXTRADING.com, for this week’s episode of Trading Insights. Trading Insights with FXT is a weekly talk show hosted by FXTRADING.com(FXT) that provides viewers with invaluable insights into the market from some of its leading trading veterans. \n\n----------------------------------------------\n\nWhat is FXT Navigator™? \n\nFXT Navigator is a complete set of institutional calibre tools and analytics developed by traders, for traders. It can help retail clients to access cutting-edge trading capabilities, and greatly enhance their insight and knowledge as investors.\n\nAbout Michael and Tim\nTim Muirhead is the Chief Investment Officer of Australian-licensed fund manager Arbidyne Capital. He is a veteran trader with a background in engineering, and previously worked with renowned proprietary trading firm Tibra Capital. Tim is also the co-founder of Fignition Private Investment.   \n\nMichael Berman is the Chief Executive Officer of FXTRADING.com. He has over 20 years of experience in the allocation of trading capital and product development. Michael is an innovative product developer, researcher and trader with deep psychological and qualitative insights. His key areas of expertise lie in psychology, economics, trading and investment.   ",
        "language": "en",
        "author_name": "FXTRADING.com",
        "slug": "trading-insights-with-fxt",
        "cover": "20221108_111156_74c230e90034d158d1be679db0d61311.jpg"
    },
    {
        "podcast_id": 162164,
        "title": "K&H piac & gazdaság",
        "description": "A K&H podcast csatornája pénzügyi aktualitásokról & a piac minden rezdüléséről.",
        "language": "hu",
        "author_name": "K&H piac & gazdaság",
        "slug": "khpiacgazdasag",
        "cover": "20221021_021019_06cc23935f17a6826757625480629d28.jpg"
    },
    {
        "podcast_id": 162214,
        "title": "Talking Investment Management",
        "description": "<p>Join Stradley Ronon attorneys as they discuss key topics in the investment management industry. </p>",
        "language": "en",
        "author_name": "Stradley Ronon Podcasts",
        "slug": "stradley",
        "cover": "20221201_051222_f3055f5df6e7e793f25bb148509b9169.jpg"
    },
    {
        "podcast_id": 162567,
        "title": "This Week in College Viability",
        "description": "Imagine your college student calls home in a panic.  Their college just announced it is about to close - for good.   \n\nHow do you avoid this story happening to you?\n\nMany private colleges have recently closed and it is likely many more will close.  \n\nOur College Viability App shows which ones are more likely to do so.   Don't let your student choose a financially unhealthy college and lose lost credits, lost time and lost money if it closes.  We have done all the work to let you compare the financial health of these colleges and choose one that will have the resources to provide your student with a solid education.\n\nAs a former college administrator, I have seen first-hand the financial challenges that too many private colleges face and have chosen not to share with you.\n\nThe College Viability App enables students, parents, leaders and others to compare the changes in a private colleges’ finances, enrollment, and outcomes over a recent period of 6 years.\n\nFor families this information lets them make more informed decisions about their college choice -- limiting the risk choosing a one whose financial results suggest viability concerns in the coming months and years.\n\nFor higher education leaders, the App provides comparative data about competitors and potential merger or alliance partners.\n\nHere is a YouTube link showing how to use the College Viability App.  https://bit.ly/3jGXA9t\n\nHere is the full College Viability YouTube channel.   See if a college you are considering is reviewed for financial health and viability.    https://bit.ly/3DLq7mr\n\nIf you want to get updates to your inbox, go to   https://www.collegeviability.com/institute-lead-magnetj5cyzcmf \n\nAt CollegeViability.com, we have also developed a curated site about private colleges and higher education.  It serves as a single source for timely news about the challenges of both.\n",
        "language": "en",
        "author_name": "Gary Stocker",
        "slug": "twicv",
        "cover": "20221023_021047_741376d0cc56ed28a0a7aed2414c1b5e.jpg"
    },
    {
        "podcast_id": 162873,
        "title": "Well Travelled with ATPI",
        "description": "The last three years have emphasised the importance of open dialogue in the effort to restore the business travel industry. In this new series, ATPI brings together industry experts with the people who are working hard to keep-up the return of travel.",
        "language": "en",
        "author_name": "ATPI",
        "slug": "the-atpi-podcast",
        "cover": "20221031_101038_888531930a1775c65ff84e0ec252f9df.jpg"
    },
    {
        "podcast_id": 163296,
        "title": "De Klantcontact Pro's Podcast",
        "description": "<p>Welkom bij de Klantcontact Pro's Podcast. Onze missie is om organisaties te helpen bij het creëren van waardevolle klantrelaties en gaan het gesprek met pro's uit de markt. Luister je mee?</p>",
        "language": "nl",
        "author_name": "Save Your Customers",
        "slug": "kppodcast",
        "cover": "20221026_111057_b54b991a70d222d51d011481ef15645b.jpg"
    },
    {
        "podcast_id": 163460,
        "title": "Keeping it Base",
        "description": "The founders of the New Jersey cannabis brand, Plant Base LLC is here to teach minorities how to get into the cannabis industry from a first person point of view. Plant Base will bring you along their journey of entering the industry and updating the world with the latest news and culture in this new emerging market place.",
        "language": "en",
        "author_name": "Plant Base LLC",
        "slug": "keepingitbase",
        "cover": "20221027_011044_ef595411af7f1840b67f01b6b67926fd.jpg"
    },
    {
        "podcast_id": 163660,
        "title": "CRES Insurance Risk Management Webinar Series ",
        "description": "You'll find detailed tips to help real estate professionals be successful while minimizing the risks of E&O claims and real estate lawsuits.  CRES specializes in protecting real estate professionals with customized Errors and Omissions insurance.  We can directly underwrite your real estate E&O policy, or help you find the best option if we are not the best fit.  We also help real estate business owners and real estate offices with liability, property, cybersecurity, and workers' compensation insurance.",
        "language": "en",
        "author_name": "CRES Insurance",
        "slug": "cres-insurance-risk-management-webinar-series",
        "cover": "20221027_101053_a2b3808e8ea369e04cb53802b6d9fff9.jpg"
    },
    {
        "podcast_id": 164472,
        "title": "PULSO HIPOTECARIO",
        "description": "En Pulso Hipotecario, el podcast de la Asociación de Brokers Hipotecarios (ABH),\nqueremos dar información y guía a cualquier persona que esté buscando un crédito\nhipotecario y necesite el apoyo de un asesor.\nEn este espacio, conducido alternadamente por Eugenio Klee y Jorge Alcántara,\nPresidente y Director de la ABH, respectivamente, contaremos con especialistas en\nfinanzas, con los directivos de los principales bancos de México; así como con las cabezas de los principales brokers hipotecarios del país, para que cada uno de ellos nos de su perspectiva sobre el mercado de crédito hipotecario en México y nos desglosen con detalle los principales productos para que puedas tomar una de las decisiones más importantes de tu vida: adquirir o mejorar tu patrimonio\n",
        "language": "es-mx",
        "author_name": "Podbox Studios",
        "slug": "pulsohipotecario",
        "cover": "20221031_111055_35b1b436665e91808d7f2adaf75429d3.jpg"
    },
    {
        "podcast_id": 166348,
        "title": "Investiční podcast s Vladimírem Pikorou",
        "description": "Novinky a zajímavosti z ekonomiky a investování s Vladimírem Pikorou. Poslouchejte podcasty s uznávaným makroekonomem a analytikem finančních trhů. ",
        "language": "cs",
        "author_name": "Vladimír Pikora",
        "slug": "vladimir-pikora",
        "cover": "20221108_091110_55b3e56031496b4c3fa8426480c6324b.jpg"
    },
    {
        "podcast_id": 167246,
        "title": "Business Banter & Bourbon",
        "description": "Listen to the best new opinion podcast in these uncertain times. Rants and opinions that never stop, while two economical wizards sip on a new bourbon whiskey each week. The takes are as sharp as the liquor!\n\n\nThe content in this podcast is intended for educational and entertainment purposes. Individuals on this podcast are not financial advisors. \n\nThis is a free podcast for the sole intention of entertainment and business and economic news.\nAll opinions expressed by all individuals on this podcast are solely their own. Do not treat any opinion expressed by any individual on this podcast as a specific inducement to make a particular investment or follow a particular strategy, but only as an expression of their opinions. Specific ideas provided in this podcast are meant to be illustrative examples of themes and concepts only. All individuals’ statements and opinions are subject to change without notice. No individuals on this podcast are in any way compensated for the specific opinions expressed. \nIdeas and opinions expressed on this podcast do not guarantee in any way any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment discussed on this podcast or on the show. Investments or strategies mentioned on this podcast or on the show may not be suitable for you, nor are any ideas to be interpreted as recommendations for you, they are examples and ideas only. This material does not take into account your particular investment objectives, financial situation or needs and is not intended as recommendations appropriate for you. You must make an independent decision regarding investments or strategies mentioned on this show. Before acting on information on this website or on the show, you must consider whether it is suitable for your particular circumstances and must seek advice from your own financial or investment adviser.\n\nPlease drink Bourbon responsibly.",
        "language": "en",
        "author_name": "Business Banter & Bourbon Podcast",
        "slug": "bizbanterbourbon",
        "cover": "20221111_061158_098285ece330de1938e91b1cb84777f9.jpg"
    },
    {
        "podcast_id": 167305,
        "title": "Small Farm Minute",
        "description": "Small Farm Minute allows small farmers to share their stories of micro-farming amongst the microchips in Silicon Valley, keeping the culture of agriculture alive in the place formally known as the \"Valley of Hearts Delight\" due to the diverse agriculture that had covered the valley and now has been shrunk down.",
        "language": "en",
        "author_name": "Christopher Mabie",
        "slug": "smallfarmminute",
        "cover": "20221126_031103_4856efcf2e5b6d88771b11ad83aa1172.jpg"
    },
    {
        "podcast_id": 168178,
        "title": "CHRO Quick Talks",
        "description": "CHRO Quick Talks is a podcast series featuring CHROs from the Equilar community to discuss the challenges faced by top HR leaders.",
        "language": "en",
        "author_name": "Equilar",
        "slug": "chroquicktalks",
        "cover": "20221115_061125_c968c0e8a0e29f36c2b26b1e030d95c4.jpg"
    },
    {
        "podcast_id": 169038,
        "title": "The Comeup radio station ",
        "description": "<p>We are a radio station/ podcast out Greenville sc. we interview ppl all around the world to help promote their business or music. Mel &amp; Dj yuni on Tuesdays at 6pm. Bite-Size on Thursdays at 6pm. Quincy James Monday-Friday 5pm to 7pm KonversationsWithGlo Wednesdays at 5:30pm to 6pm</p>",
        "language": "en",
        "author_name": "Quincy James Mel Lloyd Dj yuni Bite-size ",
        "slug": "thecomeupradiostation",
        "cover": "20221119_051158_a4c601a08ff8292604c8a6e88869b8be.jpg"
    },
    {
        "podcast_id": 170079,
        "title": "Magnitude Inc.'s Marketing & Communications Podcast",
        "description": "<p>Magnitude's President (Leona Laurie) and Head of Content (Marcia Simmons) break down the month's events in marketing and social media, and maybe have a little fun, too.</p>",
        "language": "en",
        "author_name": "Thomas Laurie",
        "slug": "magnitudemmm",
        "cover": "20230323_050335_7002fb79da3f1325421aa6542ab97c3f.jpg"
    },
    {
        "podcast_id": 170596,
        "title": "Arch Publications Business Insight",
        "description": "<p>The Arch Publications Business Insights podcast, bringing print to life.</p><p>Each edition Katy meets local business owners to talk about their past, present and future. These interviews expand on from our in print interviews and offer the readers and a wider audience a better sense of who they are and what they can offer our communities and maybe inspire the next generation of entrepreneurs in Cheshire.</p><p>You can find out more about our magazines at www.archpublications.com</p>",
        "language": "en",
        "author_name": "Arch Publications",
        "slug": "archpublications",
        "cover": "20230225_090214_f1026537a47107ff90450c40b75ecbe1.jpg"
    },
    {
        "podcast_id": 170760,
        "title": "Success Tulsa",
        "description": "Podcast versions of the interviews heard on Success 1057.",
        "language": "en",
        "author_name": "Success 1057 Radio",
        "slug": "successtulsa",
        "cover": "20221127_031138_5213a84dff2defbc87ac45d1936a1406.jpg"
    },
    {
        "podcast_id": 171395,
        "title": "Glenwood Financial Partners LLC",
        "description": "Rick believes in contributing his time to the community and has been an active volunteer in charitable, professional, scholastic, and athletic activities, and he currently serves on the investment Commitment of the North Carolina Bar Association. He greatly enjoys time with friends on the golf course, and his treasures his wife, Hargrave, and his three sons and their families.",
        "language": "en-us",
        "author_name": "Richard C. McElroy, III, AWMA, JD",
        "slug": "glenwood-financial-partners",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 171406,
        "title": "Raleigh Wealth Solutions",
        "description": "Raleigh's Retirement Coach Brian Raleigh and Mikayla Raleigh provide sound advice during this monthly \"Shelter from the Storm\" podcast. You work your entire life to provide for you and your family. The Raleighs help you protect those assets and help you make sure you never run out of money. Call Raleigh Wealth Solutions today for more information, at 919-852-1215.",
        "language": "en-us",
        "author_name": "Brian Raleigh & Mikayla Raleigh",
        "slug": "raleigh-wealth-solutions",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 171540,
        "title": "Tom Kearney",
        "description": "A native of Goldsboro Tom Kearney grew up listening to WPTF and was a particular fan of Carl Goerch.\n\nEducated at Wake Forest College and the University of North Carolina Tom taught for several years before joining WPTF in 1982.\n\nAlong with various other shows and duties, Tom has hosted theTom Kearney Show (Openline with Tom Kearney) since December,1988.\n\nTom's program is a general interest talk/interview show that he hopes is edifying and entertaining.",
        "language": "en-us",
        "author_name": "Tom Kearney",
        "slug": "tom-kearney",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 171793,
        "title": "Money Matters",
        "description": "For more than 30 years, Lewis Financial Management, LLC, has been providing clients with Comprehensive Financial Planning. They pride themselves on being far more than just  \"money managers,\" believing in TOTAL financial planning and helping clients along the path to achieving their goals.\n\nTune into Money Matters with the Lewis Family, and listen as Doug, Linda and Deborah Lewis answer your tax, investment, retirement, cash-flow and estate questions.",
        "language": "en-us",
        "author_name": "Doug, Linda, & Deborah Lewis",
        "slug": "money-matters",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 172023,
        "title": "Z-Elite",
        "description": "Mit dem Z-Elite-Blog bleiben Sie in allen Versicherungs- und Vorsorgefragen auf dem Laufenden. Wir veröffentlichen regelmässig Inhalte zu aktuellen Themen, die Ihnen Tipps und Tricks aufzeigen, wie Sie das Beste aus Ihrer Krankenkasse bekommen zum Best-Preis.   ",
        "language": "de-ch",
        "author_name": "Alena",
        "slug": "z-elite",
        "cover": "20221202_011247_cccbbedfc5d038bddfecad4561b19503.jpg"
    },
    {
        "podcast_id": 174527,
        "title": "Foresight News",
        "description": "<p>Foresight Daily is a daily podcast covering the latest news in the web3 space. Tune in every day for updates and insights on decentralized technology and its impact on the future. Stay ahead of the curve with \"Foresight Daily\". </p><p>ForeCast is the podcast exploring the future of Web3 through engaging discussions with thought leaders in the blockchain and cryptocurrency space. Whether you're a seasoned crypto enthusiast or new to the game, Forecast is your one-stop source for in-depth analysis and informed perspectives on the future of decentralized technology. Tune in for thought-provoking conversations, valuable insights, and a glimpse into the ever-evolving world of Web3. Our guests come from a wide range of backgrounds, including developers, investors, entrepreneurs, and researchers, bringing unique perspectives and experiences to the table. We cover a variety of topics related to Web3, such as decentralized finance, blockchain scalability, privacy and security, token economics, and more. Our goal is to provide an open and honest platform for discussion, where we can challenge assumptions and explore new ideas.</p>",
        "language": "en",
        "author_name": "kean",
        "slug": "kean",
        "cover": "20230201_040253_42ceba7a60c2db38b8bb599efda2cad5.jpg"
    },
    {
        "podcast_id": 175322,
        "title": "TRAde SeCREts",
        "description": "Here at Totum Realty Advisors, we view commercial real estate through three different sets of eyes. With 45 years combined experience, we often round table and discuss topics: current events, regulations, general stories and client experiences. Grab a bourbon with us and enjoy! We invite you to listen in, suggest topics and join us! \n\nGuests are welcome, as are comments and feedback.\n\nIf you would like to throw an idea out for our podcast or join us sometime, email us at kelsey@totumrealtyadvisors.com.\n\nContact Info for the Team:\nKevin Riley, SIOR, CCIM - Kevin@totumrealtyadvisors.com\nMichael Castle - Michael@totumrealtyadvisors.com\nPaige Myers - Paige@totumrealtyadvisors.com\nOffice Phone: 412-745-5000",
        "language": "en",
        "author_name": "TRAde SeCREts ",
        "slug": "tradesecrets-episode16",
        "cover": "20230119_090119_62ee3252a55c0f1a8c1448610c77f052.jpg"
    },
    {
        "podcast_id": 175356,
        "title": "AranaCast by Arana Ventures",
        "description": "Parth and Abdullah, the founding partners of Arana Ventures, discuss recent news in the cryptocurrency industry and dive deep into the conceptual, technical and philosophical components of Blockchain Technology.\n\nAranaCast communicates the complexities of the space in layman's terms while doing the in-depth research even insiders can learn from.",
        "language": "en",
        "author_name": "Parth & Abdullah",
        "slug": "arana-ventures",
        "cover": "20221219_091200_f65786265905c633060927f83b778c9e.jpg"
    },
    {
        "podcast_id": 175643,
        "title": "Get The Best Reviewed Personal Injury Firm In Nevada!",
        "description": "Benson & Bingham Accident Injury Lawyers, LLC is a top rated personal injury firm providing service throughout the state of Nevada.\n\nDowntown Office\n626 S 10th St\nLas Vegas, NV 89101\nPhone: (702) 382-9797\nWebsite: https://www.bensonbingham.com/\n\nSummerlin Office\n11441 Allerton Park Drive #100\nLas Vegas, NV 89135\nPhone: (702) 684-6900\n\nHenderson Office\n9230 S Eastern Ave #155\nLas Vegas, NV 89123\nPhone: (702) 463-2900\nWebsite: https://www.bensonbingham.com/henderson-personal-injury-lawyer/\n\nReno Office\n1320 E Plumb Lane Ste A\nReno, NV 89502\nPhone: (775) 600-6000\nWebsite: https://www.bensonbingham.com/reno/",
        "language": "en",
        "author_name": "Benson & Bingham Accident Injury Lawyers, LLC",
        "slug": "bensonbingham",
        "cover": "20221221_111241_12b798c53d6302f7b363917a33520a4a.jpg"
    },
    {
        "podcast_id": 176020,
        "title": "PowerUp: Conversations with SDSIC Members",
        "description": "Trevor Scullion interviews SDSIC members about exciting projects they're working on and learn how they're creating new solutions to address the growing needs of our Power Grid. In each episode, members share deep, creative thoughts and share insights on their current efforts and projects. PowerUp is a master-class on Electric Utility work, creativity, leadership and how to support grid advancements.",
        "language": "en",
        "author_name": "Trevor Scullion",
        "slug": "powerup",
        "cover": "20230123_110112_1527639c251915bd2504649a6c7145e4.jpg"
    },
    {
        "podcast_id": 177060,
        "title": "SATTE TRAVEL INSIGHT - TRAVEL & TOURISM PODCAST SERIES ",
        "description": "SATTE by Informa Markets in association with Reemarkabl  presents \"SATTE TRAVEL INSIGHT - TRAVEL & TOURISM PODCAST SERIES\"  an exclusive series wherein you learn about the success stories of the top brands, the challenges they faced and how they overcame them. Learn and explore about the latest technologies, new trends and developments in the Travel and Tourism Industry. ",
        "language": "en",
        "author_name": "Surendra Pal Singh ",
        "slug": "sattetravelinsightpodcastseries",
        "cover": "20221230_051255_72fceddb8ba8a6dce71351e45d56f1cf.jpg"
    },
    {
        "podcast_id": 177328,
        "title": "Get Real (Estate) with Gavin & Josh",
        "description": "We are two real estate salespeople in the Western New York market that enjoy all things real estate. We'll be discussing the real side of real estate and educating buyers and sellers alike to what goes into selling and buying those homes. We'll also be talking to others as well to get their takes on the current state and issues in the market. Join us on our journey of teaching and learning!",
        "language": "en",
        "author_name": "Gavin Townsend & Josh Morgan",
        "slug": "getrealpodcast",
        "cover": "20230123_100108_701435b9dd95e07269654a44e2ef3cb0.jpg"
    },
    {
        "podcast_id": 179297,
        "title": "Dock Talk",
        "description": "Dock Talk is a podcast created by Maritime Professionals & Experts for Maritime Professionals & Experts. Want a community who asks and answers all of the industries questions? Well now you have it. Tune into Dock Talk once a month and stay up-to-date on the happenings in our industry!",
        "language": "en",
        "author_name": "Tessa Andres",
        "slug": "dock-talk",
        "cover": "20230112_080104_b76c1a44cc2a6c7528d9650132bb101f.jpg"
    },
    {
        "podcast_id": 179608,
        "title": "Plan With Callahan Podcast",
        "description": "This podcast covers all things money and investing.  From overall financial planning, to specifics such as retirement and retirement benefits, college savings, wealth management, banking, estate planning and everything in between.  If it has to do with money, we talk about it!",
        "language": "en",
        "author_name": "Ryan F. Callahan, CFP®, CIMA®, CPFA",
        "slug": "planwithcallahan",
        "cover": "20230209_080239_2bfb8ebc90ea1088c55291a9dba33ca7.jpg"
    },
    {
        "podcast_id": 180791,
        "title": "Turn Up ",
        "description": "<p>Emission talk généraliste Actualités, LGBT, Sexe</p>",
        "language": "fr",
        "author_name": "Romain Le Gal",
        "slug": "turnup",
        "cover": "20230827_020839_197e57a7ea19429af1cb3a8f3dada870.jpg"
    },
    {
        "podcast_id": 180981,
        "title": "Indian Market Story",
        "description": "<p>Welcome to 'The Indian Market Story', an enlightening journey through India's remarkable economic transformation over the past few decades.</p><p>From a humble per capita GDP of $370 in 1990 to an impressive $2200 in 2023, and with sights set on a projected $5000 by 2030, India's economic voyage is nothing short of an inspiring saga.</p><p>Each week, we delve into the dynamic factors that have contributed to this growth, through in-depth conversations with a diverse array of guests. Our lineup features everyone from seasoned businessmen and market mavens to cutting-edge entrepreneurs and finance whizzes, all lending their unique insights into the forces shaping India's economic landscape.</p><p>We explore a broad spectrum of markets, including equity, real estate, venture capital, private businesses, and fixed income markets. Through stories, insights, and expert analysis, we dissect the factors that have led to this incredible growth and what the future might hold.</p><p>'The Indian Market Story' is more than just a podcast; it's an exploration of a nation's journey to economic prosperity. Whether you're an investor keen on understanding the Indian market, an entrepreneur looking for inspiration, or someone intrigued by economic narratives, this podcast promises to provide a comprehensive understanding of one of the most exciting economic transformations of our time. Join us as we unravel the compelling narrative of India's economic ascent – the triumphs, the challenges, the innovation, and the sheer determination that have shaped the Indian Market Story.</p>",
        "language": "en",
        "author_name": "Varun Mehta",
        "slug": "weekly-market-story",
        "cover": "20230710_100755_ee410866681deaa3cb7d9e55bb565a10.jpg"
    },
    {
        "podcast_id": 181003,
        "title": "Kadry w pigułce",
        "description": "<p>Kadr w pigułce czyli praktyczny przewodnik po świecie prawa i rynku pracy. </p><p>Uczę, ustrukturyzowuję, uświadamiam. </p><p>Mam na imię Donata i będę Twoim przewodnikiem po świecie prawa i rynku pracy.</p><p>W podcaście będę mówiła o: </p><p>- projektach ustaw i rozporządzeń z omówieniem jaki mają wpływ na przedsiębiorców, specjalistów ds. kadr oraz pracowników;</p><p>- zmieniających się przepisach prawnych; </p><p>- trendach na rynku pracy w oparciu o różnorodne raporty opracowywane przez organizacje państwowe ale również prywatny sektor; </p><p>- innowacyjnych i technologicznych rozwiązaniach dla pracodawców, które mają optymalizować i automatyzować procesy w organizacji; </p><p>- nowych sposobach rekrutacji i narzędziach wspierających pozyskanie kandydatów do pracy; </p><p>- narzędziach oraz najnowszych metodach wspierających działania employer brandingowe w budowaniu pozytywnego wizerunku pracodawcy, </p><p>- uelastycznianiu form zatrudnienia oraz o tematach pokrewnych, które nie pozostają bez wpływu na rynek pracy. </p><p>-------------------------------------------------------------------------------------- 💊 Książka \"Prawo pracy. First minute\": <a href=\"https://sklep.kadrywpigulce.pl/produkt/ksiazka-prawo-pracy-first-minute-ebook-w-prezencie/\">https://sklep.kadrywpigulce.pl/produkt/ksiazka-prawo-pracy-first-minute-ebook-w-prezencie/</a> </p><p>💊 Blog: <a href=\"https://kadrywpigulce.pl/\">https://kadrywpigulce.pl/</a> </p><p>💊 Wesprzyj podcast na PATRONITE i otrzymaj prezent: https://patronite.pl/www.kadrywpigulce.pl</p>",
        "language": "pl",
        "author_name": "Donata",
        "slug": "kadrywpigulce",
        "cover": "20230410_030408_c5dad7b3bdd60f40344bee6144182a7a.jpg"
    },
    {
        "podcast_id": 183632,
        "title": "My FX Buddies",
        "description": "<p>News and updates on the Iraqi Dinar RV and Iraq Politics</p><p>Visit My <a href=\"https://www.myfxbuddies.com/2023/09/the-us-assistant-secretary-of-treasury.html\">FX Buddies Blog</a> to get more information</p>",
        "language": "en",
        "author_name": "Tish Washington",
        "slug": "myfxbuddies",
        "cover": "20230125_090135_e9be505f3a50d12f4f1c6fe876bed272.jpg"
    },
    {
        "podcast_id": 183870,
        "title": "People Changing The World 2023- A.Melo Edition ",
        "description": "<p>Podcast hosted by Alex Melo Crane editor-in-chief, reporter, and national gold medalist photographer. Will be highlighting corporations, small businesses, and people helping change the world with their products or good doing.  Some topics might be strong topics for some. This is not a typical podcast no scripts, just fluent conversations. Just raw good conversations if you hear a topic that you disagree with or dislike please skip it and enjoy the next one.  If you would like to send a donation to keep this podcast going please click on donate or want to be an episode sponsor please send me a direct email. </p>",
        "language": "en",
        "author_name": "Alex Melo Crane",
        "slug": "amelochangingtheworld",
        "cover": "20230327_120341_ac5c9c84fc662e1378aefb494f1bb912.jpg"
    },
    {
        "podcast_id": 184153,
        "title": "The Realest AMG’s Podcast",
        "description": "Focusing on current real estate topics and trends in Toronto and the GTA. With interviews and discussion with top industry leaders. ",
        "language": "en",
        "author_name": "Brandon Hebert",
        "slug": "realestamgs",
        "cover": "20230127_070113_8332f4ad1eb927aed25edc0a8a8d7aa6.jpg"
    },
    {
        "podcast_id": 185529,
        "title": "NFT Tallinn Talks | A Web3 Podcast",
        "description": "<p>Meeting Web3's pioneers and exploring their past as entrepreneurs, traders, developers, and dreamers; their present as founders, and their future as speakers at the largest Web3 conference in Northern and Eastern Europe: NFT Tallinn, happening in Tallinn, Estonia from May 8 - 10.</p>",
        "language": "en",
        "author_name": "Sander Gansen",
        "slug": "nfttallinn",
        "cover": "20230202_080250_f3df93001cea752d38920860076ae244.jpg"
    },
    {
        "podcast_id": 187710,
        "title": "Antares Vision Group - Italian",
        "description": "<p>Antares Vision Group è partner tecnologico d’eccellenza nella digitalizzazione e nell’innovazione per imprese, istituzioni e autorità governative, garantisce sicurezza, qualità, sostenibilità e efficienza di prodotti e filiere generando fiducia. Offre un ecosistema integrato di tecnologie – sia software, sia hardware - per garantire la qualità dei prodotti (sistemi e macchine di ispezione) e la tracciabilità dei prodotti lungo la filiera (dalle materie prime, alla produzione, dalla distribuzione fino al consumatore), con una gestione integrata di dati, di produzione e di filiera, anche tramite l’applicazione dell’intelligenza artificiale e l'utilizzo di blockchain. Antares Vision Group è attivo nel settore Life Science (farmaceutico, dispositivi biomedicali e ospedali), nel Beverage, Food, Cosmetico, Chimico e nel Packaging e potenzialmente in molte altre industrie. Leader mondiale per la tracciabilità dei farmaci, fornisce i principali produttori mondiali (oltre il 50% delle top 20 multinazionali) e diverse autorità governative, di soluzioni per monitorare la filiera e validare l'autenticità dei prodotti. Società quotata da aprile 2019 su AIM Italia e dal 14 maggio 2021 su Euronext - segmento STAR, Antares Vision Group ha raggiunto un volume d'affari nel 2021 per €179 milioni, è presente in più di 60 Paesi, impiega oltre 1100 dipendenti e consolida una rete di oltre 40 Partners internazionali. Ulteriori informazioni sono reperibili sul sito www.antaresvision.com e su www.antaresvisiongroup.com.</p>",
        "language": "it",
        "author_name": "Antares Vision Group",
        "slug": "antaresvisiongroup-italian",
        "cover": "20230216_050201_b8a15cdfab146b37a21064ce26e61145.jpg"
    },
    {
        "podcast_id": 187711,
        "title": "Antares Vision Group - English",
        "description": "Antares Vision Group is technology partner in digitalization and innovation for companies, institutions and governments, guaranteeing safety and quality, sustainability and efficiency of products and supply chains to build trust.\n It provides a unique and integrated ecosystem of technologies – including software and hardware – to guarantee product quality (inspection systems and equipment) and end-to-end traceability (from raw materials to production, from distribution to the consumer), through connected data management, applying artificial intelligence and blockchain .\nAV Group is active in the Life Science  (pharmaceuticals, medical devices, and hospitals), Beverage, Food, Cosmetics, Chemicals and Packaging  and potentially in many other industries. The world leader in track and trace solutions for pharmaceutical products, it provides major global pharma manufacturers (more than 50% of the Top 20 multinationals) and several government authorities with solutions to monitor their supply chains and validate product authenticity.\nListed since April 2019 on the Italian Stock Exchange in the Alternative Investment Market (AIM) segment and from 14 May 2021 in the STAR segment of the Mercato Telematico Azionario (MTA) (electronic equity market), AV Group recorded a turnover of Euro 179 million in 2021, operates in more than 60 countries, employs more than 1,100 people, and has a consolidated network of more than 40 international partners. For more information, visit antaresvision.com and antaresvisiongroup.com.\n",
        "language": "en",
        "author_name": "Antares Vision Group",
        "slug": "antaresvisiongroup-english",
        "cover": "20230208_030221_27dd27c55fc83d4ab83d6735b42ae552.jpg"
    },
    {
        "podcast_id": 188423,
        "title": "DFW Real Estate Weekly",
        "description": "<p>Todd Tramonte is an innovator and leader in the areas of real estate marketing and sales. </p><p>This weekly podcast covers the state of the market in DFW and listener questions.</p><p> If you need an expert, full-time, fully committed agent, call our team.</p><p>If you have ANY questions about relocating to Dallas Fort Worth or moving within Dallas Fort Worth, please contact us!</p><p>CALL: 214-216-2161 </p><p>EMAIL: <a href=\"mailto:info@toddtramonte.com\">info@toddtramonte.com</a> </p><p>WEBSITE: <a href=\"https://www.dallashomerealty.com/\">https://www.dallashomerealty.com/</a></p>",
        "language": "en",
        "author_name": "Todd Tramonte",
        "slug": "toddtramonte",
        "cover": "20230411_040422_a205dea3036106844c5da50ea5ffcd06.jpg"
    },
    {
        "podcast_id": 188952,
        "title": "The Topping Show ",
        "description": "<p>The Topping Show is a podcast around Business, Politics and Culture. Topping has run multiple small businesses for several years, and has long been fascinated by the interconnected trifecta that feeds another around the areas of Business, Culture, and Politics. </p>",
        "language": "en",
        "author_name": "Topping",
        "slug": "thetoppingshow1",
        "cover": "20230212_110203_a3beb9726c9058325e99318fc11f9ad6.jpg"
    },
    {
        "podcast_id": 189548,
        "title": "Fanzone",
        "description": "<p>A weekly podcast from Podfans about all the new features we are building. Remember <strong>The future is only the future until we build it. </strong></p>",
        "language": "en",
        "author_name": "Sam Sethi",
        "slug": "fanzone",
        "cover": "20230304_080310_eb412f97c423c07a8aaf0aac394e2905.jpg"
    },
    {
        "podcast_id": 190273,
        "title": "We Built This Business ",
        "description": "<p>We would like to welcome you to The We Built This Business Podcast with Dan and Dan. We will sit down with ambitious entrepreneurs to discuss their journey and explore their challenges, successes, failures, and future plans of their business.</p>",
        "language": "en",
        "author_name": "Dan and Dan",
        "slug": "theexperiencespecialistsgroup",
        "cover": "20230217_110243_085252035f7ca8b6e600b1de0d1c74e1.jpg"
    },
    {
        "podcast_id": 190876,
        "title": "Raise and Deploy: The International Investing Podcast",
        "description": "<p>Raise and Deploy: A podcast dedicated to international investment with insights from the world's leading investment professionals from New York to Timbuktu. Each episode we will discuss the trials and tribulations that occur when seeking significant returns in foreign and emerging markets. We cover the full life cycle of investment from the moment you raise capital to the final check cashed on return. If you have any questions or want to reach out to any guests, please email jb@deaglo.com</p>",
        "language": "en",
        "author_name": "Deaglo Partners LLC",
        "slug": "raiseanddeploy",
        "cover": "20230509_020543_0b4023a718dfdd2eee065321bfc9f004.jpg"
    },
    {
        "podcast_id": 191164,
        "title": "Mortgages with Sunny",
        "description": "<p>Sunny is an experienced mortgage lender in South Florida who decided to launch this podcast to share her knowledge, tips and guidance for new and existing homeowners. This podcast will cover an array of topics including home buying, investing, real estate and so much more!</p>",
        "language": "en",
        "author_name": "Mortgages with Sunny",
        "slug": "mortgageswithsunny",
        "cover": "20230221_020204_2689a97fb817a3c9e0d47fde358f1c2a.jpg"
    },
    {
        "podcast_id": 191346,
        "title": "The Home Straight ",
        "description": "<p>Our maiden podcast in which we ponder whether buying a home is a head-over-heart decision or whether love at first sight and following your gut is the way to go</p>",
        "language": "en",
        "author_name": "Michael Maloco ",
        "slug": "malocoandassociates-the-home-straight",
        "cover": "20230221_060254_9052f17e6c17752177f3cfa5a36c56d3.jpg"
    },
    {
        "podcast_id": 192137,
        "title": "Hash-Op Podcast",
        "description": "<p>Hash-Op is a podcast dedicated to Bitcoin Mining. My goal is to give bitcoiners a summary of headlines, developments, and innovations in Bitcoin mining space.</p>",
        "language": "en",
        "author_name": "Hoda Rezaei",
        "slug": "hash-op",
        "cover": "20230430_070402_872b1d5206c332a69aa7ebd41266760e.jpg"
    },
    {
        "podcast_id": 192415,
        "title": "Café Virtual con TaxaSistemas",
        "description": "<p>Café Virtual con TaxaSistemas es un espacio diseñado especialmente para tí, donde podrás conocer las últimas tendencias de las áreas contables, fiscales, laborales y de seguridad social.</p>",
        "language": "es-mx",
        "author_name": "TaxaSistemas Asesores de Negocios",
        "slug": "taxasistemas",
        "cover": "20230225_080233_f14e436b231dc5a763eebdd6b8bf109f.jpg"
    },
    {
        "podcast_id": 192452,
        "title": "Orlando Housing Market Weekly Update",
        "description": "<p>Join Brenden Rendo of The Homes In Orlando Team and Joseph Dionne of Appli Home Loans as we take a look at the factors affecting the Orlando housing market.  How these factors will change the way the market will react to these factors and what the current market statics tell us.</p>",
        "language": "en",
        "author_name": "Brenden Rendo",
        "slug": "orlandohousingmarketupdate",
        "cover": "20230225_110227_3bab22b652c0807b5f1d9ea00d8ebef6.jpg"
    },
    {
        "podcast_id": 193376,
        "title": "El Mundo Del Trabajo y la bioética laboral",
        "description": "<p>Un ejemplo de educación permanente y pedagogía constitucional es el programa radial, podcast y pagina web de la comunidad virtual del Ministerio de trabajo y la Universidad piloto de Colombia denominado el mundo del trabajo y la bioética laboral</p><p>“Son conferencias de los Inspectores de Trabajo, autoridades de paz como puente ético y bioético entre trabajadores y empleadores, que previenen los conflictos que surgen en las relaciones capital – trabajo; generando programas que pueden ayudar a resolver problemas específicos, definir políticas y plantear alternativas: son un equipo de hombres y mujeres que tienen como objetivo, servir de agentes sociales y hacer llegar a todos los sectores productivos las políticas del Ministerio, orientando a trabajadores y empleadores sobre los diferentes temas de las relaciones laborales. Atendiendo la necesidad de establecer acciones relacionadas con la función preventiva del Ministerio de Trabajo y con el ánimo de garantizar el cumplimiento de las normas legales y convencionales de derecho laboral, así como la promoción del diálogo social, la Dirección Territorial de Bogotá,  desarrolla el programa institucional de radio tiene como objetivo socializar información sobre la Oferta Institucional, así como orientar a trabajadores y empleadores sobre los diferentes temas relacionados con el derecho al trabajo. Se han emitido más de cien programas radiales desde el año 2017 durante 10 temporadas, la página web tiene más de 12000 visitas. Tiene una periodicidad semanal y se produce en la emisora Unipiloto Radio Online, que es miembro de la RRUC (Red de Radios Universitarias de Colombia), esta alianza hace posible tener una mayor visibilidad, alcance, intercambio y apoyos en la producción de su contenido. El programa tiene la siguiente ruta electrónica, sobre oferta institucional del sector trabajo de la D.T. de Bogotá, del Ministerio de trabajo: <a href=\"http://bioeticadeltrabajo.org/radio/\">http://bioeticadeltrabajo.org/radio/</a> El programa radial es parte del plan de acción de la Dirección Territorial de Bogotá de difusión de normas laborales, ha sido creado para atender a la población vulnerable (Trabajadores informales, del servicio doméstico, trabajo infantil y juvenil, adultos mayores, migrantes) y especialmente sectores críticos (Construcción, transporte, vigilancia, mano de obra intensiva, informales, servicios personales.) donde se puede consultar sobre: Empleo, trabajo y seguridad social, inspección y vigilancia del cumplimiento de normas laborales, la conciliación laboral, trabajadores rurales, vulnerables, informales e independientes, jornada laboral, salario, salud ocupacional y prevención de accidentes, evasión del sistema general de seguridad social y aportes parafiscales, tipos de contrato de trabajo, riesgos laborales, migración laboral, pensiones, trabajo juvenil, erradicación del trabajo infantil, trabajadores de la calle, orientación y atención al ciudadano para trámites ante el Ministerio de Trabajo, mujeres trabajadoras, derecho de asociación, intermediación laboral, trabajadoras del servicio doméstico, regulación del trabajo sexual, nuevas formas de relaciones laborales, políticas salariales, los comités de convivencia para la prevención del acoso laboral; ética laboral y trabajo decente, los convenios internacionales de trabajo de los cuales Colombia es signatario”. Ministerio de Trabajo &amp; Universidad Piloto de Colombia. (2019). El mundo del trabajo y la bioética laboral. Programa radial, podcast y página web de la comunidad virtual del Ministerio de Trabajo y la Universidad Piloto de Colombia. Recuperado el 20 de abril de 2022, de <a href=\"https://bioeticadeltrabajo.org/\">https://bioeticadeltrabajo.org/</a></p>",
        "language": "es-mx",
        "author_name": "Gabriel Gomez y James Olarte",
        "slug": "elmundodeltrabajo",
        "cover": "20230301_040337_1c918bf576c371d4ee2e74e1e317b9b8.jpg"
    },
    {
        "podcast_id": 194490,
        "title": "Properly Brainwashed",
        "description": "<p>Welcome to Properly Brainwashed a commentary on the social norms, a perspective of everyday choices we make that shapes our narrative of family, work, relationships, and finances.</p>",
        "language": "en",
        "author_name": "AZ and Andrea",
        "slug": "properlybrainwashed",
        "cover": "20230305_050321_fb2c27ea83e4cafab2f685f548dceb19.jpg"
    },
    {
        "podcast_id": 195180,
        "title": "STAFFING IN SYNC",
        "description": "<p><strong>STAY IN SYNC WITH THE LATEST STAFFING TRENDS AND INSIGHTS</strong></p><p>Staffing-in-Sync is a free series of live-streamed, bi-monthly “panel-casts” with the staffing industry's top thought leaders addressing today's most pressing staffing and business issues.</p>",
        "language": "en",
        "author_name": "ESC & SyncStream",
        "slug": "staffinginsync",
        "cover": "20230307_040301_5e3766886c67f3af18308ccb18a933ba.jpg"
    },
    {
        "podcast_id": 195221,
        "title": "#TimesUpLittler©",
        "description": "<p>#TimesUpLittler© is a podcast series about the author's experiences at her former employer, labor and employment law firm Littler Mendelson, P.C., including, but not limited to, its shareholders and practices, as well as other former and current employees' experiences with Littler.</p>",
        "language": "en",
        "author_name": "Uliana Kozeychuk, Littler Abuse Survivor©",
        "slug": "timesuplittler",
        "cover": "20230307_070335_63a8cfdd18439a8a918ac7014a4071e3.jpg"
    },
    {
        "podcast_id": 195794,
        "title": "American court hearing recording audio, including #crypto",
        "description": "<p>Please consider a BOOST or other donation to help support the efforts that make it possible for me to stream audio of American court hearing official recordings.  The audio can be accessed through the courts and sometimes through administration websites of bankrupt companies.  But it takes a few steps to access audio and play audio accessed that way.  Thanks to amazing streaming technology including Podcasting 2.0 I am able to make the audio accessible to people around the world who may be interested in reviewing.  With additional technology I am able to provide transcripts for some of the audio recordings, in the form of unofficial computer auto generated written transcripts.  These transcripts can assist people who are hearing impaired, and other people who prefer to read along.  The unofficial transcripts can be translated into other languages for convenience, by people using Google Translate and other translation tools available on the internet.  I hope access is useful to you in some way, and thank you for listening.</p>",
        "language": "en",
        "author_name": "Center of Main Interests",
        "slug": "the-comi",
        "cover": "20230313_010320_b7023ab05bdf7b55482a701ed43a6f19.jpg"
    },
    {
        "podcast_id": 195951,
        "title": "Cyber Security Business",
        "description": "<p>Hosted by Kevin Pouche, COO of K logix, Cyber Security Business interviews CISOs and other security leaders to hear their advice about the business of information security. This podcast gives our listeners actionable takeaways to help them increase the effectiveness of their security programs.</p>",
        "language": "en",
        "author_name": "K logix",
        "slug": "k-logix-cybersecurity-business",
        "cover": "20230310_040335_b54df5072139be9229100ad843334af1.jpg"
    },
    {
        "podcast_id": 195963,
        "title": "PodEBEM",
        "description": "<p>PodEBEM Podcast sobre <strong>E</strong>mpreendedores <strong>B</strong>rasileiros <strong>E</strong>spalhados pelo <strong>M</strong>undo destaca alguns brasileiros que escolheram empreender fora do Brasil e tiveram sucesso em seus negócios em diferentes partes do mundo. Você vai ouvir histórias inspiradoras de pessoas que superaram desafios, enfrentaram grandes mudanças culturais e mantiveram seus sonhos empreendedores.</p><p>Nós conversamos com empreendedores de diferentes áreas, como tecnologia, gastronomia, serviços, que compartilham suas experiências empreendedoras e suas perspectivas sobre as diferenças entre empreender no Brasil e em outros países.</p><p>Ao ouvir essas histórias, você terá uma ideia de como os brasileiros estão fazendo a diferença em diversas partes do mundo e como a criatividade, a coragem e a determinação podem levar ao sucesso empreendedor em qualquer lugar.</p><p>E-mail: <a href=\"mailto:podebemcast@gmail.com\">podebemcast@gmail.com</a></p><p><a href=\"https://www.instagram.com/podebemcast/\">https://www.instagram.com/podebemcast/</a></p><p><a href=\"https://www.youtube.com/@podebem-qy3lu\">https://www.youtube.com/@podebem-qy3lu</a></p><p><a href=\"https://www.facebook.com/profile.php?id=100090940178563\">https://www.facebook.com/profile.php?id=100090940178563</a></p>",
        "language": "en",
        "author_name": "Samuel Campos",
        "slug": "podebem",
        "cover": "20230529_020515_029b9e533b24063a804c32cf9ae6505e.jpg"
    },
    {
        "podcast_id": 195986,
        "title": "Digging into the Job Market",
        "description": "<p>Musings on the job market from the leading provider of job market data to the capital markets and corporations.</p>",
        "language": "en",
        "author_name": "LinkUp Job Market Data",
        "slug": "diggingintothejobmarket",
        "cover": "20230310_060307_fb05e4c9630268c2c061aa75afde64ad.jpg"
    },
    {
        "podcast_id": 196020,
        "title": "Taxed Enough Already",
        "description": "<p>\"It's your moral and patriotic duty to pay less is taxes\" is our business motto, and the core of our show <em>Taxed Enough Already.</em> The show covers some of the strategies we utilize to help individuals and businesses practice their “moral and patriotic duty by paying less in taxes.\" We also sit down with business leaders, decorated military Veterans, current and former elected officials to get their input over issues evolving around; taxation, economics, and high finance.</p><p><a href=\"http://www.FinanceForThought.com\">www.FinanceForThought.com</a></p><p>Contact email: <a href=\"mailto:info@financeforthought.com\">info@financeforthought.com</a></p>",
        "language": "en",
        "author_name": "Dan Nuwash, MBA",
        "slug": "taxedenoughtalreadyepisode1",
        "cover": "20230310_100318_d6f5e754054c710f62a7ef00ab0d470e.jpg"
    },
    {
        "podcast_id": 196915,
        "title": "Talk Time With Tom & Tina.",
        "description": "<p>Talk Time With Tom &amp; Tina: This podcast is designed for our current and future clients, business partners and the wider public. We are providing an update as to the weekly events which we see on the coal face pertaining to all things mortgages in Australia.</p>",
        "language": "en",
        "author_name": "Aria Financial Pty Ltd",
        "slug": "talktimewithtomandtina",
        "cover": "20230314_110330_691231b654f737a15fbe589f1e965c9c.jpg"
    },
    {
        "podcast_id": 196919,
        "title": "The Best At Work",
        "description": "<p>Join Best Companies Group to learn what it takes to be the Best at Work!</p><p>The best at leadership, the best at creating an amazing workplace, and the best professional you can be.</p>",
        "language": "en",
        "author_name": "Jaime Raul Zepeda",
        "slug": "bestatwork",
        "cover": "20230515_090535_c4e5c7d1d2e251619a2ee56c7a479451.jpg"
    },
    {
        "podcast_id": 197019,
        "title": "Leaders in Construction",
        "description": "<p>The Leaders in Construction Podcast is a must-listen for all individuals interested in the construction industry. Hosted by Stewart Wallace, this podcast features in-depth conversations with global leaders in the field, exploring their experiences and insights. Tune in to gain unique perspectives from some of the most successful and innovative leaders in the industry.</p>",
        "language": "en",
        "author_name": "Stewart Wallace",
        "slug": "leaders-in-construction",
        "cover": "20230627_120637_d9e43e975d16d0bdcab0882568a7ae8d.jpg"
    },
    {
        "podcast_id": 197235,
        "title": "The Osome Business Digest",
        "description": "<p>The must-listen, 10 minute segment on key developments for small businesses</p>",
        "language": "en",
        "author_name": "Osome ",
        "slug": "osome",
        "cover": "20230316_080321_03aeed55cfd7e052e6b9b8ec1331765d.jpg"
    },
    {
        "podcast_id": 197658,
        "title": "Escape Velocity",
        "description": "<p>A weekly news analysis show covering geopolitics, blockchain and the future of money. Brought to you by Valhil Advisors with co-hosts Jimmy Vallee &amp; Molly Elmore</p>",
        "language": "en",
        "author_name": "Molly Elmore",
        "slug": "escapevelocity",
        "cover": "20230318_020324_d105a52281ddb6fc9ac57e029da05898.jpg"
    },
    {
        "podcast_id": 198323,
        "title": "Gloriette trifft Nachhaltigkeit",
        "description": "<p>In diesem Podcast sprechen wir mit verschiedenen Stakeholdern über die nachhaltige Entwicklung im südtiroler Tourismus, um Einsicht in die verschiedenen Blickwinkel zu erhalten.</p>",
        "language": "de",
        "author_name": "Mirjam, Viktoria und Philipp",
        "slug": "gloriettetrifftnachhaltigkeit",
        "cover": "20230321_060351_48ca9416b04ae917748c8617480a9719.jpg"
    },
    {
        "podcast_id": 199059,
        "title": "Economic Development Radio",
        "description": "<p>The Economic Development Radio has been created as a platform to bring you interviews and discussions via podcasts and articles with:</p><p>Economic Development professionals, talking about issues facing the industry and their provinces, cities and towns. Business owners, managers and other stakeholders including business chambers throughout South Africa.</p>",
        "language": "en",
        "author_name": "Thokozani Thwala ",
        "slug": "economic-development-radio",
        "cover": "20230324_010327_f0a0a88eb40a0e84433113667e45cd13.jpg"
    },
    {
        "podcast_id": 199131,
        "title": "Flaman Connect",
        "description": "<p>Agriculture is more than an industry. It’s a community.</p><p>Flaman Connect is an agriculture podcast that’s part bio, part farm news, and part good old story swap. Hosts Trevor Grinde. Regan Kunz, and Mitch Flaman talk to some fascinating Agri-Canadians who know the farm life well and have a lot to say about its future.</p><p>If you like your important ag news and agriculture business mixed with entertaining trivia and fun, familiar stories, this is the farm podcast for you.</p>",
        "language": "en",
        "author_name": "Trevor Grinde, Regan Kunz & Mitch Flaman",
        "slug": "flaman-connect",
        "cover": "20230403_100447_2f8edb0765666053f717e1a195b4bf5b.jpg"
    },
    {
        "podcast_id": 199901,
        "title": "The DeCesare Group Podcast",
        "description": "<p>Are you interested in the latest economic development and business activities in Southcentral Kentucky? Then you will not want to miss The DeCesare Group Podcast hosted by Jim DeCesare, member of the Kentucky Association of Economic Development Hall of Fame.</p><p>The DeCesare Group Podcast is a companion to the SOKY Economic Development and Business newsletter. In each episode, we'll be talking to individuals who are in the know about the latest economic development and business activities in Southcentral Kentucky.</p><p>You'll hear from industry leaders, business owners, and other experts in the field, as they share their insights and perspectives on the economic and business landscape.</p>",
        "language": "en",
        "author_name": "Jim DeCesare",
        "slug": "tdg-podcast",
        "cover": "20230405_020439_c6f0c0dcc83a4c97505a241ebaa77714.jpg"
    },
    {
        "podcast_id": 200725,
        "title": "Business Boost : Unraveling the Top Business Stories of the Week",
        "description": "<p>Produced by: Shape Concierge </p><p>Website: <a href=\"http://shapeconcierge.com\">shapeconcierge.com</a> </p><p>Hosts: Porter Penrose, Charlotte Knight, and Miranda Milieu </p><p>Dive into \"Business Boost,\" a thought-provoking podcast by Shape Concierge that dissects the top business stories of the week. Each episode features our expert hosts, Porter Penrose, Charlotte Knight, and Miranda Milieu, who bring their unique perspectives and dynamic conversation to deliver in-depth analysis and actionable insights.</p><p>Experience the \"Business Boost\" consultancy service by Shape Concierge, tailored to elevate your business in the luxury market. With our cost-effective solutions, data-driven strategies, and increased brand visibility, we'll guide your business to stay ahead of the competition. Discover more about our services, membership plans, and career opportunities at <a href=\"http://shapeconcierge.com\">shapeconcierge.com</a>.</p><p>Don't miss out on future episodes packed with stimulating discussions and exclusive insights. Subscribe and share \"Business Boost\" with your network, and let's unlock the secrets to business success together.</p>",
        "language": "en",
        "author_name": "Shape Concierge",
        "slug": "business-boost",
        "cover": "20230401_090452_726b214e04ae8e2ec05610b42cea9cfb.jpg"
    },
    {
        "podcast_id": 201694,
        "title": "Between Us Agents ",
        "description": "<p>Robby Lyons, Sean Leahy, and Samantha Boyd have a combined 15 years of residential real estate sales experience - for the past few years they’ve spent their days navigating their teams of agents and clients through the turbulent Florida housing market. Helping facilitate over 1,000 transactions every year - they’ve seen their fair share of uh oh’s, oh no’s, and jesus-fucking-christs! Tune in for a comical take on real estate current events, horror stories, and tips on making your real estate career more successful. Off the clock and with drinks in hand, this podcast is by agents, for agents, but, most importantly, just Between Us Agents.</p>",
        "language": "en",
        "author_name": "Between Us Agents",
        "slug": "betweenusagents",
        "cover": "20230406_120445_e1ea40b68c76e055c810b9651d6f92b0.jpg"
    },
    {
        "podcast_id": 202629,
        "title": "TAX NEWS - Il podcast fiscale per tutti",
        "description": "<p>Ogni settimana una pillola sulle novità e sulle tematiche fiscali di maggior interesse per tutti coloro che non sono professionisti dei tributi.</p>",
        "language": "en",
        "author_name": "silvia saccani",
        "slug": "successo-del-podcast",
        "cover": "20230415_030419_4c7d3d9bcfe2644a95a0e38b9cec45ff.jpg"
    },
    {
        "podcast_id": 202974,
        "title": "Next day T Shirt Printing",
        "description": "<p>Need a custom t-shirt printed for a last-minute event or a special occasion? Look no further than 3v Printing Store. With our next day t-shirt printing service, you can get high-quality custom t-shirts printed in a hurry without sacrificing on quality. Whether you need just one shirt or dozens, we have the equipment and expertise to get the job done right and fast.</p><p>At 3v Printing Store, we use state-of-the-art printing technology and high-quality materials to create custom t-shirts that look and feel great. Our next day t-shirt printing service is perfect for businesses, sports teams, charities, events, and individuals who need custom t-shirts in a hurry. Contact us today to learn more about our next day t-shirt printing service and get started on your order! For more details, visit: <a href=\"https://3vprintingstore.com/next-day-t-shirt-printing-atlanta\">https://3vprintingstore.com/next-day-t-shirt-printing-atlanta</a></p>",
        "language": "en",
        "author_name": "Steve Johnson ",
        "slug": "next-day-t-shirt-printing",
        "cover": "20230413_080437_0604276b449aab99fb8756eb1e26d6c5.jpg"
    },
    {
        "podcast_id": 203205,
        "title": "Podcast - Forbes Ecuador",
        "description": "<p>Estrenamos nuestro <strong>podcast</strong> enfocado en historias con valor agregado de sectores únicos de Ecuador.</p>",
        "language": "es",
        "author_name": "Forbes Ecuador",
        "slug": "forbesecuador",
        "cover": "20230414_020432_ede6c95168e790f97b0afeb07d1c89de.jpg"
    },
    {
        "podcast_id": 205265,
        "title": "Power of passive investing & How to Retire Rich",
        "description": "<p>Welcome to \"Power of Passive Investing &amp; How to Retire Rich,\" the podcast that will teach you everything you need to know about investing your money wisely and building a secure financial future.</p><p>In each episode, we'll dive deep into different investment strategies, examining the benefits and risks of passive investing and exploring how it can help you grow your wealth over time.</p><p>Our guests will be a mix of financial advisors, industry experts, and successful investors who will share their own experiences and offer valuable advice on how to achieve financial freedom and retire comfortably. This podcast will provide you with the knowledge and tools you need to make informed decisions and maximize your returns.</p><p>So if you're ready to take control of your financial future and retire rich, join us on \"Power of Passive Investing &amp; How to Retire Rich\" for the insights and inspiration you need to succeed!</p><p>Follow Me on Social Media</p><p>Facebook: VJ Patel. Facebook Group: <a href=\"https://www.facebook.com/groups/864301437410963/\"><strong>Multi-Family/RV &amp; Mobile Homes/ Self Storage/1031/ Senior Living</strong></a> YouTube Channel: Power of passive investing &amp; How to Retire Rich, Linkedin: VJ  Patel, Website: <a href=\"http://www.thefuturegp.com\">www.thefuturegp.com</a>, FREE E-BOOK: www.thefuturegp.com/ebook</p>",
        "language": "en",
        "author_name": "VJ Patel",
        "slug": "thefuturegp",
        "cover": "20230711_020713_346da31e1b1deed6aa7f38bdea3da38c.jpg"
    },
    {
        "podcast_id": 205397,
        "title": "In The Bat Cave",
        "description": "<p>A recording of the BAT (basic attention token) communities weekly twitter space.</p>",
        "language": "en",
        "author_name": "BAT Community",
        "slug": "batcave",
        "cover": "20230516_020533_dd9f0d3fc3de8f23007d2ea446048a84.jpg"
    },
    {
        "podcast_id": 205461,
        "title": "DuPage Business Beat",
        "description": "<p>Today’s biggest business issues, told from a Chicagoland perspective. A podcast about emerging industries, shifting borders, economic ecosystems, and you. Featuring experts and entrepreneurs. Hosted by Greg Bedalov, President &amp; CEO of Choose DuPage. DuPage Business Beat is produced by <a href=\"https://www.choosedupage.com/\">Choose DuPage</a>.</p>",
        "language": "en",
        "author_name": "Choose DuPage",
        "slug": "dupage-business-beat",
        "cover": "20230425_060431_555d60c4155fd64ca212599cca71863f.jpg"
    },
    {
        "podcast_id": 205605,
        "title": "Mérlegen - a HVG üzleti podcastja",
        "description": "<p>Ahol az üzleti élet a közélettel találkozik, ott csípjük nyakon és hozzuk el műsorunkba: a Mérlegen podcast házigazdái, Csatári Flóra Dóra és Dzindzisz Sztefan híreken, történeteken és interjúkon keresztül mutatják be mindazt, ami a cégek világában történik, vendégeik pedig vállalkozásokról, trendekről, üzleti aktualitásokról mesélnek. De a hardcore business-rajongóknak sem érdemes elkapcsolniuk!</p>",
        "language": "hu",
        "author_name": "HVG podcastok",
        "slug": "hvgmerlegen",
        "cover": "20230426_070436_d6143daf60d32ef7d0d374cd13eea94a.jpg"
    },
    {
        "podcast_id": 206132,
        "title": "The Confidante",
        "description": "<p>The Confidante: A podcast discussing the news you need to know at the intersection of business, tech, and culture.</p>",
        "language": "en",
        "author_name": "Joyce Philippe and Doyinsola Oladipo",
        "slug": "theconfidante",
        "cover": "20230528_030527_5c2845a44bbec17b640a130de1d6fa6b.jpg"
    },
    {
        "podcast_id": 206608,
        "title": "The AgriDuo: Food for Thought",
        "description": "<p>From the humble beginnings of planting and harvesting to the cutting-edge technology of today's agribusiness, we will delve into the fascinating world of food production and the people who make it all possible.</p><p>Join the Agri Duo (Karabo and Conce) as we uncover the latest trends, innovations, and best practices in South African agriculture. </p>",
        "language": "en",
        "author_name": "The AgriDuo",
        "slug": "theagriduo",
        "cover": "20230501_010545_e74ad5b81598aef2cdc0f0e7a624668f.jpg"
    },
    {
        "podcast_id": 207467,
        "title": "RE:GEN REPORTS by PUMA",
        "description": "<p><strong>OUR INSIDE TRACK ON A MORE SUSTAINABLE FASHION FUTURE.</strong></p><p>Want to know about what PUMA is doing to make fashion more sustainable? And how we can all play a part in challenging businesses to do better?</p><p>Subscribe to our 10-part podcast series RE:GEN REPORTS: 10 independent hosts. 10 PUMA insiders and industry experts. Each episode explores a different sustainability theme.</p><p>No corporate jargon. No excuses.</p><p>RE:GEN REPORTS is the direct outcome of PUMA’s Conference of the People, held in London in September 2022. Expect conversations that bring to life the progress, challenges and setbacks of working towards PUMA’s 10for25 sustainability goals, and how we’re collaborating with the wider fashion industry to build a better and more sustainable future. </p><p></p><p>Get to know our Voices of a RE:GENERATION – content creators, designers and storytellers making an impact on sustainability – and other like-minded changemakers.</p><p></p><p>Find the PUMA 2022 Sustainability Report online at <a href=\"http://about.puma.com\">about.puma.com</a></p>",
        "language": "en",
        "author_name": "PUMA SE",
        "slug": "puma-regen-reports",
        "cover": "20230531_100519_abfd2a35ef593e475da265d0c2eb5e35.jpg"
    },
    {
        "podcast_id": 208364,
        "title": "The Beau Show",
        "description": "<p>\"The Beau Show\".....hosted by Realtor Beau Goss will be sharing Life, Real Estate and many different experiences while staying committed to his dream of how anybody and everybody can work together and make an IMPACT in each others lives, and their community! He will be interviewing different types of guest from all aspects of business and/or community leaders on each show.  Beau and his guest will use their professional background to share funny moments, success stories, market updates, and being fully transparent about life.  Beau has a goal to help make an IMPACT, one episode at a time!</p>",
        "language": "en",
        "author_name": "Beau Goss",
        "slug": "thebeaushow",
        "cover": "20230510_020559_74fdf94a02dfce402fb80126fd4a7d2d.jpg"
    },
    {
        "podcast_id": 208693,
        "title": "Business Report Weekly",
        "description": "<p>Business Report Weekly explores the top business headlines every week, and gives you context on what's happening without having to scour countless surface level articles to understand what's happening.</p><p>Business Report Weekly is hosted by Bradley Rand Martin.</p>",
        "language": "en",
        "author_name": "Bradley Rand Martin",
        "slug": "businessreportweekly",
        "cover": "20230515_060501_97e2280a6eef0389d78bc14470471745.jpg"
    },
    {
        "podcast_id": 209002,
        "title": "Real Estate Yelm",
        "description": "<p>Real estate market updates for Yelm, Washington and the surrounding area, including joint Base Lewis-McChord (JBLM), Fort Lewis, and McChord Air Force Base. Hosted by 20+ year real estate agent and expert marketer, Bill Sauneuf.</p><p>Covers the communities of Yelm, Eatonville, Rainier, Lacey, Olympia, Tacoma, Spanaway, Graham and Puyallup.</p><p>John L. Scott Real Estate / Yelm</p><p>Bill Sauneuf, Real Estate Agent</p><p>Call Today! <strong>360-708-2929</strong></p><p><strong>Bill@Sauneuf.com</strong></p><p>Equal Housing Opportunity</p>",
        "language": "en",
        "author_name": "Bill Sauneuf",
        "slug": "realestateyelm",
        "cover": "20230513_050521_619051752b68dfd819b0ecbee0c29ad2.jpg"
    },
    {
        "podcast_id": 210202,
        "title": "The REDD Eye",
        "description": "<p>The REDD eye is a 3 min financial news podcast, which summarizes the week’s most important high-yield credit headlines in Latin America, hand-picked by our editors.</p><p>Also available in <a href=\"https://media.rss.com/thereddeyeamericalatina/feed.xml\">Spanish</a> and <a href=\"https://media.rss.com/thereddeyeamericalatinaportugues/feed.xml\">Portuguese</a></p><p>(For Spotify: <a href=\"https://open.spotify.com/show/2Ai51Js79YLrC2EX6bLU0O?si=131c8108d045426c\">Spanish</a> and <a href=\"https://open.spotify.com/show/2FSagMPlQ7oLumztjWewy9?si=0b6028996f8446a8\">Portuguese.)</a></p><p>For more information and full access to our news and reports, access <a href=\"https://www.reddintelligence.com/\">www.reddintelligence.com</a></p><p>Producers: Julieta Valente, Maria Fernanda Blaser, Steven Bodzin</p><p>Theme music: Gabriel DeSantis</p><p>Host: Steven Bodzin</p>",
        "language": "en",
        "author_name": "REDD Intelligence",
        "slug": "thereddeyelatam",
        "cover": "20230519_090527_626a55481c70ca0657de948fa0ef0944.jpg"
    },
    {
        "podcast_id": 210204,
        "title": "The REDD Eye América Latina en Español",
        "description": "<p>The REDD Eye es un resumen semanal de noticias financieras con las noticias mas importantes del mercado de bonos en América Latina.</p><p>También disponible en <a href=\"https://open.spotify.com/show/6g0NhhDQUdETh32j2tj0lM?si=4y4Ev42-Qw6HlJl4-Yc6hQ\">Inglés</a> Y <a href=\"https://open.spotify.com/show/2FSagMPlQ7oLumztjWewy9?si=0b6028996f8446a8\">Portugués</a></p><p>Para más información y acceder a todas nuestras noticias e informes, visite nuestra página web <a href=\"https://www.reddintelligence.com/\">www.reddintelligence.com</a></p><p>Producción: Julieta Valente, Maria Fernanda Blaser, Steven Bodzin</p><p>Tema musical: Gabriel DeSantis</p><p>Narración: Julieta Valente</p>",
        "language": "es",
        "author_name": "REDD Intelligence",
        "slug": "thereddeyeamericalatina",
        "cover": "20230519_100519_d178cff465c842d5ae37dbcfaf9f78b0.jpg"
    },
    {
        "podcast_id": 211455,
        "title": "The Bitcoin Street Journal Market Update",
        "description": "<p>Welcome to The Bitcoin Street Journal Bitcoin Market Update! We bring you current  live bitcoin headline news, market updates, technical analysis, BTC price, market capitalization and accurate market supply data. Join us on The Daily Diary of the Bitcoin Dream for breaking news, business updates, financial and economic news everyday.</p>",
        "language": "en",
        "author_name": "The Bitcoin CEO",
        "slug": "thebitcoinstreetjournal",
        "cover": "20230525_080551_615d92a0f8c52722ca6b5376aac5ac2f.jpg"
    },
    {
        "podcast_id": 211594,
        "title": "Duros a 4 Pesetas",
        "description": "<p>Duros a 4 pesetas es el programa líder en información sobre PYMES, autónomos y emprendedores en Cataluña, Comunidad Valenciana y Andorra. Semanalmente durante 90 minutos las pequeñas empresas tienen la puerta abierta a contar a la audiencia grandes historias: qué venden, cómo contactar con ellos, qué ventajas ofrecen.</p>",
        "language": "es",
        "author_name": "Duros a 4 Pesetas",
        "slug": "durosa4pesetas",
        "cover": "20230526_030537_74d383a99f66b45a59528e4cd658d599.jpg"
    },
    {
        "podcast_id": 211724,
        "title": "The REDD Eye América Latina em Português ",
        "description": "<p>The REDD eye é um podcast de notícias financeiras de 3 minutos selecionadas pelos nossos editores, que resume as manchetes mais importantes da semana sobre créditos high yield na América Latina.</p><p>Também disponível em <a href=\"https://open.spotify.com/show/6gPBlXkQ0illdoDKldt2nL?si=81de9de99d764d14\">Inglês</a> e <a href=\"https://open.spotify.com/show/2Ai51Js79YLrC2EX6bLU0O?si=0c8f6ca57e8e4a18\">Espanhol</a></p><p>Para mais informações e acesso a todas as nossas notícias e informes, visite nosso site <a href=\"https://www.reddintelligence.com/\">www.reddintelligence.com</a></p><p>Produção: Julieta Valente, Maria Fernanda Blaser, Steven Bodzin</p><p>Música: Gabriel DeSantis</p><p>Anfitriã: Maria Fernanda Blaser</p>",
        "language": "pt-br",
        "author_name": "REDD Intelligence",
        "slug": "thereddeyeamericalatinaportugues",
        "cover": "20230528_070526_70f794aebacd42ad223962715a5ff5de.jpg"
    },
    {
        "podcast_id": 212111,
        "title": "Conrad's Corner",
        "description": "<p>Welcome to Conrad's Corner, the premier podcast for all things commercial real estate. I'm Damon Conrad, your host, and I'll be introducing you to the industry's top figures, sharing their thoughts and captivating stories. Join us as we explore the latest trends, strategies, and insider insights, equipping you with the tools to thrive in this dynamic field. Get ready to unlock the potential of commercial real estate and be inspired by the voices shaping its future.</p>",
        "language": "en",
        "author_name": "Damon Conrad",
        "slug": "conrads-corner",
        "cover": "20230529_070558_ca0261bc82b090f8d6794d972872a424.jpg"
    },
    {
        "podcast_id": 212610,
        "title": "SFS PocketTalks",
        "description": "<p>Introducing SFS PocketTalks – a brand-new podcast series designed for everyone in the construction industry. </p><p>From apprentices and early-career engineers to seasoned professionals, PocketTalks delivers bite-sized insights straight into your day. Each episode is short and concise, offering an easily digestible blend of industry standards, innovative ideas, and the very latest in construction practices. </p><p>Curious about U-values? We've got a PocketTalk for that. Want to know more about fall protection product standards? We've got you covered.</p><p> #SFSPocketTalks is your go-to guide for all things construction. Tune in today!</p>",
        "language": "en",
        "author_name": "SFS Group Fastening Technology Ltd",
        "slug": "sfs-pockettalks",
        "cover": "20230601_090643_093c0cf96abed00bb76d9f681d18967c.jpg"
    },
    {
        "podcast_id": 212658,
        "title": "Economy Update with Stephen Petith",
        "description": "<p>Welcome to \"The Economy Update\" podcast series, where we bring you the latest insights and analysis on the ever-evolving world of economics. Join your host, Stephen Petith, as we delve into the most pressing issues, trends, and developments shaping the global economy.</p><p>In each episode, we provide an engaging and informative exploration of a wide range of topics, from macroeconomic trends to industry-specific dynamics, and from geopolitical events to technological advancements. Our goal is to help you navigate the complex landscape of the global economy, empowering you with knowledge and understanding to make informed decisions in your personal and professional life.</p><p>With Stephen Petith at the helm, an esteemed expert in the field of economics, you can expect in-depth discussions, expert interviews, and thought-provoking analysis. Our podcast episodes cover a broad spectrum of subjects, including fiscal and monetary policies, market trends, international trade, emerging markets, sustainable finance, innovation, and much more.</p><p>We bring you real-time updates on major economic events, such as financial crises, policy changes, and market disruptions, and examine their implications for businesses, investors, and individuals. By exploring the interconnectedness of global economies, we aim to provide you with a comprehensive understanding of the forces driving economic growth, risks, and opportunities across different regions.</p><p>\"The Economy Update\" podcast series is designed for listeners of all backgrounds, whether you're an industry professional, a student, a business owner, or simply someone interested in staying informed about the world of economics. Our episodes are carefully crafted to blend expertise with accessibility, ensuring that complex economic concepts are explained in a clear and engaging manner.</p><p>Join us on this enlightening journey as we unravel the intricacies of the global economy, uncover hidden trends, and shed light on the factors shaping our financial landscape. Subscribe to \"The Economy Update\" with Stephen Petith and stay ahead of the curve with the latest economic insights, all in one podcast series.</p><p>More information at support@globalwealthclub.com</p>",
        "language": "en",
        "author_name": "Global Wealth Club",
        "slug": "globalwealthclub",
        "cover": "20230705_010722_c72cd711243503a23c1604a674a97e00.jpg"
    },
    {
        "podcast_id": 213222,
        "title": "In Conversation Podcast: Genesis Series Pt. 1",
        "description": "<p>Xzavier Antonio hosts \"In Conversation Sessions\" and interviews creatives, entrepreneurs and other media personalities. The Genesis SEries is the beginning of \"In Conversation Podcasts recordings and the beginning of our story telling for the brands you'll find yourself journeying with and getting to know.</p>",
        "language": "en",
        "author_name": "Xzavier Antonio, Spitfire Shine and more ",
        "slug": "inconversationpodcastsgenesisone",
        "cover": "20230605_070652_066a27502a9ea0cd3c18f5ed92357173.jpg"
    },
    {
        "podcast_id": 213260,
        "title": "Iron Sharpens Iron is a podcast powered by Nestlé Needs Youth and Youth Connekt Africa",
        "description": "<p>Welcome to Iron Sharpens Iron is a podcast powered by Nestlé Needs Youth and Youth Connekt Africa. This is a podcast where we, as African youth, get together to discuss the pivotal role in shaping our collective future on the African continent. </p><p>About Nestle Needs Youth</p><p>Nestlé Needs Youth is a catalyst for transformation that empowers young people with skills for the job market, and job opportunities - all to ensure that youth can thrive in the dynamic world of business.</p><p>About YouthConnekt Africa</p><p>YouthConnekt Africa invests in youth's ideas and initiatives to pave the way for Africa to harness its true power by the year 2030! Together with Nestle Needs Youth, these partners are powering a platform where ideas flourish, minds converge, and iron sharpens iron.</p>",
        "language": "en",
        "author_name": "Nestlé ESAR",
        "slug": "nestle-esar",
        "cover": "20230605_070634_c330053ea381e0f397c365ad9a24bb9a.jpg"
    },
    {
        "podcast_id": 213716,
        "title": "ASCM New York City Long Island Presents",
        "description": "<p>ASCM New York City Long Island Presents focuses on all topics and speakers as it relates to the needs of New York City Long Island supply chain community - providing a wealth of knowledge from supply chain industry, careers, education and training, local supply chain news, interviews and more - ASCM NYC LI is here for you.</p>",
        "language": "en",
        "author_name": "ASCM NYC LI Forum",
        "slug": "ascm-nycli-presents",
        "cover": "20230607_010646_04009cd60cbeb4073bc36d84a6c50fac.jpg"
    },
    {
        "podcast_id": 213825,
        "title": "Greater Eastside Agent Podcast",
        "description": "<p>Welcome to The Greater Eastside Agent Podcast, a show designed exclusively for real estate agents on the Eastside of Lake Washington, covering the bustling cities of Bellevue, Bothell, Snohomish, and the surrounding areas. Every week, Chris covers several different segments: the latest updates on home prices in the local market, sales strategies that are working for other agents, and mortgage news and tips that will help you grow your business. Whether you're a seasoned agent or just starting your career, this show will help you stay informed and maximize your success in this competitive market.</p>",
        "language": "en",
        "author_name": "Chris Butaud",
        "slug": "eastsideagent",
        "cover": "20230608_120638_10504fff0f6e1dd0425d5b98988e171b.jpg"
    },
    {
        "podcast_id": 213933,
        "title": "Proper Tease - The podcast that cuts the property industry to the bone. ",
        "description": "<p>Matt Smith &amp; Kris Ericsson are self-proclaimed property professionals who share their thoughts on a range of topics mostly focused on the property world. Not afraid to call a spade and spade, with over 40 years combined property experience, they give their opinion on matters of the day and often invite experts in various fields related to the property industry to give advice, vent frustration and generally stir up trouble, in a friendly, safe environment.</p><p>If there is anything you would like us to talk about then please send your questions and comments to us on <a href=\"mailto:hello@smithericsson.com\">hello@smithericsson.com</a></p>",
        "language": "en",
        "author_name": "Matt Smith & Kris Ericsson ",
        "slug": "propertease",
        "cover": "20230707_060725_616057ae9e5e46a0a146c5e17ff5a8ea.jpg"
    },
    {
        "podcast_id": 215114,
        "title": "Creative Minds Podcast ",
        "description": "<p>Our Founder and Creative Director will sit down with some of the creative industry's brightest sparks, pick their brains about their creative process and share all the gems with you, once a month.</p><p>We'll be diving into their creative processes and tapping into all the bespoke experience and knowledge they've built throughout their illustrious careers working across advertising campaigns and everything creative.</p><p>Follow us on social media!</p><p>Instagram: <a href=\"https://www.instagram.com/bearjamproductions/\">https://www.instagram.com/bearjamproductions/</a></p><p>LinkedIn: <a href=\"https://www.linkedin.com/company/bear-jam/\">https://www.linkedin.com/company/bear-jam/</a></p>",
        "language": "en",
        "author_name": "BearJam Productions",
        "slug": "bearjam-creative-minds",
        "cover": "20230614_100638_f482473207abba77671048d48980b597.jpg"
    },
    {
        "podcast_id": 215169,
        "title": "Diálogo Urbano",
        "description": "<p>Diálogo Urbano es un podcast donde, de la mano de Visor Urbano, exploraremos los temas que moldean nuestra vida en las ciudades y cómo interactuamos con ellas.</p><p>Cada mes, nos sumergimos en conversaciones apasionantes y enriquecedoras con personas expertas en el cómo funcionan nuestras ciudades. Únete a nosotros mientras exploramos diversas cuestiones que nos atañen, compartiendo ideas, experiencias y soluciones innovadoras.</p><p>¡Sintoniza Diálogo Urbano el tercer jueves de cada mes y descubre cómo podemos mejorar la vida en las ciudades a través del uso de la tecnología!</p>",
        "language": "es",
        "author_name": "Visor Urbano",
        "slug": "dialogo-urbano",
        "cover": "20230614_060614_0f3ee701377c9db36f0c1180282c7db4.jpg"
    },
    {
        "podcast_id": 217278,
        "title": "WillowsCoffee",
        "description": "<p>Willows Coffee is a premium coffee roastery that offers a wide range of high-quality, sustainably sourced coffee beans from around the world. Our mission is to provide coffee lovers with the best possible coffee experience by ensuring the quality, freshness, and ethical sourcing of our beans. Our team of expert roasters carefully selects and roasts each batch of coffee to perfection, creating a unique and flavorful cup that will awaken your senses. Whether you're a coffee aficionado or a casual drinker, we're confident that you'll love our coffee. Try it today and taste the difference! <a href=\"https://willowscoffee.com/\">https://willowscoffee.com/</a></p>",
        "language": "en",
        "author_name": "Willows Coffee",
        "slug": "willowscoffee",
        "cover": "20230629_040601_6aabe46a44919363558c3f7187be5acb.jpg"
    },
    {
        "podcast_id": 217377,
        "title": "RADIO ARROYO AL AIRE",
        "description": "<p>Música, historia, tradición, reportajes y algo más. Estado de México</p>",
        "language": "es",
        "author_name": "JOSE DAVID ARROYO ESTRADA",
        "slug": "radioarroyoalaire",
        "cover": "20230629_100607_c96d6af168dd615fab99155ba7b82501.jpg"
    },
    {
        "podcast_id": 217816,
        "title": "Studio Contra - Zorgwekkend",
        "description": "<p>Contra Zorgbemiddeling nodigt regelmatig gasten uit aan tafel in studio Zorgwekkend om te praten over uitdagingen op de werkvloer in de #zorg in het algemeen en in de #gehandicaptenzorg in het bijzonder.</p>",
        "language": "nl",
        "author_name": "Studio Zorgwekkend",
        "slug": "contrazorgbemiddeling",
        "cover": "20230704_080718_43273eacfd76b06fccd55807bcf7ee8e.jpg"
    },
    {
        "podcast_id": 217831,
        "title": "CDO Magazine Podcast Series",
        "description": "<p>The CDO Magazine Podcast Series is a one-of-a-kind series of data-world debates conducted by and for CDOs. The podcast series covers a wide range of topics, including machine learning, artificial intelligence, data technology, the Internet of Things, and robotics. Podcasts range from mini episodes covering high-level themes to longer, in-depth interviews with practicing data professionals and leaders. No matter where you are in your data science career, staying up to date on the latest in data and how it is gaining significant attention is always a good idea. To remain up to date, subscribe to the CDO Magazine Podcast Series.</p>",
        "language": "en",
        "author_name": "CDO Magazine",
        "slug": "cdomagazine",
        "cover": "20230703_030701_8d21c35ec9fa1db9adb32bdade4ac7e2.jpg"
    },
    {
        "podcast_id": 218085,
        "title": "eCommerce Masterclass",
        "description": "<p>eCommerce MasterClass caters to global business professionals and eCommerce elites who simply don't have the time to learn and adapt; with each episode less than 10 minutes, it's the best place for you to start learning from business masters around the globe whether you are driving, cooking, or jogging, all hands-free!</p>",
        "language": "en",
        "author_name": "Iron Shelly",
        "slug": "ironshellyecommerce",
        "cover": "20230705_090733_74a7524b83300ebecca90c6ac6207d7a.jpg"
    },
    {
        "podcast_id": 218344,
        "title": "Mentes Empresariales: Historias que inspiran ",
        "description": "<p>Las mentes empresariales son personas con una mentalidad y habilidades empresariales admirables, que han asumido retos cada vez más grandes, concretando sus sueños en realidad. Son visionarias, emprendedoras, innovadoras y dispuestas a asumir riesgos con el fin de cumplir sus propósitos tanto personales como en los negocios.</p>",
        "language": "es-mx",
        "author_name": "Grupo Economy",
        "slug": "mentes-empresariales-historias-que-inspiran",
        "cover": "20230707_020732_bb6afdbec90bb34fc889630f66c7b367.jpg"
    },
    {
        "podcast_id": 218465,
        "title": "The Restoration when Jesus Returns",
        "description": "<p>Some comical enlightenment, the restoration of the earth when Jesus Christ returns, BRICS or the new world money system</p>",
        "language": "en-us",
        "author_name": "Jeff Casillo",
        "slug": "98507449",
        "cover": "20230707_090724_83e2710ca5261dabd5dc732687556df6.jpg"
    },
    {
        "podcast_id": 220546,
        "title": "LGS Impulsa: Los Desafíos de las Empresas",
        "description": "<p><em>En LGS Impulsa ofrecemos una asesoría sensible y personalizada con un fuerte en el apoyo a la gestión interna de las PYMES para ACELERAR NEGOCIOS y TRANSFORMAR EMPRESAS de forma económica, ágil y aumentando la cuenta de resultados desde el corto plazo. </em></p><p><em>Sabemos que la ACELERACION y posterior TRANSFORMACIÓN interna de las empresas es el motor para alcanzar el éxito y el crecimiento sostenible de las empresas españolas en entornos de incertidumbre y recesión. </em></p><p><em>Sabemos que cada negocio y empresa es único y es por eso que nos apasiona brindar soluciones personalizadas que se adapten perfectamente a las necesidades y desafíos específicos de cada organización.</em></p><p>Contáctanos sin compromiso a nuestro WhatsApp al número 639 159 409 o a través de nuestra web <a href=\"http://www.lgsimpulsa.com\">www.lgsimpulsa.com</a> </p>",
        "language": "es",
        "author_name": "LGS Impulsa",
        "slug": "lgsimpulsa",
        "cover": "20230914_050917_85913169901414f720231dc73ee7e1e3.jpg"
    },
    {
        "podcast_id": 220815,
        "title": "Pune News Today",
        "description": "<p>Website</p>",
        "language": "en",
        "author_name": "Ramsha Afzal",
        "slug": "trendingpodcast",
        "cover": "20230723_060749_fb46b2bcc416211dd36161e58b9ac08e.jpg"
    },
    {
        "podcast_id": 221375,
        "title": "Persivia CareSpace®",
        "description": "<p>A channel to help healthcare providers gain insights related to diverse latest trends. </p>",
        "language": "en",
        "author_name": "Persivia Inc",
        "slug": "persiviainc",
        "cover": "20230727_110740_8e25a5cc412ba37d7ea17391b7df8c24.jpg"
    },
    {
        "podcast_id": 221405,
        "title": "BSTC",
        "description": "<p><strong>Best teaching of note bstc corse</strong></p>",
        "language": "en",
        "author_name": "Nandkisho ",
        "slug": "nandkishor",
        "cover": "20230727_040752_2df63a076755ae57c912b925d9c2115b.jpg"
    },
    {
        "podcast_id": 221616,
        "title": "Marketing industrial en acción",
        "description": "<p>Estrategias, acciones y tácticas innovadoras de marketing para el sector industrial</p>",
        "language": "es",
        "author_name": "Alfonso Mandujano",
        "slug": "mkt-industrial-en-accion-estrategias-ganadoras",
        "cover": "20230729_120714_79206d92b8793853f59df4f252a44e79.jpg"
    },
    {
        "podcast_id": 222166,
        "title": "EstateCast",
        "description": "<p>EstateCast provides educational and valuable information about estate planning and estate administration. We will post audio versions of our blogs, staff conversations, as well as interviews relevant to ensuring your peace of mind. </p>",
        "language": "en",
        "author_name": "Robert P. Newman, Esq.",
        "slug": "rpnlaw",
        "cover": "20230801_080810_6f4ab7367b1c048273d36d1e1252a392.jpg"
    },
    {
        "podcast_id": 222229,
        "title": "Turkey Sourcing Services",
        "description": "<p>Pelotek LLC, a Wyoming-based sourcing company, specializes in providing <strong>product sourcing from Turkey</strong>, <strong>English-to-Turkish translation services</strong>, and <strong>Turkey-focused digital marketing services</strong> to non-Turkish clients. This podcast is about Sectors in Turkey and our Case Studies.</p>",
        "language": "en",
        "author_name": "Pelotek Online",
        "slug": "productsourcing",
        "cover": "20230802_070835_47f142c52385cb8262d1744379b64917.jpg"
    },
    {
        "podcast_id": 222318,
        "title": "Go FUD Yourself",
        "description": "<p>Welcome to <strong>\"Go FUD Yourself,</strong>\" your essential guide to the world of crypto with hosts Ceara Crawford and JD Gagnon.</p><p>Get updated on the latest news and insights in blockchain finance, from weekend roundups and midweek degen fixes to the global crypto arms race and controversial FU Fridays. Our expert hosts provide analysis, discussions, and actionable takeaways, covering everything from regulations and market trends to DeFi and beyond.</p><p>Go FUD Yourself is designed to be added to your DYOR routine. It should act as a short-form daily news update as well as provide you with conjecture for your critical thinking lens. We cover real-time real-news stories with the occasional deep-dive into complex topics like CBDCs.</p><p>Whether you're a seasoned enthusiast or new to the world of cryptocurrencies, our daily episodes are designed to keep you informed and engaged. Mondays are all about weekend news, while Wednesdays focus on DeFi and degen news. Thursdays uncover the crypto arms race, and Fridays wrap up with an audacious take on the week's controversies.</p><p>Subscribe to \"Go FUD Yourself\" now and stay ahead of the curve in the fast-paced world of blockchain finance. Join us for exciting journeys through the dynamic landscapes of crypto news. Get ready to challenge the status quo and immerse yourself in the captivating world of blockchain finance with \"Go FUD Yourself.\"</p><p>** Marked explicit for language</p>",
        "language": "en",
        "author_name": "Ceara Crawford",
        "slug": "gofudyourself",
        "cover": "20230802_060812_e14b886b732c7db96adcf790038dec3a.jpg"
    },
    {
        "podcast_id": 222751,
        "title": "Economía Capital ",
        "description": "<p>Economía Capital</p><p>Una conversación de economía para iniciar la semana informado</p><p>Viviana Véjar y Orlando Cisterna conversan de economía y negocios, con la mirada critica y analítica para despertar tu emprendedor interior.</p><p>Lunes, 7:30 AM</p><p>Youtube Capital Rock Media</p><p>Spotify Economía Capital</p>",
        "language": "es-mx",
        "author_name": "Orlando Cisterna y Viviana Véjar",
        "slug": "economiacapitalrock",
        "cover": "20230821_050851_51b6ba83d42a496a79a624eab4ac05c3.jpg"
    },
    {
        "podcast_id": 223078,
        "title": "Diamond Gems with Avi Krawitz",
        "description": "<p>Diamond Gems with Avi Krawitz is a place to tell the story of the diamond market, sharing our experiences, learning from each other, and understanding what diamonds truly mean to each of us.</p><p>Find me at:</p><p>Website: <a href=\"http://www.avikrawitz.com\">www.avikrawitz.com</a> </p><p>Email: <a href=\"mailto:avi@avikrawitz.com\">avi@avikrawitz.com</a> </p><p>Instagram: <a href=\"https://www.instagram.com/avi_krawitz/\">https://www.instagram.com/avi_krawitz/</a> </p><p>LinkedIn: <a href=\"https://www.linkedin.com/in/avi-krawi\">https://www.linkedin.com/in/avi-krawi</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbjBlcEh3MFZKZUhGdktaVjdCa3pWVll6TTBqUXxBQ3Jtc0tuYm8yR3FnWE1tbElTMWN6ZEQ4YzRTSlZ3XzJaMTlfODhoQmdid1VyRlk3LXVzaWF6aFBSOFpQa19YMUlyZnlXUV9GYkFNNnlmcVZVWTNPNnJCejhIRWYzSWVzb0d6RGVGYW4zWmg0R0thOE42cFo1WQ&amp;q=https%3A%2F%2Fwww.linkedin.com%2Fin%2Favi-krawitz-1260999%2F&amp;v=2SyQ00zF1R0\">...</a> </p><p>Tik Tok: <a href=\"https://www.tiktok.com/avi_krawitz\">https://www.tiktok.com/avi_krawitz</a></p>",
        "language": "en",
        "author_name": "Avi Krawitz",
        "slug": "avikrawitz",
        "cover": "20230808_070841_68136b884389a5ff4f9dfafb114d6815.jpg"
    },
    {
        "podcast_id": 223288,
        "title": "ASX ScamWatchers",
        "description": "<p>We provide a platform for Retail Investors to unite and expose fraud on Discord by peer to peer sharing of knowledge. This permits up-to-date information on the latest scams and frauds that are happening across the Australian Securities Exchange (ASX). In addition, ScamWatchers enables peer to peer advice on how to avoid falling victim to these scams, tips on how to spot red flags and stay vigilant. If you’re an experienced investor or just starting out, ASX ScamWatchers is an essential tool for sharing knowledge and helping prevent victims losing life savings.</p><p>We have no affiliation with ASX, ASIC, or any regulatory body. Our members complement their work, but our roots dig deep into the grassroots level and connects investors directly to discuss potential pumps, scams and fraud..</p>",
        "language": "en",
        "author_name": "ASX ScamWatchers",
        "slug": "asxscamwatchers",
        "cover": "20230809_020835_b17e565e06ad5f75d79100a85e3984dc.jpg"
    },
    {
        "podcast_id": 223589,
        "title": "Reimagined Energy Podcast",
        "description": "<p>A weekly renewable energy video podcast featuring interviews with influential experts, academia, businesses and organizations leading the way in sustainable business and clean technology. Hosted by Maria McGowan, topics cover a wide range of renewable energy-related projects in a conversational, informative way. Each episode is less than 30 minutes in length.</p>",
        "language": "en",
        "author_name": "Maria McGowan",
        "slug": "reimaginedenergy",
        "cover": "20230811_120812_4f05c5c2ff3c2319d4a0bde541825e43.jpg"
    },
    {
        "podcast_id": 223736,
        "title": "Ondernemers in Beeld",
        "description": "<p>Ontdek de reis achter ondernemerschap. Luister naar verhalen, inzichten en doorbraken in 'Ondernemers in Beeld'. Laat je inspireren om te groeien, te innoveren en je eigen pad naar succes te vinden.</p>",
        "language": "nl",
        "author_name": "RAKHAN",
        "slug": "ondernemersinbeeld",
        "cover": "20230913_090921_5f29849263a508ea4ebada7f374cd552.jpg"
    },
    {
        "podcast_id": 223745,
        "title": "\"Wear Many Hats\" Risings ",
        "description": "<p>\"WMH\" Risings aims to spotlight emerging talents within the FM industry, shedding light on their remarkable journeys so far and illuminating their envisioned career trajectories. But that's not all! This series also doubles as a platform to empower and guide the next wave of industry leaders. Expect to gain valuable insights and tips for navigating your path to success within the field.</p>",
        "language": "en",
        "author_name": "Wear Many Hats - Podcast",
        "slug": "wmhrisings",
        "cover": "20230812_030806_7e10538023a95751e45d4388ab708eae.jpg"
    },
    {
        "podcast_id": 223823,
        "title": "Frerard STAY",
        "description": "<p>???unr</p>",
        "language": "en",
        "author_name": "Frerard STAY",
        "slug": "staymcr",
        "cover": "20230813_060805_06da54ec8babd83d45aae283daf57844.jpg"
    },
    {
        "podcast_id": 224093,
        "title": "The Aspiring Financial Guru",
        "description": "<p>Tired of hearing monotone voices, and commentators with less charisma than a piece of cardboard. I won't say that entertainment is my strength, but I will try my best. Get on on this ride to hear my analysis on the hottest companies of the moment.</p>",
        "language": "en",
        "author_name": "Manuel Gonzalez",
        "slug": "aspiringfinancialguru",
        "cover": "20230814_100852_f6e0b4173ff0d18394c1f791b84722d6.jpg"
    },
    {
        "podcast_id": 224539,
        "title": "Global 20 Interviews",
        "description": "<p>Where do you go for inspiration in the realm of philanthropy? In our Global 20 series we are sharing 20 interviews with thought leaders in philanthropy who are pivotal in shaping a better world and implementing strategic and systemic change.</p>",
        "language": "en",
        "author_name": "Ben Morton Wright",
        "slug": "global20-interview-with-lady-edwina-grosvenor",
        "cover": "20230904_010938_50df1e28d211de2261faa9ed0a755840.jpg"
    },
    {
        "podcast_id": 224547,
        "title": "Northwest Now Steve On The Street",
        "description": "<p>Northwest Now's Steve Kiggins' in-depth reports on stories that matter in Western Washington.</p>",
        "language": "en",
        "author_name": "Steve Kiggins",
        "slug": "northwest-now-steve-on-the-street",
        "cover": "20230907_070903_e14869099388e74f3a6321ccd4bafb5f.jpg"
    },
    {
        "podcast_id": 225487,
        "title": "FCG/MCC Podcast ",
        "description": "<p>Welcome to  the FCG/MCC monthly audio newsletter/podcast! Each month, we will bring you the latest news and updates affecting federally qualified health center operations, covering a range of topics from operations and billing to clinical quality and and regulatory updates. We will also discuss additional funding opportunities and programs available through grants and other initiatives, along with tips and tricks for optimizing your health center’s operations.</p>",
        "language": "en",
        "author_name": "Nickolas Hickman",
        "slug": "fcgmcc",
        "cover": "20230823_030817_fa3a7aa8ee26168db6a464625780e33a.jpg"
    },
    {
        "podcast_id": 226227,
        "title": "REAL ESTATE CAFE - FIRST TIME HOME BUYERS EPISODE 1",
        "description": "<p><strong>Hi, this is Shelley Janson of Luxury Partners Realty - today I am with Mike Rausch of The Mortgage Firm and we are going over some important information for FIRST TIME HOME BUYERS; like different types of mortgages, down payment assistance and the process from start to finish to make your life stress free.</strong></p>",
        "language": "en",
        "author_name": "SHELLEY JANSON",
        "slug": "real-estate-cafe",
        "cover": "20230828_040841_c5608403a62757908e5d24fb474dec27.jpg"
    },
    {
        "podcast_id": 226291,
        "title": "Gcb productions productions",
        "description": "<p>Updates and info for my YouTube channel</p><p>Gcb productions.</p>",
        "language": "en",
        "author_name": "Gcb pro",
        "slug": "gcb-productions-pod",
        "cover": "20230828_110857_ac555376c7a7d79a594bbe7d4bcb10bd.jpg"
    },
    {
        "podcast_id": 226302,
        "title": "Think IT _ Think Cast & Think Talks",
        "description": "<p>A Think IT é uma das principais empresas brasileiras que oferecem soluções e serviços especializados de infraestrutura de TI e segurança da informação. Trabalhamos em parceria com grandes empresas como Oracle Cloud Infrastructure, Microsoft, Fortinet. Ascenty, Commvault, Verizon, entre outros.Estamos há mais de 17 anos no mercado com serviços em tecnologia que proporcionam excelência operacional, flexibilidade, performance e modernização de negócios, para entregar aos líderes, mais tempo para focarem na otimização dos resultados. Em 2022 conquistamos o selo GPTW (Great Place to Work).</p>",
        "language": "pt-br",
        "author_name": "Think IT| Think Cast & Think Talks",
        "slug": "think-it",
        "cover": "20230829_120809_5eb6d80f74371847fe710aabbf2eea42.jpg"
    },
    {
        "podcast_id": 226503,
        "title": "AI Generated Business News: Information Technology Sector",
        "description": "<p>Your AI associate who reads every call from earnings , industry conferences, investor days , special management updates— distilling key details in under 5 mins. Power up your commute and expand your knowledge about diverse set of companies and industries with this audio podcast!</p><p>Responsible AI Disclaimer: This entire podcast is automatically created by Generative AI algorithms so the content could have factual errors, biased or inappropriate text.</p>",
        "language": "en",
        "author_name": "TeeSnee AI",
        "slug": "teesnee",
        "cover": "20230830_040842_4ab20cf3903258923ecde93e3ba2a257.jpg"
    },
    {
        "podcast_id": 227130,
        "title": "The Level Up Podcast",
        "description": "<p>Real Estate Agents - Looking to LEVEL UP your business? The Level Up Podcast is a show dedicated to helping raise the bar in the real estate industry by sharing the tips, tricks, and secrets of top-producing real estate agents nationwide.</p>",
        "language": "en",
        "author_name": "Tyler Miller",
        "slug": "leveluppodcastshow",
        "cover": "20230904_030955_c1d717a79f7cb3d720de2618851d9285.jpg"
    },
    {
        "podcast_id": 227514,
        "title": "BERNARDO PLAZA CANDIDATO AL CONCEJO PALMIRA",
        "description": "<p>Soy Bernardo Plazas Muñoz, he pertenecido a varios grupos de líderes comunitarios participando en diferentes actividades comunitarias. Constituí por primera vez la JAC del barrio tulipanes donde actualmente resido, soy actualmente el Edil electo de la Comuna 10 que más ha demostrado trabajo en equidad e inclusión con la comunidad, en este proyecto todos caben.</p><p>He hecho partícipe de las actividades comunitarias aquí en nuestro barrio como</p><p>a) iluminación de espacios deportivos en Tulipanes</p><p>b) Seguridad del barrio, fortaleciéndolo día a día</p><p>c) Servicios Públicos y gestión de novedades</p><p>d] Mantenimiento de las zonas verdes y aprovechamiento con Circos, Canchas y Eventos para la comunidad</p><p>Evento de Cometas</p><p>Tratamiento de peladitos</p><p>Jornadas lúdicas de sano esparcimiento como reinados, conciertos</p><p>Todos los años celebrando el día del Niño</p><p>Novena en Navidades con el apoyo de la comunidad y comerciantes</p><p>e) Actividades para niños como:</p><p>Torneos de fútbol festival de cometas, halloween, novenas navideñas y escuela de fútbol</p><p>Impulse a qué se realizarán cursos como Inglés por el SFNA y de Seguridad Privada</p><p>g) Acondicione los terrenos para crear escenarios deportivos</p><p>h) Actividades para la tercera edad como arorrumba</p><p>Con las demás juntas y líderes hemos logrado gestionar las Cámaras de Seguridad, las Alarmas, Caseta Comunal y el Cal de policía.</p><p>En pandemia participe en ayudar con mercados que los comerciantes donaban y logré gestionar ante la gobernación 600 mercados los cuales  se dividieron  en las  6  juntas en partes iguales de 83 mercados a cada junta</p><p>logré realizar el acondicionar  2 terrenos y con el apoyo de  la  comunidad se hicieron dos canchas de fútbol  hoy dos escuelas y niños la disfrutan</p><p>en el estallido social participe en poner un comedor comunitario al servicio de la comunidad</p><p>desde el año 2022 logré formar el grupo del adulto mayor dónde a la fecha hay 60 integrantes de este grupo</p><p>Logré formar  e instalar un frente de seguridad  comunitarios con radios de comunicaciones y cámaras de seguridad en ciudad del campo  conectados a la policía nacional primero en valle del cauca y se extendió a la urbanización pereira alcanzando  lograr que más de 60 comerciantes de la comunidad de ciudad del campo y la urbanización  pereira lo integran hace más de un año</p><p>Y el segundo frente de seguridad lo formó en la dolores de la comuna 10  hace unos tres meses   con 40 radios  igual conectados a la policía del sector .</p><p>Solo tengo agradecimiento con la comunidad, comerciantes y empresarios que que apoyan todos mis proyectos, que creen en este proyecto de sacar adelante a ciudad del campo y buscar el bienestar de todos sin distinción, donde son la comunidad y los que me conocen que he realizado mi labor con el propósito de que todos caben y unidos como comunidad cualquier propósito lo podremos lograr</p>",
        "language": "es",
        "author_name": "Bernardo Plaza Candidato al Concejo Palmira",
        "slug": "bernardoplaza-u10",
        "cover": "20230906_080912_971bf0e10ca2b1223bc6b9775b1793a2.jpg"
    },
    {
        "podcast_id": 227687,
        "title": "Keep it a Buck",
        "description": "<p>Welcome to Keep it a Buck - the podcast that takes an honest and straightforward approach to discussing the worlds of economics, entrepreneurship, mindset, and more. Join David Schwartzman and David Gregory as they explore the strategies, insights, and lessons that successful individuals and businesses use to thrive in today's ever-changing landscape. Special thank you to Emily Shteynberg for researching our deep dives so tirelessly, and to Nadine Pedzich for finding amazing visuals to complete all of our videos!</p>",
        "language": "en",
        "author_name": "David Schwartzman and David Gregory",
        "slug": "keepitabuck",
        "cover": "20230907_080938_511f8e593cc6ff1046ef98f4c7d279ab.jpg"
    },
    {
        "podcast_id": 227769,
        "title": "Medeenomics",
        "description": "<p>\"Medeenomics Podcast\"-ийн эхний дугаарыг хүлээн авна уу. Эдийн засаг, бизнес, санхүү, технологи, хөрөнгө оруулалттай холбоотой шийдвэр гаргахад хэрэг болох мэдээллийг тогтмол хүргэх болно.</p><p>\"Мөнгөний Урсгал\" цахим товхимлыг өдөр бүр мэйлээр хүлээн авахыг хүсвэл дараах холбоосоор мэйлээ бүртгүүлээрэй <a href=\"https://bloombergtv.mn/subscription\">https://bloombergtv.mn/subscription</a></p>",
        "language": "mn",
        "author_name": "Medeenomics",
        "slug": "medeenoimics",
        "cover": "20230908_090959_4dabb1fe5da7c8dd70bfb68e3e894ebf.jpg"
    },
    {
        "podcast_id": 227786,
        "title": "Emmanuel Katto Uganda",
        "description": "<p>I’m Emmanuel Katto a Uganda based local journalist, who mainly collects the latest stories and happenings of Uganda and Africa as a whole, on different domains and headlines.</p>",
        "language": "en",
        "author_name": "Emmanuel Katto Uganda",
        "slug": "emmanuelkatto-uganda",
        "cover": "20230908_010903_eabb968a403237d51593ddd21534d727.jpg"
    },
    {
        "podcast_id": 227834,
        "title": "OBJETIVO AM/PM peligrosa.mx 1370 y a1600AM ",
        "description": "<p><strong>#objetivoAM</strong></p><p>¡No te pierdas las últimas noticias nacionales de Tlx y Pue por la 1370AM y en <a href=\"http://www.peligrosa.mx\">www.peligrosa.mx</a>! Únete a <strong>Fabián Robles</strong> 7 a 9 AM para mantenerte informado. #Noticias + #peligrosa1370AM y <a href=\"http://www.peligrosa.Mx\">www.peligrosa.Mx</a> <a href=\"https://stream.zeno.fm/ktezveaxxjzvv\">https://stream.zeno.fm/ktezveaxxjzvv</a> #1370am #tlaxcala #puebla #musicasalsa #radioonline</p>",
        "language": "es",
        "author_name": "Peligrosa radio 1370am y 1600 am",
        "slug": "peligrosa1370am",
        "cover": "20230908_070951_3154c42f50139cca5b7b4ff2bf3e489e.jpg"
    },
    {
        "podcast_id": 228182,
        "title": "Building a Better Tomorrow",
        "description": "<p>Introducing “Building a Better Tomorrow”: A forward-thinking podcast.</p><p>In a world where the construction industry plays a pivotal role in shaping our environment, it’s time to have a conversation that matters. </p><p>This is \"Building a Better Tomorrow,\" where we embark on a journey through the ever-evolving landscape of the built environment. Join us as we unravel the intricacies of construction, exploring the latest industry trends, innovative technologies, and sustainable practices. </p><p>From groundbreaking discussions within BIM, to tackling flood risks, we will be joined by a variety of guests to cover the full spectrum of modern construction. </p><p>Whether you're a seasoned industry professional or simply curious about how construction can be a force for good, tune in to the Building a Better Tomorrow Podcast to learn more. Together, we’ll build a better future, one episode at a time. </p>",
        "language": "en",
        "author_name": "calfordseaden",
        "slug": "buildingabettertomorrow-calfordseaden",
        "cover": "20230911_010910_cf2e1cdcc83bab623f1bccb38367e848.jpg"
    },
    {
        "podcast_id": 228187,
        "title": "Talking Tampa",
        "description": "<p>Hosted by Dean Diakonis, a multi-million dollar producing real estate agent specializing in residential sales in the Tampa Bay area. Covering what is happening in the market, upcoming projects/developments, and bringing on guests to help you better navigate and dominate the real estate world. </p>",
        "language": "en",
        "author_name": "Dean Diakonis",
        "slug": "talkingtampa",
        "cover": "20230911_020903_1448a342896e207bf1b887dc3d52f54a.jpg"
    },
    {
        "podcast_id": 228205,
        "title": "SEEDCast by SEED engenharia",
        "description": "<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Phasellus non efficitur nunc. Nam porttitor nibh lectus, et tincidunt leo euismod eu.</p>",
        "language": "pt-br",
        "author_name": "SEED engenharia",
        "slug": "seedcast",
        "cover": "20230911_040924_10bb4caa367807924dc2c2ce09bf0505.jpg"
    }
]