[
    {
        "podcast_id": 4465,
        "title": "Design Thinkers Podcast",
        "description": "Unlock the world of Design Thinking as we explore its role and impact in society today on issues including climate change, transport, fashion and more. Learn from interviews and debates with some of the world's leading Design Thinkers.\n\nJoin the Responsible Revolution.\n\nFind out more: www.designthinkersacademy.co.uk\n\nFollow us: @designthinkersacademylondon",
        "language": "en",
        "author_name": "Design Thinkers Academy London",
        "slug": "designthinkersacademylondon",
        "cover": "5dc1962311b33.jpg"
    },
    {
        "podcast_id": 5005,
        "title": "The Reading Instruction Show",
        "description": "The Reading Instruction Show is a podcast about reading instruction (and other things) with a little bit of attitude. There is plenty here to inform and entertain all.",
        "language": "en",
        "author_name": "Dr. Andy Johnson",
        "slug": "drandy",
        "cover": "20230123_020122_7d7e2d09fe1dad184b31307b05b21d3e.jpg"
    },
    {
        "podcast_id": 7496,
        "title": "Quadrants of Mental Health",
        "description": "Dealing with the mind, body, spirit, and finance within the mental health field.",
        "language": "en",
        "author_name": "Dr. AJ ( Arthur Johnson)",
        "slug": "test11",
        "cover": "20200715_023638_5450b5f6f54bfd8980fbb12ddbfe528a.jpg"
    },
    {
        "podcast_id": 7543,
        "title": "The Macular Health Podcast",
        "description": "Welcome to the MacuHealth podcast, a channel dedicated to providing up-to-date education on macular health, nutrition and advancing visual performance.",
        "language": "en",
        "author_name": "MacuHealth",
        "slug": "macuhealth",
        "cover": "20200408_182056_dcd2a60305ab51a5d29127c9a99cc6fd.jpeg"
    },
    {
        "podcast_id": 8208,
        "title": "ABA Wizard",
        "description": "The ABA Wizard podcast is your weekly dose of research. Keep up with current literature in the field of applied behavior analysis as Kylan Heiner, BCBA takes the mic and interviews authors of current journal articles. ",
        "language": "en",
        "author_name": "ABA Wizard",
        "slug": "abawizard",
        "cover": "20200426_234543_8da91562fe67034ee6df5bcf9475b9b9.jpeg"
    },
    {
        "podcast_id": 8724,
        "title": "Ben's Learning Lounge",
        "description": "Taking the big topics you don't think about, and turning them into short digestible podcasts.",
        "language": "en",
        "author_name": "Ben Wallace",
        "slug": "benslearninglounge",
        "cover": "20220304_010350_a393126e7ef6fadc994cfebc00e9d6dc.jpg"
    },
    {
        "podcast_id": 8924,
        "title": "Learn & Bring Moshiach",
        "description": "Demystifying the core of all Judaism, the intent of all creation-- Moshiach. ",
        "language": "en",
        "author_name": "Learnmoshiach.com",
        "slug": "learnmoshiach",
        "cover": "20200528_120603_a64fa612b4ad5d89be88cfe08a4ebc6d.jpeg"
    },
    {
        "podcast_id": 9392,
        "title": "Transitional Justice Institute: Public Lectures and Events",
        "description": "A podcast series from the Transitional Justice Institute (TJI) at Ulster University in Northern Ireland, sharing our public lectures and events from key scholars and practitioners. The TJI is a world-leading research institute investigating themes of conflict, transitional justice, human rights, gender and international law. Learn more about our research, public events, taught postgraduate programmes (LLM Human Rights Law and Transitional Justice; LLM Gender, Conflict and Human Rights) and our PhD community at www.transitionaljustice.ulster.ac.uk. ",
        "language": "en",
        "author_name": "Ulster University",
        "slug": "tji",
        "cover": "20200605_191825_f301394bafde5535be217d9b9bbfc55e.jpeg"
    },
    {
        "podcast_id": 11440,
        "title": "Davis & Elkins Career Services Podcast",
        "description": "Some simple things to consider on the first day of your internship!",
        "language": "en",
        "author_name": "Christopher Jones",
        "slug": "careerservicesdewv",
        "cover": "20200817_020152_9f3ae3d4e6965fc8076ed83a38532333.jpg"
    },
    {
        "podcast_id": 13686,
        "title": "Adult History",
        "description": "Check out Adult History coming November 2, 2020.",
        "language": "en",
        "author_name": "ChristiAnn",
        "slug": "adulthistory",
        "cover": "20201028_004902_1b1eb04875e059be5d932fd92be8bae8.jpg"
    },
    {
        "podcast_id": 14943,
        "title": "Exploration Of The PCCAPS Program",
        "description": "Join the discussion as PCCAPS students interview a multitude of guests, all relating to project-based learning.",
        "language": "en",
        "author_name": "PCCAPS STUDENTS",
        "slug": "capsinterview",
        "cover": "20201120_172257_900555386a219b6af6ff97c990232748.jpg"
    },
    {
        "podcast_id": 15495,
        "title": "The Greg McAfee Show",
        "description": "An award-winning entrepreneur, Greg McAfee has a passion for helping business owners take their businesses to new heights. In 1990, Greg started McAfee Heating and Air Conditioning Co., his only capital was a meager $274 and a well-used truck. Today, Greg runs one of the most successful HVAC companies in the Midwest and is called upon to share his expertise with other business owners all over the nation. \n\nIn his new book, “Build and Grow Your HVAC Business”, Greg shares nine elements that will guide you in growing your business. He loves to inspire others to chase their dreams at full force, just as he has in his own life and business. Greg is still the working President of his company and puts the same systems and ideas in to place at his own laboratory, McAfee Heating and Air Conditioning Company, in Dayton, Ohio. \n\nGreg resides in Beavercreek, Ohio. Several years ago Greg sent articles to national trade magazines and many were published, which led to coaching, which led to business boot camps/revivals, and now The Greg McAfee Show. All these services help HVAC business owners think different and help grow their companies. ",
        "language": "en",
        "author_name": "Greg McAfee",
        "slug": "thegregmcafeeshow1",
        "cover": "20210825_160701_2cd1e17cc994b7093070da64d4d46594.jpg"
    },
    {
        "podcast_id": 15665,
        "title": "Colegio Suizo de México",
        "description": "Podcasts del Colegio Suizo de México",
        "language": "es",
        "author_name": "Colegio Suizo de México",
        "slug": "csm",
        "cover": "20201126_172418_9cca84fa5e6d4d1c632d243e35593fc5.jpg"
    },
    {
        "podcast_id": 16804,
        "title": "Salgın ve Toplum",
        "description": "Salgın ve Toplum Webinar serimizi buradan dinleyebilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipc4",
        "cover": "20201203_112846_e4e48353ec86774e8637deb4a0e21ada.jpg"
    },
    {
        "podcast_id": 16964,
        "title": "Doğa ve İklim Söyleşileri",
        "description": "Doğa ve İklim Söyleşileri'nde doğa koruma ve iklim değişikliği şle mücadele alanlarını bir araya getirerek tartışmayı amaçlıyoruz. Doğa ve İklim Söyleşileri serisinin tüm bölümlerine buradan ulaşabilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipmipc",
        "cover": "20201204_065712_a07fd2d94a65f3417a3b91f61c526eb9.jpg"
    },
    {
        "podcast_id": 16967,
        "title": "Nasıl bir Dünya? Nasıl bir Türkiye?",
        "description": "İstanbul Politikalar Merkezi (İPM) ve Medyascope işbirliğiyle hazırlanan “Nasıl bir Dünya? Nasıl bir Türkiye?” programının bütün bölümlerini buradan izleyebilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipmipcipm",
        "cover": "20201204_070310_744663f249a66f6925291c2a502a28e7.jpg"
    },
    {
        "podcast_id": 18040,
        "title": "codes",
        "description": "Learn your penal codes violations, business and professions codes, financial crimes, weapons violations, weapons confiscation violations, health and safely codes, vehicle code violations, radio codes/call types, ten codes by listening to my episodes on repeat.",
        "language": "en",
        "author_name": "Estefania Alcala",
        "slug": "learnyourcodes",
        "cover": "20201210_045838_555e478aa36b1c222b9b7f066a2e48a1.jpg"
    },
    {
        "podcast_id": 20220,
        "title": "Clippings: The Official Podcast of the Council for Nail Disorders",
        "description": "Welcome to Clippings, the official podcast of the Council for Nail Disorders where Drs. April Schachtel and Dr. Katherine Stiff take a closer look at articles and clippings published on all things nail disease. Visit us at www.nailexperts.org \nThank you for listening!\n",
        "language": "en",
        "author_name": "Council for Nail Disorders",
        "slug": "cndclippings",
        "cover": "20201223_125644_8f53eb80348152ec1515d1888fa20106.jpg"
    },
    {
        "podcast_id": 25970,
        "title": "The Arts & Learning Monthly Master Class Series ",
        "description": "Welcome, here we share our recorded Monthly Master Classes and Interviews with the Industry. These classes provide insight from industry professionals in the areas of: Theatre, Music, College Auditions, and More. With each added class, we strive to make high-quality arts education more accessible to all. You can always join us for next month's live zoom master class, by visiting us at www.artsandlearning.org",
        "language": "en",
        "author_name": "The Arts and Learning Conservatory",
        "slug": "artsandlearning",
        "cover": "20210226_072609_90c6d12be657fcfabe6f6d996c7ab485.jpg"
    },
    {
        "podcast_id": 27543,
        "title": "Casino Talk",
        "description": "Casino Talk ponúka tie najzaujímavejšie rozhovory zo sveta hazardných hier. Navyše ako dlhoroční hráči ti prinášame jedinečné školenia, ktoré ťa naučia stať sa „Smart Gamblerom“. \n\nPodcast Casino Talk ti prináša aplikácia My Casino Hub, tvoj sprievodca svetom hier.\n\nGoogle Play: http://bit.ly/36G8Dc2\nApple Store: http://apple.co/39Mk44b\n",
        "language": "sk",
        "author_name": "MY CASINO HUB",
        "slug": "casinotalk",
        "cover": "20210126_090130_e4418a29326eb6f0c039b705eef6cf2f.jpg"
    },
    {
        "podcast_id": 28165,
        "title": "Discussing essential topics related to Clinical Pharmacists in General Practice",
        "description": "Welcome to the Clinical Pharmacist podcast, where we discuss key topics related to Pharmacists in General Practice- supporting Pharmacists in this sector & help accelerate their career as a Clinical Pharmacist. Hosted by Runa Salim- the Clinical Lead of CPS & the training & development manager of Clinical Pharmacist Academy. Co-hosted by Mahmud Yusupov- the founder & Managing Director of CPS. Both Runa & Mahmud are IP Pharmacists with a wealth of experience in General Practice and are passionate about supporting pharmacists to become safe & efficient members of the General Practice workforce and have trained hundreds of Pharmacists to date.",
        "language": "en",
        "author_name": "Mahmud Yusupov",
        "slug": "clinicalpharmacist",
        "cover": "20210129_154916_5b62695a9693dd08a7499f5fcf8fe76c.jpg"
    },
    {
        "podcast_id": 29166,
        "title": "Tudo sobre a Rússia",
        "description": "O podcast oficial do Instituto Rússia Brasil, uma das maiores escolas de russo no Brasil. Neste podcast vamos semanalmente compartilhar com vocês muitas curiosidades sobre a Rússia e sua história, língua e cultura. Добро пожаловать!",
        "language": "pt-br",
        "author_name": "Instituto Rússia Brasil",
        "slug": "tudosobrearussia",
        "cover": "20210201_155711_7e263ab410f202c32261d3990f320b13.jpg"
    },
    {
        "podcast_id": 29565,
        "title": "UCSC Slugcast",
        "description": "Hosted out of the Student Affairs and Success divisional office, UCSC Slugcast is a way for students to learn more about campus resources, services, and student stories no matter where they are. Join our team of student podcasters every week to hear interviews, news, and stories about slug life at UCSC.",
        "language": "en",
        "author_name": "UCSC Division of Student Affairs and Success",
        "slug": "ucscslugcast",
        "cover": "20210413_221413_d34d248d5d0ba54b0dc9c86ea1f2f296.jpg"
    },
    {
        "podcast_id": 30276,
        "title": "The Study Room",
        "description": "A student-run podcast featuring a series of debates on the most pressing topics of our time along with exam revision for the most pressing exams of our time",
        "language": "en",
        "author_name": "A Very Tired A-level Student",
        "slug": "thestudyroom",
        "cover": "20210205_135901_6f77455e12e9f2b6e78a07ef248fea4c.jpg"
    },
    {
        "podcast_id": 30646,
        "title": "1 key success",
        "description": "This channel is an Islamic Radio Channel.",
        "language": "en",
        "author_name": "Islamic Radio Channel",
        "slug": "1keysuccesss",
        "cover": "20210305_181854_5e932a4f55becf24577e667f604e6b97.jpg"
    },
    {
        "podcast_id": 30896,
        "title": "Learn Chinese while sleeping - The Little Prince - Slow Audiobook",
        "description": "Slow audiobook in chinese mandarin for passive listening.\nThe Little Prince - 小王子 - El Principito \n#chino #chinese  #HSK #audiobooks #learnchinese #bedtimestory ",
        "language": "zh",
        "author_name": "Jing Lin",
        "slug": "jinglin",
        "cover": "20210314_110644_e376065459b629d401f6ec1e29a0d2a3.jpg"
    },
    {
        "podcast_id": 31559,
        "title": "UNSW Sydney - School of BEES",
        "description": "These are lectures and discussions from lecturers at UNSW Sydney for various courses across the School of Biological, Earth and Environmental Sciences",
        "language": "en",
        "author_name": "Michael Kasumovic",
        "slug": "unsw-bees",
        "cover": "20210303_183811_01d97f190605457866c3f74a982ef225.jpg"
    },
    {
        "podcast_id": 32955,
        "title": "Oposiciones Policia Vasca ",
        "description": "Resumen de todo lo que necesitas saber tema a tema para presentarte a las oposiciones de la Ertzaintza o la Policía Municipal en el País Vasco. \nDelitos y otros datos de interés para policías en activo que quieran refrescar la memoria \nInstagram: @police.podcast \n",
        "language": "es",
        "author_name": "A.",
        "slug": "oposicionespoliciavasca",
        "cover": "20210217_172832_97eb9a24b1fc28b2379dce04b42161cf.jpg"
    },
    {
        "podcast_id": 36682,
        "title": "Learner Driver Hub ",
        "description": "Learning to drive is challenging, but you don't have to do it alone. \nWelcome to the Driving Test Success, Learner Driver Hub podcast! This show is to help learner drivers in the UK navigate their way through the learner journey and tackle any challenges which come along the way. Join the team to help discover top tips, tricks and advice to make sure you get that first time pass. \n\nUK's No.1 Theory Test app - £4.99: https://bit.ly/DTSPodcastS1",
        "language": "en",
        "author_name": "Driving Test Success",
        "slug": "drivingtestsuccess",
        "cover": "20210304_183442_419486400ff8c2d6c82621ef6953673d.jpg"
    },
    {
        "podcast_id": 40975,
        "title": "Forgotten Victims: The Forensic Interview ",
        "description": "The Forgotten Victims Podcast, hosted by Scott Modell Ph.D. and Staci Whitney, LMSW, educates and empowers multidisciplinary team members to successfully investigate crimes against individuals with disabilities and other vulnerable populations. With decades of experience between them, they share how teams can successfully seek justice for vulnerable victims by discussing research, case examples and sharing practical skills for every step of an investigation. Join Scott and Staci to learn more about how you can make an impact in your community and better serve victims with disabilities through your work.",
        "language": "en",
        "author_name": "Modell Consulting Group ",
        "slug": "forgottenvictimspodcast",
        "cover": "20210312_151532_dfcae8d33728fe1701a3d2346d9d3544.jpg"
    },
    {
        "podcast_id": 43072,
        "title": "wPRAWIEni",
        "description": "Podcast prowadzony przez członków projektu społecznego wPRAWIEni. Rozmowy z osobami związanymi z prawem. Słuchając - stajesz się wPRAWIOny! ",
        "language": "pl",
        "author_name": "wPRAWIEni",
        "slug": "wprawieni",
        "cover": "20210320_210114_1fc995f75e57643a44aa3e324073eee5.jpg"
    },
    {
        "podcast_id": 44160,
        "title": "SM México",
        "description": "En el podcast de SM México encontrarás charlas informales sobre educación, un espacio que entiende tu labor docente y los mejores tips para el nuevo contexto educativo. También un espacio donde papá y mamá se sentirán identificados.",
        "language": "es",
        "author_name": "SM México",
        "slug": "sm",
        "cover": "20210409_004407_d12ba6fcb6c550f98c86ecbc3d0fc586.jpg"
    },
    {
        "podcast_id": 45843,
        "title": "Mapei Krónika Podcast",
        "description": "A Mapei Krónika podcastja azért jött létre, hogy segítséget adjon! Lesz itt minden, ami építőipar: szó lesz hőszigetelésről, vízszigetelésről, problémákról és azok megoldásairól, nagyméretű lapokról, teraszburkolásról, fugázóról, padlófűtésről, medenceépítősről, betonjavításról és még sorolhatnánk, sosem lenne vége… ",
        "language": "hu",
        "author_name": "Mapei Kft",
        "slug": "mapei-kornika",
        "cover": "20210331_174030_4c87bf8d1600c802bc63fc88d065745f.jpg"
    },
    {
        "podcast_id": 45916,
        "title": "Matthew's World of Wine and Drink",
        "description": "An Englishman in California soaking up the sun, I am a WSET Diploma graduate, Certified WSET Educator, and MW student. I blog about wine, teach it at all levels, and drink plenty of it. Follow me on twitter @mattswineworld or check out my website: matthewsworldofwineanddrink.com",
        "language": "en",
        "author_name": "Matthew Gaughan",
        "slug": "matthewsworldofwineanddrink",
        "cover": "20210401_225443_1ba75f1c4157ab0cb8cb337153bad746.jpg"
    },
    {
        "podcast_id": 46044,
        "title": "Informativos do TST - Vingadores",
        "description": "O destemido grupo de Vingadores comenta os principais julgados do Tribunal Superior do Trabalho. Se for corajoso o suficiente para se manter atualizado sobre a jurisprudência trabalhista e a sempre impactante batalha entre Dr. Capital e Sr. Empregado, junte-se a nós!",
        "language": "pt-br",
        "author_name": "SAULO MARTINS DE MELO",
        "slug": "vingadorescomentam",
        "cover": "20210401_135148_b982d78c801a4f2c202d53503da89085.jpg"
    },
    {
        "podcast_id": 47060,
        "title": "Esquire University",
        "description": "This podcast is dedicated to lawyers and those who support the legal industry.  We will bring you topics that directly affect the business of law including mass torts, marketing, intake, CRMs and more.",
        "language": "en",
        "author_name": "Eric Bersano",
        "slug": "esquireuniversity",
        "cover": "20210405_210130_cc00953347689fa37ce587059c8e6cb8.jpg"
    },
    {
        "podcast_id": 47776,
        "title": "Primary Music Teaching Podcast",
        "description": "Megan Roe speaks with professional teachers and musicians about music teaching at primary school level.\n\nWhat are the barriers faced by the teachers of today and how can we support teachers in enriching the lives of our children through music?\n\nHow do we engage the digital natives of today?\n\nCan the 'inter-relating dimensions' of music be demystified for all teachers?\n\nCan we involve music more in our day to day teaching?\n\nIs cross-curricular crushing our creative subjects?\n\nWhere can teachers find helpful resources?\n",
        "language": "en",
        "author_name": "Megan Roe",
        "slug": "primarymusic",
        "cover": "20210409_134028_34682260fb51ce3831ef640eb5028952.jpg"
    },
    {
        "podcast_id": 48396,
        "title": "Ilan Shchori - My tel-Aviv - History of Tel Aviv",
        "description": "שיחות, ראיונות ותוכניות עם אילן שחורי בתחנות וערוצי הרדיו השונים בנושאי תולדות תל אביב\nTalks, interviews and programs with Ilan Shchori on various radio stations and channels on the history of Tel Aviv",
        "language": "he",
        "author_name": "Ilan Shchori",
        "slug": "ilanmytlv",
        "cover": "20210410_201402_0ad9826144e1542f57525f38e4759a08.jpg"
    },
    {
        "podcast_id": 49257,
        "title": "The Educated Athlete Podcast",
        "description": "A show dedicated to empowering athletes and practitioners to perform at their best through education - I’m Coach T and I’m an Exercise Physiologist. If you want to elevate your game, take your fitness and sports performance to the next level, or become a better coach - this is the podcast for you - Let's learn!\n\n",
        "language": "en",
        "author_name": "Trevor Short, PhD (c), CSCS",
        "slug": "theeducatedathlete",
        "cover": "20210414_025754_a0f78f332a7b543a7cf99e22dafa9158.jpg"
    },
    {
        "podcast_id": 49447,
        "title": "Podcast",
        "description": "<p>PROVA</p>",
        "language": "it",
        "author_name": "Giovanni",
        "slug": "maestroiaquinta",
        "cover": "20230517_080536_da972892859e6437cc78d3cdc7f272fd.jpg"
    },
    {
        "podcast_id": 54783,
        "title": "60 de minute cu RE/MAX România ",
        "description": "Am dat startul podcasturilor într-o serie numită 60 de minute cu RE/MAX România.\nNe dorim să dăm cât mai multe insights din spatele culiselor din imobiliare. Invitații noștri sunt fie colegi din rețea, top brokeri și agenți, fie antreprenori de succes dornici să împărtășească cu voi experiențele lor. Stay tuned! \n",
        "language": "ro",
        "author_name": "RE/MAX România",
        "slug": "60-minute-cu-remax-romania",
        "cover": "20210506_103550_84f3600681868d8ed87a086aa463bb66.jpg"
    },
    {
        "podcast_id": 55376,
        "title": "Rica, Empoderada y Latina by Patricia Carreño",
        "description": "¡Hello Beauty Bosses! Si no me conoces, soy Patricia Carreño, empresaria con más de 20 años de experiencia en negocios dentro de la industria de la belleza y hoy por hoy, fundadora y directora de la academia de micropigmentación más importante en América Latina. #BeautyAngelsAcademy. \n\nY he creado este podcast para ti, para ti que tienes un pequeño negocio enfocado en la belleza, un spa, pones uñas, cortas cabello ¡Lo que sea! Si tu negocio se dedica a embellecer a las personas este podcast, es para ti. \n\nTe voy a contar como hice para crecer de un pequeño salón de belleza en la cochera de mi madre a una empresa internacional que factura millones de pesos al mes. \n\nQuiero que te sientas, cómoda y segura conmigo para que tomes lo mejor de este podcast, lo apliques en tu negocio y logres hacerlo crecer SIN TANTO DRAMA. ",
        "language": "es",
        "author_name": "Patricia Carreño",
        "slug": "ricaempoderadalatina",
        "cover": "20210706_162239_e52ff8b75cc4a329e5a1733b12e15ec9.jpg"
    },
    {
        "podcast_id": 55796,
        "title": "Government Ops Podcast",
        "description": "Hosted by City Manager Rob Anderson and Communications Manager Meghan Howard, the Government Ops Podcast covers an overview of the various City Departments, programs, and services here in the City of Fairborn. Discover this great community where you can live, work, play, and go to school. ",
        "language": "en",
        "author_name": "City of Fairborn",
        "slug": "governmentops",
        "cover": "20210614_202655_ec1cf08cf0004587067a7043902f76c2.jpg"
    },
    {
        "podcast_id": 57608,
        "title": "Let's Talk Micro",
        "description": "Clinical Microbiology explained in simple terms, suitable for students and microbiologists alike. Hosted by Luis Plaza, a Medical Laboratory Scientist, he also talks about his experiences as a clinical microbiologist.",
        "language": "en",
        "author_name": "Luis Plaza",
        "slug": "letstalkmicro",
        "cover": "20210518_155452_ff250b3ba17c308e991c7f05c13c9848.jpg"
    },
    {
        "podcast_id": 58256,
        "title": "La Station Beauté - Beauty Academy",
        "description": "La Station Beauté - Beauty Academy est une école de formation en esthétique spécialisée dans toutes les nouvelles technologies. Regroupant les meilleures artistes au Québec, ce Podcast est destiné à toutes les passionnées du domaine. \n\nPrésenté par Chloé Jacques, formatrice spécialisée en Maquillage Permanent & Microblading et Alexane Palica esthéticienne formatrice en Esthétique & Technologies Avancées.\n\nNous discuterons ici librement de stratégies d'affaires, de mindset, de marketing, de start-up, etc. Nous couvrirons également tout ce qui touche l'esthétique et les technologies avancées telles que:\n\n-Maquillage Permanent\n-Microblading\n-Skin Care\n-Microneedling\n-Extension de cils\n-Russian Volume\n-Lashlift\n-Henné\n-Freckles\n-Areola Reconstruction\n-Micro Pigmentation Capillaire\n-Laser\n-Nanoliner\n-Stroke Pattern\n-Colorimétrie\n\nEt plus encore!\n\nVous désirez apprendre de façon ludique & rapide? Joignez-vous à nous!",
        "language": "fr",
        "author_name": "Chloé Jacques & Alexane Palica",
        "slug": "lastationbeaute",
        "cover": "20220905_110957_f4ce6ad34a12756adbeffa22345f8f8c.jpg"
    },
    {
        "podcast_id": 60555,
        "title": "The Secret Life of Shopify in Israel",
        "description": "The Shopify Israel market might seem small, but it sure is mighty. We're bringing you all of the insights, advice, and know-how that we've gathered over the last 10 years that's specific to the benefits and limitations of the platform in Israel. ",
        "language": "he",
        "author_name": "BOA Ideas",
        "slug": "shopify-in-israel",
        "cover": "20210602_120149_8319bae2e379ba81c3765e2a0d5326d7.jpg"
    },
    {
        "podcast_id": 60596,
        "title": "Friendly Physics",
        "description": "Physics should be simple. It is all around us, relevant in math, biology, sports and space.\n\nLet's break it down and listen to ~10 minute episodes on topics ranging from speed to parallel universes. \n\nFriendly Physics is produced by a high school physics teacher and steps listeners through kinematics, simple machines, electromagnetism and more. ",
        "language": "en",
        "author_name": "Gabriela Gallego",
        "slug": "friendlyphysics",
        "cover": "20210604_151622_9d86a3b623cd8007a21feaf25c09b5d4.jpg"
    },
    {
        "podcast_id": 61745,
        "title": "Pasión por la escritura creativa",
        "description": "Soy Nuria Sierra, escritora, lectora profesional y asesora literaria. Mi misión es ayudar a los autores en el proceso de escritura. Te doy la bienvenida a este canal donde compartiré mis conocimientos sobre técnica narrativa, trucos de escritura y motivación para escribir. Espero que los apliques a tu escritura y le des rienda suelta a tu pasión por las palabras.",
        "language": "es",
        "author_name": "Nuria Sierra",
        "slug": "nuriasierra",
        "cover": "20211110_111155_c38cb851367fee70901f6277aa31aee6.jpg"
    },
    {
        "podcast_id": 62467,
        "title": "The Freedom Focused Podcast",
        "description": "<p>Are you struggling and frustrated as a small business owner? </p><p>Do you wish that your business ran smoother, with employees who were more engaged and productive? </p><p>Do you spend so much time running your business that you have little if any time to do the things you really love to do? </p><p>If you answered yes to any or all of these questions, then The Freedom Focused Podcast is made for you! </p><p>With over 20 years of experience as a small business owner, </p><p>Daran Wastchak shares his knowledge of how to run a business that is \"Freedom Focused.\" </p><p>In this podcast, you will learn just how to do that, and in the process make greater personal and professional freedom as a small business owner a reality rather than just a dream! </p><p>To learn more about Daran and Freedom Focused, check out his website at <a href=\"http://www.DaranWastchak.com\">www.DaranWastchak.com</a>. </p><p>Stay focused on your <strong>FREEDOM</strong>!</p>",
        "language": "en",
        "author_name": "Daran Wastchak",
        "slug": "freedomfocusedpodcast",
        "cover": "20220126_050123_3e89c10ce87d5613d93a3369dbb6b63e.jpg"
    },
    {
        "podcast_id": 62583,
        "title": "Miss Fintech Talks",
        "description": "Fintech is the future of finance, teens are the future of fintech. Are you ready?",
        "language": "en",
        "author_name": "Miss Fintech",
        "slug": "missfintech",
        "cover": "20210616_093822_1dbc6843f700601eb9fb6f3d2e5f00b2.jpg"
    },
    {
        "podcast_id": 66141,
        "title": "Health Coaches Academy",
        "description": "Welcome to the home of Health Coaching with the team here at The Health Coaches Academy. This show explores the power of health coaching to enable people to live life well, through interviews with some of the UK's leading Health Coaches and associated professionals. For more information on Health Coaching, and how you can become one, visit www.healthcoachesacademy.com",
        "language": "en",
        "author_name": "Health Coaches Academy",
        "slug": "healthcoachesacademy",
        "cover": "20210702_115509_3dc6498cd2f66dd55866fd6b552f9f39.jpg"
    },
    {
        "podcast_id": 66202,
        "title": "The Journey",
        "description": "Speel hier de spelpodcast",
        "language": "nl",
        "author_name": "The Journey",
        "slug": "doemeemetthejourney",
        "cover": "20210702_185253_6b4e7174ba6efc40d3132f0fa7388b4e.jpg"
    },
    {
        "podcast_id": 66419,
        "title": "Tooth Be Told: The University of Alberta School of Dentistry Student Podcast ",
        "description": "Welcome to Tooth Be Told, a professionalism podcast where we talk about all things dentistry! If you need something to wake you up on your commute to KAYE clinic or need a little break from drilling in the simlab, Tooth Be Told is here to showcase different voices in the field, discuss all the trending dental topics and keep you updated on all upcoming School of Dentistry events, all while sharing a laugh and having a friendly conversation. ",
        "language": "en",
        "author_name": "SPEA",
        "slug": "toothbetold",
        "cover": "20210714_173756_e75ff0c1cd4d68b235d873074e3f4669.jpg"
    },
    {
        "podcast_id": 66600,
        "title": "The Health and Safety Digest",
        "description": "We are delighted to announce the new Astutis podcast, 'The Health and Safety Digest', under the Astutis podcast umbrella. \n\nEach season will concentrate on an individual health and safety training course. Each episode will answer FAQs and, more importantly, your questions.\n\nIn every episode, Astutis Digital Content Writer Toby Howell will interview those responsible for designing accredited health and safety training courses to bring learners closer to the qualifications they are studying. Alternatively, if you are unsure of what qualification to take, 'The Health and Safety Digest' will make that choice easier. \n\nSeason One will focus on the NEBOSH Diploma, now called the NEBOSH Diploma for Occupational Health and Safety Management Professionals. Each episode will dissect the qualification, one question at a time. \n\nA 2021 syllabus update has made some significant changes to the course, changing the complexion of the entire qualification.  Each episode will uncover the course, giving listeners an under-the-hood experience. \n\nSeason One features Astutis Techincal Director Brenig Moore. Brenig has over 30 years of experience in the health and safety training industry.   Brenig has sat on the NEBOSH Council and is responsible for the Astutis incarnation of the NEBOSH Diploma. ",
        "language": "en",
        "author_name": "Astutis",
        "slug": "healthandsafetydigest",
        "cover": "20210707_080035_b70530deb7bae8438a528b8857959d49.jpg"
    },
    {
        "podcast_id": 66620,
        "title": "monke is lerning",
        "description": "illegitimi non carborundum ",
        "language": "en",
        "author_name": "ksuspicious",
        "slug": "stepupboi",
        "cover": "20210706_002450_bd1053a991cd51c38473d4cd3c65c309.jpg"
    },
    {
        "podcast_id": 67034,
        "title": "Tech Champagne",
        "description": "Welcome to Tech Champagne, a podcast about creating multiple revenue streams with automated systems.   If you dream of having an online business that allows you the freedom to work from wherever on whatever lights up your soul, you're in the right place.  Create a digital course or a connected community or a sales funnel that you brings you the dreamiest of clients with systems that do allll the work for you.  ",
        "language": "en",
        "author_name": "Alisa Wilcox",
        "slug": "techchampagne",
        "cover": "20220113_120118_a1e91622bb137f40fbccda1ba063b81e.jpg"
    },
    {
        "podcast_id": 68155,
        "title": "Rhode Island Youth Mental Health Webinar Series ",
        "description": "Welcome to the Rhode Island Youth Mental Health Webinar Series, funded by the Rhode Island Department of Health. This series of webinars, presented by industry professionals, is designed to increase the awareness of parents, educators, and youths themselves of the mental health problems facing today's youth. \n\nFor More Information, Check Out Our Social Media:\nWebsite: www.risas.org/\nFacebook: @RISASorg\nInstagram: @risas_org\nTwitter: @RISAS_Org",
        "language": "en",
        "author_name": "Rhode Island Student Assistance Services",
        "slug": "riyouthseries",
        "cover": "20210716_123435_433a860deccff8a62ace701ecb345ce2.jpg"
    },
    {
        "podcast_id": 69749,
        "title": "Why on Earth Should I Gamify?",
        "description": "Would you believe some students will graduate high school with the same amount of gaming hours as hours spent in class? With this in mind, why would teachers ever think gamifying their classroom is a good idea? Don't students spend enough time gaming already? Michelle Watrin, a middle school teacher from beautiful Abbotsford, B.C., explains the ins and outs of what gamifying a classroom could look like, and why some teachers are finding such success in gamification. ",
        "language": "en",
        "author_name": "Michelle Watrin",
        "slug": "whyonearthshouldigamify",
        "cover": "20210723_221416_31e512c589b852fcc1d928856098d7ec.jpg"
    },
    {
        "podcast_id": 75541,
        "title": "TUSmedline",
        "description": "TUSmedline Tıpta Uzmanlık Sınavına hazırlanan hekimlere yenilikçi ve dijital kanallar aracılığıyla bilgi vererek hazırlık süreçlerini verimli ve en iyi şekilde yönetmelerini sağlamayı amaçlar. Alanında uzman eğitmenlerden hazırlık önerileri, temel ve klinik bilimler hakkında ayrıntılı ve güncel bilgiler sunar.",
        "language": "tr",
        "author_name": "TUSmedline",
        "slug": "tusmedline",
        "cover": "20211020_080457_e8ae2e432ccd80a61fcd131e60e45511.jpg"
    },
    {
        "podcast_id": 75908,
        "title": "School of PE Podcast",
        "description": "We are so excited to offer our latest educational resource: the School of PE Podcast. Several times a month, we will be releasing a variety of episodes featuring hot topics in engineering along with interviews with School of PE instructors, subject matter experts, and other special guests. Hosted by our Associate Vice President Chris Miller, these podcasts are designed to deliver interesting and informative content you can listen to or watch anywhere, anytime. Tune in regularly so you don’t miss any updates or new content!",
        "language": "en",
        "author_name": "School of PE",
        "slug": "schoolofpe",
        "cover": "20210827_191720_547c6a95576e530e0185f9706fca1631.jpg"
    },
    {
        "podcast_id": 78683,
        "title": " The Empire Building Podcast",
        "description": "Talking all things business, career and empire building.\n\nBy Candice Lott and Charlotte Le Pore \n\n",
        "language": "en",
        "author_name": "Candice Lott & Charlotte Le Pore",
        "slug": "empirebuilding",
        "cover": "20211125_121152_a42231559c2790832ee36d3c2d3acce2.jpg"
    },
    {
        "podcast_id": 78867,
        "title": "Apathetic Podcast",
        "description": "<p>Micah and Carlos start a new series on their experiences in life.</p>",
        "language": "en",
        "author_name": "Micah Reeves",
        "slug": "apatheticpodcast",
        "cover": "20210913_014222_8e4260faf150773170c74ceb870d73c9.jpg"
    },
    {
        "podcast_id": 79384,
        "title": "Duet Partner Podcast",
        "description": "Duet is the independent music teacher's partner for digital studio management. Music teachers are our heroes, and we're passionate about providing them with the tools they need to focus on the music, not the management. This podcast complements our digital assistant software, providing insights from industry experts on how to start, run and grow a successful music teaching studio.",
        "language": "en",
        "author_name": "Duet Partner",
        "slug": "duetpartner",
        "cover": "20220329_040304_44470ca1593c60d4854b9c9e8697f7a6.jpg"
    },
    {
        "podcast_id": 81033,
        "title": "Academic Writing in 3 Minutes",
        "description": "Tips and ideas on how to improve your university writing, whether you are an undergraduate or a postgraduate student - all in 3 minutes.",
        "language": "en",
        "author_name": "Neil from Academic English Skills",
        "slug": "academicwritinginthree",
        "cover": "20211001_163911_e3b82c4caa93efd0d309209124b4f747.jpg"
    },
    {
        "podcast_id": 81420,
        "title": "Macbeth: The Podcast",
        "description": "Designed as an exciting and immersive learning tool for students, Macbeth is performed by our professional acting company in five action-packed episodes, complete with cinematic score and soundscape.   Read along with the text as you listen, get entangled in Shakespeare's bloody, murderous plot, and discover why Macbeth is still one of the greatest tragedies ever written. \n\nThis activity is made possible by the voters of Minnesota through a grant from the Minnesota State Arts Board, thanks to a legislative appropriation from the arts and cultural heritage fund.\n\nDirected by Doug Scholz-Carlson and Victoria Nassif | Text Coaching by Victoria Teague | Sound Design by Scott O’Brien | Sound Editing by Nathanael Brown\n\nFeaturing: Andrew Carlson (Macbeth) | Leah Gabriel (Lady Macbeth) | Michael Fitzpatrick (Duncan) | Will Sturdivant (Banquo, Siward) | Vanessa Morosco (Macduff) | Valerie Lynn Brett (Lady Macduff, Hecate) | Alex Campbell (Malcolm) | Chris Pow (Ross) | Brittany Proia (Lennox) | Melissa Maxwell (Seyton) | Victoria Nassif (1st Witch, 1st Murderer, Doctor) | Gavin Mueller (2nd Witch, 2nd Murderer) | Lauren Winder (3rd Witch, Gentlewoman) | Doug Scholz-Carlson (Captain, Caithness) | Jackson Mixon (Donalbain) | Liam Carlson (Fleance) | Emma Bucknam (Servant) | Lyda Carlson (Macduff Child) | Hannah Young (Young Siward).  Thanks to KQAL and WSU.\n\nScore and soundscape originally designed for GRSF’s 2019 season production, directed by Paul Mason Barnes. Thanks to KQAL and WSU.",
        "language": "en",
        "author_name": "Great River Shakespeare Festival",
        "slug": "greatrivershakespearefestival",
        "cover": "20211010_221244_b4c3edd7e481dde3f52e3278fff056ab.jpg"
    },
    {
        "podcast_id": 81866,
        "title": "דינמיקה של עץ החיים בקבלה",
        "description": "ברוכים הבאים!\nבסדרה זו שנכתבה על ידי רבי סטיבן כתריאל פיסדל זצ\"ל נלמד את יסודות הבסיס של השתלשלות הבריאה לפי הקבלה ואת תהליך הבריאה עצמו לפי עץ החיים, המודל שמתאר את הבריאה בכל רגע ורגע ברמה הקוסמית וברמת האדם.\nבברכת שלום וברכה",
        "language": "he",
        "author_name": "Tomer Drori",
        "slug": "treeoflife",
        "cover": "20210927_221758_0552bfed8c094509ceedad89ca71c8e0.jpg"
    },
    {
        "podcast_id": 81910,
        "title": "Marvin Pierce Dog Teacher",
        "description": "Marvin Pierce Dog Teacher Podcast \n\nMarvin pierce has been doing obedience training for over 20 years and shares his experience in the field on this podcast.\nYou will hear about obedience training tips and many other dog training discussions!\nVisit our website at www.marvinpiercedogteacher.com",
        "language": "en",
        "author_name": "Marvin Pierce Dog Teacher",
        "slug": "marvinpiercedogteacher",
        "cover": "20221021_021032_5ed98ce0031a23e31c8c466088d8e92d.jpg"
    },
    {
        "podcast_id": 82052,
        "title": "Conversando con ORFE",
        "description": "Conversando con ORFE",
        "language": "es",
        "author_name": "Orozco Felgueres",
        "slug": "conversando-con-orfe60",
        "cover": "20211028_143305_d02b0f2181b1b7941f8835d3aa2e768c.jpg"
    },
    {
        "podcast_id": 83316,
        "title": "Padres Imperfectos",
        "description": "Conversaciones de @patymier con expertos que nos ayudan en el camino de ser papás, educando desde el amor y aceptando que nos podemos equivocar.",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "padresimperfectos",
        "cover": "20211005_003206_7bf33079d61d70854e7ce8f43a8b8615.jpg"
    },
    {
        "podcast_id": 84866,
        "title": "Eşikteki Türkiye",
        "description": "İnsanlık küreselleşme, yeni teknolojiler, iklim değişikliği gibi herkesi yatay kesen dinamiklerin yanı sıra her bir ülkeyi farklı şekillerde etkileyen göç, terör, radikalleşme, eşitsizlik, yoksulluk gibi gelişmeler üzerinden yeni bir tecrübe yaşıyor. Bu tecrübe, birbirinden farklı düzeylerde de olsa, her ülke ve toplumun bilgi, olgu ve değer ile ilişkilerini yapısal olarak dönüştürüyor. Bu webinar serisinde Türkiye'nin de yakından hissettiği bu dönüşüm sürecinin toplumsal, siyasal ve ekonomik dinamiklerinin anlaşılması, bu dinamiklerin ulusal, bölgesel ve küresel gelişmelerle etkileşiminin değerlendirilmesi amaçlanmaktadır.\n",
        "language": "tr",
        "author_name": "Istanbul Policy Center & Ankara Institute Turkey",
        "slug": "esiktekiturkiye",
        "cover": "20211013_114505_cfb79e61f485eb5f10076eee73f74db4.jpg"
    },
    {
        "podcast_id": 86576,
        "title": "The Open Bible Podcast",
        "description": "Contending for the True Gospel.... The Open Bible Podcast is for Christians seeking answers to understand the scriptures in their context and mystries. There are passages that can be obscure to modern readers due to historical or cultural references. Peter said that Scripture contains “some things that are hard to understand”, 2 Peter 3:16. The lack of understanding & knowledge can be deadly. Psalm 19:7: declares that the “testimony of the Lord is sure, making wise the simple”. But the simple cannot be made wise by something they are unable to understand. Surely, the Word of God does demand the need for interpretation, explanation, and exposition of the scripture by diligent Bible Teachers. To comprehend God and His dealings with mankind in the past, and His plans for the future, is the main goal of these podcasts.",
        "language": "en",
        "author_name": "Fernando Jimenez",
        "slug": "fernandojimenezuk",
        "cover": "20211109_103716_f82fabae2d69e7ff14ebf2ae5933912a.jpg"
    },
    {
        "podcast_id": 87567,
        "title": "DE CAMINO AA..",
        "description": "DE CAMINO AA..\nUn programa que hemos creado con la intención de compartir con todos ustedes reflexiones, vivencias y experiencias que se nos pueden presentar cuando decidimos emprender un nuevo camino.\n\nA partir del 3 de noviembre del 2021 podrás acompañarnos en este camino TODOS LOS MIÉRCOLES.",
        "language": "es",
        "author_name": "Decaminoaa",
        "slug": "decaminoaa",
        "cover": "20211028_080029_cd93ad523b31da5687b7a7e10fa6299a.jpg"
    },
    {
        "podcast_id": 88469,
        "title": "Mindful Warrior Radio ",
        "description": "Welcome to Mindful Warrior Radio, a podcast where we share brave stories, authentic insight, and real knowledge. \n\nWe interview CEOs, Olympians, elite athletes, coaches, authors, creatives, and other professionals on the topics of leadership, mindfulness, coaching, communications, interpersonal skills, conflict management, team building, flow, health, well-being, and optimal performance.",
        "language": "en",
        "author_name": "Mindfulwarrior",
        "slug": "minfulwarrioradio",
        "cover": "20211102_194841_e0f5152e829fd058f76b0711f8badd82.jpg"
    },
    {
        "podcast_id": 89463,
        "title": "Planting Positivity",
        "description": "Planting Positivity is a series of 38 podcasts to help you, to help yourself!\nYou wont get it all done, so stop trying!\nYou won't get permission, so stop asking!\nInstead be more like a flower, it doesn't need permission, it doesn't have to be super busy all the time, it doesn't need justification, clarification, or credibility it just is! It grows, it blooms, its beautiful, it just is!\nHappiness and Positivity are a mindset, when  planted, watered and nurtured,  they grow, when weeded and pruned, they flourish, enabling you to bloom in life. To thrive rather than survive. \nDon't be like the salmon thrashing about upstream, relax, let go and go with the flow. \nIt is not all about 6 figure incomes, sweating and stressing through life, proving you're a superwoman because look you can juggle baby, take the kids to numerous weekly activities (that they probably don't even want to do, by the way) be busy and super efficient at work, cook like Delia Smith and bake like Mary Berry and still have energy to be a loving wife, FFS*! its about enjoying the here and now. Its about aligning and finding the peace within, to be able to find your authentic voice and use it to get what you want. Its learning to say \"NO! I'm not going to do that, because it is not in line with my happiness\"  Your happiness, your joy, your  inner peace  are too important to keep at the back door, too important to brush aside and hope you'll find time for them later. \nExplore who you are, learn about you and how your mind works and learn how to embrace the wonderfulness of you, so you can get purposeful on getting more positive. ",
        "language": "en",
        "author_name": "Jenni eden",
        "slug": "jenniedenplantingpositivity",
        "cover": "20211108_112728_f4c079f756ae31bacce8f17bede6d984.jpg"
    },
    {
        "podcast_id": 92632,
        "title": "The Mechanics of Poker Podcast",
        "description": "In The Mechanics of Poker podcast, Rene aka ‘TheWakko’ and Mindset & Performance coach Adam Carmichael deconstruct high stakes poker players. They are figuring out what it is about them, how they think, and what they do that makes them so successful. The hosts place an extra focus on the obstacles these players had to overcome and the skills they had to develop in their rise to the top.",
        "language": "en",
        "author_name": "Rene 'TheWakko' ",
        "slug": "mechanicsofpoker",
        "cover": "20220728_010753_8c81eedcf7f32712598ef25729f6f1ca.jpg"
    },
    {
        "podcast_id": 93473,
        "title": "Duiden met de Muijs",
        "description": "Samen met Daniël Muijs duiden we met elkaar wekelijks de zin en de onzin achter de trends, de gebaande paden en de gewoonten in het onderwijs. Vanuit de dagelijkse praktijk bouwen we een brug naar wetenschappelijk theorie en onderzoek, en weer terug. Nieuwsgierig naar meer? Kijk dan ook eens op www.academica-group.com voor nog meer moois. ",
        "language": "nl",
        "author_name": "Academica University of Applied Sciences",
        "slug": "duidenmetdemuijs",
        "cover": "20220210_080256_d4959b7ab21a20111e59b74e2c1fae0c.jpg"
    },
    {
        "podcast_id": 93929,
        "title": "Podcast by Emma",
        "description": "Come listen to a college student talk about real world current events, being in a classroom and teaching during these crazy times, and all around anything and everything in this world with me or even special guest stars like my friends and family, quite the ride.",
        "language": "en",
        "author_name": "Emma Shields",
        "slug": "podcastbyemma",
        "cover": "20211203_081254_c0a2fa6444f9731aaba1b455a95a6b45.jpg"
    },
    {
        "podcast_id": 94265,
        "title": "Emerging Market Retail Podcast",
        "description": "The Emerging Market Retail Podcast aims to collect and disseminate trends and best practices in the grocery retailing industry in emerging markets, from both a professional and academic perspective. This initiative is sponsored by Tilburg University and led by Prof. Dr. Jan C. Fransoo, and Ph.D. students Camilo Mora and Rafael Escamilla.",
        "language": "en",
        "author_name": "TEMRP",
        "slug": "emergingmarketretail",
        "cover": "20211208_041252_032006ef81efc876898bea6a55f9bbc3.jpg"
    },
    {
        "podcast_id": 95284,
        "title": "Blissful Bride - The Wedding Bliss Podcast",
        "description": "<p>Blissful Bride ist der Podcast für alle brides-to-be, die sich eine entspannte Hochzeitsplanung wünschen. Ob die Suche nach der perfekten Location, passenden Dienstleistern oder die vielen Entscheidungen, die während der Planung getroffen werden müssen: Als Hochzeitsplanerin weiß ich, dass das alles manchmal ganz schön viel sein kann. Daher erfährst du in den einzelnen Podcast-Episoden, wie du step-by-step durch alle Planungsschritte kommst und die Zeit bis zur Hochzeit so entspannt und selbstsicher wie möglich erlebst.</p>",
        "language": "de",
        "author_name": "Lisa Gregori",
        "slug": "theweddingbliss",
        "cover": "20230225_080204_6e2495ddea1b48b455c0a743372c1c1e.jpg"
    },
    {
        "podcast_id": 95525,
        "title": "Informal Caregiving and Alzheimer’s Disease Podcast",
        "description": "Hello this is Azucena and I am a graduate student at Northwestern University Master of Public Health program.\n\nAs part of my growth in public health I am supporting Healthy Washington Heights to establish this podcast.\n\nMy hope is that this podcast can be a place where we can discuss big topics together related to caregivers' experiences. \n",
        "language": "en",
        "author_name": "Azucena Lopez",
        "slug": "healthywashingtonheights",
        "cover": "20220501_010559_315b2a04d806130d9d1fa56f1349b120.jpg"
    },
    {
        "podcast_id": 96427,
        "title": "The Scriptures Are Real",
        "description": "The Scriptures Are Real (TSAR) with Kerry Muhlestein is a podcast where we look at elements of the scriptures that have become real to us. We interview both experts (people with language, archaeological, historical backgrounds, etc.), and lay folks, and explore times when the scriptures became real to them. This is done from the viewpoint of members of the Church of Jesus Christ of Latter-day Saints. We believe that there is real power in the scriptures and that as they become more real we can better apply them to our lives and draw more power from them. \nIf you listen to this podcast you will learn all kinds of interesting background information that will help you understand and learn more from the scriptures. We believe it will allow you to add real power to your life.\nMy gratitude to my co-host Lamar Newmeyer. Also to my friend Rich Nicholls, who composed the introductory music.",
        "language": "en-us",
        "author_name": "Kerry Muhlestein",
        "slug": "tsar",
        "cover": "20211219_021230_d1f3d1820a4525c970af03256388e9e6.jpg"
    },
    {
        "podcast_id": 96764,
        "title": "J'explique la technologie très simplement",
        "description": "Depuis 40 ans dans l'informatique, j'ai vu naître l'ordinateur personnel, Internet, le piratage , le paiement en ligne, Google .\nDiplômé d'une école d'ingénieur, j'ai été  responsable du département Networking chez IBM  et élu meilleur manager en 1997.  \nEntrepreneur : j'ai levé des fonds en 2000 et j'ai fondé une PME de développements dans l'Internet que ma fille ainée dirige  avec succès aujourd'hui . \n40 ans de carrière dans l'informatique : ce sont des milliers de rencontres, des succès  , des échecs mais surtout le plaisir d'être dans un domaine sans cesse en évolution . Jeunes et moins jeunes , je suis là pour vous donner envie de comprendre la technologie, alors n'hésitez pas à regarder ma chaine et à me poser vos questions !",
        "language": "fr",
        "author_name": "Manu du Turfu",
        "slug": "manuduturfu",
        "cover": "20211221_081236_e8f904ce7a8f011b1f5539c809952df2.jpg"
    },
    {
        "podcast_id": 96999,
        "title": "Women Writing ...",
        "description": "A new feminist podcast about literature. ",
        "language": "en",
        "author_name": "Tilly Nevin",
        "slug": "womenwritingpodcast",
        "cover": "20211222_101254_bcb2d499238b0cb0b462baa98d3833f5.jpg"
    },
    {
        "podcast_id": 97469,
        "title": "Cow Talks",
        "description": "<p>Cow Talks with Dr. Marcelo Wallau, UF/IFAS Forage Extension Specialist and Chris Prevatt, Beef Cattle and Forage Commodity Director for the Alabama Farmers Federation. This podcast is tailored towards producers and extension agents in Florida.</p>",
        "language": "en",
        "author_name": "Marcelo Wallau and Chris Prevatt",
        "slug": "cowtalks",
        "cover": "20211228_071213_d6d7f40cc1b2e4b301e1fd76d28990f8.jpg"
    },
    {
        "podcast_id": 101073,
        "title": "PHIL 1301: Introduction to Philosophy",
        "description": "<p>Lecture notes recordings for PHIL 1301. Cover art \"Books\" by Scouse Smurf, downloaded from Flickr. Podcast also available on Spotify.</p>",
        "language": "en",
        "author_name": "Dr. Bruxvoort",
        "slug": "phil1301",
        "cover": "20220123_120104_5f3db408176d81e4fcee59980f6413d0.jpg"
    },
    {
        "podcast_id": 101955,
        "title": "Rideear",
        "description": "Rideear är en podd där du kommer få möjlighet att utveckla din ridning tillsammans med flera olika ridtränare, du kommer få en lektion som du kan lyssna på när du rider. \n\n\n\n\nAnsvarig utgivare: Amanda Norenius",
        "language": "sv",
        "author_name": "Amanda Norenius",
        "slug": "rideear",
        "cover": "20220119_020127_dd0f98df1168aeb9182a094b23fb2ecd.jpg"
    },
    {
        "podcast_id": 102258,
        "title": "Trenerzy Umysłu - Best Brain",
        "description": "Trenerzy Umysłu - Bracia Boral. Kim jesteśmy?\n\t\t\tCzy marzysz o tym, aby realnie pomóc Twojemu dziecku w nauce? Jeśli jesteś rodzicem zaangażowanym w rozwój swoich dzieci, to zapewne odpowiedź brzmi “tak”. Od wielu lat pomagamy dzieciom i dorosłym szybciej przyswajać wiedzę. Po sukcesach w Mistrzostwach Polski, pojechaliśmy jako pierwsi Polacy w historii na Mistrzostwa Świata Pamięci🏆, przywożąc stamtąd dwa medale i szóste miejsce drużynowo. Po powrocie ktoś poprosił o zrobienie pierwszego w życiu szkolenia i zobaczyliśmy że jest to nasze powołanie, które daje nam Pan Bóg. Dzielić się naszą pasją i umiejętnościami tak, aby innym było łatwiej. Dziś wiemy, że techniki efektywnej nauki i zapamiętywania wcale nie są kluczem do sukcesu. Najważniejszy jest dobry trening. To, co nas dziś wyróżnia to dbałość o szczegóły, które w treningu pamięci są najistotniejsze. W kursie pamięci głównym celem jest rozwój wyobraźni, giętkości umysłu, koncentracji uwagi i szybkości kojarzenia informacji.\n\t\t",
        "language": "pl",
        "author_name": "Bartłomiej Boral, Tobiasz Boral",
        "slug": "trenerzyumyslu",
        "cover": "20220124_030124_ebcd6fe2f7a43b08b154689625c8ff27.jpg"
    },
    {
        "podcast_id": 103022,
        "title": "Level Up",
        "description": "<p>Welcome to our podcast about leveling up in many industries. where we explore the latest trends and strategies to help individuals succeed in their journey. We also provide support to our students, faculty, and individuals. We believe that continuous learning and improvement are key to achieving success, and that's why we've invited expert guests, including educators, business leaders, social media experts, authors, and coaches, to share their insights and best practices on how to engage students and help them reach their full potential. We also provide ideas for business entrepreneurs on how to level themselves through exchanging stories and added-value conversations. From innovative teaching methods and technology to leadership and personal development, our podcast covers a wide range of topics to help students thrive in their academic and professional careers. Join us as we delve into the fascinating world of higher education and student engagement, and discover the tools and techniques that can make a difference in your life.</p><p>Check my details here: <a href=\"https://linktr.ee/luabydocleyland\">https://linktr.ee/luabydocleyland</a></p><p>Website: <a href=\"https://luabydocleyland.com/\">https://luabydocleyland.com/</a></p>",
        "language": "en",
        "author_name": "Dr. Constance Leyland",
        "slug": "levelupwithdrleyland",
        "cover": "20220311_060339_c9887569bc8ce393497bcbf8759422c4.jpg"
    },
    {
        "podcast_id": 104113,
        "title": "La mochila del Profe",
        "description": "Es un programa creado por maestrandos del Centro de Estudios \"David Alfaro Siqueiros\".\nLa “mochila pedagógica del profe” se ha construido a través de experiencias vitales durante toda su educación, desde el nivel básico hasta la universidad, donde ha incorporado las características y peculiaridades de la cultura pedagógica, el cual debemos modificar porque ya no son capaces de satisfacer las necesidades del mundo contemporáneo. ",
        "language": "es",
        "author_name": "ROGER ANTONIO OCH DZIB",
        "slug": "lamochiladelprofe",
        "cover": "20230129_040151_b3fb3b0b758f6ef1fd6c60202ad0b569.jpg"
    },
    {
        "podcast_id": 106485,
        "title": "Pigpot Podcast",
        "description": "Pigpot Podcast รายการ Podcast เรื่องการเลี้ยงสุกร น้องใหม่จาก Piggy Connect มาแล้ว!! \nมาพร้อมกับความรู้ แบบคนฟาร์มหมู ที่หยิบยกเอามาจากทั่วโลกมา มาย่อยสรุปให้ทุกท่านได้อัพเดทกัน แบบเข้าใจง่าย\n ภายใต้เวลาเพียงแค่ 8 นาที",
        "language": "en",
        "author_name": "BIAHLATH",
        "slug": "pigpotpodcast",
        "cover": "20220205_070224_6e6f2df0ffbb2dde8650e66b57746931.jpg"
    },
    {
        "podcast_id": 106628,
        "title": "HRD",
        "description": "The purpose of this podcast is to enhance the public's level of English across all age groups.",
        "language": "en",
        "author_name": "Hamid Reza Dousti",
        "slug": "hamidrezadousti1",
        "cover": "20220321_040326_199f58c272f8e0c23deda64ad57e12da.jpg"
    },
    {
        "podcast_id": 107600,
        "title": "Black Sheep",
        "description": "Welcome to Black Sheep where we're revealing new discoveries through education, one book at a time.",
        "language": "en",
        "author_name": "Mila Rahim",
        "slug": "blksheeppodcast",
        "cover": "20220209_050251_03d080854f65034735fd0224cbccc361.jpg"
    },
    {
        "podcast_id": 108167,
        "title": "Jelly Bean Medicine ",
        "description": "Welcome to the Jelly Bean Medicine podcast! \n\nMy name is Stephanie and I’m a final year medical student with a love for paeds. \nWith the Bond University Paediatrics Club, we've started a podcast for medical students that runs through all the high yield paediatric content using Australian guidelines. \n\nFollow our instagram, @jellybeanmedicine for more paediatric content. ",
        "language": "en",
        "author_name": "Jelly Bean Medicine ",
        "slug": "jellybeanmedicine",
        "cover": "20220224_070243_8da739f0273e6396c0e45229f48251bd.jpg"
    },
    {
        "podcast_id": 108677,
        "title": "Addiction-Rx",
        "description": "Clinical Dilemma ",
        "language": "en",
        "author_name": "Centre for Addiction Medicine & NIMHANS Digital Academy",
        "slug": "addiction-rx",
        "cover": "20220214_080210_256b3d4996e29bc37eb439fff19e9931.jpg"
    },
    {
        "podcast_id": 108935,
        "title": "Siła Marki",
        "description": "<p>Siła Marki - podcast autorstwa Anny Ganew - strateżki, konsultantki komunikacji marki, edukatorki, wspierającej kobiety w rozwoju ich małych biznesów. Po blisko 15 latach zajmowania się PRem i marketingiem wiem jedno, że nawet najmniejszy biznes potrzebuje wielkiej strategii, dlatego właśnie dzielę się wiedzą na temat tego jak stworzyć strategię i prowadzić działania marketingowe dla swojego małego biznesu. Jeśli masz swój mały biznes i chcesz go lepiej rozumieć, poznać swojego klienta, zacząć świadomie budować swoją markę i strategię jej komunikacji, to zapraszam Cię do słuchania.</p><p>Jeśli chcesz podzielić się ze mną swoją opinią lub zadać pytanie, to napisz do mnie na <a href=\"mailto:kontakt@annaganew.pl\">kontakt@annaganew.pl</a></p>",
        "language": "pl",
        "author_name": "Anna",
        "slug": "silamarki",
        "cover": "20220215_110240_db5a5ad2343643403162bb3dbc68b259.jpg"
    },
    {
        "podcast_id": 109576,
        "title": "Temas selectos para Alergólogos y Pacientes",
        "description": "El Colegio Mexicano de Inmunología Clínica y Alergia pone a disposición de la comunidad medica y pacientes esta serie de podcast en donde se abordan temas de actualidad en la práctica medica alergológica, explicados de una forma sencilla y didáctica impartidos por  expertos y especialistas en sus áreas  ",
        "language": "es",
        "author_name": "CMICA",
        "slug": "cmica",
        "cover": "20220217_080209_eaea984e6992c9e1e56644053e95a80b.jpg"
    },
    {
        "podcast_id": 109684,
        "title": "El Cocinero Podcast",
        "description": "Bienvenidos a mi Podcast, Un lugar donde podré expresar todas mis anécdotas y experiencias de mi vida.",
        "language": "es",
        "author_name": "Alex Vargas ",
        "slug": "elcocineropodcast",
        "cover": "20220220_070238_7732443e800980842e07fbb740fdc6d2.jpg"
    },
    {
        "podcast_id": 111173,
        "title": "Stirgus Credit Repair",
        "description": "Welcome to the Stirgus Credit Repair Podcast, where we talk about credit scores and financial topics. We will explain how credit scores are established, how to use a credit card, great loan options, the credit repair process, business credit and more! \nFor more information on our service, please visit www.StirgusCreditRepair.com, email Info@StirgusCreditRepair.com or call (225) 243-9700. ",
        "language": "en",
        "author_name": "Christopher Stirgus",
        "slug": "stirguscreditrepair",
        "cover": "20220224_050255_906b5a86b48182dc70095a6f17cf215a.jpg"
    },
    {
        "podcast_id": 111505,
        "title": "Habilidades Interpersonales HHGD_U2_EA_DAMD",
        "description": "Habilidades Interpersonales:\nComunicación\nResolución de conflictos\nNegociación\nMotivación",
        "language": "es",
        "author_name": "Darío Molina Díaz",
        "slug": "habilidadesgerenciales",
        "cover": "20220226_040247_23cbba86e44fdba87e69a72dcb3e6281.jpg"
    },
    {
        "podcast_id": 111966,
        "title": "Welcome To Undergrad",
        "description": "Scared about College? Don't know where to start? Well, Welcome to Undergrad. A UTA-based podcast where we tell you the ins and outs of our college and what it taught us. We have discussions for multiple majors, and we won't hide any details. Welcome to Undergrad!",
        "language": "en",
        "author_name": "Zachary Smith and Danny Mudvari",
        "slug": "wtg",
        "cover": "20220228_100257_19760d4b7e9a7afc56e7f75609773227.jpg"
    },
    {
        "podcast_id": 112813,
        "title": "Paint with Lovejoy",
        "description": "Helping First-time & Beginner painters get comfortable with the painting process. We will discuss, how-to topics, perspective, and mindset for painting, as well as answer student questions in the \"Ask Lovejoy\" series. Much of the philosophy of what I teach can be applied to painting but also to life in general, so even if you are not a painter you can still enjoy the info and apply it to something in your life.",
        "language": "en",
        "author_name": "Lovejoy",
        "slug": "paintwithlovejoy",
        "cover": "20220303_100338_78567f7b582b6d2dedb19b338957c429.jpg"
    },
    {
        "podcast_id": 114314,
        "title": "Aprende español en 5 minutos",
        "description": "<p>En los 5 minutos que tenemos contigo hablaremos sobre temas interesantes si estás practicando español. o si te interesan las lenguas y sus singularidades. La idea es que practiques español y por eso evitamos las traducciones. Pero, a veces, hacemos algunas traducciones para facilitar la comprensión si estás haciendo otra cosa mientras escuchas. Te dejamos también las transcripciones abajo. Muchas gracias por escuchar, por favor comenta y comparte el podcast, eso nos ayuda mucho. Si quieres más información estas son nuestras páginas: <a href=\"https://www.spanishincabo.com/\">https://www.spanishincabo.com/</a> <a href=\"https://spanishuptoyou.com/\">https://spanishuptoyou.com/</a></p><p>n the 5 minutes we have with you we will talk about interesting topics if you are practicing Spanish. or if you are interested in languages and their singularities. The idea is that you practice Spanish and that is why we avoid translations. But sometimes we do some translations to make it easier to understand if you're doing something else while listening. We also leave you the transcripts below. Thank you very much for listening, please comment and share the podcast, that helps us a lot. If you want more information these are our pages:</p>",
        "language": "en",
        "author_name": "Malena y eduardo ",
        "slug": "spanishincabo",
        "cover": "20230225_060204_6bffb552ed5a56a90a26711f9ec656bf.jpg"
    },
    {
        "podcast_id": 114360,
        "title": "Paraksilen Kimya",
        "description": "Paraksilen Kimya youtube kanalına ait podcastleri burada bulabilirsiniz. Yolda, evde, okulda podcastlar ile kimya bilginizi tazeleyebilir, unuttuğunuz yerleri aklınızda tutabilirsiniz.",
        "language": "tr",
        "author_name": "Mehmet Sait Özdemir",
        "slug": "paraksilenkimya",
        "cover": "20220420_100458_34ffd60c053b59b6944043329196326a.jpg"
    },
    {
        "podcast_id": 114496,
        "title": "דרך המש\"י",
        "description": "ברוכים הבאים לערוץ של דרך המש\"י.\nבואו להבין מהו טיפול הוליסטי, מהי אנרגיה, מהי צ'אקרה וכל מה שבינהם בסדרת שיעורים מרתקת.\n",
        "language": "he",
        "author_name": "אורנה שלו",
        "slug": "ornashalev",
        "cover": "20220311_020333_1b4fd0dbcecd5a68d90a5eb244f65307.jpg"
    },
    {
        "podcast_id": 114672,
        "title": "IPeers Research Series Podcast",
        "description": "The IPeers Research Seminar Series Podcast is a short and sweet podcast where the members of IPeers interview their seminar series guests and quiz them about the origins of their research ideas, the writing process, and their life as a researcher.\n\nIPeers is organized by researchers at the Legal Studies Department at the Central European University (CEU). It brings together students, researchers, and faculty from inside and outside CEU which share an interest in IP and IT law, law & innovation, law & technology, and related disciplines.",
        "language": "en",
        "author_name": "CEU IPeers Research Group",
        "slug": "ipeersresearchgroup",
        "cover": "20220312_110356_f8efa6a2513cd3f8524fa5f2403ff4c6.jpg"
    },
    {
        "podcast_id": 115083,
        "title": "CLIL Voices",
        "description": "CLIL Voices is a podcast designed to be an accessible resource for CLIL practitioners and researchers. Episodes formats will include: Interviews with CLIL experts, discussions between peers about CLIL teaching and/or research, and discussions between language teachers of CLIL and content specialists.\n",
        "language": "en",
        "author_name": "TECLIL",
        "slug": "clilvoices",
        "cover": "20220628_010621_db910107ae390fb50948af821926c071.jpg"
    },
    {
        "podcast_id": 115335,
        "title": "Podcasts Scaffold",
        "description": "Podcasts produzidos pela Scaffold Education para trilhas de clientes",
        "language": "pt-br",
        "author_name": "Scaffold Education",
        "slug": "hoftmodulo1",
        "cover": "20220329_120337_f0b85e08dbea6fdde2f135d80f9c6bd4.jpg"
    },
    {
        "podcast_id": 116005,
        "title": "Road 2 Forex",
        "description": "<p>This is an educational Forex podcast where we talk about everything and anything related to trading on the Foreign Exchange. The host is a professional and full-time day trader, with 4 years of experience within the forex markets and who works for a proprietary firm in addition to running his own education business where he teaches people how to trade both forex and crypto.</p>",
        "language": "en",
        "author_name": "Road 2 Forex",
        "slug": "road2forex",
        "cover": "20230705_020734_7f6a4861389da391ac51e5b6f927386c.jpg"
    },
    {
        "podcast_id": 118405,
        "title": "GradSchoolGrad - US Policy & IR Programs Podcast",
        "description": "Podcast for thoughts and observations about US Policy & IR Grad Programs from a recent MPP graduate and higher education watcher. ",
        "language": "en",
        "author_name": "GradSchoolGrad",
        "slug": "gradschoolgrad",
        "cover": "20220329_020311_9b55f5b173a9ea37ce2a1a63dd4e9180.jpg"
    },
    {
        "podcast_id": 118438,
        "title": " عوالم الفلسفة",
        "description": "الفلسفة هي اجتماع العقل والإدراك لفهم الواقع\n\nهذه الدروس مسجلة من مساحات تويتر على حساب عوالم الفلسفة.\n يمكنكم المشاركة أو مجرد الإستماع للدروس بمتابعة حساب عوالم الفلسفة على منصة تويتر\n\nhttps://twitter.com/philo_worlds",
        "language": "ar",
        "author_name": "طارق سعد القرني",
        "slug": "philosophy",
        "cover": "20220329_090353_8d448401dd3d9f1415b26d0201b3e43b.jpg"
    },
    {
        "podcast_id": 119860,
        "title": "Tutor Challenges",
        "description": "<p>A podcast for students by students on what it is like to be a tutor in challenge based learning projects.</p>",
        "language": "en",
        "author_name": "Isabelle Cooijmans, Sebastiaan Peters, and Sten Wessel",
        "slug": "tutorchallenges",
        "cover": "20230406_050432_3a8eeff470f9953526bebc31b8b94d5f.jpg"
    },
    {
        "podcast_id": 119911,
        "title": "Up Your English: Transforming ELT & Learning Beyond Labels - Podcast",
        "description": "<p>Welcome to \"Up Your English\"! Get ready to embark on an exciting podcast journey that combines the world of English language learning with a deep dive into the fascinating realm of Dyslexia and ADHD. I'm your host, Ania Karwowska, and I'm thrilled to be your guide in exploring the science behind dyslexia and debunking its myths.</p><p>Join me as I uncover the latest scientific research, educational approaches, and innovative technologies that can empower dyslexic students to excel in their English language journey. We'll explore evidence-based teaching methods, adaptive learning techniques, and inclusive classroom practices that cater to diverse learners.</p><p>Join me as I uncover the latest scientific research, educational approaches, and innovative technologies that can empower neurodiverse students to excel in their English language journey.</p><p>🚀 <a href=\"https://polcalanguages.kartra.com/page/KZa214\">https://polcalanguages.kartra.com/page/KZa214</a></p>",
        "language": "en",
        "author_name": "Ania Karwowska PolCa Languages",
        "slug": "neurodivergent-language-learners",
        "cover": "20230719_090701_3df55224b15149e4c8553a4d124253c4.jpg"
    },
    {
        "podcast_id": 120286,
        "title": "CSD Praxis Prep 5331",
        "description": "Peer led CSD Praxis 5331 Prep created by Students for Students; A Room of Requirements if you will! Not affiliated with any Universities or ASHA. ",
        "language": "en",
        "author_name": "Speech CSD Praxis Team",
        "slug": "csdpraxis",
        "cover": "20220406_020457_56a31d4e7ea0a0711596a525cc22ed41.jpg"
    },
    {
        "podcast_id": 120465,
        "title": "16th Minute ",
        "description": "All about Scrum. ",
        "language": "en",
        "author_name": "CAVU",
        "slug": "16thminute",
        "cover": "20220520_030500_5e2f378a9022b9b9d926e73fba55e1cd.jpg"
    },
    {
        "podcast_id": 121257,
        "title": "96 AD",
        "description": "Every second Sunday there will be a new episode about Rome around the crucial year of 96 AD, the year in which the Emperor Domitian was assassinated, and a new dynasty would bring the Roman Empire to its greatest extent. \n\nI will cover Roman history from roughly 68 through 117 AD. We will cover in depth the reigns of the Flavian emperors Vespasian, Titus and Domitian. Then, we will cover the reigns of Nerva, Trajan and perhaps venture into Hadrian, Antoninus Pius and Marcus Aurelius. \n\nTo come talk with me about the podcast, make suggestions and anything else, go over to the subreddit that I've made for the podcast: https://www.reddit.com/r/96AD/.",
        "language": "en",
        "author_name": "Ben Pennell",
        "slug": "96ad",
        "cover": "20220410_080417_c6272ddb45605a6143b3529b5a114941.jpg"
    },
    {
        "podcast_id": 121315,
        "title": "The Bill Wilder Podcast",
        "description": "Bill received an undergraduate degree in English and German from Guilford College and an M.Div. from Gordon-Conwell Theological Seminary. He completed his Ph.D. in biblical studies at Union Theological Seminary in Virginia. He is the author of Echoes of the Exodus: Narrative in the Context and Background of Galatians 5:18. Before coming to Charlottesville, Bill and his family spent two years in Ogbomosho, Nigeria, where Bill taught biblical languages, history, and theology at the Nigerian Baptist Theological Seminary. Bill and his wife, Nicolien, have four children.",
        "language": "en",
        "author_name": "Bill Wilder",
        "slug": "billwilder",
        "cover": "20220411_050441_5e7e4dd481a014e4260bf808d6045af9.jpg"
    },
    {
        "podcast_id": 122074,
        "title": "Wildwood College Life",
        "description": "We are Wildwood Community Church's college ministry in Norman, OK. We are committed to college students following Jesus together to the glory of God! Find us @wildwoodcollege or at wildwoodchurch.org/college for more information!",
        "language": "en",
        "author_name": "Kevin Choate",
        "slug": "wildwoodcollege",
        "cover": "20220414_020443_364231dadfefc4edb872379b02116e11.jpg"
    },
    {
        "podcast_id": 123569,
        "title": "The Legal Gist",
        "description": "Are you an aspiring attorney? The Legal Gist shares the journeys and stories from diverse, leading law students and attorneys. Learn about the gist of various legal practices, from corporate law to public interest. Hosted by Giselle Valdez, a first-generation Latina law student at Columbia Law School.",
        "language": "en",
        "author_name": "The Legal Gist",
        "slug": "thelegalgist",
        "cover": "20220421_030420_54c848bca4dce459bde67358b9e26d98.jpg"
    },
    {
        "podcast_id": 124889,
        "title": "Sustainability and Impact Global Series",
        "description": "From climate change, to poverty or gender inequality, enterprises and businesses are now asked to walk the talk- but what can be done? What is being done? \n\nThis first season has eight exciting episodes exploring how some enterprises in Africa are working towards impact and sustainability. We will look into the tools they use, the challenges they face, how they adapt their pricing, marketing, distribution to commercially reach a growing market of more than 2,5 billion people -  with a positive impact!\n\nThe research and deliver were done by the talented Nova SBE Grad students of Prof. Filipe Alfaiate in his course “Leading Impact Enterprises in International Development”, as their final assignment. They did outstanding work. And the best six podcasts from the past 2 years are at the center of this Series and its debates with Prof. Filipe Alfaiate and TA Dr. Daniela Afonso. ",
        "language": "en",
        "author_name": "Filipe Alfaiate @ Nova Business and Economics School",
        "slug": "sustainability-global",
        "cover": "20220510_110540_674c2064fb15ff4146aba4a137fb2e51.jpg"
    },
    {
        "podcast_id": 125308,
        "title": "ADM Fertilizer Updates",
        "description": "Monthly fertilizer updates from your trusted ADM partner.",
        "language": "en",
        "author_name": "ADM Fertilizer",
        "slug": "admfertilizer",
        "cover": "20220429_010428_07db814d40d3af757b2a68ea976ffa7c.jpg"
    },
    {
        "podcast_id": 126318,
        "title": "Journal Club ULVF",
        "description": "V Journal Club-u ULVF spremljamo in komentiramo najnovejše znanstvene raziskave in dosežke na področju veterinarske medicine. Občasno ponovimo tudi osnove veterinarskih postopkov. Za vse veterinarje in ostalo zainteresirano javnost, ker številnim novostim najlažje sledimo skupaj.",
        "language": "sl",
        "author_name": "Veterinarska fakulteta UL",
        "slug": "ulvf",
        "cover": "20220511_070525_444200d9b2a713c0b6798b50f21da7e9.jpg"
    },
    {
        "podcast_id": 127266,
        "title": "Globalcast",
        "description": "Global Bridge Educação  e treinamento",
        "language": "pt-br",
        "author_name": "Global Bridge",
        "slug": "globalbridge",
        "cover": "20220509_120550_d8b27bb1c50f9f3b107317e1b6af82d6.jpg"
    },
    {
        "podcast_id": 127967,
        "title": "Conversas Made in CO",
        "description": "Podcast com conversas curtas com diplomados em Comunicação Organizacional, com o objectivo de fomentar o conhecimento dos actuais alunos sobre percursos que possam vir a ter, valências da licenciatura que durante a mesma não são tão óbvias para eles, e, claro, aumentar o orgulho de pertença ao curso.\nPodcast apresentado por Alexandra Leandro e João Morais\n\nGenérico / música: Pedro Alexandre Teixeira\nGenérico / voz: Márcia Figueiredo",
        "language": "pt-pt",
        "author_name": "Escola Superior de Educação de Coimbra",
        "slug": "conversas-made-in-co",
        "cover": "20221123_101123_4f125f576f1d13a684cd8ad9b9a81aa4.jpg"
    },
    {
        "podcast_id": 130103,
        "title": "VR-Learn",
        "description": "I denne podcastserien tar vi for oss bruk av digitale hjelpemidler i undervisning, med spesifikt fokus på bruk av lavkostnads virtuell virkelighet .\nTa kontakt med Jakob eller Ane om du vil koble deg opp mot prosjektet eller har ideer til gjester for høstens podkaster.\nJakob.b.cyvin@ntnu.no\nAnesko@stud.ntnu.no\n\nPodcasten er laget som et ledd i Prosjektet VR-Learn ved institutt for Geografi, NTNU, der prosjektet er finansielt støttet av HkDir.\n\nMere info: https://www.ntnu.no/geografi/vr-learn\n",
        "language": "nb",
        "author_name": "Jakob Bonnevie Cyvin",
        "slug": "vr-learn",
        "cover": "20220524_010551_b517d055c3e9d1b2944640f88552ac6a.jpg"
    },
    {
        "podcast_id": 130202,
        "title": "HOA 101 with Joe Holland & Industry Experts",
        "description": "Sit down with Joe Holland and other industry experts while they discuss all things property management. With over 30 years of managing community developments and investment properties, Joe will educate, inform, and provide you with a good laugh or two through this podcast. ",
        "language": "en",
        "author_name": "Property Management Systems, Inc.",
        "slug": "pmsystems",
        "cover": "20220524_110541_36d39c74c9b010752d3720bfde66ade9.jpg"
    },
    {
        "podcast_id": 130372,
        "title": "Creative talks ",
        "description": "Una guía para sobrevivir a la universidad, aunque todavía no estamos seguros de como…",
        "language": "es",
        "author_name": "José Ignacio Morejón y Héctor Carrillo",
        "slug": "creativetalkspodcast",
        "cover": "20220525_070531_f516b2bed20c15b206f2554501899ec6.jpg"
    },
    {
        "podcast_id": 130532,
        "title": "High Performer Safety Leaders at CareUniversity",
        "description": "Join experts from leading medical centers as they share their lessons learned to prevent harm to patients AND caregivers. TMIT Global at Safetyleaders.org is the longest running patient safety community of practice in the world. It has provided continuing education through hundreds of recorded sessions to caregivers, administrators, and governance leaders.",
        "language": "en",
        "author_name": "Charles Denham",
        "slug": "safetyleaders",
        "cover": "20220526_030522_9886dd04466330428bd91ddc94db252d.jpg"
    },
    {
        "podcast_id": 130549,
        "title": "Coronavirus Survive & Thrive Guides at CareUniversity",
        "description": "Join leading experts who address how families can practice readiness, response, rescue, recovery, and resilience to not only survive but thrive.Launched when the COVID crisis hit in 2020, our programs help families of caregivers at top medical centers and essential infrastructure workers. Our 1,000 family household study helps us help families as the science evolves. ",
        "language": "en",
        "author_name": "Charles Denham",
        "slug": "medtacpodcasts",
        "cover": "20220526_060536_ec9900acd6b1f79a14cb4404b6486cb4.jpg"
    },
    {
        "podcast_id": 130738,
        "title": "HAZ TU PODCAST",
        "description": "Es un podcast pensado para quienes ya tienen un podcast o quieren hacer un podcast y no saben cómo. Abarca desde la parte técnica hasta la gestión de contenidos y cómo monetizarlo. Es el ABC para cualquier creador que quiera llevar su podcast a otro nivel. \n/// Edición: Uriel Islas",
        "language": "es",
        "author_name": "Romina Pons y Memo Núñez",
        "slug": "haztupodcast",
        "cover": "20220602_040639_d2f9933426217e7b2d3f388aa74dbab1.jpg"
    },
    {
        "podcast_id": 131259,
        "title": "Voces por la innovación, el podcast de #innovaSocial",
        "description": "Voces por la innovación es el podcast del programa  #innovaSocial de Fundación Caja de Burgos y Fundación La Caixa.",
        "language": "es",
        "author_name": "Fundación Caja de Burgos",
        "slug": "vocesporlainnovacion",
        "cover": "20220530_110501_4bc9b746561120a5189489501e2d1670.jpg"
    },
    {
        "podcast_id": 131429,
        "title": "Easy Medizin Podcast mit Kauveh P",
        "description": "Im deutschsprachigem Raum gibt es bist jetzt keine Podcasts, die komplett dem M2 Staatsexamen gewidmet sind. Hier ist eure Chance euch bite-size Wiederholungen zu den wichtigsten Themen fürs M2 kostenlos anzuhören! Werdet Fit fürs M2!",
        "language": "de",
        "author_name": "Amir Kauveh Panah",
        "slug": "fitfuerm2mitkauvehp",
        "cover": "20220610_100634_27e1901f025a3bc88cabbcd2cbd08f3d.jpg"
    },
    {
        "podcast_id": 131847,
        "title": "Spanish On the Go! by EasyEspañol · Enjoy your Spanish learning experience with authentic material.",
        "description": "Learn spanish in a smart way with authentic material. \n\n✅  Learning by talking with native spanish coaches.\n✅  Culture and artistic latin environment.\n✅  Talk Sessions to practice Spanish.\n✅  Free activities, like tours, guides or grammar sessions, to enjoy learning spanish with people like you.\n\nTake a tour: https://www.easyespanol.org/\n",
        "language": "en-us",
        "author_name": "EasyEspañol",
        "slug": "easyespanol",
        "cover": "20220602_060601_ce7b8f306f201b8477915506594c4c32.jpg"
    },
    {
        "podcast_id": 132570,
        "title": "De pe podcast pentru dezvoltare profesionala",
        "description": "Dorești să evoluezi în carieră? Pornește cu autoevaluarea. Ascultă și descoperă cum te poate ajuta.",
        "language": "ro",
        "author_name": "Mihaela Gologan",
        "slug": "lunif",
        "cover": "20220626_050615_a47b287f364f78aa3741450b21a77e9b.jpg"
    },
    {
        "podcast_id": 134224,
        "title": "El sendero del hacker :)",
        "description": "Proyecto del podcast “el sendero del hacker” de Zarco Martínez Evelyn Iovali del 2-1 Matutino EPOANCH",
        "language": "es-mx",
        "author_name": "Iovali Zarco ",
        "slug": "iovalizarco05",
        "cover": "20220614_050612_3bb3b80fb88f391aa63eac709da98bb5.jpg"
    },
    {
        "podcast_id": 134784,
        "title": "PATC Podcast",
        "description": "<p>Welcome to PATC Podcast, hosted by Mark Waterfill and David Broadway. Join us as we explore a wide range of topics related to law enforcement and public safety.</p><p>Each episode features in-depth interviews with experts in the field, who also happen to be instructors for PATC courses across the country. You'll hear from these instructors who'll share their experiences and insights on what it takes to keep our communities safe. Plus, they'll give you a sample of what they teach in each of their classes.</p><p>Whether you're a seasoned law enforcement professional or just interested in learning more about the field, PATC Podcast has something for everyone. So join us for engaging conversations and valuable insights that you won't find anywhere else.</p><p></p><p>Have questions or comments? Email us at <a href=\"mailto:patcpodcast1@gmail.com\">patcpodcast1@gmail.com</a></p>",
        "language": "en",
        "author_name": "Public Agency Training Council",
        "slug": "patcpodcast",
        "cover": "20220624_040624_38539d3fd56b319ccd293b6228493ec4.jpg"
    },
    {
        "podcast_id": 136545,
        "title": "Medicina Prehospitalaria Podcast",
        "description": "Podcast dedicado a la medicina prehospitalaria en latinoamerica. Discusiones de medicina basada en evidencia, entrevistas y discusion ",
        "language": "es",
        "author_name": "Christian Goring",
        "slug": "mphpodcast",
        "cover": "20221026_071006_5b914bd4bfe33ba343fc97bc90565299.jpg"
    },
    {
        "podcast_id": 136742,
        "title": "Derecho a la identidad",
        "description": "Los derechos de los niños y uno de los más importantes es el derecho a la identidad, tener un nombre y una acta de nacimiento.",
        "language": "es-mx",
        "author_name": "Rosa María Carranza",
        "slug": "399176",
        "cover": "20220626_070659_5d32ce3c271d17721aba7930712342ec.jpg"
    },
    {
        "podcast_id": 137014,
        "title": "Taller bienes raíces",
        "description": "Taller introductorio de bienes raíces y taller de bienes raíces. ",
        "language": "es",
        "author_name": "Francisco Garay",
        "slug": "tallerbienesraicesf22",
        "cover": "20220627_030644_d6632ecb2cd44573370ff54d010b0e59.jpg"
    },
    {
        "podcast_id": 137593,
        "title": "Como Manejar Mejor Mis Finanzas 2022 ",
        "description": "Aprendiendo sobre quienes califican para una consolidacion de deudas, Los beneficios y mas,\n\nVisita nuestra pagina web www.librededeuda.com",
        "language": "es",
        "author_name": "Yesenia Salgado",
        "slug": "notifinanzas",
        "cover": "20220630_010633_639325de9f82448fa113d843ea6f4ae0.jpg"
    },
    {
        "podcast_id": 138093,
        "title": "Corso per Sommelier dell'A.I.S. (Associazione Italiana Sommelier)",
        "description": "Corso per sommelier in 6 episodi, trattando le seguenti tematiche:1° Colore, profumo e sapore del vino, 2° I vini speciali e come servire il vino, 3° Il territorio, i vitigni, gli enologi-viticoltori, 4°  La grande varietà dei migliori vini italiani dislocati sulla nostra Italia, 5° e 6°  La degustazione del vino abbinato al cibo in generale. con la voce di docenti qualificati dell’Associazione Italiana Sommelier.",
        "language": "it",
        "author_name": "Studio Podcast Mister X",
        "slug": "corsopersommelier",
        "cover": "20220702_120705_ca53a75841d0fc5e9f4521b82cc1f3f5.jpg"
    },
    {
        "podcast_id": 138306,
        "title": "The PLAB Podcast",
        "description": "Free to use Podcasts and educational content for students preparing for the PLAB exams.\nFollow us on social media @theplabpodcast",
        "language": "en",
        "author_name": "Dr Gney Mehta",
        "slug": "theplabpodcast",
        "cover": "20220706_110740_e5f954ddabbe8cb9ce39af8e34233ee7.jpg"
    },
    {
        "podcast_id": 138632,
        "title": "Test_Editoria",
        "description": "Il sistema integrato di informazione Euroconference garantisce aggiornamento e approfondimento per il mondo dei Professionisti.\nLa varietà di riviste consente di essere aggiornati tempestivamente su tutte le principali novità del settore, di avere le soluzioni per le varie problematiche di studio nonché di poter approfondire accuratamente le tematiche di interesse.\n\nOgni testata ha un Comitato Scientifico che garantisce sull'autorevolezza dei contenuti.\n\n<a href=\"https://www.euroconference.it/editoria/riviste\">Scopri il catalogo completo delle riviste Euroconference</a>",
        "language": "it",
        "author_name": "Ec Test",
        "slug": "20220705ectest1",
        "cover": "20220915_080934_62fb7a0be34d32cf445ac47ba5a30b9c.jpg"
    },
    {
        "podcast_id": 139539,
        "title": "Unchanging Education",
        "description": "Towards an understanding of Teacher-Versus-Student-Centered education [\"TVSC\"] .... and why it matters.",
        "language": "en",
        "author_name": "Dan Clemens",
        "slug": "ue",
        "cover": "20220806_020807_b7a77c4889cb0af9d47c6f5dde42c5f5.jpg"
    },
    {
        "podcast_id": 140018,
        "title": "Worth of Souls",
        "description": "The Worth of Souls Podcast is a series of 14 lessons dedicated to the application of the gospel of Jesus Christ in our every day lives.  It is a deep dive into Seeing, Thinking, Feeling and Doing as Christ, and following His perfect example in the everyday moments that fill up our days, not just on Sunday.  ",
        "language": "en",
        "author_name": "Brent & Andrea Palmer",
        "slug": "worthofsouls",
        "cover": "20220712_060718_bcfe01d2e9760945834f04b82574b525.jpg"
    },
    {
        "podcast_id": 140207,
        "title": "Anesthesia STAT: the Stanford Anesthesia Tutorial Podcast",
        "description": "Interesting and high-yield discussion-based anesthesia content for those just starting their training (our Stanford residents in their tutorial month and beyond) and learners at any level interested in learning more about the specialty and it’s practice.",
        "language": "en",
        "author_name": "Derrick Wu, MD",
        "slug": "anesthesiastat",
        "cover": "20220723_120707_1757e7a2143cb612ad23de7cb4a86eb8.jpg"
    },
    {
        "podcast_id": 140601,
        "title": "Radio Evolution",
        "description": "Benvenuto o benvenuta su Radio Evolution, un podcast interamente dedicato al mondo della formazione e dell’educazione.\nQuesto podcast raccoglie e lancia una sfida, come un cielo di nuove stelle che si apre per insegnarci le costellazioni della fiducia, della speranza, del sano ottimismo e dell’entusiasmo per il tempo che verrà e che si costruisce nelle scelte di ogni giorno.\nSe desideri conoscere tutte le nostre attività puoi consultare il nostro sito www.cs-evolution.com.",
        "language": "it",
        "author_name": "Pietro Lombardo",
        "slug": "radioevolution",
        "cover": "20220715_020746_714fa220e69c7ece2c69590d6c7194a2.jpg"
    },
    {
        "podcast_id": 140707,
        "title": "The Maybird Cycling Podcast",
        "description": "A youth-focused podcast about the wide world of cycling. From training to racing to gear and more, The Maybird Cycling Podcast is a small part of our mission to develop passionate cyclists and excellent humans. ",
        "language": "en",
        "author_name": "Joe Draper",
        "slug": "themaybirdcyclingpodcast",
        "cover": "20221203_101255_1a1825ac2ae5f90597c2ccf84f5353e1.jpg"
    },
    {
        "podcast_id": 140735,
        "title": "Cazadores de Dominios",
        "description": "Bienvenido al podcast de inversión en nombres de dominio en castellano.\n\nEn este podcast compartiré material educativo para aquellos que se están iniciando en la compra venta de dominios web y entrevistaré a profesionales para todos aquellos que ya conozcan el sector y busquen contenido más especializado.",
        "language": "es",
        "author_name": "Cazadores de Dominios",
        "slug": "cazadoresdedominios",
        "cover": "20220716_100725_636db9cf15d9c285930f0ccb6a5ff112.jpg"
    },
    {
        "podcast_id": 142686,
        "title": "SEGURA-MENTE PODCAST SECAMAIN",
        "description": "Buscamos concientizar y minimizar riesgos laborales, con platicas amenas de seguridad industrial.",
        "language": "es",
        "author_name": "Ulises Hernández Cote y Misael Alva Dávila",
        "slug": "secamain",
        "cover": "20220726_050751_2faae0bde801c350e0301abaa499c62b.jpg"
    },
    {
        "podcast_id": 142757,
        "title": "#Licensed",
        "description": "This podcast is to help young social worker prepare to take a licensure exam.",
        "language": "en",
        "author_name": "Kandis Hunt",
        "slug": "licensedpodcast",
        "cover": "20220727_120718_3ebfae2cb3792d1a8076673943e290fe.jpg"
    },
    {
        "podcast_id": 143656,
        "title": "T3 Transition To Tech",
        "description": "T3 Transition To Tech presents compelling - and actionable! - information you can use on career strategies and related topics! \n\nCreated for professional women from non-tech backgrounds who are looking to land a job in Tech, T3 is on a mission to help women realize they are not “starting from scratch”; but, rather, that they are “starting from experience”! \n\nWith all the information and misinformation available online, the T3 podcast features women sharing their real-world experience working on technology teams in different roles — and how listeners can follow in their footsteps. (Or forge totally new paths others can follow!)\n\nJoin us for some edutainment you can put to good use today.",
        "language": "en",
        "author_name": "Melissa Malpica",
        "slug": "t3-vet-your-career-coach",
        "cover": "20220731_060745_abe138090e4a214cb36316457e7945fc.jpg"
    },
    {
        "podcast_id": 144214,
        "title": "The Doula's Guide to... Preparing For Your Birth",
        "description": "<p><strong>Welcome to The Doula's Guide To... preparing for your birth</strong>! With me Meg, AKA The Dungaree Doula, Leeds based (but Hull born - trust me, you'll get used to the accent) doula and hypnobirthing teacher. I'm a self confessed birth and parenting nerd, here to support you wherever you are on your journey to family life.</p><p>In this podcast we'll delve deep into the nitty gritty topics you're desperate to know more about, answer your questions and I'll give you the unbiased facts on all things pregnancy, birth and parenting.</p><p>Along the way we'll have guest speakers, interviews and a few positive birth stories to really boost your oxytocin too (more on that in the hormones episode!).</p><p>New episodes drop every Friday at 7am, enjoy!</p><p><strong>Sign up for my online birth prep &amp; hypnobirthing course, 20% off with code 'PODCAST':</strong> <a href>thedungareedoula.co.uk/onlinecourse</a></p><p>Love the podcast? Leave me a tip here - <a href=\"https://ko-fi.com/thedungareedoula\">https://ko-fi.com/thedungareedoula</a></p><p>Wanna connect? Come say hi... <a href=\"http://thedungareedoula.co.uk\">thedungareedoula.co.uk</a> &amp; <a href>@thedungareedoula</a></p><p>Music by <a href=\"https://pixabay.com/users/dayfox-29184718/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=music&amp;utm_content=121561\">DayFox</a> from <a href=\"https://pixabay.com/music//?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=music&amp;utm_content=121561\">Pixabay</a></p>",
        "language": "en",
        "author_name": "The Dungaree Doula",
        "slug": "thedoulasguide",
        "cover": "20230818_080849_d23f8d539ff272b6ef689353a3ec3c2b.jpg"
    },
    {
        "podcast_id": 144383,
        "title": "Teacher After Hours",
        "description": "Hello guys!! \nWelcome to my podcast where we will dive into all things teaching. I’ll be starting my student teaching this year and hopefully get my own classroom after this year. Come join  my journey as I embark in this new chapter in life and let’s hang and chat with myself and some special guest !!",
        "language": "en",
        "author_name": "Brenda ",
        "slug": "teacherafterhours",
        "cover": "20220804_040859_d059a4d30fb26225e846a990422ce440.jpg"
    },
    {
        "podcast_id": 144400,
        "title": "Glory and Beauty",
        "description": "Glory and Beauty 出版公式Podcastへようこそ！\nメルマガ『東北の教会』： churchintohoku.wordpress.com\nG＆B出版： gloryandbeauty.stores.jp\nべリス賛歌： www.youtube.com/channel/UCtapL0f_cZhXtsSa3JoUk1A",
        "language": "ja",
        "author_name": "Samuel Galbreath",
        "slug": "gloryandbeauty",
        "cover": "20220804_060815_04158e9ba212676340735efc77498dea.jpg"
    },
    {
        "podcast_id": 144569,
        "title": "STAND FIRM MINISTRIES ",
        "description": "<p>Listen to <strong>bold</strong>,<strong> informative</strong> sermons by Dr. Shane Perez as he equips Christians to face the current of the world<strong> without compromise</strong> and <strong>grounded in the truth of God and Scriptures</strong>. Dr. Perez takes<strong> apologetics</strong>, <strong>discipleship</strong>, and <strong>personal application</strong>, all derived directly from the Bible and blends it with <strong>relevant</strong> and <strong>controversial topics of today's culture</strong> in an <strong>engaging</strong> and <strong>unashamed</strong> way<strong>.</strong> Ephesians 6:1 </p>",
        "language": "en",
        "author_name": "DR. SHANE PEREZ",
        "slug": "standfirmministries",
        "cover": "20230716_020730_19abe06b826c96728a4c5b110c8e4f9c.jpg"
    },
    {
        "podcast_id": 144614,
        "title": "Tecnologías para la Educación | Universidad Anáhuac Querétaro",
        "description": "<p>En este espacio puedes encontrar algunos recursos que se han elaborado para diferentes proyectos de la Universidad Anáhuac Querétaro.</p>",
        "language": "es",
        "author_name": "Pablo Arturo Martínez Polanco",
        "slug": "socrates-movimientoshisped",
        "cover": "20230915_050942_17ef80673f4f87086a99fbbe0ca134f2.jpg"
    },
    {
        "podcast_id": 144995,
        "title": "Words of Wisdom with Apostle Glen Monama",
        "description": "Join Apostle Glen Monama as he teaches and discusses Bible concepts and theology, answers viewers' questions, and addresses spiritual issues that affect Christians in their everyday lives. Tune in and hear what God has to say.\n\nBible Studies, Sunday Services, and Podcasts can also be found in their corresponding chapters/series. These chapters will be updated every Wednesday. ",
        "language": "en",
        "author_name": "Words of Wisdom with Apostle Glen Monama",
        "slug": "words-of-wisdom-with-apostle-glen-monama",
        "cover": "20220807_060847_393deecaced5f3ff1e7b3ecc3f574c10.jpg"
    },
    {
        "podcast_id": 145091,
        "title": "The Research Podcast with Sir Jeffrey Canlas",
        "description": "In this podcast series, we aim to provide you, research learners, a more straightforward understanding of the subjects: Practical Research 1, Practical Research 2, and Inquiries, Investigations, and Immersion for Senior High School.\n\n",
        "language": "en",
        "author_name": "Jeffrey Canlas",
        "slug": "theresearchpodcastwithsirjeffreycanlas",
        "cover": "20220807_080806_489ae76f1c1538c884f03ee3ffb73a81.jpg"
    },
    {
        "podcast_id": 145818,
        "title": "Podcast",
        "description": "Ideas y propuestas para mejorar la calidad de mis estudiantes, no hay mayor satisfacción que ayudar a la gente crecer.",
        "language": "es",
        "author_name": "liberbiz",
        "slug": "liberbiz",
        "cover": "20220811_120811_503c9d5e7878cf5ef16604c4be6db8ce.jpg"
    },
    {
        "podcast_id": 146530,
        "title": "Moving Forward with Andy Douglas",
        "description": "The podcast where we talk about unlocking our true potential and moving forward in business and life.\nMoving Forward with Andy Douglas is the show where we ask our special guests how they move forward with their projects and what holds them back. We'll take a deep dive into the things that block us from achieving our goals and creating the life that we desire. We ask our guests what they are currently working on, how they are moving forward or being held back, and how they overcome obstacles and barriers to achieving their dreams.",
        "language": "en",
        "author_name": "Andy Douglas",
        "slug": "movingforward",
        "cover": "20220822_090843_be90e6a379627d6fa73a7c455dab7e72.jpg"
    },
    {
        "podcast_id": 146665,
        "title": "United Manufacturing Hub",
        "description": "Here you can find the our \"IT / OT fundamentals series\" and audio versions of popular blog posts of the United Manufacturing Hub. \n\nSeason 1 is about our blog posts. In our blog posts we write about the tools & technologies behind our Industrial IoT stack - from Unified Namespace to IT / OT infrastructure and security.\n\nSeason 2 is about our \"IT / OT fundamentals series\", which is based on our popular \"Introduction to IT/OT\" workshop, designed to provide a common ground for companies looking to enter the field of industrial IoT. It takes a step back and looks at the field from an architectural perspective, explaining key IT and OT concepts. As a final result, meaningful content discussions can now be held between IT and OT, and \"bullshit bingo\" is reduced.\n\nThe United Manufacturing Hub is an Open-Source Helm Chart for Kubernetes, which combines state-of-the-art IT / OT tools & technologies and brings them into the hands of the engineer. \n\nMore information about the United Manufacturing Hub can be found here: https://learn.umh.app/\n\nMore information about our company UMH Systems GmbH can be found on our website: https://www.umh.app/\n\nMore information about the Unified Namespace can be found in the knowledge section of our learning platform: https://learn.umh.app/know/industrial-internet-of-things/techniques/unified-namespace/",
        "language": "en",
        "author_name": "United Manufacturing Hub",
        "slug": "united-manufacturing-hub-blog-posts",
        "cover": "20221026_101003_dd2171ef98def2793f5a8abff4693841.jpg"
    },
    {
        "podcast_id": 146831,
        "title": "Protalk - Aangeboden door Protecta Solutions",
        "description": "In deze podcast behandelt Protecta Solutions diverse thema's omtrent de opslag van gevaarlijke stoffen, het gebruik van vloeistoffen en het bestrijden van lekkages. ",
        "language": "nl",
        "author_name": "Protecta Solutions",
        "slug": "protectasolutions",
        "cover": "20220816_120846_2fe86847aa15a5125e0f4424cec764cc.jpg"
    },
    {
        "podcast_id": 147268,
        "title": " Tafsir Of Juz Amma By Shaykh Mohammad Akram Nadwi",
        "description": "Welcome to CIC's podcast! \n\nWe will be sharing lectures from a wide range of subjects within the Islamic sciences, each of them filled with pearls of wisdom from Sheikh Dr. Mohammad Akram Nadwi. \n\nWe are launching our channel with Sheikh's tafsir of some of the most recited surah's from the Qur'an. The Tafsir of Juz Amma.\n\nImagine how it would feel to have a deep understanding of the surahs contained in the last part of the Qur'an - the surahs that are often recited in our prayers, the surahs that are short in length but very weighty in meaning, carrying the core essential message of the Qur'an. It is a rare opportunity to study these surah's with an extraordinary scholar and thinker who is an expert in both tafsir and hadith.\n\nCambridge Islamic College is a registered educational charity.(Charity Number 1163646) Please support CIC to carry on its mission. Please visit https://www.cambridgeislamiccollege.org/donate to see how you can support.",
        "language": "en",
        "author_name": "Cambridge Islamic College",
        "slug": "cambridge-islamic-college",
        "cover": "20221001_061040_1aa38651e3231968c0b3fcbcb60886fa.jpg"
    },
    {
        "podcast_id": 147746,
        "title": "Catholic Daily Brief",
        "description": "Daily catechesis and food for thought for Catholics. \n",
        "language": "en",
        "author_name": "Eremita",
        "slug": "catholicdailybrief",
        "cover": "20220820_070823_47f6f2d08b825431c78d09390becbcbc.jpg"
    },
    {
        "podcast_id": 148771,
        "title": "Agogiek In The Spotlight: een open gesprek",
        "description": "Take a look at our ‘open gesprekken’ binnen het project Agogiek In The Spotlight!!! Meer zoals deze on the way, maar geduld! Tis een schone deugd, en de moeite voor de leuke en interessante gesprekjes. Heb je vragen, ideeën, feedback? Dm ons gerust (via instagram, facebook of mail)\nMisschien kan dit de aanzet zijn tot gesprekken met je medestudenten, ouders, vrienden, kennissen, vreemden op straat ;),... sowieso stof tot nadenken!\nGebruik het hoe je maar je wil, en share als je anderen wil informeren of gewoonweg een gouden hartje hebt en ons wil steunen &lt;3\n",
        "language": "nl",
        "author_name": "Lee Casasus Garcia",
        "slug": "agogiekinthespotlight-eenopengesprek",
        "cover": "20220829_020840_f875a61684b2311d1bd7cbab07d6b3aa.jpg"
    },
    {
        "podcast_id": 149340,
        "title": "Horizonte 3.0",
        "description": "El mundo se cae a pedazos, desde el abandono de una moneda fuerte cosas como la pobreza, inseguridad y desarrollo desordenado de muchísimos países ha sido el pan de cada día de analistas y corredores de bolsa. El costo: millones en la pobreza, deudas impagables e inflación, poder para los gobiernos y bancos centrales, mientras, sufrimiento para aquellos que viven al día.\nEn medio de todo este desastre la tecnología y un visionario seudónimo  nos ha brindado una nueva herramienta, descentralizada, anónima y sólida sobre la cual fundamentar nuestra economía. ¿Es acoso segura? ¿O es una estafa? ¿Que es Crypto? \n¡Acompáñanos a descubrir este nuevo mundo, y a conocer la economía del futuro! Tal vez uno de los caminos a la utopía sea un activo sólido y descentralizado y solo hay una forma de averiguarlo.",
        "language": "es-mx",
        "author_name": "Miguel Suárez",
        "slug": "horizonte3punto0",
        "cover": "20220828_120856_0e84e592fe5ca059962f7beeffa602e3.jpg"
    },
    {
        "podcast_id": 149541,
        "title": "Senior Care Movement™ ",
        "description": "<p>Welcome to the Senior Care Movement™ podcast! Join the founder and lead community coach, John Largent as he shares information, stories, product reviews and what's going on inside the Senior Care Movement™ community. The Senior Care Movement™ community is a private, focused (non-Facebook, no distractions) group made exclusively for people with a connection to the senior care industry. This is an inclusive group and consists of families, caregivers, senior care advisors, agency leaders, companies, organizations, governmental agencies and non-profits that serve our senior population. Some of the benefits of joining the Senior Care Movement™ community include: - Lunch and Learn Symposiums - meets twice monthly to share the latest information, trends and best practices in the senior care industry - 'Level Up' Sales Webinars - Learn to sell your services in an ethical, nuanced, compassionate and effective consultative approach to seniors and their families - Discounted rates on online courses offered exclusively inside the community - Discounted tickets to an upcoming live Senior Care Summit - Network with others in the senior care industry to share stories, innovations and best practices to offer the best service possible to the seniors in your area Get access now and join the Senior Care Movement today.! www.seniorcaremovement.com</p>",
        "language": "en",
        "author_name": "John Largent",
        "slug": "seniorcaremovement",
        "cover": "20220828_110842_b1a014fc41702b2ca280bbf711bd5416.jpg"
    },
    {
        "podcast_id": 149588,
        "title": "Liderando Mentiras",
        "description": "Entender y comunicar cómo varios personajes en la historía han manipulado a sus seguidores. Nos enfocaríamos en líderes de cultos/sectas o políticos reconocidos por su forma de manipular al público. \nIntegrantes: \n- Gisela Ponce\n- Mariano Dorador\n- Miranda Carbajal\n- María Jose Segovia",
        "language": "es",
        "author_name": "Gisela Maria Ponce",
        "slug": "liderando-mentiras",
        "cover": "20220829_020807_ca9db1c05466697b091ffa5420aab945.jpg"
    },
    {
        "podcast_id": 151697,
        "title": "Tatler Singapore's Decoding Brilliance, in partnership with Tiffany & Co.",
        "description": "Decoding Brilliance is Tatler Singapore's new podcast series, addressing in-depth questions and conversations relating to the world of scintillating jewels. In partnership with Tiffany & Co., we are deep diving into the illuminating realms of jewellery, the social impact of gems, language of love, masterful craftsmanship and innovative design, marrying precious moments with precious stones. ",
        "language": "en",
        "author_name": "Tatler Singapore",
        "slug": "tatler-singapore-jewellery-decoding-brilliance-tiffany-and-co-paige-parker-labgrown-natural-diamonds",
        "cover": "20220907_060953_6aab0ecd9cb7116e9006321c1f9a547a.jpg"
    },
    {
        "podcast_id": 152408,
        "title": "La Faculté ",
        "description": "La vente fut longtemps un sujet tabou dans la province du Québec… Il est temps que la majorité des gens revoient leur vision générale envers la vente et d’enfin reconnaître cet art indispensable au succès !\n\nDans ce podcast, nous discuterons de différents sujets enrichissants comme l’entrepreneuriat, la vente, la communication et les relations professionnelles. Avec une petite note humoristique, les invités du Podcast se feront un plaisir de partager leurs connaissance et expériences avec vous !\n\nLe podcast de la faculté est disponible sur toute les plateformes de Balado.\n\nBranchez vos écouteurs et cliquez sur le lien ci-dessous pour propulser votre carrière dès maintenant.",
        "language": "fr",
        "author_name": "Raphael Toutant",
        "slug": "lafaculte",
        "cover": "20221113_071102_1f708865eeacfa512c05359325a5a4ae.jpg"
    },
    {
        "podcast_id": 152899,
        "title": "Integration Through Pod",
        "description": "Integration Through Pod is the podcast of the European Union Law Working Group at the European University Institute in Florence. Recorded at Villa Salviati, in the Tuscan hillside, this is the podcast where Ph.D. researchers, professors and academics meet to talk about European Union Law. ",
        "language": "en",
        "author_name": "European Union Law Working Group (European University Institute)",
        "slug": "integration-by-pod",
        "cover": "20220914_030903_011d404a481dd560e2cf9b9367e97dbf.jpg"
    },
    {
        "podcast_id": 153764,
        "title": "Materials.Business",
        "description": "Welcome to Materials Business! This is an initiative oriented towards the creation of a virtual space for the updating and strengthening of your knowledge about relevant topics related to your duties on equipment’s integrity and materials protection.\n\nThis space is designed as the meeting point for all the colleagues being part of your global community of managers and responsible people in charge of the management and decision in relation to materials and equipment integrity (planners, designers, plant managers and engineers, laboratory managers, QA&QC managers, researchers, contractors, and other specialists concerned with caring equipment and materials). From the design and selection, to the disposal, after as long as possible life in service, according to the principles of Circular Economy and the expectations in front of a new economy for a more sustainable world.",
        "language": "en",
        "author_name": "Monica Hernandez/Felipe Rocha",
        "slug": "materials-business-podcast",
        "cover": "20220921_090956_91e1ec50ae2c39547197ce69f4b582ef.jpg"
    },
    {
        "podcast_id": 154269,
        "title": "MUSIC LABORATORY DOMÓWKA",
        "description": "Domówka to cykl spotkań organizowanych przez Music Laboratory, największą polską szkołę produkcji muzyki i realizacji dźwięku. Każde spotkanie to rozmowa z ciekawym gościem związanym ze światem produkcji muzyki. W spotkaniach uczestniczyć można zapisując się na listę gości na stronie Music Laboratory. Domówka to klimatyczne spotkanie w domowej atmosferze i otoczeniu, to możliwość poznania ciekawych ludzi i wysłuchania rozmów prowadzonych przez Michała Wasilewskiego, polskiego producenta a także wykładowcy w Music Laboratory. Jeśli więc interesuje Cię temat produkcji muzyki nie może Cię tam zabraknąć.",
        "language": "pl",
        "author_name": "Music Laboratory",
        "slug": "domowka",
        "cover": "20220918_120914_145d5a5d7ca4d18953c9e05b99d04d5c.jpg"
    },
    {
        "podcast_id": 155130,
        "title": "Birth Your Book",
        "description": "Words are playthings that we click together in hopes of building a home…\n \nHere every week, with your host author, editor, and book coach June Lucarotti, Birth Your Book authors & friends share their stories with the world and invite you to tell yours.\n\nJoin us in creating a culture of belonging through storytelling where all writers are heard. \n\nPull up a seat by our fire. Come as you are. Welcome home.\n\nvolasessions.com\n",
        "language": "en",
        "author_name": "June Lucarotti, MFA CYT",
        "slug": "birthyourbook",
        "cover": "20221026_011031_9e814bdb01d21711656e3b4b371edb9a.jpg"
    },
    {
        "podcast_id": 155282,
        "title": "PODCAST DEL MÓDULO 1",
        "description": "Podcast del Módulo 1 de la Licenciatura en Educación e Innovación Pedagógica de la Universidad Pedagógica Nacional (UPN) 321. Zacatecas.",
        "language": "es-mx",
        "author_name": "LEIP UPN ZAC",
        "slug": "modulo1leipupn",
        "cover": "20220922_080940_662cec689ff47d14a4ae0473a43d2a62.jpg"
    },
    {
        "podcast_id": 155704,
        "title": "Text to Task: Simplifying Education",
        "description": "<p>My name is Gargi, and my goal is to simplify everyday education and make it real with TEXT to TASK. I am a Fulbright Scholar, a member of the US Department of State alumni community, an educator, and a humanitarian. I am passionate about strengthening the capacities of educators and empowering them to create a better, more equitable education system. I am committed to working towards a more just and peaceful world through education, activism, and collaboration. In this podcast, I welcome guests from all over the world for inspiring and fascinating conversations about education.</p>",
        "language": "en",
        "author_name": "Gargi Sarkar",
        "slug": "texttotasksimplifyingeducation",
        "cover": "20220924_110913_ed0258f3e3c8788981a2daa62615a0e4.jpg"
    },
    {
        "podcast_id": 155968,
        "title": "¿Los estudios de comunicación son iguales aquí y en todo el mundo?",
        "description": "Bienvenidos a un episodio más de ¿Por que hablas así? tenemos un corto pero muy interesante bloque de información para que vayas y la presumas con tus cuates del trabajo o de la escuela, ya que te contamos algunos detalles historicos acerca de los estudios acerca de la comunicación en América Latina. \nAcompañanos y al final no olvides darle \"Me gusta\", Compartir y dejarnos tus dudas o comentarios, ¡Siempre te leemos!",
        "language": "es-mx",
        "author_name": "Equipo 11_Sociología de la comunicación",
        "slug": "porquehablasasiuvm",
        "cover": "20220926_020946_1814802bf16ed08f136a17f5c08da5a6.jpg"
    },
    {
        "podcast_id": 156017,
        "title": "Euroconference",
        "description": "Il sistema integrato di informazione Euroconference garantisce aggiornamento e approfondimento per il mondo dei Professionisti.\nLa varietà di riviste consente di essere aggiornati tempestivamente su tutte le principali novità del settore, di avere le soluzioni per le varie problematiche di studio nonché di poter approfondire accuratamente le tematiche di interesse. \n\nOgni testata ha un Comitato Scientifico che garantisce sull'autorevolezza dei contenuti.\n\n<a href=\"https://www.euroconference.it/editoria/riviste\">Scopri il catalogo completo delle riviste Euroconference</a>",
        "language": "it",
        "author_name": "Gruppo Euroconference Spa",
        "slug": "euroconference",
        "cover": "20220926_080915_244f58ee693b72dd3923e430bc533fb0.jpg"
    },
    {
        "podcast_id": 156075,
        "title": "Pensar, Amasar, Crecer. El podcast de panadería de Arturo Blanco. ",
        "description": "Arturo Blanco es Asesor técnico - comercial en Panadería y empresas del sector. En este Podcast Arturo trata temas relevantes sobre la panadería y bollería, y además, conversa con algunos de los profesionales más relevantes del sector. \n",
        "language": "es",
        "author_name": "Arturo Blanco",
        "slug": "arturo-blanco",
        "cover": "20230117_050108_007e77ef9954fff1d25131ff050adf40.jpg"
    },
    {
        "podcast_id": 157073,
        "title": "El Rincón de la Vaca Sagrada",
        "description": "Podcast de la clase de Poéticas Teatrales I en el que revisamos los textos de las Grandes Vacas Sagradas del Teatro del S.XIX y S.XX",
        "language": "es",
        "author_name": "La Vaca Sagrada",
        "slug": "elrincondelavacasagrada",
        "cover": "20220930_050948_b13aa5b74575f0d014a7c45bf6bef9a9.jpg"
    },
    {
        "podcast_id": 157699,
        "title": "The Gov Guys Podcast",
        "description": "A podcast brought to you by a couple of teachers with a love of pop culture and a shared interest in educating our students in the ways of the United States Government and its Politics. ",
        "language": "en",
        "author_name": "Elias Crowder and Kendall Hertzler",
        "slug": "govguyspodcast",
        "cover": "20221003_011024_7838bce8e7e05dfafbec2c4740c00664.jpg"
    },
    {
        "podcast_id": 159792,
        "title": "Il Cenedese e l'Alta Marca Trevigiana: percorsi tra storia e memoria",
        "description": "Podcast del progetto di Storia e Cultura del Veneto del Liceo Flaminio di Vittorio Veneto.\nA cura di Matteo Collodel e in collaborazione con il Circolo Vittoriese di Ricerche Storiche, il Liceo Artistico Munari di Vittorio Veneto, il Comune di Vittorio Veneto e con il sostegno dell'Ufficio Scolastico Regionale del Veneto.",
        "language": "it",
        "author_name": "Matteo Collodel",
        "slug": "camt",
        "cover": "20221012_101032_977aa78fb16091b707d3d5f01dc4cd2a.jpg"
    },
    {
        "podcast_id": 159945,
        "title": "Belhaven University Lectures",
        "description": "This podcast contains lectures for some of the courses at Belhaven University, Jackson, MS.",
        "language": "en",
        "author_name": "Belhaven University",
        "slug": "bulectures",
        "cover": "20221013_081029_df149b8f0f063aad254b7f549be8f898.jpg"
    },
    {
        "podcast_id": 160846,
        "title": "Horror Study Hall",
        "description": "If horror is your thing, listen to Horror Study Hall: the academic side of horror.  Where we examine research, books, and podcasts that study the horror genre.  ",
        "language": "en",
        "author_name": "M.A. Reynolds",
        "slug": "horrorstudyhall",
        "cover": "20221022_051045_4aab6696caa9bb97b7cc6099a48e9149.jpg"
    },
    {
        "podcast_id": 161781,
        "title": "Rock Your Girl Power",
        "description": "Rock Your Girl Power Merch: https://www.pinkladycouture.com/rockyourgirlpower\n\nWelcome to Girl Power. We are the bad and Boujeè Boss Ladies on a phenomenal journey to help you discover your power passion and purpose at the convergence of love romance and finance. I’m your host, Keci Monique along with my co-host Curtiesha, Cherie, and Christian.\n\nGirl Power is a movement to EmpowHER women and emancipate their minds from old to new through The ABC's of self-love.\n\nAbstinence: abstaining from behaviors that keep you in repeating cycles of relationships and life. Genesis 50:20\nBeauty: WOMAN, know thyself, take care of thyself, and protect thyself from predators of life. Jeremiah 29:11 & Isaiah 61:1-3\nConfidence: Build your confidence so that you build self-equity and value to who you are. Ephesians 3:20 \n\nJoin us every Sunday at 9 AM Eastern daylight time for a half hour a Girl Power staring June 19th. Be sure to SUBSCRIBE, LIKE & SHARE Empowered to Be Her! #podcast #podcasting #love #romance #finance #girlpower #NovaeMoney #marriage #dating #divorce #ApplePodcasts #Spotify",
        "language": "en",
        "author_name": "Keci Moniquè",
        "slug": "rockyourgirlpower",
        "cover": "20221020_121007_ac7e4d7daa9881a35dee71b44d1248ef.jpg"
    },
    {
        "podcast_id": 161991,
        "title": "Con las Manos en la Masa",
        "description": "De la mano de tus Hosts Dani (foodiemprende) y Ale, vas a aprender cosas nuevas sobre emprendimiento, nuestras experiencias en torno a nuestros negocios, nuestra vida y nuestras aventuras en la cocina. Para ayudarte a emprender, crecer y aprender. ",
        "language": "es",
        "author_name": "Alebanfi & Foodiemprende",
        "slug": "conlasmanosenlamasa",
        "cover": "20221020_081011_45f1a50fad9ce9a6f5e7a1cabfbc49a4.jpg"
    },
    {
        "podcast_id": 162081,
        "title": "La Aletheica: Filosofía en pocas palabras",
        "description": "La Aletheica es un curso básico sobre la historia de la filosofía, busca ser un curso dinámico y de fácil acceso para todo aquel que se esté iniciando en en estudio de esta disciplina.\n¡Un episodio nuevo cada semana!",
        "language": "es",
        "author_name": "Rodrigo Gallardo",
        "slug": "aletheica",
        "cover": "20221021_041012_c10c549a82158837d99e0dcd6264498a.jpg"
    },
    {
        "podcast_id": 162746,
        "title": "Lectures",
        "description": "In-depth courses that contain intuitive modules and detailed lectures to inspire knowledge, broaden skills and entice experience.",
        "language": "en",
        "author_name": "ProjektIntel",
        "slug": "projektintel-lectures",
        "cover": "20221024_061032_868f578f8879805ff6d2ff05b1dc7479.jpg"
    },
    {
        "podcast_id": 163458,
        "title": "TREK ONLINE Bible School",
        "description": "Trek Online is a podcast for the teaching ministry of Brad Hunt, founder and president of CrossTrek World Ministries.",
        "language": "en",
        "author_name": "Brad Hunt",
        "slug": "trekonline",
        "cover": "20221031_071058_ff257ba8774948f044bbcf69bb803b59.jpg"
    },
    {
        "podcast_id": 163601,
        "title": "Pro Ciegos y Sordos de Guatemala",
        "description": "Contribuimos a mejorar la calidad de vida de las personas que acuden al Benemérito Comité Pro Ciegos y Sordos de Guatemala con problemas visuales y auditivos.",
        "language": "es",
        "author_name": "Pro Ciegos y Sordos de Guatemala",
        "slug": "prociegosysordos",
        "cover": "20221027_051031_b97685c37f028edc00d4703d59d2de76.jpg"
    },
    {
        "podcast_id": 163773,
        "title": "La Plaza del Opositor",
        "description": "Podcast charlando con diferentes personas que han pasado por una oposición en España. Si estás interesad@ en participar puedes contactarme por los MD de Twitter: @manuel_jesus17\n",
        "language": "es",
        "author_name": "Manuel Jesús González Sánchez",
        "slug": "laplazadelopositor",
        "cover": "20221028_101010_506c129e78c7c3f9f3a972510ebbde7f.jpg"
    },
    {
        "podcast_id": 163781,
        "title": "CEA Colegio Inglés Ciudad Juárez",
        "description": "Podcast de educación, Pedagogía, Información y oferta educativa de Colegio Inglés Ciudad Juárez",
        "language": "es",
        "author_name": "CEA Colegio Inglés Ciudad Juárez",
        "slug": "ceacolegioinglesciudadjuarez",
        "cover": "20221028_111024_bef0a68f85e949ca628b432b4935b020.jpg"
    },
    {
        "podcast_id": 164059,
        "title": "Menstrual Cyclic Nature ",
        "description": "These podcasts we’ll take you on a journey of menstrual cycle knowledge. In the series of episodes we’ll learn the basics. I'll share with you some elementary alphabet of the menstrual cycle and briefly we’ll take a peek into the world of hormones and biochemistry of  menstrual cycle. I will try to give a bigger picture which shows why it is so important to understand menstrual cyclic nature and how you can benefit from having this kind of knowledge. ",
        "language": "en",
        "author_name": "Nadja Tobias",
        "slug": "mcn-basics",
        "cover": "20221029_051029_d782f056f117ea1b26576f04e5ce7ec4.jpg"
    },
    {
        "podcast_id": 164411,
        "title": "The Bible Professor",
        "description": "Where our goal is to bring biblical literacy to the podcasting world and to the ends of the earth. We do that by teaching the Bible, defending biblical Christianity, and discussing the Bible’s relevance to culture. Videos are at https://www.youtube.com/@thebibleprofessor.",
        "language": "en",
        "author_name": "Melton Winstead",
        "slug": "thebibleprofessor",
        "cover": "20221108_031150_acfb9b32f6304c3aca7d9b949614ee1d.jpg"
    },
    {
        "podcast_id": 164838,
        "title": "Lady Astaroth",
        "description": "Tarot y mas Tarot",
        "language": "es",
        "author_name": "Lady Astaroth",
        "slug": "ladyastaroth",
        "cover": "20221219_121222_24917378a697f21aff7aee61bce14da2.jpg"
    },
    {
        "podcast_id": 165306,
        "title": "CRIPTOBAR",
        "description": "<p>¡Bienvenidos a CRIPTOBAR! El podcast donde hablamos de <strong>TECNOLOGÍA, INTELIGENCIA ARTIFICIAL, CRIPTOMONEDAS, WEB3 y BLOCKCHAIN </strong>mientras disfrutamos de unas copas. En cada episodio, exploramos temas candentes en el mundo de las criptomonedas y la tecnología, desde el análisis de las últimas tendencias hasta las noticias y acontecimientos más relevantes. Únete a nosotros para aprender, divertirte y disfrutar de una noche inolvidable en CRIPTOBAR. ¡No te lo pierdas!</p>",
        "language": "es",
        "author_name": "Criptoman",
        "slug": "leadgods",
        "cover": "20230218_060218_70015635864cb9c665d60e2ffa1852ba.jpg"
    },
    {
        "podcast_id": 165807,
        "title": "Ius Commune Podcast",
        "description": "A podcast about the ius commune. iuscommunepod@gmail.com",
        "language": "en",
        "author_name": "Joseph",
        "slug": "iuscommune",
        "cover": "20221106_051154_4dba6b5df05fc859986da6ae71afb87a.jpg"
    },
    {
        "podcast_id": 167104,
        "title": "Digital Empowerment",
        "description": "<p>This series of podcasts includes a variety of areas--everything from astrology to healthcare to epidemiology to medicine. Also video lectures can be found at Doc B channel on <a href=\"https://www.youtube.com/@skbanergt3\">YouTube</a>. Please checkout my new <a href=\"http://edocb.org\">edocb.org</a> website.</p>",
        "language": "en",
        "author_name": "Sri Banerjee",
        "slug": "docb",
        "cover": "20221111_111124_1b94daa92a8ec1da5fb44ad28bd6ed03.jpg"
    },
    {
        "podcast_id": 167352,
        "title": "La normalisa ",
        "description": "La innovación en la practica docente\n ",
        "language": "es-mx",
        "author_name": "Raul",
        "slug": "benv",
        "cover": "20221112_051120_e79d70640cf3c916af148a7b99e6f63a.jpg"
    },
    {
        "podcast_id": 168849,
        "title": "SkillsFuture: Let's Chat!",
        "description": "<p>SkillsFuture: Let's Chat podcast invites fellow Singaporeans for a chat to discuss about lifelong learning topics, such as skills mastery and the importance of upskilling throughout one's career journey.</p>",
        "language": "en",
        "author_name": "SkillsFuture SG",
        "slug": "ssgletschat",
        "cover": "20230320_070357_9a4c71a658f50fd581a5e1563390d774.jpg"
    },
    {
        "podcast_id": 169079,
        "title": "Arte Contemporáneo | #SENDATalks",
        "description": "Arte Contemporáneo | #SENDATalks por Galeria SENDA presenta:\nExposiciones, encuentros entre artistas, charlas, experiencias de galeristas y coleccionistas, y mucho más... ",
        "language": "es",
        "author_name": "Galeria SENDA",
        "slug": "sendatalks",
        "cover": "20221119_121124_82d3c73f947e9947f26ecec38d5bf8ac.jpg"
    },
    {
        "podcast_id": 169711,
        "title": "Luxfeel Flooring Podcast - Everything You Need To Know About Hybrid Flooring and moore",
        "description": "Luxfeel flooring is an Australian direct-to-consumer flooring company specialising in Next-generation APC flooring. Focused on fixing all the problems will old SPC and WPC hybrids. ",
        "language": "en",
        "author_name": "Luxfeel Next-gen Hybrid ",
        "slug": "luxfeel-hybrid-flooring",
        "cover": "20221202_011201_f2b19cfef0469054b45ac7acd787c83f.jpg"
    },
    {
        "podcast_id": 171633,
        "title": "First Third Productions",
        "description": "<p>A cigar life.</p>",
        "language": "en",
        "author_name": "Stephen Tatum, Laramie Navrath, DeMario Brown",
        "slug": "zt-pilot",
        "cover": "20230224_020246_e5ef22a164b0dc494f6c5ad44f43ae8c.jpg"
    },
    {
        "podcast_id": 172134,
        "title": "Think Possible: transforming lives through supported education",
        "description": "At National Learning Network (NLN) we are on a mission to change the conversation around inclusive, supported education and level the playing field for those who need a little more support to reach their educational, career and personal goals. ",
        "language": "en",
        "author_name": "National Learning Network ",
        "slug": "thinkpossible",
        "cover": "20221202_111250_a108405011591074f25c06b3f69c3e39.jpg"
    },
    {
        "podcast_id": 172792,
        "title": "Filosofía en serio.",
        "description": "<p>Continuamos el Podcast con Totalidad e Infinito. Abordaremos categorias como la de Religión, y seguiremos distinguiendo la Trascendencia de otras categorías como la de la mera Negatividad. También se esclarecerá la primacía de la Trascendencia frente a la Ontología, o en otras palabras, la primacía del Otro frente al Mundo.</p>",
        "language": "es",
        "author_name": "Jorge Plascencia",
        "slug": "filosofando",
        "cover": "20221214_051239_a6fc4a61fc5eddf02c31ae82c21fcf93.jpg"
    },
    {
        "podcast_id": 172870,
        "title": "The Quantum Supercreation Podcast",
        "description": "In this program, the international 3 Time Top Number One Bestseller Author Gisbert Reuter, an award-winning Creative Director and Mentor & Advisor to 6-, 7- and 8-fig business owners shows you how to use Quantum Leap Strategies to create better results faster.\n\nGisbert has helped more than 10,000 people in numerous live and online events, enjoy a better quality of life, more joy and fun, and in turn, have much less stress and achieve results they never thought possible.\n\nHe has worked with people all over the world, among them, medical doctors, top athletes, lawyers, speakers, consultants, business owners, and leaders.\n\nBefore Gisbert founded his first company in 1998, he worked in Munich with the former head of entertainment of German's TV station ProSieben in his film and TV production Entertainment Factory. \n\nIn 2010 Gisbert started holding seminars and handing out questionnaires to anonymously received critiques, wishes, and opinions. In the meantime, several moving boxes are stacked full of these papers, all with superlative customer opinions. \n\nStatements like \"The best thing that ever happened to me\", \"He has changed my life\", \"A state of permanent WOW!\", \"I am much happier\", or even \"The best seminar in the world!\" run as a common thread throughout these questionnaires. \n\nHis calling for you is straightforward: Do the Leap and Let Joy Work For You! \n\n● Income ● Impact ● Wealth ● Confidence ● Joy ● Health ● Wellbeing ● and Longevity ● \n\nDo you want to create top notch results for life? This is your Podcast.\n",
        "language": "en",
        "author_name": "Gisbert Reuter",
        "slug": "gisbertreuter",
        "cover": "20221206_021249_72aa27d541031c3ac4640d0d369fec48.jpg"
    },
    {
        "podcast_id": 173138,
        "title": "Audio Leyes",
        "description": "Audio Leyes narradas por Locutor Profesional. Actualizaciones diarias. Escucha y Estudia donde y cuando quieras desde cualquier dispositivo. By www.thedigitallaw.com ",
        "language": "es",
        "author_name": "The Digital Law",
        "slug": "audio-leyes",
        "cover": "20221228_021258_b56d7a49ed418bd76e3a035b829134b1.jpg"
    },
    {
        "podcast_id": 173313,
        "title": "EDEN 2022 Annual Conference ",
        "description": "<p>Listen to the Keynote Speakers presentations for the 2022 EDEN Annual Conference in Tallinn University.</p>",
        "language": "en",
        "author_name": "EDEN Digital Learning Europe",
        "slug": "edenac2022-riinavuorikari",
        "cover": "20221208_061258_23856b9138471a8574a4ab7826e0b5e3.jpg"
    },
    {
        "podcast_id": 173654,
        "title": "Supernegotiate",
        "description": "Welcome to my series for Procurement managers: Hard Negotiations.\nIn this series, I will take you through some of my most effective techniques for negotiation. In this first episode, I will teach you how can you gather more information in any negotiation. Especially, when the vendor is being difficult.\nI will also teach you about how to establish trust and rapport with your supplier before you can use the trust to your advantage.",
        "language": "en",
        "author_name": "Gaurav Sharma",
        "slug": "supernegotiate",
        "cover": "20221216_111240_aee1ab7f988ac7129d74fe2b537c0e29.jpg"
    },
    {
        "podcast_id": 174459,
        "title": "Lunchtime Law",
        "description": "This podcast focuses on exploring current events from the perspectives of legal professionals in a format that anyone can understand, while on their lunch break. \n\nHosted by a trial attorney with experience in over a dozen fields of law, this podcast is meant to provide a straightforward approach to understanding how the law actually works, without taking itself too seriously. ",
        "language": "en",
        "author_name": "Pastrami Law Melt",
        "slug": "pastramilawmelt",
        "cover": "20221215_121234_83268c2aba360a43f13b8923606eff98.jpg"
    },
    {
        "podcast_id": 174985,
        "title": "universe~",
        "description": "just some of my thoughts…",
        "language": "en",
        "author_name": "Ella",
        "slug": "universe",
        "cover": "20221217_071238_196905229a54c10ffebb6606330657c7.jpg"
    },
    {
        "podcast_id": 175659,
        "title": "key Issues in Tourism Consumption",
        "description": "In this podcast, the tourism master’s students at Aalborg University discuss diverse topics about tourism consumption with experts and academics, such as sustainability, food tourism, and gender.",
        "language": "en",
        "author_name": "Amira Benali",
        "slug": "key-issues-in-tourism-aalborg",
        "cover": "20221221_011224_f16de75768e929d1ec43c3f75d1c9438.jpg"
    },
    {
        "podcast_id": 176036,
        "title": "Hungry Authors",
        "description": "If you’ve got the hunger—the drive, the gumption, the stick-with-it-ness—to develop a great idea and plan your book, then you should do it. In this podcast, writers and industry experts Liz Morrow and Ariel Curry share insights and tools to plan and write your book, navigate the publishing industry, and bring your ideas to life. With interviews from bestselling authors, hungry authors just like you, and other publishing insiders, Hungry Authors is a place for all of us to get better and make our publishing dreams come true - together. ",
        "language": "en",
        "author_name": "Ariel Curry & Liz Morrow",
        "slug": "hungryauthors",
        "cover": "20221223_081202_e32f5338093bb69385143fbcbefea39a.jpg"
    },
    {
        "podcast_id": 176439,
        "title": "The Intangible",
        "description": "The Intangible is a podcast discussing cultural preservation in the modern world. From statues, to music, to cancel culture, to literature- The Intangible focuses on every aspect of modern culture. Cultural Preservation is normally discussed in the context of history and ancient archaeological artifacts. But, what about our current culture? What are the controversial aspects of our culture? Do we even want to preserve some parts? These are some of the questions that The Intangible aims to answer through discussions with many opinionated guests with focuses in different fields of culture and cultural preservation. For more information, check out the website: https://www.theintangible.co/",
        "language": "en",
        "author_name": "Nicholas",
        "slug": "theintangible",
        "cover": "20221227_121214_fd6b87cdbdf0b09e1fd907a87f6b596e.jpg"
    },
    {
        "podcast_id": 177386,
        "title": "DERM of the Day",
        "description": "Created by a third-year osteopathic medical student to educate premed and medical students about some of the most commonly tested dermatologic conditions encountered in medical school, as well as foster relationships within the Dermatology community.\n\n***For educational purposes only, not intended to be used as medical advice***",
        "language": "en",
        "author_name": "Caden Carver",
        "slug": "dermoftheday",
        "cover": "20230101_120112_763fcec3ab01ae1af29ae6686d5cb02a.jpg"
    },
    {
        "podcast_id": 177443,
        "title": "LaunchDay Podcast | Business - Start. Grow. Scale.",
        "description": "<p>Start. Grow. Scale.! Hear compelling stories and discussions from other business owners on what it takes to achieve success!</p>",
        "language": "en",
        "author_name": "LaunchDay™ with Dean Cvetkoski",
        "slug": "launchday",
        "cover": "20230822_040840_35c0d58f117e29a53a6bbb6a2ee67a29.jpg"
    },
    {
        "podcast_id": 177920,
        "title": "Eweviwo",
        "description": "<p>Documenting Ghanaian Ewe Culture and Traditions in podcast for a new generation of Ewes around the world.</p>",
        "language": "en",
        "author_name": "Eweviwo Project",
        "slug": "eweviwo",
        "cover": "20230701_080749_cffbe860734cdadf4dc892a5062fc387.jpg"
    },
    {
        "podcast_id": 178508,
        "title": "The Beauty Momentum",
        "description": "Sometimes we all need a reminder that we CAN do it. What ever \"it\" may be. Each episode will be the boost in your day to keep moving you forward. Your go-to podcast for all things beauty industry advice, (single)parenthood and owning a business, relationship and work life balance, and navigating it all with faith without losing momentum. Hosted by beauty biz owner, Moriah \"Mo\" Hasan.",
        "language": "en",
        "author_name": "Moriah \"Mo\" Hasan",
        "slug": "thebeautymomentum",
        "cover": "20230106_120100_a5162c0d5169a683ffe1c1ad527c0e44.jpg"
    },
    {
        "podcast_id": 179594,
        "title": "Toroid Academy Podcast",
        "description": "El lugar que estabas buscando para tu crecimiento y desarrollo tanto personal como profesional. ¡Contenido de calidad y directo al grano! \n\nDesarrolla y crece en las diferentes áreas de tu vida que te llevarán a alcanzar tu mejor versión: Salud y bienestar, Intelecto, Emociones, Conexión, Carácter, Amor, Familia,  Vida Social, Finanzas, Carrera y Estilo de Vida.",
        "language": "es",
        "author_name": "Israel Marín",
        "slug": "toroidacademy",
        "cover": "20230110_080130_bb1b4f37866de5900c78dbf300d3b41a.jpg"
    },
    {
        "podcast_id": 179935,
        "title": "Solar & Storage Market Podcast",
        "description": "Learn more about solar inverters, pv modules, energy storage, and racking equipment from the manufacturers. ",
        "language": "en",
        "author_name": "RENVU, INC",
        "slug": "renvu",
        "cover": "20230112_070114_19c382cca1d87f8f8c4cc28109719c49.jpg"
    },
    {
        "podcast_id": 180254,
        "title": "Mañana es lunes",
        "description": "Mañana es lunes, un podcast de Música y Pedagogía escrito y presentado por Eugenia Arús. \nUn programa de radio semanal emitido por Bellaterra Música Ed para motivar y dar valor, a toda la labor que desempeñan los maestros de música, en su día a día, y un punto de encuentro distendido para compartir con los profesionales de la educación y con todos aquellos que quieran escucharnos.\nSon reflexiones y propuestas creadas por la Dra. Eugénia Arús en el marco del Aula de Didáctica que la lidera en el Musical de Bellaterra dentro del Máster en Pedagogía de la Música y el Movimiento que ofrece la Universidad Ramon Llull-Blanquerna y El Musical dentro de su programa de formación permanente para maestros.",
        "language": "es",
        "author_name": "Bellaterra Música - Eugenia Arús",
        "slug": "bellaterramusica",
        "cover": "20230124_090120_114c016897cba0d29c991cc05f14cfca.jpg"
    },
    {
        "podcast_id": 181115,
        "title": "WEED is my medicine",
        "description": "<p>Ever grown your own cannabis? This podcast talks about my journey growing my own medical weed at home. We will discuss my experiences using growing and using cannabis for Crohn's, a chronic illness that I've had for 15+ years. We'll talk about other aspects of Crohn's and chronic pain. There are many facets to health and cannabis can certainly be a life changing part of that journey! 🚂 I focus on organic soil growing indoors, but in this podcast we will discuss many styles of growing at home such as Autopots, Coco coir, and DWC. Tune in for discussions on how to cultivate the plant, medical cannabis lifestyle, and tips on how to achieve more out of your home grow! 🌱💯💡</p>",
        "language": "en",
        "author_name": "Evergrown Cultivation",
        "slug": "evergrownyourown",
        "cover": "20230314_020326_98b910863ac4eb27b071a3b486cb53f6.jpg"
    },
    {
        "podcast_id": 181209,
        "title": "Sublime Gracia Podcast",
        "description": "El potcast de “Sublime Gracia” por Josue Arellano como host y Marcos Tizapaneco co-host. Este espacio nace por necesidad de nuestro Pastor, Rev. Moises Quirino, de enseñar a la iglesia nuestra doctrina en la que estamos fundados ya que pertenecemos a la Iglesia Apostolica de la Fe en Cristo Jesus (IAFCJ), aquí encontraras nuestros ahora 21 puntos doctrinales, estaremos compartiendo un episodio cada semana, los lunes a las 9:00 am podrás ver nuestros estrenos, tendremos invitados, compartiremos nuestras experiencias personales y a las luz de la Biblia seremos edificados.",
        "language": "es",
        "author_name": "Sublime Gracia Church",
        "slug": "sublimegracia",
        "cover": "20230127_050109_960fb220aa343c3e9cdc1527ecb37715.jpg"
    },
    {
        "podcast_id": 181311,
        "title": "Get Licensed - Security Insider",
        "description": "Welcome to our new channel dedicated to all things security - Get Licensed Security Insider. \n\nHere you will find our tips and tricks to stay safe, an insight into the real world of security as well as our presenter Carl Randle having some fun along the way!\n\nMake sure to subscribe to our channel to keep up to date with our podcasts.\n\n___\nSecurity Insider is powered by Get Licensed.\nGet working with Get Licensed.\n\nhttps://www.get-licensed.co.uk\n0207 078 7259",
        "language": "en",
        "author_name": "Get Licensed",
        "slug": "get-licensed",
        "cover": "20230117_030127_8603400a9009b9b417e60c0a0da7bf28.jpg"
    },
    {
        "podcast_id": 183639,
        "title": "TechniTrader - Stock Market Training Podcast",
        "description": "<p>In this Podcast, you will learn how the stock market works, stay up to date on current events in the financial markets, and get some free tips for trading stocks, options, ETFs and more. Martha Stokes CMT is the Co-Founder and CEO of TechniTrader, an educational firm dedicated to helping retail traders and independent investors learn how to trade or invest in the stock market.</p><p><strong>TechniTrader.Courses</strong> has been educating traders since 2000. Martha Stokes is a Chartered Market Technician, one of only a few hundred to date registered with the Market Technicians Association, with more than 20 years of experience in the financial services industry. Having worked as a professional technical analyst for buy side institutions and also a successful business owner, with a working understanding of both sides of a company's goals, Martha has a unique take on the stock market that all investors should tune in for.</p><p>Reach out to <a href=\"mailto:olgap@technitrader.com\">olgap@technitrader.com</a> to request Martha as a guest speaker.</p>",
        "language": "en",
        "author_name": "Martha Stokes CMT",
        "slug": "technitrader",
        "cover": "20230125_100136_14674922ec79205f5b277ecd372925bb.jpg"
    },
    {
        "podcast_id": 183841,
        "title": "Muses of a Channel ~CCStarseeds",
        "description": "<p><strong>~CCStarseeds</strong> ..... Born, an <strong><em>Open channel</em></strong> and with the guidance of the <strong><em>Ascension Seeds Network</em></strong><em>, </em>tells us of her journeys as she <strong><em>astral- travels</em></strong> through dimensional portals to other <strong><em>Realms, Spaces, Places</em></strong><em>,</em> and <strong><em>through</em></strong> <strong><em>Time </em></strong>that exists beyond the <strong><em>five senses</em>. </strong>Keep up with CCStarseeds by visiting her website: <a href=\"http://www.ccstarseeds.me\">www.ccstarseeds.me</a></p>",
        "language": "en",
        "author_name": "~CC Starseeds~.          Connie Preston Parker",
        "slug": "ccstarseeds",
        "cover": "20230627_110655_73f690cee25b52c99c6df8e1fd2ea2ae.jpg"
    },
    {
        "podcast_id": 184061,
        "title": "Diesel Doktor",
        "description": "En Podcast om skibsdieselmotorer, og tekniske anlæg ombord på skibe. produceret i samarbejde med MARTEC",
        "language": "da",
        "author_name": "Niels Ilberg Jacobsen",
        "slug": "dieseldoktor",
        "cover": "20230127_110100_5b67b7c584507d8c89cfa78f0246171d.jpg"
    },
    {
        "podcast_id": 184912,
        "title": "Did You Know?-The ESCO HVAC Podcast",
        "description": "The ESCO Institute \"Did you Know?\" podcast provides HVACR professionals access to reliable, up-to-date, and relevant information, directly from trusted sources. The world of HVACR has been changing at an exponential rate over the last few years; new SEER ratings, flammable refrigerants, and an array of technological advances. Keeping up with all the changes in regulation, manufacturing, refrigerants and how to properly prepare students and technicians has became daunting. Many of our guests are speakers and exhibitors at the HVAC EXCELLENCE National HVACR Education Conference and represent every sector of the HVACR industry. Thanks for joining in!\n\n\n",
        "language": "en",
        "author_name": "ESCO Institute",
        "slug": "escogroup",
        "cover": "20230130_020159_e1d28a7f2073d22344cad55e2782555f.jpg"
    },
    {
        "podcast_id": 185392,
        "title": "Popular Culture in the Americas",
        "description": "<p>This podcast explores Popular Culture in the Americas, hosted by Dr. Melissa Maldonado-Salcedo. Pablo G. Alvarez produces it. This course is offered at New York University in the department of Anthropology at New York University. To download the syllabus and study guides or to read more about my work, please visit: www.melthestorydoc.com</p>",
        "language": "en",
        "author_name": "Melissa Maldonado-Salcedo",
        "slug": "popular-culture-in-the-americas",
        "cover": "20230201_120223_099c59094a26c489e4a9d61c97ff5d04.jpg"
    },
    {
        "podcast_id": 186180,
        "title": "HABLANDO DE TODO",
        "description": "<p>Hablamos de todo como informática, tipos de música ect</p>",
        "language": "es",
        "author_name": "Alfonso y Javier",
        "slug": "hablandodetodo",
        "cover": "20230203_090245_1ad37cffae56fba8a6091319765df41c.jpg"
    },
    {
        "podcast_id": 186463,
        "title": "Moj Podcast",
        "description": "Moj Podcast (moj podkast) je podkast o podkastima. Bar u svojoj prvoj sezoni. Kako da pokrenete podkast, od ideje do promocije (i monetizacije), vodiće vas Uroš Bogdanović, čovek koji iza sebe ima preko 20 godina rada u radijskoj i podkast industriji.",
        "language": "sr",
        "author_name": "PodMedia",
        "slug": "moj-podcast",
        "cover": "20230204_110242_02b12ff508b4527be08bbb1076fbc711.jpg"
    },
    {
        "podcast_id": 187226,
        "title": "TechMonkeys",
        "description": "<p>This podcast is about making a podcats. Here it's about most technical issues to solve. We prove some gear and software to upgrade and improve podcast producing and moneticing. If you want to make a donation follow this link: https://getalby.com/p/ellibrero33 If you use a</p>",
        "language": "en",
        "author_name": "Victor Niebla",
        "slug": "tecmonkeys",
        "cover": "20230309_030347_dd9319ffb3f6a472f68cb82aa937a82a.jpg"
    },
    {
        "podcast_id": 190252,
        "title": "The Year 12 Blueprint",
        "description": "<p>Heshan and Adrian, Founders of Mian Learning, talk about the mindset and goals year 12 students should have in order to achieve success. Being teachers at Monash University and having tutored thousands of students collectively, both Heshan and Adrian have developed a passion for teaching.</p>",
        "language": "en",
        "author_name": "Heshan and Adrian ",
        "slug": "theyear12blueprint",
        "cover": "20230217_080242_e4dea9c257034c26ab6a62cf78edba21.jpg"
    },
    {
        "podcast_id": 190394,
        "title": "Hernán's English Classroom",
        "description": "<p>¡Bienvenidos a Hernán's English Classroom! Aquí encontrarás un espacio de aprendizaje de inglés divertido, moderno y personalizado, liderado por el profesor Hernán. Cada episodio ofrece lecciones prácticas y dinámicas sobre gramática, pronunciación, vocabulario y más. Además, Hernán compartirá con sus estudiantes consejos útiles para mejorar su aprendizaje de inglés, así como experiencias interesantes sobre la cultura angloparlante. ¡Sintoniza nuestro podcast y prepárate para mejorar tus habilidades en inglés en una clase virtual única y emocionante!</p>",
        "language": "en",
        "author_name": "Hernán Tena Cortés",
        "slug": "elprofesorhernan",
        "cover": "20230217_100248_739ac9c53e0b665c76de4cf2a1d1ca98.jpg"
    },
    {
        "podcast_id": 190775,
        "title": "Inside the Law",
        "description": "<p>Welcome to Inside the Law! This podcast is a place where we are going to learn all things law.</p><p>​​My involvement in the mock trial club in school sparked a great interest in learning more about the law and what goes into the process of a successful trial. I am interested in exploring all areas of law and getting a better understanding of the field. I am a novice, here to gain an education and take my listeners along for the ride in understanding why people pursue a career in law, what it means to be an effective lawyer and to explore the different areas of practice. Get ready to be engaged and inspired!</p>",
        "language": "en",
        "author_name": "Lily R",
        "slug": "learninglawwithlily",
        "cover": "20230329_080330_532e08c321163c0830bfef4dfb5d87d5.jpg"
    },
    {
        "podcast_id": 191117,
        "title": "Global Nurse Ed",
        "description": "<p>Nursing education anytime, anywhere, for anyone...breaking the complex down into the comprehensible. Let my decade-plus experience in nursing education be the supplement to your success with short podcasts you can listen to in the car, at the gym, or anywhere that finds you ready to maximize your potential!</p>",
        "language": "en",
        "author_name": "Jason Micheal Kiernan, PhD, RN, ACNP (United States credentialed)",
        "slug": "gne-s1e1-cancer-oncogenes-tumorsuppressorgenes-epigenetics",
        "cover": "20230227_040245_b5b34a6cdfde4bac32ee6caac3678448.jpg"
    },
    {
        "podcast_id": 191512,
        "title": "Talking Weather",
        "description": "<p>Hi</p><p>My name is George Muniz Gund</p><p>I am a former meteorology student and have always had a huge passion for weather, growing up in places with very interesting weather patterns, such as San Francisco,USA and Sao Paulo, Brazil.</p><p>Check out my other podcast \"Unpacking Neuroqueerness\" as well</p><p><a href=\"https://open.spotify.com/show/4q31WLOKRERreD1DQjOOkt?si=332125f163664c12\">https://open.spotify.com/show/4q31WLOKRERreD1DQjOOkt?si=332125f163664c12</a></p>",
        "language": "en",
        "author_name": "George Muniz Gund",
        "slug": "talkingweather",
        "cover": "20230227_030202_d4a1bf0b9c5fabeb619f1549f2596083.jpg"
    },
    {
        "podcast_id": 192164,
        "title": "Differential Discussions",
        "description": "<p>Two hematology nerds NOT just talking about cells. This channel will serve as a place to review theory and explore topics in laboratory medicine with colleagues working in the field.</p>",
        "language": "en",
        "author_name": "Differential Discussions",
        "slug": "differentialdiscussion",
        "cover": "20230224_070235_67525684a95fcc371420d3f9afc1ef03.jpg"
    },
    {
        "podcast_id": 192605,
        "title": "New York Real Estate Legal Minute",
        "description": "<p>Real estate legal tips from Aldad &amp; Associates, P.C., leading and experienced New York real estate attorneys for over 25 years.</p><p>The attorneys and staff at Aldad &amp; Associates, P.C. – renowned for their expertise, integrity and commitment to excellence – represent years of successful real estate legal advisory in both commercial and residential settings.</p><p>The firm was established in 1996 with the goal of offering its clients greater personal attention and cost efficiency through the expertise of our associates and senior attorneys. We place emphasis on providing the highest quality legal representation in a courteous, responsive and professional manner while achieving the rigors of efficiency that are now and will continue to be required from the legal profession.</p><p>We are a boutique New York law firm specializing in real estate transactions. Aldad &amp; Associates is recognized and known in the industry for providing the quality legal representation found in the largest firms, together with the reasonable fees and personal service of a boutique firm. A partner of the firm is always available to meet or speak with you during the process so that any of your questions or concerns receive prompt attention.</p><p>Visit <a href=\"http://Aldadlaw.com\">Aldadlaw.com</a> for more information</p>",
        "language": "en",
        "author_name": "Lior Aldad, Esq.",
        "slug": "aldadlaw",
        "cover": "20230226_060242_2110e9f6b97cba83c8dc2a4d577a0909.jpg"
    },
    {
        "podcast_id": 192760,
        "title": "Lo Personal es Político",
        "description": "<p>Lo Personal es Político es un podcast donde hablaremos sobre cultura, política y la realidad Latinoamericana. No te lo pierdas los domingos a las 20:00 horas México y 21:00 horas Ecuador.</p>",
        "language": "es",
        "author_name": "Gabriela Rivadeneira",
        "slug": "lopersonalespolitico",
        "cover": "20230227_030252_2cec79b681d1dd3f3d495c694c5e6fdf.jpg"
    },
    {
        "podcast_id": 193460,
        "title": "A lo legal: Derecho y actualidad",
        "description": "<p>A lo legal: Derecho y actualidad es un espacio creado por el <strong>Departamento de Estudios Jurídicos</strong> de la Universidad Icesi con el apoyo de la <strong>Organización de Estudiantes de Derecho de Ices</strong>i y el <strong>Semillero de Transformación Digital, </strong>el cual tiene por objetivo ser un canal de interacción entre <strong>docentes</strong>, <strong>estudiantes</strong> y la <strong>sociedad en general</strong>.</p><p></p><p>Durante los próximos minutos conversaremos con diversos invitados sobre cuestiones de actualidad en el mundo del derecho</p><p></p><p>Utilizaremos un <strong>lenguaje claro, sencillo y ameno</strong>, que nos permitirán identificar y explicar los temas relevantes en el mundo del derecho.</p>",
        "language": "es",
        "author_name": "Universidad Icesi",
        "slug": "alolegal",
        "cover": "20230317_070329_399d63378b25978af5c3eac57d83a8a5.jpg"
    },
    {
        "podcast_id": 193785,
        "title": "Arcana",
        "description": "<p>You are welcome to this space as many times as necessary. We thank you for sharing your time with us. Next, we share with you how this space works.</p><p>- What is said in this podcast corresponds to information supported by bibliography which will be cited in each episode.</p><p>- The intention is to provide information that is useful while keeping respect for any cosmogony and any beliefs. This is a guide rather than a manual on the Tarot and its mysteries.</p><p>- The responsibility for the use of the information belongs to the person who listen and recommend this information. In this space we do not seek to promote ideologies, beliefs or cosmogonies; on the contrary, we seek to gather as much information about each Tarot letter and locate it in some line of knowledge.</p><p>- To understand each other, and to start from a version of the Tarot that we can consult, we will use the Marseille Canon as described by Marianne Costa and Alejandro Jodorowsky in the Book La Vía del Tarot.</p><p>If your tarot deck does not belong to the Marseille Canon or you notice differences in the descriptions, do not disconnect. You will see that you will know your tarot by studying the differences with other decks.</p><p>At Arcana, we are convinced that there is no absolute way to read the tarot, only ways to interpret it. We consider it important to give information that expands the stories symbolically expanded as a result of playing the cards.</p><p>This podcast is a library where topics about the arcana are poured. If your search is based on reading, this space will help you with information about the cards. In the same way we will share the useful information to achieve readings using the Tarot.</p><p>This space is not intended to be a matter of debate, it is just a free and informative space in which we respect the different ways of seeing and thinking about the Tarot. We think more about this space to share experiences and information.</p><p>If what interests you my dear pilgrim is to know about the world of Tarot, or being the case, a deck has come into your hands, I invite you to go through your deck together.</p><p>It is not necessary to have a Tarot available, you can take this space to consult or satisfy some intellectual curiosity.</p><p>The only thing we ask of all participants is to keep their mind open to the information that is shared.</p><p>I remind you that the use of the tools and information that you hear are the responsibility of those who practice and use them.</p><p>With this welcome we begin the transmissions of this podcast. We hope your participation and that you share your experience in the world of Tarot with us and the pilgrims.</p><p>For those who listen to this podcast, it may be something new or curious, but I also know that there are some of our listeners who found us because they are in the learning process.</p><p>The only certainty is that the Tarot in the history of man fulfills a function that is important to us: Save symbolic relationships that have been established over time within the iconography of the Tarot.</p><p>From what you hear, take what works for you.</p><p>This is Arcana.</p>",
        "language": "en",
        "author_name": "Victor Niebla",
        "slug": "arcanaenglish",
        "cover": "20230302_040359_8f17665835277d6848194a5cdc266720.jpg"
    },
    {
        "podcast_id": 194211,
        "title": "Become A Master Teacher",
        "description": "<p>The <em>Master Teacher Podcast</em>, from Tab &amp; Mind, is designed with the busy educator in mind.</p><p>Each week, we share <strong>engaging stories and useful tips that keep you thinking about your craft as you go through your day</strong>.</p><p>Whether you're a veteran teacher who's been in the trenches for years or a student-teacher who is preparing for their first rodeo, there's something here for you.</p>",
        "language": "en",
        "author_name": "Tab & Mind - Educator Courses & Resources",
        "slug": "master-teacher",
        "cover": "20230304_120348_528dab8ebe1085c41eb199f9848c6e6c.jpg"
    },
    {
        "podcast_id": 194933,
        "title": " روشنگران قادسیه",
        "description": "<p>نبرد قادسیه، نبرد ایران و اسلام، همچنان ادامه دارد. این بار، ایران پیروز است</p>",
        "language": "fa",
        "author_name": " روشنگران قادسیه",
        "slug": "roshangaranmedia",
        "cover": "20230324_030326_8845392c5a89bb184d3d3f7b58498220.jpg"
    },
    {
        "podcast_id": 195700,
        "title": "ArcanaMX",
        "description": "<p>Bienvenido a Arcana. </p><p>Arcana es un espacio abierto. se encuentra contenido en la nube bajo el mecenazgo del Genio del Lenguaje.</p><p>Eres bienvenide, bienvenida o bienvenido a este espacio las veces necesarias. Te agradecemos que tu tiempo lo compartas con nosotros. A continuación, quisiéramos copartir la manera de trabajo de este espacio.</p><p>- Lo dicho en este podcast corresponde a información respaldada en bibliografía la cual será citada en cada capítulo.</p><p>- La intención es brindar información que sea de utilidad respetando cosmogonías y creencias. Es una guía mas que un manual sobre el Tarot y sus misterios.</p><p>- La responsabilidad del uso de la información es de quien le da uso.  En este espacio buscamos juntar la mayor información sobre cada carta y ubicarlo en algún renglón del conocimiento.</p><p>- Para entendernos y partir todos de una versión de Tarot, usaremos el Canon de Marsella como lo describe Marianne Costa y Alejandro Jodorowsky en el Libro La Vía del Tarot.  </p><p>De lo que escuchen, sólo tomen lo que les sirva.</p>",
        "language": "es",
        "author_name": "Victor Niebla",
        "slug": "arcanamx",
        "cover": "20230309_020311_344cc728e47845c5cc01dac6dcbe4f85.jpg"
    },
    {
        "podcast_id": 196885,
        "title": "The CeMAP Study Podcast with Future in Finance",
        "description": "<p>If you're thinking about studying for your CeMAP exams &amp; have no idea where to start - don't worry, I got you.</p><p>In the BRAND SPANKING NEW podcast series, we'll be breaking down each of the 25 Units of the London Institute of Banking &amp; Finance's, 'Financial Regulation UK', which is everything you need to sit CeMAP 1, &amp; delivering it in bite-size pieces, with some real world examples in a 'hopefully not even remotely mundane' way.</p>",
        "language": "en",
        "author_name": "Charlotte Hemmingway ",
        "slug": "futureinfinance",
        "cover": "20230415_070457_81af356509e6e091a4c62d2c9853a7cf.jpg"
    },
    {
        "podcast_id": 197312,
        "title": "Cixemo (audiolibro) ",
        "description": "<p>Todos los derechos reservados.</p><p>Abogado Penalista nos comparte una de sus grandes obras Cixemo, un libro que discute y analiza el sistema actual del planeta, regido bajo el entendimiento de la cultura que nos ha llevado como sociedad hasta donde estamos hoy. </p><p>Todos los fondos recaudados, serán destinados a dos partes: al propio autor del libro y al CIIIDAER una Asociación Civil Mexicana sin fines de lucro dedicada a la promoción de la educación, energías renovables, cuidado del planeta y apoyo a pueblos indígenas. </p>",
        "language": "es-mx",
        "author_name": "Raúl González Salas Campos",
        "slug": "ciiidaer-cixemo",
        "cover": "20230316_060350_c35e7b24eeae42580ed13c64b36736eb.jpg"
    },
    {
        "podcast_id": 197714,
        "title": "Lecture Prep on the Go (RSS 4242 Gender, Leisure and Sport)",
        "description": "<p>This podcast provides audio lectures for students in RSS 4242 to help them prepare for in-class discussions.</p>",
        "language": "en",
        "author_name": "Charlene Shannon-McCallum",
        "slug": "lectures-on-the-go",
        "cover": "20230318_080304_e59c0aebedafbcca1d16e8921f90744b.jpg"
    },
    {
        "podcast_id": 198381,
        "title": "Gastro Shakers ",
        "description": "<p><strong>¡Te presentamos “Gastro Shakers”, el nuevo Podcast de BCH!</strong></p><p>A través de una serie de diálogos con los principales players que están revolucionando el panorama gastronómico y alimentario actual, abordaremos temas como la innovación alimentaria, la evolución de la figura del chef, cómo es de impactante la comunicación gastronómica hoy en día o la gestión de éxito en proyectos tanto empresariales como de restauración que han escalado a lo más alto</p>",
        "language": "es",
        "author_name": "Gastro Shakers ",
        "slug": "gastro-shakers-episodio-0",
        "cover": "20230321_120344_845b83e7dd0564bf895bae47c96e7349.jpg"
    },
    {
        "podcast_id": 198571,
        "title": "Charla Al Vuelo",
        "description": "<p>Podcast educacional creado por parte de la revista \"Habla en Buho\"</p>",
        "language": "es-mx",
        "author_name": "Habla en Búho",
        "slug": "charlaalvuelopodcast",
        "cover": "20230322_050315_9fc864a559ef266e490051bc6a6f2591.jpg"
    },
    {
        "podcast_id": 199687,
        "title": "Noticias, relatos y entretenimiento",
        "description": "<p>Noticias de actualidad, San Pedro Peralta y alrededores.</p>",
        "language": "es-mx",
        "author_name": "EMSaD San Pedro Peralta",
        "slug": "brujulamundial-equipo2",
        "cover": "20230329_030354_1ed243736c9077cc085fd3d8042e6b07.jpg"
    },
    {
        "podcast_id": 199688,
        "title": "The Crop Insurance Podcast",
        "description": "<p>To learn more please visit our website <a href=\"http://www.TheCropInsurancePodcast.com\"><strong>www.TheCropInsurancePodcast.com</strong></a></p><p>Get an insider's look at the complex world of Federal Crop Insurance with our podcast. With three generations, and 40 plus years, of experience in the program, we've learned the ins and outs of this important resource for farmers. Join us as we share our insights, interview farmers from across the country, and feature special guests from the insurance industry. Our mission is to help you understand and benefit from this critical program</p>",
        "language": "en",
        "author_name": "Mike Rydell",
        "slug": "thecropinsurancepodcast",
        "cover": "20230327_060345_d15f37e81ba9e9c496f84aaa78bff443.jpg"
    },
    {
        "podcast_id": 200867,
        "title": "Open Source Intelligence (OSINT) and Investigation",
        "description": "<p>Welcome to our podcast about Open Source Intelligence (OSINT) and Investigation. In this podcast, we explore the fascinating world of OSINT and how it can be applied to investigations of all kinds.</p><p>Whether you're a private investigator, law enforcement officer, journalist, or just someone interested in the intersection of OSINT and investigation, this podcast has something for you.</p><p>Topics covered in this podcast include social media investigations, digital forensics, online threat intelligence, and much more. We delve into the latest tools and techniques used in OSINT and investigation, as well as the ethical and legal considerations that investigators must keep in mind.</p><p>In addition to discussing the theoretical and technical aspects of OSINT and investigation, we also feature real-world case studies and examples. Our guests share their experiences of using OSINT to solve complex cases, providing valuable insights into the practical application of this field.</p><p>So join us for our podcast about OSINT and investigation, where you'll learn from leading experts and gain a deeper understanding of the powerful role that OSINT plays in modern investigations. Whether you're a seasoned investigator or just getting started, there's something for everyone in this podcast.</p>",
        "language": "en",
        "author_name": "Mattia Vicenzi",
        "slug": "osint",
        "cover": "20230402_040417_63ff11e3a975bb10da28a8000a444949.jpg"
    },
    {
        "podcast_id": 200907,
        "title": "Corso Completo di Scacchi",
        "description": "<p>Corso di Scacchi Completo</p>",
        "language": "it",
        "author_name": "ScacchiEaltro",
        "slug": "scacchiealtro",
        "cover": "20230408_030430_2a2da7b6d6c7e0d39fbec38697a500f6.jpg"
    },
    {
        "podcast_id": 201227,
        "title": "Coach 3C di Tratto Stefania - Business, Team e Career Coach",
        "description": "<p>Parliamo di Comunicazione, Negoziazione, Team e Leader Evoluti, Gestione Aziendale Teal, I 4 Colori della Personalità, Self Leadership, Talenti e Career Coaching</p>",
        "language": "it",
        "author_name": "Stefania Tratto",
        "slug": "coach-3c-di-tratto-stefania-business-team-e-career-coach",
        "cover": "20230404_080449_f2d3ad7d9b22728c72fbd314bd11c71b.jpg"
    },
    {
        "podcast_id": 202934,
        "title": "musica912",
        "description": "<p>Cosas.</p>",
        "language": "en",
        "author_name": "Marcos",
        "slug": "musica912",
        "cover": "20230413_030449_f29f33ba33d6328c37345c4430c55970.jpg"
    },
    {
        "podcast_id": 203012,
        "title": "Let's Get to the Good Stuff",
        "description": "<p>Two college professors looking to get to the good stuff about programs, courses, and the real things that students want or need to know. Get excited to listen to these ladies get real and raw about their experiences as students and professors as well as with some special guests along the way.</p>",
        "language": "en",
        "author_name": "Let's Get to the Good Stuff",
        "slug": "letsgettothegoodstuff",
        "cover": "20230417_040444_b770e015d6bbc3a710da25f4dee7ec2d.jpg"
    },
    {
        "podcast_id": 203340,
        "title": "Classes of Mail",
        "description": "<p>Make yourself discipline proof! This podcast is dedicated to educating City Letter Carriers on all the things you forgot from Carrier Academy. We'll go over basic procedures and regulations, and dive deeper into how the mail system actually works. I do not speak for the USPS, this is not an official USPS podcast, and all opinions and advice are my own. Submit feedback, questions, or topic suggestions to <a href=\"mailto:classesofmail@gmail.com\">classesofmail@gmail.com</a> .</p>",
        "language": "en",
        "author_name": "Alan Gegax",
        "slug": "classesofmail",
        "cover": "20230531_010545_d410d9e8b199be75f13d268b120b7af5.jpg"
    },
    {
        "podcast_id": 203594,
        "title": "Geordie Film's Class",
        "description": "<p><strong>Geordie Film's Class </strong>specialises in screenings and informative lectures around 'class' films, based out of the North-East. This includes a wide variety of genres, and often screens monthly at the Tyneside independent Cinema.</p>",
        "language": "en",
        "author_name": "Nathan Lunn",
        "slug": "geordiefilmsclass",
        "cover": "20230416_090450_42d4618114e674e5cbfa3b9cd1d2c00f.jpg"
    },
    {
        "podcast_id": 204034,
        "title": "Viajemos Juntos El Podcast",
        "description": "<p>Bienvenidos a este podcast de turismo, un espacio dedicado a explorar destinos turísticos, las mejores recomendaciones para agentes de viajes. Descubre nuevos lugares y proveedores para asegurarle a tus pasajeros que tendrán la mejor experiencia posible.</p>",
        "language": "es-mx",
        "author_name": "David Cota",
        "slug": "viajemosjuntoselpodcast",
        "cover": "20230418_090427_f979e43a2e9bf1862dada8926171f1de.jpg"
    },
    {
        "podcast_id": 204183,
        "title": "Life, Legacy, & The Law",
        "description": "<p>An educational estate planning podcast structured to help people understand what estate planning is and how to plan for their legacy.</p>",
        "language": "en",
        "author_name": "Life, Legacy, & The Law",
        "slug": "life-legacy-and-the-law",
        "cover": "20230501_010539_4786c2cdf17d7f139bc828c91e42aaf3.jpg"
    },
    {
        "podcast_id": 204479,
        "title": "Hypnosis NGH",
        "description": "<p>This podcast series offers a fun and serious look at Hypnosis for Hypnotists, offers various idea's, reviews case studies and features NGH Educational Opportunities.</p><p>Join the NGH online at www.ngh.net</p>",
        "language": "en",
        "author_name": "National Guild of Hypnotists Hosts",
        "slug": "hypnosisngh",
        "cover": "20230420_070440_8bf8a4fde399640f3e475fb2f187eba9.jpg"
    },
    {
        "podcast_id": 204741,
        "title": "Socialización, Escuela y Formación del Individuo",
        "description": "<p>Importancia de la formación como agente formadora en la educación en un mundo globalizado y dinámico</p>",
        "language": "es-mx",
        "author_name": "Kenya Vargas Hernandez",
        "slug": "kenyavhernandez",
        "cover": "20230422_010413_988193743a3ff62dc9d04f1f2cddfc08.jpg"
    },
    {
        "podcast_id": 205632,
        "title": "Emisora del CRA Alciares",
        "description": "<p>Grabaciones realizadas por el alumnado de nuestro Colegio Rural Agrupado</p>",
        "language": "es",
        "author_name": "CRA Alciares",
        "slug": "craalciares",
        "cover": "20230426_110412_ba7456a59c497741ee3e82bb8712bb8e.jpg"
    },
    {
        "podcast_id": 206658,
        "title": "La Cábala Con Rab Moshe Bendahan ",
        "description": "<p>Canal Dedicado al crecimiento espiritual según la Cábala. Expliciones y Disertación del Rabino Moshe Bendahan ,Rabino principal de las comunidades Israelitas de España.</p><p>Disfruta de nuestros cursos gratuitos de zoom. Inscríbete en el correo Por favor enviar su número de WhatsApp y nombre <a href=\"mailto:crecerencabala@gmail.com\">crecerencabala@gmail.com</a></p><p>YouTube: https://www.youtube.com/@LaCabalaconRabMosheBendahan</p>",
        "language": "es",
        "author_name": "Rab Moshe Bendahan ",
        "slug": "la-cabala-con-rabmoshebendahan",
        "cover": "20230709_110739_aae8d533dd411d3ca9e2e457d503ea4f.jpg"
    },
    {
        "podcast_id": 206804,
        "title": "Hasta la igualdad y más allá",
        "description": "<p>En este programa abordaremos la diversidad funcional con la ayuda de la prima de Raquel, una de nuestras webmasters. Laura Viciano nos contará sus experiencias dentro de la organización de la ONCE, concretamente cómo trabaja dentro de un centro donde ayudan a las personas a incorporarse al mundo laboral.</p>",
        "language": "es",
        "author_name": "Hasta la igualdad y más allá",
        "slug": "hastalaigualdad",
        "cover": "20230502_030514_b529ca38f5226b5b97eecacf27666fc2.jpg"
    },
    {
        "podcast_id": 206887,
        "title": "Real Estate for Life",
        "description": "<p>Be prepared to succeed in real estate! Real Estate Professionals Denise Fuller and Raymond Rees believe it's important for everyone to have a trusted real estate agent by their side for life. They want their clients and anyone else interested to be THE MOST KNOWLEDGEABLE. Talking regularly with brokers, agents, clients, and staying on top of current news, they share their knowledge and expertise in this weekly podcast. #real estate #northern virginia real estate</p>",
        "language": "en",
        "author_name": "Home Estate Realty, Inc.",
        "slug": "homeestaterealty",
        "cover": "20230901_080912_c344756f6898ba08a397ae2d4d67898e.jpg"
    },
    {
        "podcast_id": 207804,
        "title": "Driven In Purpose",
        "description": "<p>This podcast is about getting to know kingdom-minded individuals who are driven in purpose as well as those who are just discovering their drive. Through these discussions, you will receive divine guidance on how to discover your purpose in God and how to be driven by it!</p>",
        "language": "en",
        "author_name": "Alice M. Robinson",
        "slug": "driveninpurpose",
        "cover": "20230507_060542_86a419c061670da35e35c6a12ba08503.jpg"
    },
    {
        "podcast_id": 208859,
        "title": "Interpreting the Word of God",
        "description": "<p>Dr. De Leon discusses various scriptures found in both the OT/NT, paying special attention to both the setting and background in biblical times, as well as how the scriptures apply to us in our daily lives.</p>",
        "language": "en",
        "author_name": "Dr. Joel De Leon",
        "slug": "interprettheword",
        "cover": "20230512_070557_8e6c4b2775b557a9d3ffb5679daeb353.jpg"
    },
    {
        "podcast_id": 209780,
        "title": "Sigma Tau Delta Midwest Regional News",
        "description": "<p>Your Midwestern Region Student Representatives Gabrielle Harden and DeAni Blake-Britton go over recent national events, news, and Wordy by Nature blog posts as well as more local information, highlighting Midwestern chapters and events! Tune in for a new way to connect to Sigma Tau Delta and get to know your student leadership. </p><p>If you have any feedback, suggestions for regional events, or chapters that you'd like to bring tot our attention, you can email either of us at <a href=\"mailto:mwsr@wordybynature.org\">mwsr@wordybynature.org</a> or <a href=\"mailto:mwasr@wordybynature.org\">mwasr@wordybynature.org</a>. </p><p><a href>See your 23-24 student leaders here!</a></p><p><em>This podcast will only be in use for the 2023-2 academic year.</em></p>",
        "language": "en",
        "author_name": "Elle Hardoin",
        "slug": "sigmataudelta-news",
        "cover": "20230517_100515_0ac1fdf183accff52869388c635dba8c.jpg"
    },
    {
        "podcast_id": 209987,
        "title": "التأطير المفتوح",
        "description": "<p>التأطير المفتوح مبادرة للمساهمة في التأطير الأكاديمي لطبلة الدكتوراه داخل الجامعات الجزائرية عبر لقاءات دورية عن بعد، نناقش فيها أبجديات البحث العلمي ومواضيع لها علاقة بمسار الدكتوراه.</p><p>بودكاست التأطير المفتوح هو ملخص لما يحدث في تلك اللقاءات.</p>",
        "language": "ar",
        "author_name": "Oussama Metatla",
        "slug": "open-supervision-podcast",
        "cover": "20230518_100513_ff4a9a493edbf395fa47b340db952059.jpg"
    },
    {
        "podcast_id": 210260,
        "title": "EDEM 6629 Micro Lectures",
        "description": "<p>Greetings everyone and welcome to EDEM 6629.</p>",
        "language": "en",
        "author_name": "Lillian Reeves",
        "slug": "edem6629",
        "cover": "20230519_050509_7ed1841aac4760d291ee3db3b6e55b41.jpg"
    },
    {
        "podcast_id": 211591,
        "title": "CRR Podcast",
        "description": "<p>Discussion on the Benefits and Uses of Construction Products</p>",
        "language": "en",
        "author_name": "Corrosion Resistant Reinforcing",
        "slug": "crrpodcast1",
        "cover": "20230526_030520_7d8a1802ae886efb01374cfb9188cc81.jpg"
    },
    {
        "podcast_id": 211661,
        "title": "Pickup Music Pod for Guitarists",
        "description": "<p>Weekly pod for guitarists from Pickup Music, the #1 online guitar learning platform, with Sam Blakelock (co-founder) and Karl Kerfoot (Head of Education).</p><p><a href=\"https://pickupmusic.com/\">https://pickupmusic.com/</a></p>",
        "language": "en",
        "author_name": "Pickup Music",
        "slug": "pickupmusic-pod",
        "cover": "20230526_090536_09c9f1dc1c73f0d25a27750c3609eb2b.jpg"
    },
    {
        "podcast_id": 211716,
        "title": "Empowered Living Podcast",
        "description": "<p>Welcome to the \"<strong>Empowered Living</strong>\" podcast!</p>",
        "language": "en",
        "author_name": "Dr. Sophia Khousadian",
        "slug": "drsophiakhousadian",
        "cover": "20230527_060501_d3025a493337630572a81cec176cc812.jpg"
    },
    {
        "podcast_id": 213250,
        "title": "La historia del paradigma",
        "description": "<p>Somos tres estudiantes de psicología queriendo compartir sus conocimientos respecto a los paradigmas y los métodos de investigación en los que se puedan llegar a encontrar.</p>",
        "language": "es",
        "author_name": "Mariana Morales Morales, Ximena Correa Romero y Nathaly Hendren Hernandez",
        "slug": "historiadelparadigma",
        "cover": "20230605_050643_06db2854c6f6dce9f360f52328b9e0b4.jpg"
    },
    {
        "podcast_id": 213476,
        "title": "Training Lab - Italia",
        "description": "<p>Con il nostro aiuto hai libero accesso alle migliori informazioni esclusivamente basate sulle ultimissime evidenze scientifiche, sotto forma di Podcast della durata di 10 minuti, da poter consultare come e quando vuoi.</p>",
        "language": "it",
        "author_name": "Training Lab - Podcast",
        "slug": "traininglab",
        "cover": "20230606_090645_1d768cbd261ece1e62e3e9cec703c2c2.jpg"
    },
    {
        "podcast_id": 213860,
        "title": "Docentes Innovadores!!",
        "description": "<p>Hola, Bienvenidos a Docentes innovadores </p>",
        "language": "es-mx",
        "author_name": "ara",
        "slug": "podara1",
        "cover": "20230617_050653_b9336bd70244faf789dad7d4946b3493.jpg"
    },
    {
        "podcast_id": 213991,
        "title": "Mandarwin - Mandarin with Edwin (跟Edwin一起学汉语)",
        "description": "<p>Belajar Bahasa Mandarin untuk keseharian</p>",
        "language": "id",
        "author_name": "Edwin Kurnia Reswara",
        "slug": "mandarwin",
        "cover": "20230608_060608_6d5348730ff67a8f4a4735d9b38000f0.jpg"
    },
    {
        "podcast_id": 214372,
        "title": "Viralmente Hablando",
        "description": "<p>Un ratito en el que hablaremos de Redes Sociales y donde juntos, le vamos a dar forma a tus perfiles de internet con una buena base, con la que conseguirás llegar a todas esas personas que te encantaría que te escuchasen. Sin humo. Aquí sólo se habla de lo que funciona realmente. Si estás leyendo esto, estás un pasito más cerca de llegar a tu objetivo en redes. ¿Seguimos caminando? </p>",
        "language": "es",
        "author_name": "Vanessa Garcia",
        "slug": "viralmentehablando",
        "cover": "20230610_050649_c6c15365bc040f63569a5b9c421f1a00.jpg"
    },
    {
        "podcast_id": 215444,
        "title": "Organisational Transformation",
        "description": "<p>Dive deep into this 7-episode podcast on how to sustain organisational-wide transformation successfully. Based on over 25 years of a practitioner's hands-on experiences and insights. Challenging conventional change theory and unearth methods adopted by top organisations globally.</p>",
        "language": "en",
        "author_name": "Shu-Tze",
        "slug": "sustainableorg-widetransformation",
        "cover": "20230618_100603_2b386bcc44f10053b0a2df96754ee1d7.jpg"
    },
    {
        "podcast_id": 216174,
        "title": "LIVE IAM MINISTRIES LLC",
        "description": "<p>The Book of Revelation Chapter 6 </p><p>Episode 5</p>",
        "language": "en",
        "author_name": "April Clark",
        "slug": "liveiamministriesllc",
        "cover": "20230621_120646_bc626b480f06d24fb49e592597d14d95.jpg"
    },
    {
        "podcast_id": 216209,
        "title": "Talk Through Student Podcast",
        "description": "<p>Halo dan selamat datang di Talk Yhrough Student Podcast (bisa disingkat TTSP). Melalui podcast ini kita akan membahas tentang teknik penanaman yg menggunakan metode hidroponik yg efisien dan juga menghemat ruang. Pada episode episode TTSP ini kita akan mengeksplorasi dan mengetahui aspek aspek yg penting dalam metode hidroponik ini</p>",
        "language": "id",
        "author_name": "Kelompok 5 p5",
        "slug": "talkthroughstudentpodcast",
        "cover": "20230621_050659_87887e8d64874841f794fb02b8c96aaa.jpg"
    },
    {
        "podcast_id": 216220,
        "title": "Podcast Figuras Tutoriales y Perfil del Tutor",
        "description": "<p><strong>TEMA: LAS FIGURAS TUTORIALES Y EL PERFIL DEL TUTOR</strong></p><p>OBJETIVO: Identificar las figuras tutoriales así como las diferentes actividades que realiza un tutor, tanto en la tutoría individual como en la grupal y de pares así como qué tipo de apoyos requiere cada tutorado.</p><p>Se comenta en torno a la figura tutorial, los programas académicos y sobre trámites y servicios disponibles en el IPN. También de la canalización a los estudiantes del IPN a las dependencias politécnicas que les pueden brindar atención ante alguna problemática y su orientación en relación a las habilidades de estudio, dificultades y dudas con respecto a su trayectoria académica, de situaciones sociales, familiares e incluso de salud.</p>",
        "language": "es-mx",
        "author_name": "REFUGIO HERNÁNDEZ",
        "slug": "las-figuras-tutoriales-y-el-perfil-del-tutor",
        "cover": "20230621_060656_a6969d5f11277e45def2f895208ce0d3.jpg"
    },
    {
        "podcast_id": 216387,
        "title": "BUILDING HEROes ",
        "description": "<p>This year’s podcast series will revolve around the successful operation of buildings and all those involved in making that process happen. This includes the operation, maintenance, energy management, and controls within a building. We have an exciting lineup of experts in the industry to discuss these key components of building operations. Check them out!</p>",
        "language": "en",
        "author_name": "Julia K. Day",
        "slug": "buildingheroespodcast",
        "cover": "20230622_080609_c9f7e0bac7fbbcb817482be88c3406a1.jpg"
    },
    {
        "podcast_id": 216735,
        "title": "Cenas do Futuro",
        "description": "<p>Não sabes o que fazer para o resto da vida? Ainda não descobriste a tua cena para o futuro? Então este Podcast é para ti. Deixa-te de rodeios e vem saber o que te espera!</p>",
        "language": "pt-pt",
        "author_name": "Beatriz Roldão",
        "slug": "cenasdofuturo",
        "cover": "20230625_120631_37f4187557df92b5c631f3123ddce438.jpg"
    },
    {
        "podcast_id": 216744,
        "title": "ROMarkable",
        "description": "<p>This is podcast is for educational purposes only.</p>",
        "language": "en",
        "author_name": "Romulo Belen Jr.",
        "slug": "romarkable",
        "cover": "20230625_020632_4def530e4a782aa1b438eae24311a2d0.jpg"
    },
    {
        "podcast_id": 217202,
        "title": "Aliya Yomi",
        "description": "<p>Learn an Aliya a day in 10 minutes.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "aliyayomi",
        "cover": "20230628_030640_f1047d11369840dbae16825f15b42b38.jpg"
    },
    {
        "podcast_id": 217223,
        "title": "Nach Yomi",
        "description": "<p>Learn all the 742 chapters of Nach at 10 minutes a day.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "nachyomi",
        "cover": "20230628_070619_346c76225389b9369fc0170f95449afe.jpg"
    },
    {
        "podcast_id": 217235,
        "title": "Epilogues - Understanding the Weekly Haftorah",
        "description": "<p>Take. few minutes to understand the most overlooked part of our Shabbos morning.</p>",
        "language": "en",
        "author_name": "Rabbi Ya'akov Trump",
        "slug": "epilogues",
        "cover": "20230628_080601_744fe9d9def2686502487e5dd99bfd57.jpg"
    },
    {
        "podcast_id": 217416,
        "title": "Trade up with TJ",
        "description": "<p>Talking all things health, wealth, business &amp; lifestyle with your host Tyler Joosten.</p><p>My mission is to create a culture where tradies have a great balance of being disciplined &amp; tough but also emotionally intelligent so they can embrace change.</p><p>follow along on instagram - tradeup_withtj</p><p><a href=\"https://www.instagram.com/tradeup_withtj/\">https://www.instagram.com/tradeup_withtj/</a></p><p><a href=\"https://www.buymeacoffee.com/tradeupwithtj\">https://www.buymeacoffee.com/tradeupwithtj</a></p>",
        "language": "en",
        "author_name": "Tyler Joosten",
        "slug": "tradeup-withtj",
        "cover": "20230630_030652_da8343a2c1a6f05218b930394f33fc7a.jpg"
    },
    {
        "podcast_id": 217648,
        "title": "Enfermedad Granulomatosa Crónica_ Cristy Arriola",
        "description": "<p>Podcast sobre las inmunodeficiencias primarias de anticuerpos</p><p>Cristy Arriola </p>",
        "language": "es-mx",
        "author_name": "Cristy Arriola",
        "slug": "enfermedadgranulomatosacronicaporcristya",
        "cover": "20230701_100733_bbd9f1283093f1d2ef0ab5fb95a50f22.jpg"
    },
    {
        "podcast_id": 217858,
        "title": "مقالات باسين",
        "description": "<p>علوم، تاريخ، ثقافة</p>",
        "language": "ar",
        "author_name": "Yassin Khadraoui",
        "slug": "maqalatyassin",
        "cover": "20230703_060748_a01e456315b63cde396d514eddd9a872.jpg"
    },
    {
        "podcast_id": 218213,
        "title": "L&D Lightning Talks",
        "description": "<p>Multi-cultural training challenges</p>",
        "language": "en",
        "author_name": "www.bigdatatrunk.com",
        "slug": "multi-cultural-training-challenges",
        "cover": "20230706_080742_02290fc52b4929cbb9a1fcfd8888ccb1.jpg"
    },
    {
        "podcast_id": 218353,
        "title": "Podcast Bareng Dosen FB UKDW!",
        "description": "<p>Podcast seputar obrolan ringan bersama dosen fakultas Bisnis UKDW</p><p>.</p><p>.</p><p>Banyak hal yang akan dibahas mulai dari topik seputar akademis mapun non akademis</p>",
        "language": "id",
        "author_name": "Fakultas Bisnis UKDW",
        "slug": "fbukdw",
        "cover": "20230707_030704_18e798b644298b53389ba13b3e16d084.jpg"
    },
    {
        "podcast_id": 218785,
        "title": "MEDICAST - La voce dell'assistenza",
        "description": "<p>Il podcast di Margotta Medical: azienda che offre prodotti digitali e servizi per l'ambito sanitario &amp; socio-sanitario.</p><p>Questo podcast è dedicato al personale delle strutture socio-sanitarie e a tutti gli appassionati di temi sanitari.</p>",
        "language": "it",
        "author_name": "Margotta Medical",
        "slug": "margottamedical",
        "cover": "20230710_030709_cf87030724bfcdf913bb6f8c7aadda83.jpg"
    },
    {
        "podcast_id": 218829,
        "title": "Importancia de los derechos",
        "description": "<p>Amplitud de conocimiento para la vida diaria</p>",
        "language": "es",
        "author_name": "Luz Ruiz",
        "slug": "derechos-luz05",
        "cover": "20230710_070734_5ebbc4fb1ac85e7aacbc75ca14c3f879.jpg"
    },
    {
        "podcast_id": 219057,
        "title": "Doctorando con Tecnologías",
        "description": "<p>Las ventajas de las Tecnologías de la Información y Comunicaciones en la esfera Social y Familiar.</p>",
        "language": "es",
        "author_name": "Equipo Ventajas de las TIC en lo social y familiar",
        "slug": "esferasocialyfamiliar",
        "cover": "20230712_030706_eabb7d6d2d496cd271ebae3de7826010.jpg"
    },
    {
        "podcast_id": 219745,
        "title": "Actividad 2. Podcast colaborativo (entrevista) por FABIÁN FERNANDEZ SALDIVAR",
        "description": "<p><strong>Agradezco a los asesores académicos que me permitieron entregar esta actividad de forma individual debido a las complicaciones que experimenté a lo largo de la semana.</strong></p>",
        "language": "es",
        "author_name": "Fabián Fernández Saldívar",
        "slug": "fabianuiexpro",
        "cover": "20230716_100729_1cbd6e922438b71a7b378a320d6e8728.jpg"
    },
    {
        "podcast_id": 219833,
        "title": "You've Got This ",
        "description": "<p>\"You've Got This\" with StudentLoop UK is a dynamic and insightful podcast dedicated to addressing the challenges and triumphs that students face during their academic journey. Hosted by the enthusiastic and empathetic team at StudentLoop UK, each episode features engaging discussions, practical advice, and inspiring stories to support and uplift students throughout their educational pursuits.</p><p>With a focus on mental health, study tips, career guidance, and personal development, \"You've Got This\" provides a comprehensive and holistic approach to student life. Whether you're struggling with exam stress, seeking effective study techniques, or navigating the complexities of university life, this podcast offers valuable insights and encouragement to help you overcome obstacles and reach your full potential.</p><p>Through guest interviews, expert opinions, and real-life experiences, the StudentLoop UK team creates a warm and inclusive space where students can connect, relate, and find reassurance in knowing they are not alone in their challenges. With a strong emphasis on self-care and mental well-being, the podcast also aims to equip listeners with the tools and resources they need to maintain a healthy balance between academic success and personal growth.</p><p>Tune in to \"You've Got This\" with StudentLoop UK and join Jennifer and the team as they navigate the ups and downs of student life, offering support and inspiration every step of the way. Whether you're a high school student, university undergraduate, or postgraduate, this podcast is your ultimate companion in making the most of your educational journey and embracing the exciting possibilities that lie ahead.</p>",
        "language": "en",
        "author_name": "StudentLoop UK",
        "slug": "youvegotthis",
        "cover": "20230717_010713_76eef646a3d3af32fa53906f9b110a94.jpg"
    },
    {
        "podcast_id": 220052,
        "title": "Episode 1 - Introducing Impersonations Atlanta",
        "description": "<p>This podcast will cover the details some details about Impersonations Atlanta and what the agency does and provides to clients.</p>",
        "language": "en",
        "author_name": "Anthonia Berry",
        "slug": "impersonationsatlanta",
        "cover": "20230724_120752_c95ad169340113545ae8ee8b204cfd4c.jpg"
    },
    {
        "podcast_id": 220119,
        "title": "Meditantes PodCast",
        "description": "<p>Meditação sem fronteiras.</p>",
        "language": "pt-br",
        "author_name": "Meditantes Podcast",
        "slug": "meditantespodcast",
        "cover": "20230719_120713_02fb97243336b70975ccc0ae5f316940.jpg"
    },
    {
        "podcast_id": 220173,
        "title": "Divine Justice: Understanding the Courts of Heaven",
        "description": "<p><strong>What is the Court of Heaven? The Court of Heaven is a place in the Spiritual dimension where you can approach God as the Righteous Judge to receive a judgement on the evil activities, transactions, agreements and promises that exist in your generational lineage long before you were born.  Verdicts rendered in the Court of Heaven help to restore your legal rights for God to invade the earth to dissolve all false allegations and accusations made against you. My teachings on the Court of Heaven are intended to help the listener deepen their understanding of the process, procedures and areas of our lives which would bring a petitioner/Believer to God's Courtroom.</strong></p>",
        "language": "en",
        "author_name": "Dr. Cheroll Dossett, MBA/M.Ed.",
        "slug": "divinejustice",
        "cover": "20230719_080742_e860cdaaabe556f73aea763a5acc2a60.jpg"
    },
    {
        "podcast_id": 220204,
        "title": "AMONG US",
        "description": "<p>Dibawakan khas oleh Panitia Pendidikan Islam SMK Pekan Telipok dengan kerjasama pelajar SMK Pekan Telipok yang bijak, cerdik dan ambitious.</p><p>Untuk siri yang pertama ini, Panitia Pendidikan Islam telah memilih 5 orang pelajar dari setiap tingkatan untuk mengkaji bagaimana kerjasama antara dua masa yang berbeza dijalankan. Selaras dengan itu, apakah pendapat yang bakal dihuraikan di dalam podcast ini? Check out this podcast to find out more!</p><p>Podcasters :</p><p>Mash - Tingkatan 5</p><p>Muaz - Tingkatan 4</p><p>Came - Tingkatan 3</p><p>Sakinah - Tingkatan 2</p><p>Aftha - Tingkatan 1</p>",
        "language": "en",
        "author_name": "Ustazahnurulhamimi",
        "slug": "amongusptkms",
        "cover": "20230719_110728_b5198f94cd934c7ff1b2692c68ea0d0b.jpg"
    },
    {
        "podcast_id": 220856,
        "title": "Vox Criminalis ",
        "description": "<p><a href=\"https://www.facebook.com/hashtag/oficialfaoc?__eep__=6&amp;__cft__[0]=AZUWUn_hp94TO9LlCY17AqS_YZjZtdG1vXOkd4nqWR0U2CV87-brXzpaxTkqvctvpl3tE01Oz00LW1jnOpih7f7KmHcrcTXOTRv0Vw1LesQHhNDXqVPn2SzGrqJGaXiFEuoSh-k78asXPP_Pwrd_tSYtf1MrAHHsXORBnqfBb-CD1qE0bHBau-Xs6ndox5ciV6k&amp;__tn__=*NK-R\">#</a>PÓDCAST🎙️ | ¡Hola a todxs! Les damos la bienvenida a Vox Criminalis, un espacio donde exploraremos, aprenderemos y debatiremos sobre el fascinante campo del Derecho Penal, Procesal Penal y ramas afines. Este será el lugar para inspirar, cuestionar y reflexionar en compañía de destacadxs ponentes, quienes enriquecerán nuestras mentes y nos ayudarán a alcanzar la excelencia académica, profesional y personal.</p><p>¡Los invitamos a seguir nuestros canales de difusión!¡Gracias por su atención!🎊</p>",
        "language": "es",
        "author_name": "Vox Criminalis",
        "slug": "voxcriminalis",
        "cover": "20230726_030706_046e2243cf48a7718e995a4682e170da.jpg"
    },
    {
        "podcast_id": 220965,
        "title": "Forty Hadith of Imam Nawawi – Pearls of the Prophet",
        "description": "<p>Get ready to be captivated by the hidden treasures of the hadith sciences as we uncover their importance and relevance in the modern world. Don't miss out on this opportunity to enrich your understanding of Islamic tradition and gain insights into a realm of knowledge that will leave you truly inspired. Tune in now to Sheikh Akram Nadwi's illuminating course on hadith interpretation and practice.</p>",
        "language": "en",
        "author_name": "Cambridge Islamic College",
        "slug": "cichadith",
        "cover": "20230724_080730_ca84d0ffced5d0535b725a4e45b027a9.jpg"
    },
    {
        "podcast_id": 221006,
        "title": "Daebak | BAK FEB UNDIP",
        "description": "<p>Selamat datang di Podcast Dialog Asique nya BAK Merupakan sebuah podcast dari Badan Audit Kemahasiswaan (BAK) FEB Undip berupa obrolan santai dan ringan yang akan menemani teman teman semua dimana pun dan kapan pun</p><p>.------------</p><p>Instagram : @bak_febundip</p><p>Line : @pgk0014h</p><p>Twitter : @bak_febundip</p><p>#UpgradeOurQuality</p><p>#RaihTransparansi</p>",
        "language": "en",
        "author_name": "BAK FEB UNDIP",
        "slug": "podcastdaebakfebundip",
        "cover": "20230725_020726_aae9af2c94678f8d361b15396d6c6205.jpg"
    },
    {
        "podcast_id": 221405,
        "title": "BSTC",
        "description": "<p><strong>Best teaching of note bstc corse</strong></p>",
        "language": "en",
        "author_name": "Nandkisho ",
        "slug": "nandkishor",
        "cover": "20230727_040752_2df63a076755ae57c912b925d9c2115b.jpg"
    },
    {
        "podcast_id": 221485,
        "title": "NURS 2001: Reflective Podcast Summary",
        "description": "<p>Palliative</p><p>Mental Health &amp; Addiction</p><p>Culturally Safe Healthcare</p><p>Women's Health</p><p>Leadership</p>",
        "language": "en",
        "author_name": "Kaitlynn Russell",
        "slug": "nursekaitlynn",
        "cover": "20230728_060725_36cab262e2667aeb18ad24089d6a5e7c.jpg"
    },
    {
        "podcast_id": 221575,
        "title": "Improving the Student Experience Using Quality Matters",
        "description": "<p>Drawing on their experience as participants in West Chester University's Quality Matters (QM) program, Dr. Julie Nair and Dr. Megan Mraz share their perspectives on how QM positively impacted the student experience in the RN to BSN program and the efforts they undertook to earn course and program design certification.</p>",
        "language": "en",
        "author_name": "Julie McCulloh Nair & Megan Infanti Mraz",
        "slug": "studentexperiencewithqualitymatters",
        "cover": "20230728_050739_2e48507a9bbdf70e90392c16ecb85464.jpg"
    },
    {
        "podcast_id": 221918,
        "title": "How To Begin Your Career In Voice-Over",
        "description": "<p>The preparation demanded to compete professionally in Voice-Over.</p>",
        "language": "en",
        "author_name": "Joseph Dean Coburn",
        "slug": "american-voiceover",
        "cover": "20230731_090705_1de3d0ad1b690e1999f3107c06b45aad.jpg"
    },
    {
        "podcast_id": 222135,
        "title": "I Wasn't Prepared For This...",
        "description": "<p>A podcast for educators about managing everyday classroom occurrences from the Student Support Services team of Conroe ISD.</p>",
        "language": "en",
        "author_name": "Conroe ISD Student Support Services",
        "slug": "cisdsss",
        "cover": "20230801_050815_110b51352ccbc09e484e49a17c1e8b16.jpg"
    },
    {
        "podcast_id": 222324,
        "title": "Основи авторського права в креативних індустріях",
        "description": "<p><strong>«Основи авторського права в креативних індустріях»</strong> — це чудовий оглядовий онлайн-курс для всіх учасників ринку креативних індустрій, від фахівців до працедавців. Він створений за участі Національного офісу інтелектуальної власності та інновацій. На ньому ми розповімо: які права мають автори, як їх захищати, як працювати з NDA, як не порушувати права інших представників ринку і що робити, коли стикаєтесь з плагіатом.</p>",
        "language": "uk",
        "author_name": "CASES",
        "slug": "copyright",
        "cover": "20230802_060811_75342fbbdae81e7ea79e83340a3f6841.jpg"
    },
    {
        "podcast_id": 222641,
        "title": "Sweet Success Society",
        "description": "<p>Biblical Success Principles, Personal Leadership &amp; Development</p>",
        "language": "en",
        "author_name": "Simone Smart",
        "slug": "sweetsuccesssociety",
        "cover": "20230805_020845_d31910bbbebc92ce2f35e9ed3e8cc2a1.jpg"
    },
    {
        "podcast_id": 222677,
        "title": "Education Kite",
        "description": "<p>Education should be accessible to all. My podcast discusses education in our society.</p>",
        "language": "en",
        "author_name": "Lyndsay Conroy",
        "slug": "educationkite",
        "cover": "20230805_030854_c21e4840b9aeaa05924a8ec02530f58c.jpg"
    },
    {
        "podcast_id": 223003,
        "title": "U of U Wellness Talks",
        "description": "<p>Welcome to the trailer episode of \"U of U Wellness Talks,\" a transformative podcast series brought to you by the Center for Campus Wellness! </p><p>In this short teaser, we'll provide you with a glimpse of what's in store for the upcoming season. Expect thought-provoking discussions with expert guests, and practical tips to enhance your overall well-being.</p><p>Our wellness experts will delve into topics such as stress management, harm reduction, safer party culture, mental health, cultivating healthy habits, and much more. </p><p>Join us as we ignite the flame of wellness within you. Stay tuned for the full episodes, where we'll empower you with knowledge, inspiration, and motivation to embark on your own wellness journey. Remember, small changes can lead to significant transformations!</p><p>Subscribe now and be ready to elevate your well-being with \"U of U Wellness Talks\" from the University of Utah. Let's walk together on this path of self-discovery and empowerment!</p>",
        "language": "en",
        "author_name": "Center for Campus Wellness ",
        "slug": "uofuwellnesstalks",
        "cover": "20230807_080807_83e1deeea5f8fedea5647dd517386ee2.jpg"
    },
    {
        "podcast_id": 223222,
        "title": "Exploring Ethical Considerations of Technology in the Classroom",
        "description": "<p>Exploring Ethical Considerations of Technology in the Classroom</p><p>Welcome to Exploring Ethical Considerations of Technology in the Classroom, the podcast where we discuss the critical issues influencing education today. In this episode, we'll talk over the ethical concerns and duties that come with using technology in the classroom. We'll look at the complications of incorporating technology while maintaining a safe and fair learning environment, from student privacy to digital citizenship.</p><p>Our journey begins with one important consideration: student privacy. Students' personal and sensitive data are more at risk as technology is integrated into schooling. Data breaches have prompted worries about how schools and educational technology businesses protect this information. It is not only about learning.</p><p>However, ethical considerations go beyond facts. The digital world introduces new problems to kid safety and well-being. The impact on students' mental and emotional health cannot be overstated as they spend more time online. Educators are now in charge of creating a safe digital environment and teaching kids appropriate digital habits.</p><p>Speaking of habits, let's move on to digital citizenship. Understanding ethical online behaviour is critical in an age of constant connectivity. Educators must help kids navigate the digital realm responsibly, from proper netiquette to addressing the negative aspects of online interactions like cyber bullying and misinformation.</p><p>Now, let's talk about a problem that extends beyond behaviour and impacts on social equality. Although technology provides limitless educational materials, what if not every student has equal access? The digital divide raises ethical concerns regarding how to provide equitable opportunities for all students, regardless of background.</p><p>One thing becomes evident as we traverse these difficult ethical considerations: the need for partnership. Parents, guardians, communities, and policymakers must all be included in the discussion. In order to resolve issues, promote responsible technology use, and develop ethical principles for technology integration, inclusivity and transparent communication are required.</p><p>Addressing ethical issues in technology helps me as an educator to establish a responsible and ethical digital learning environment. It enables them to assist students in safely and ethically navigating the digital realm.</p><p>exploring these consequences with students empowers them to be thoughtful and informed digital citizens. It gives students the tools they need to interact with technology in ways that improve their learning, personal development, and future interactions in the digital world.</p><p>Finally, knowing and debating the ethical issues of technology use in education benefits both educators and students' digital literacy. It enables instructors to successfully guide students and trains them to engage with technology responsibly, building a healthy and ethical digital society.</p>",
        "language": "en",
        "author_name": "Damon Masukume",
        "slug": "digitalliteracypodcast",
        "cover": "20230809_030836_56c51f90621c95d6becdfefd5669f1ba.jpg"
    },
    {
        "podcast_id": 223421,
        "title": "بودكاست مع محمود لين ",
        "description": "<p>حابي اشكرك على اهتمامك، في البودكاست دا ح نناقش فيهو عدد من مواضع التنمية البشرية والتطوير الذاتي والمشاريع... </p><p>كمان ح نستضيف عدد من الضيوف في الحلقات القادمة اتمنى ليك متابعة طيبة</p>",
        "language": "ar",
        "author_name": "محمود لين ",
        "slug": "withmahmoudleen",
        "cover": "20230810_100801_5eef69e3319d709bea4840f0396fbe1e.jpg"
    },
    {
        "podcast_id": 223988,
        "title": "WISE-R Financial Podcast",
        "description": "<p>W- wealth</p><p>I- Investments </p><p>S- Savings </p><p>E- Earnings</p><p>R - Retirement </p>",
        "language": "en",
        "author_name": "Wise-R Financial Therapy Pod",
        "slug": "wiserfinancialtherapypod",
        "cover": "20230814_080815_0c85eb7b756601e634d80c5a7c7557de.jpg"
    },
    {
        "podcast_id": 224048,
        "title": "The Polished Presence",
        "description": "<p>Whether you're a business professional, entrepreneur, public speaker, or simply someone seeking personal growth, \"The Polished Presence Podcast\" is your compass to mastering the art of presence. Subscribe now to embark on a transformative journey that empowers you to radiate confidence, create impact, and achieve unparalleled success.</p><p>Let your polished presence become your signature asset. Tune in to \"The Polished Presence Podcast\" and unlock the secrets to becoming an influential force in your sphere.</p>",
        "language": "en",
        "author_name": "Erika Sherek",
        "slug": "thepolishedpresence",
        "cover": "20230814_050836_6785f8e25d26008eeaba8d74a47b5d38.jpg"
    },
    {
        "podcast_id": 224109,
        "title": "Outside The Mind",
        "description": "<p>“Outside The Mind” is a next generation podcast where two high minded individuals along with guest speakers discuss topics beyond human belief.</p>",
        "language": "en",
        "author_name": "Logang & Choo Choo Train",
        "slug": "outsidethemind",
        "cover": "20230819_080800_80fbd2330af4a8596798a83a55d66e0c.jpg"
    },
    {
        "podcast_id": 224178,
        "title": "Fastex Academy",
        "description": "<p><strong>Welcome to the Fastex Academy Web3 Education Podcast! 🎓🌐</strong></p><p>Dive into the dynamic world of Web3 with our captivating podcast series brought to you by Fastex Academy. Whether you're a curious newcomer or a seasoned enthusiast, we've got your educational journey covered. Join us as we explore the fascinating realms of blockchain, cryptocurrency, metaverse, DeFi, NFTs, and all things Web3-related.</p><p>🔊 <strong>Why Tune In?</strong></p><p>Embark on a knowledge-packed adventure that demystifies the complex landscape of Web3 technologies. Our podcast is designed to be your compass, guiding you through the ever-evolving universe of decentralized innovation. From the fundamentals to advanced concepts, our episodes are crafted to cater to all levels of expertise.</p><p>💡 <strong>What to Expect</strong></p><p>Prepare for thought-provoking discussions, insightful interviews, and comprehensive breakdowns of key topics. Our expert hosts will unravel the intricacies of blockchain technology, offer clarity on the crypto craze, and provide you with a front-row seat to the revolutionizing power of NFTs. Stay ahead of the curve by exploring decentralized finance (DeFi) and discovering the limitless possibilities of the metaverse.</p><p>🎙️ <strong>Engaging Conversations</strong></p><p>Tune in to hear engaging conversations with leading experts, industry pioneers, and visionaries who are shaping the future of Web3. Our guests will share their experiences, insights, and predictions, giving you unparalleled access to firsthand knowledge in this rapidly evolving ecosystem.</p><p>🌟 <strong>Why Fastex Academy?</strong></p><p>At Fastex Academy, we're committed to delivering top-notch education in a friendly and approachable manner. We understand that the Web3 landscape can seem daunting, but our podcast breaks down complex concepts into bite-sized pieces that everyone can digest. We're your learning companion, your bridge to understanding, and your trusted source for staying informed.</p><p>🔔 <strong>Stay Updated</strong></p><p>Subscribe to our podcast to ensure you never miss an episode! Stay updated on the latest trends, breakthroughs, and innovations in the Web3 space. Whether you're on your morning commute, hitting the gym, or simply relaxing, our podcast is your portal to continuous learning.</p><p>Join us on this thrilling journey as we unravel the mysteries of Web3 and empower you to thrive in this exciting new era. Fastex Academy's Web3 Education Podcast - where knowledge meets innovation, and curiosity meets clarity.</p>",
        "language": "en",
        "author_name": "Fastex Academy",
        "slug": "fastex-academy",
        "cover": "20230816_120817_38d69f4594ed862e3504f8dde3f88f3e.jpg"
    },
    {
        "podcast_id": 224239,
        "title": "Prohibiciones y Obligaciones del empleador y trabajador ",
        "description": "<p>Tanto el empleador como el trabajador tienen obligaciones y prohibiciones específicas en el entorno laboral ecuatoriano.</p><p>Cumplir con estas obligaciones y respetar estas prohibiciones es crucial para mantener una relación laboral justa y equitativa.</p>",
        "language": "es-mx",
        "author_name": "Prohibiciones y Obligaciones del trabajador y empleador ",
        "slug": "formacion-y-orientacion-laboral",
        "cover": "20230815_070802_0ac96690b2e310e5e1d5afe66e45901d.jpg"
    },
    {
        "podcast_id": 224389,
        "title": "South University C7",
        "description": "<p>Clinical Medicine II Project</p>",
        "language": "en",
        "author_name": "South University C7",
        "slug": "sarcoidosis",
        "cover": "20230816_070825_f37729db7e84f9a04fd7470cf9424e4c.jpg"
    },
    {
        "podcast_id": 224669,
        "title": "Double Consciousness vs Rwandan and Kenyan Women",
        "description": "<p>This podcast examines the individual experiences that two students, Ella Bwonya and Holly Keza from Kenya and Rwanda respectively, have with W.E.B DuBois' concept of double consciousness. They will talk about how it affects their identities as Africans, immigrants in America and women in tech. </p>",
        "language": "en",
        "author_name": "Ella Bwonya",
        "slug": "ella-bwonya",
        "cover": "20230818_120820_5ec379e58632ae315361cd75d4f61880.jpg"
    },
    {
        "podcast_id": 224796,
        "title": "Origin and Development of Co-operation",
        "description": "<p>Origin and Development of Co-operation</p>",
        "language": "en",
        "author_name": "Shinoj",
        "slug": "cpshinoj",
        "cover": "20230819_080803_459af7fd8c04ba66834d581cd76201dd.jpg"
    },
    {
        "podcast_id": 224855,
        "title": "Innovación Educativa ",
        "description": "<p>Aprende que es la Innovación Educativa y 6 claves para ello </p>",
        "language": "es-mx",
        "author_name": "Ana Isabel García Robles",
        "slug": "innovaedu",
        "cover": "20230819_070836_88ab4ab45b2682b6de733ed38a9ffa96.jpg"
    },
    {
        "podcast_id": 224856,
        "title": "INNOVACIÓN Y TECNOLOGÍA APLICADAS A LA EDUCACIÓN",
        "description": "<p>Se comparten datos educativos enfocados al uso de la tecnología e innovación.</p>",
        "language": "es-mx",
        "author_name": "EVELYN GUTIÉRREZ AVALOS",
        "slug": "evelyngtz",
        "cover": "20230819_070816_a4d02c9f2a40eb1b813db7449d0a87a1.jpg"
    },
    {
        "podcast_id": 224858,
        "title": "Tecnologías del aprendizaje y el conocimiento TAC en nuestras vidas.",
        "description": "<p>En este podcast, explico a grandes rasgos como las TAC forman parte de nuestra vida diaria.</p>",
        "language": "es-mx",
        "author_name": "Carlos Marzoa",
        "slug": "marzmetal",
        "cover": "20230819_070841_ee55e6d88be8c557fd4e7bed7f816662.jpg"
    },
    {
        "podcast_id": 224861,
        "title": "Innovación aplicada para la educación \"TIC\"",
        "description": "<p>Hola a todos.</p><p>Sean bienvenidos a este podcast sobre Innovación aplicada para la educación</p><p>Les habla sandra nelly juarez hernandez Ing. en sistemas computacionales y es un placer para mi estar con ustedes y acompañarlos en este espacio.</p><p> </p><p>El desarrollo tecnológico a medida que pasan los años se ha vuelto indispensable tanto para la sociedad como para la educción para el progreso de nuestra sociedad se ha convertido en el alma y crecimiento de la humanidad</p><p>Las tic es decir Tecnologías de la Información y las Comunicaciones </p><p>Son una herramienta fundamental porque estamos en una era donde prevalecen las tecnologías y se encuentran en nuestra actualidad facilitando la vida de las personas.</p><p> </p><p>Las tics nos ayudan de una manera más fácil de procesar la información. De divulgar de una manera más eficaz y sencilla.</p><p> </p><p>Nos ayudan a los conocimientos en cuanto a crecimiento de habilidades, actitudes y destrezas en los estudiantes.</p><p> </p><p>Las  tics nos ayudan dentro de las clases habiendo cambios en la interacción del alumno con el docente</p><p> </p><p>¿Pero que podemos comprender como tic?</p><p>Son el conjunto de recursos, herramientas, equipos, programas informáticos, aplicaciones, redes y medios; que permiten la compilación, procesamiento, almacenamiento, transmisión de información como: voz, datos, texto, video e imágenes.</p>",
        "language": "es",
        "author_name": "Sandra Nelly",
        "slug": "sandranelly",
        "cover": "20230819_070833_0284163178eaae5071d2b8077914b8ce.jpg"
    },
    {
        "podcast_id": 224862,
        "title": "herramientas en la tecnologìa en la edicaciòn, TIC`S",
        "description": "<p>Evidencia de trabajo</p>",
        "language": "es-mx",
        "author_name": "carlos alberto juàrez hernñandez",
        "slug": "evidenicia-de-trabajo-tema-tic",
        "cover": "20230819_070835_ef3d0b207b317772b74a61f5276cba85.jpg"
    },
    {
        "podcast_id": 224866,
        "title": "TENDECIAS TECNOLOGICAS DE LA EDUCACION ",
        "description": "<p>EDUCACION</p>",
        "language": "es-mx",
        "author_name": "JANETH ALEXANDRA",
        "slug": "jane-alexa",
        "cover": "20230819_070834_7573a507e63bbaa59d16768f90ec67d1.jpg"
    },
    {
        "podcast_id": 224996,
        "title": "QUE TANTO SABEMOS DE LA RELACIÓN QUE EXISTE ENTRE LAS PROTEINAS CON LAS ENFERMEDADES",
        "description": "<p>BIENVENIDES A NUESTRO PRIMER PODCAST, DENOMINADO \" QUE TANTO SABEMOS DE LA RELACIÓN QUE EXISTE ENTRE LAS PROTEINAS CON LAS ENFERMEDADES\", SOMOS DOS ESTUDIANES DEL LICEO GALVARINOS RIVEROS CARDENAS DE LA COMUNA DE CASTRO, UNO DEL 4F Y OTRA DEL 4D.</p><p>ESPERO PUEDAN APRENDER UN POCO MAS SOBRE ALGUNAS ENFERMEDADES.</p>",
        "language": "es",
        "author_name": "JAIME VILLEGAS, ROMINA HERNANDEZ",
        "slug": "quetantosabemosdeproteinasyenfermedades",
        "cover": "20230820_080841_69db6f262da3226268753d0c5aa52301.jpg"
    },
    {
        "podcast_id": 225152,
        "title": "large scale assessments",
        "description": "<p>Discussing what it is and its effects</p>",
        "language": "en",
        "author_name": "Boitumelo mashibini",
        "slug": "mash",
        "cover": "20230821_070846_5ece8fe93667eb30a2649c86b36df47a.jpg"
    },
    {
        "podcast_id": 225406,
        "title": "Antifúngicos y sus efectos adversos",
        "description": "<p>Visitanos en : SPOTYFÚNGICOS!</p>",
        "language": "es-mx",
        "author_name": "Constanza Riquelme",
        "slug": "spotyfungicos",
        "cover": "20230903_060923_0cb29a6dd87fbd3d9f58dc2d5c5132b4.jpg"
    },
    {
        "podcast_id": 225444,
        "title": "گفتار: پادکستی برای المپیاد زیست شناسی",
        "description": "<p>گفتار مجموعه پادکستی هست که توسط گروه آموزشی سیمرغ تدوین میشه.</p><p>در این مجموعه به صورت تخصصی المپیاد زیست شناسی رو مورد بررسی قرار میدیم.</p><p>@simurgh_biology</p>",
        "language": "fa",
        "author_name": "گروه آموزشی سیمرغ",
        "slug": "simurgh-goftar",
        "cover": "20230823_100836_fc98c377f6d84270a418d63ac848723a.jpg"
    },
    {
        "podcast_id": 225615,
        "title": "The CPD Group Podcast",
        "description": "<p><strong>The CPD Group Podcast</strong> has landed! 🚀</p><p>Join host Andy as he interviews some special guests, offers helpful tips and advice to help your business, guides you through the CPD accreditation process and has some banter along the way!</p><p>Did you know you can gain a FREE CPD certificate and earn CPD credits from listening to this podcast? Be sure to listen to the end of the podcast to learn how! 🎧</p>",
        "language": "en",
        "author_name": "The CPD Group",
        "slug": "thecpdgroup",
        "cover": "20230824_080853_90224bc83634f6765fffd32c5f3f05bd.jpg"
    },
    {
        "podcast_id": 225636,
        "title": "پادکست پزشکی نکات",
        "description": "<p>نکات کاربردی برای دانشجویان پزشکی و پزشک‌ها</p><p>Telegram: <a href=\"https://t.me/nokatmed\">https://t.me/nokatmed</a></p>",
        "language": "fa",
        "author_name": "Ahsan Jahani",
        "slug": "nokatmed",
        "cover": "20230824_110858_e5899654e9369270f1c2ec5ade4c7a87.jpg"
    },
    {
        "podcast_id": 225839,
        "title": "The Talking Poem Podcast",
        "description": "<p>On The Talking Poem Podcast, writer and teacher Charlie Green invites on a poet, critic, or reader to bring in any poem they'd like to discuss. The poem could be old or new, well-known or obscure, and they follow the poem and conversation where they turn. After they talk about the poem, there will be some silliness, a poetry game, and a conversation about poetry more generally. New episodes will be released every two weeks.</p>",
        "language": "en",
        "author_name": "Charlie Green",
        "slug": "talkingpoempodcast",
        "cover": "20230825_060814_61919224bcbd216d247d95c8e44f0770.jpg"
    },
    {
        "podcast_id": 225928,
        "title": "Radio MTN",
        "description": "<p>Radio MTN</p>",
        "language": "en",
        "author_name": "Radio MTN",
        "slug": "radiomtn",
        "cover": "20230826_120809_bdceb98073140d136ffd7fc2919a18b1.jpg"
    },
    {
        "podcast_id": 225978,
        "title": "INNOVACION Y TECNOLOGIA DE LA EDUCACION",
        "description": "<p>Innovación y Tecnologías de la Educación.</p>",
        "language": "es-mx",
        "author_name": "marysol esparza",
        "slug": "innovacion-y-tecnologias",
        "cover": "20230826_090819_4cd448cf103a68740a8b622d56bcb463.jpg"
    },
    {
        "podcast_id": 225999,
        "title": "American English",
        "description": "<p>Easy English With Mohammad Mehdi</p>",
        "language": "en",
        "author_name": "Shahan",
        "slug": "shahaann",
        "cover": "20230827_120829_613acb3ef4d959f5ccd0bc0ed18922b0.jpg"
    },
    {
        "podcast_id": 226050,
        "title": "Introduction to the Geological Wonders of Nigeria ",
        "description": "<p>Discover the captivating geological wonders of Nigeria in this introductory podcast. Unveil the secrets of its diverse landscapes, from ancient rock formations to stunning caves and mineral deposits. Join us to explore the hidden stories etched in the earth's canvas and gain a newfound appreciation for Nigeria's unique and awe-inspiring features. Perfect for geology enthusiasts, nature lovers, and curious minds eager to uncover the geological marvels that have shaped this remarkable nation.</p>",
        "language": "en",
        "author_name": "Irene Bernard ",
        "slug": "geological-wonders-of-nigeria",
        "cover": "20230828_040820_ce30021ae476ead0e63ec313bc1c010a.jpg"
    },
    {
        "podcast_id": 226062,
        "title": "Educa - Aprendizaje continuo en la era digital.",
        "description": "<p>EDUCA es un revolucionario podcast potenciado por la Inteligencia Artificial Generativa. </p><p>En una era donde la educación constante es clave, reconocemos el deseo de aprender sin límites. Utilizando nuestra avanzada tecnología de IA, escudriñamos vastos compendios de datos educativos y académicos. </p><p>Identificamos las tendencias pedagógicas emergentes, los temas educativos más apremiantes y las metodologías más vanguardistas, presentándolos en un formato digestible y envolvente para nuestros oyentes. Acompáñanos en este viaje de aprendizaje continuo y descubre la educación del mañana, hoy.!</p>",
        "language": "es",
        "author_name": "Marcos Sampaio",
        "slug": "educa",
        "cover": "20230827_020858_0c622b254128741a21f0dca044071c5d.jpg"
    },
    {
        "podcast_id": 226105,
        "title": "TLDR: Veterinary Podcast",
        "description": "<p><strong>Title:</strong></p><p>TLDR: Your Go-To Podcast for Bite-Sized Pet Health Insights</p><p><strong>Episode Title:</strong></p><p>Simplify Science, One Wag at a Time: Welcome to TLDR!</p><p><strong>Introduction:</strong></p><p>Welcome to the inaugural episode of TLDR: Too Long, Didn't Research! If you're a busy veterinary professional or a pet owner seeking quick, engaging insights into the world of veterinary science, you're in for a treat. In this episode, we'll introduce you to the TLDR podcast and explain how we're revolutionizing the way you approach your pet's well-being.</p><p><strong>Episode Highlights:</strong></p><p>- <strong>Problem Solved:</strong> We dive into the common struggles of staying informed about pet health amidst a sea of complex information and jargon. </p><p>- <strong>Introducing TLDR:</strong> Discover how TLDR is your shortcut to staying savvy. We break down the latest veterinary research into easily digestible snippets, minus the overwhelm.</p><p>- <strong>Unique Approach:</strong> Learn how TLDR stands out from the crowd. We combine research with a touch of fun, making it feel like a friendly chat with your favorite vet.</p><p>- <strong>Real Results:</strong> Hear heartwarming stories of Max and Bella – real pets whose lives improved thanks to TLDR's insights.</p><p>- <strong>Join the Community:</strong> Explore why leading vets and pet parents trust TLDR. We've garnered recognition as a top pet podcast, and we're ready to welcome you into our community.</p><p>- <strong>Engage with Us:</strong> We wrap up with an invitation for you to join the TLDR journey. Dive into episodes and empower your pet care routine with actionable research.</p><p><strong>Key Takeaways:</strong></p><p>1. Staying informed about pet health doesn't have to be overwhelming or boring.   </p><p>2. TLDR is your research-obsessed friend, making veterinary science accessible and enjoyable.  </p><p>3. Real stories prove the impact of TLDR's insights on pets' lives. </p><p>4. Trust TLDR as your go-to source for credible, concise pet health information.</p><p><strong>Engaging Question:</strong></p><p>Are you ready to make pet well-being a breeze? How will TLDR's insights transform your approach to caring for your furry companion?</p><p><strong>Tune in to TLDR and let's simplify science, one wag at a time! Subscribe now for more wag-worthy wisdom.</strong></p><p><em>Disclaimer: The information provided in this podcast is for educational and informational purposes only. Always consult a qualified veterinarian for personalized advice on your pet's health.</em></p>",
        "language": "en",
        "author_name": "Shawna Varichak DVM",
        "slug": "tldr-veterinarypodcast",
        "cover": "20230827_070832_89ac08ece91eaf254fece640d9e2c138.jpg"
    },
    {
        "podcast_id": 226194,
        "title": "Distance Colleges",
        "description": "<p>If you are in search of the Top Distance MBA Colleges In India? You ended up in the right place! India's Top UGC, NAAC, DEB, and AICTE Approved Universities.</p>",
        "language": "en",
        "author_name": "Distance Colleges",
        "slug": "distancecolleges",
        "cover": "20230828_110831_5bfa57d6cada7d167335c7307f014ef3.jpg"
    },
    {
        "podcast_id": 226241,
        "title": "Imperial Image Revision",
        "description": "<p>This podcast is designed to help students of Classical Civilisation Revise the Imperial Image module at A level</p>",
        "language": "en",
        "author_name": "SCG",
        "slug": "64ba791b2ee8e5bf89536e50",
        "cover": "20230828_060848_d6c32bd71e848163bfe57c9259cd68d8.jpg"
    },
    {
        "podcast_id": 226277,
        "title": "Introduction to Prose",
        "description": "<p>COURSE PROJECT PODCAST</p>",
        "language": "en",
        "author_name": "Rhonika Thom",
        "slug": "rhonika-thom",
        "cover": "20230828_100807_6a858cc97d995f9b0d270ccc62d6f2f9.jpg"
    },
    {
        "podcast_id": 226319,
        "title": "LetsTalkYeshua",
        "description": "<p>This podcast is here for everyone who is seeking God! There is so much we have to cover in the Bible, so stay tuned for what's coming :)</p><p>Jkzsslpmf27oDar5XgvD</p>",
        "language": "en",
        "author_name": "Maeghan",
        "slug": "lets-talk-yeshua",
        "cover": "20230829_030825_49e9cf1c864a0aef303828103e6f478e.jpg"
    },
    {
        "podcast_id": 226536,
        "title": "Jillian Baxter",
        "description": "<p>In this podcast, I will discuss the many implications of violence and exhibit my standpoint on Childers' perception of it.</p>",
        "language": "en",
        "author_name": "Jillian Baxter",
        "slug": "childersandzarefsky",
        "cover": "20230830_010858_10566092768f78f12ba1abe5cd295e34.jpg"
    },
    {
        "podcast_id": 226719,
        "title": "主内播报",
        "description": "<p>主内播报</p>",
        "language": "zh",
        "author_name": "李弟兄",
        "slug": "kuangye",
        "cover": "20230831_040825_c3b044738c8e7d9917fc686276410e0d.jpg"
    },
    {
        "podcast_id": 226842,
        "title": "Word on the Street: A Beginner’s Bible Study",
        "description": "<p>We are a podcast consisting of two friends of different denominations who read through the bible and talk about its applications in the modern world.</p>",
        "language": "en",
        "author_name": "Stephen West",
        "slug": "wots",
        "cover": "20230901_040949_14ef8904cf6f08a17654dd65756ae20e.jpg"
    },
    {
        "podcast_id": 227017,
        "title": "MANDOMBE",
        "description": "<p>https://mandombeuniversity.online</p>",
        "language": "pt-br",
        "author_name": "Mandombe University",
        "slug": "mandombe",
        "cover": "20230903_060944_2d2019e1285188eb2be5ab1d1249f489.jpg"
    },
    {
        "podcast_id": 227055,
        "title": "flyx2010",
        "description": "<p>2000</p>",
        "language": "en",
        "author_name": "flyx2010",
        "slug": "2000fly2010",
        "cover": "20230903_020920_c06693f867eabb8b895edf9a890859c6.jpg"
    },
    {
        "podcast_id": 227087,
        "title": "GES BASI DE LA EDUCACIÓN",
        "description": "<p>Universidad minuto de Dios.</p><p>Gestión básica de la información. </p><p>NRC: 60727</p><p>Freddy Hilarión. </p>",
        "language": "es",
        "author_name": "Freddy Stiven Hilarión Diaz ",
        "slug": "freddyh",
        "cover": "20230903_070953_4f29087c0f9ca7e6dc25564c922a2636.jpg"
    },
    {
        "podcast_id": 227406,
        "title": "Neurociencia al Día",
        "description": "<p>Trabajo de Neurociencia en la educación</p>",
        "language": "es",
        "author_name": "Jesús",
        "slug": "nuerocienca-al-dia",
        "cover": "20230906_020934_eb0566ae2ad2dd7b519d4625c5f36649.jpg"
    },
    {
        "podcast_id": 227411,
        "title": "ItariaGo - イタリア語を学びたい人のためのポッドキャスト - The podcast for those who want to learn Italian",
        "description": "<p>Parlare e studiare italiano può essere difficile ed è meglio farlo nel modo giusto. Se stai cercando di farlo divertendoti e bene sei nel posto giusto!</p><p>イタリア語を話したり勉強したりするのは難しい場合がありますが、正しく行うことが最善です。 楽しく上手にやりたいと思っているなら、あなたは正しい場所にいます！</p><p>Speaking and studying Italian can be difficult and it's best to do it right. If you are looking to do it having fun and well you are in the right place!</p><p>Il mio sito: <a href=\"https://eserciziitaliano.it\">https://eserciziitaliano.it</a></p><p>Il sito del podcast: <a href=\"https://eserciziitaliano.it/?page_id=501\">https://eserciziitaliano.it/?page_id=501</a></p><p>Il mio Instagram: <a href=\"https://www.instagram.com/itariagonosensei/\">https://www.instagram.com/itariagonosensei/</a></p>",
        "language": "it",
        "author_name": "Simone M.",
        "slug": "itariago",
        "cover": "20230906_020915_090a4ad35767c82a164e7a5a9f1b3c76.jpg"
    },
    {
        "podcast_id": 227486,
        "title": "Aquí hay marrones",
        "description": "<p>¡Bienvenido a <strong>Aquí hay marrones!</strong></p><p>Sumérgete en el fascinante mundo de las <strong>Ciencias de la Información, la Documentación, la Bibliotecología y la Archivística</strong> con nosotros. Explora los últimos avances, debates y descubrimientos en estas disciplinas a través de conversaciones enriquecedoras y entrevistas con expertos.</p><p>Acompáñanos en este viaje educativo y apasionante mientras desentrañamos los misterios del conocimiento, la información y la gestión documental. ¡Sintoniza con nosotros y forma parte de nuestra comunidad académica!</p>",
        "language": "es",
        "author_name": "Colectivos Creativos",
        "slug": "rincon-academico-cidba1",
        "cover": "20230909_110941_3d205e5c07cc258c0d4c872461ca57f2.jpg"
    },
    {
        "podcast_id": 227555,
        "title": "Sharh Al-Muqaddimatu Al-Usūl At-Tafsīr",
        "description": "<p>Sharh Al-Muqaddimatu Al-Usūl At-Tafsīr By Ibn Taymiyyah with the explanation of Shaykh Ibn Uthaimīn</p>",
        "language": "en",
        "author_name": "Wahbi",
        "slug": "wahbitest",
        "cover": "20230907_010938_c401e59ce2fbfe4374c36c14edbfb88e.jpg"
    },
    {
        "podcast_id": 227836,
        "title": "VHP quick guides ",
        "description": "<p>Welcome to the VHP quick guides, your go-to place for quick and accessible insights into Halacha. In each shuir, we break down complex Halachic concepts and practical applications in just a few minutes. Whether you're a busy professional, a student, or anyone interested in deepening your understanding of Halacha. </p><p>Shuir by Rav Ami Merzel, head of the Virtual Halacha Program </p><p>To learn more about the Virtual Halacha Program, see our website https://vhalacha.com/</p>",
        "language": "en",
        "author_name": "Virtual Halacha Program ",
        "slug": "virtualhalacha",
        "cover": "20230908_080907_22b2498ccd8abc5ee12a491192dfeb51.jpg"
    },
    {
        "podcast_id": 228013,
        "title": "MPU3132",
        "description": "<p>.</p>",
        "language": "en",
        "author_name": "ALIN SALIMIN",
        "slug": "alinsalimin",
        "cover": "20230910_050953_4ce6d9ca5bf4751efe1800d50244eed4.jpg"
    },
    {
        "podcast_id": 228066,
        "title": "ACTIVIDAD 1. PÓDCAST EDUCATIVO.",
        "description": "<p>LECTURA  1 MITOS Y REALIDADES DEL SOBREDOTADO</p><p>LECTURA  2 ATENCIÓN EDUCATIVA A LOS ALUMNOS CON APTITUDES SOBRESALIENTES</p><p>LECTURA 3 EVOLUCIÓN DE LOS CONCEPTOS SOBRE INTELIGENCIA.</p>",
        "language": "es",
        "author_name": "ANGEL ARTURO TORRES BERNAL",
        "slug": "angelarturotorresbernal",
        "cover": "20230910_040906_3cca5a91c4f9d5ec17748a097124380f.jpg"
    },
    {
        "podcast_id": 228078,
        "title": "Programatic learner",
        "description": "<p>Unlock the world of programming effortlessly with the Programatic Learner podcast! Dive into the fascinating realm of coding as we break down complex concepts into super easy, digestible nuggets. Join us on this epic learning journey, where we turn beginners into coding wizards, one episode at a time. Let's make programming your superpower!</p>",
        "language": "en",
        "author_name": "Thidas Kaveesha Senavirathna and his buddies ",
        "slug": "programatic-learner",
        "cover": "20230910_060935_f0674a6ae2227f7c46a29f083066d8c4.jpg"
    },
    {
        "podcast_id": 228102,
        "title": "CHARMONIUM",
        "description": "<p>Welcome to \"The Charmonium Podcast,\" where science meets simplicity in the most captivating way possible. Join us for a one-of-a-kind experience that blends cutting-edge scientific exploration with the excitement of a thrilling show.</p><p>Each episode takes you on a riveting journey through the world of particle physics, quantum mechanics, and the mysteries of the cosmos. We break down complex concepts, showcase mind-blowing experiments, and engage in thought-provoking discussions with leading experts.</p><p>But we don't stop there. \"The Charmonium Podcast\" also brings you interactive demonstrations, mind-bending challenges, and a touch of humor to keep you engaged and entertained throughout.</p><p>Whether you're a science enthusiast, a curious explorer, or just looking for a dose of intellectual entertainment, this is the show that brings the universe to your screen in a way you've never seen before. So, buckle up and get ready for a scientific adventure like no other. Welcome to \"The Charmonium Podcast\"!</p>",
        "language": "en",
        "author_name": "Elyas",
        "slug": "charmonium",
        "cover": "20230910_090905_3d79ffe998e92f1d2936f331a3769a20.jpg"
    },
    {
        "podcast_id": 228151,
        "title": "قطاع شباب-كنيسة مارجرجس منشية الصدر",
        "description": "<p>anger management</p>",
        "language": "en",
        "author_name": "Mark Nour",
        "slug": "audiomack",
        "cover": "20230911_070926_6f0edbca3a24064a7a70808b228be1d5.jpg"
    },
    {
        "podcast_id": 228367,
        "title": "tarea ",
        "description": "<p>unicaribe </p>",
        "language": "es",
        "author_name": "francisco lorenzo delgado",
        "slug": "unicaribe",
        "cover": "20230912_040958_c63a6088fdc69b1dee5ee17880801bec.jpg"
    },
    {
        "podcast_id": 228573,
        "title": "ATH 232",
        "description": "<p>This podcast is to accompany Anthropology 232 at Portland Community College (Oregon). </p>",
        "language": "en",
        "author_name": "PCC Online Learning",
        "slug": "pcc-ath232",
        "cover": "20230913_100941_fde906aea67c751f1a2931838ab261ce.jpg"
    },
    {
        "podcast_id": 228786,
        "title": "Математическая логика и теория алгоритмов Seminar(15.09.2023)",
        "description": "<p><strong>Friday seminar.1020</strong></p>",
        "language": "en",
        "author_name": "Wahaba",
        "slug": "wwahaba254",
        "cover": "20230915_080949_44bacf5172e4d85bc6feb38b6d2ea0b5.jpg"
    },
    {
        "podcast_id": 229189,
        "title": "CSULB KIN 638",
        "description": "<p>During this class, we discuss collaboration and seminar topics in APE.</p>",
        "language": "en",
        "author_name": "Amanda J Young",
        "slug": "dryoung",
        "cover": "20230918_030944_9b8a5085aeec947bcaa27e9594e35a99.jpg"
    },
    {
        "podcast_id": 229325,
        "title": "Biologi B - 2h 2023",
        "description": "<p>Forsøg med oplæste lektier til jer</p>",
        "language": "da",
        "author_name": "Simon Messell",
        "slug": "2h-bio-2023",
        "cover": "20230919_010938_6ab1566842bac16c74899c314fa65381.jpg"
    }
]