[
    {
        "podcast_id": 48865,
        "title": "The Makers Garage Podcast --  by Carbide 3D",
        "description": "Short bite interviews of artists, creative professionals and people building businesses  with a CNC machine and some imagination.  This show will inform your own design process, business building and creativity.  Informative and interesting stories from the front lines of design creation.  Hosted by Kevin Barnett",
        "language": "en",
        "author_name": "Kevin Barnett",
        "slug": "themakersgarage",
        "cover": "20210412_185048_32127cbfc499620eab4914ec1b636ea9.jpg"
    },
    {
        "podcast_id": 58421,
        "title": "The McLane Minute ",
        "description": "Hosted by Frannie McLane, The McLane Minute podcast focuses on teen mental health, spirituality, and an unfiltered look at how teens are doing during the COVID-19 pandemic, and their senior year. Each episode has a special guest whom Frannie interviews. Come back for new episodes soon! ",
        "language": "en",
        "author_name": "Frannie McLane",
        "slug": "themclaneminute",
        "cover": "20210522_124040_73d987eccda751539453b512a26fe7ab.jpg"
    },
    {
        "podcast_id": 60313,
        "title": "In De Ring",
        "description": "The Box Club stapt In De Ring met makers, liefhebbers, professionals en overheden om te sparren over alles wat te maken heeft met urban en de culturele sector. Van podiumvrees tot subsidies, van de beste muziektips tot wilde anekdotes. Luister mee! ",
        "language": "nl",
        "author_name": "The Box Club",
        "slug": "indering",
        "cover": "20210601_071522_d131e6b50f3761bc8caf59df1dd2a5d1.jpg"
    },
    {
        "podcast_id": 64591,
        "title": "The What Am Games Hobbycast",
        "description": "A podcast for miniature and tabletop hobbyists, but also for anyone with ears. We cover Warhammer, we cover D&D, we cover life, and we cover what it is like to live with hobby enthusiasts.",
        "language": "en",
        "author_name": "What Am Games",
        "slug": "waghobbycast",
        "cover": "20210724_190106_524086e2ef6017003ff9e82774f72e41.jpg"
    },
    {
        "podcast_id": 75629,
        "title": "Pardon My Stash",
        "description": "<p>Knitters (and crafters) unite! Come join us weekly for a conversation about knitting, crochet, and yarn crafts all around. With a touch of comedy and sass, we talk about projects, pitfalls, and pointers about the fiber arts. Find more about our content and our cast at pardonmystash.com</p>",
        "language": "en",
        "author_name": "Meg, Drea, Tina, and Jess",
        "slug": "pardonmystash",
        "cover": "20230717_050737_2d9fc6ff5aa094f6488d1597c64a23e8.jpg"
    },
    {
        "podcast_id": 77881,
        "title": "Humlepodden",
        "description": "Humlepodden är en ölpodd med Julia, Maja och Rebecca 3 hembryggare och ölnördar från Humlegårdens Ekolager.  I Humlepodden kommer vi diskutera bryggning, ölstilar och bryggeriernas senaste öl på systemet, går från ölhistoria till trender och mycket, mycket mer.",
        "language": "sv",
        "author_name": "Humlegårdens Ekolager",
        "slug": "humlepodden",
        "cover": "20210907_095153_47624ae4bda63b1be4d3144b3fb4eab9.jpg"
    },
    {
        "podcast_id": 87102,
        "title": "The This Southern Girl Can Show",
        "description": "All about crafts, cooking, homeschooling, lifestyle, and everything in between.",
        "language": "en",
        "author_name": "Amber Dawn Riley",
        "slug": "thissoutherngirlcan",
        "cover": "20211026_000515_6f84d88fe85121ae0701dfde496ee88b.jpg"
    },
    {
        "podcast_id": 87467,
        "title": "WTF Am I Drinking?",
        "description": "This is a podcast + blog series born out of conversations about how literally every single one of us who enjoy craft beer, hard seltzer, cider, wine spritzers, canned cocktails, hard teas, hard kombuchas--you name it--is operating at a different level of knowledge. Some of us are connoisseurs, some of us are newbies. Some of us want to reach expert status, some of us really don’t care how the sausage, or seltzer, is made as long as it tastes good--but so we do want to know how and why a particular seltzer does indeed taste good.\n\nWTF Am I Drinking? is an explainer series that will dive into different topics like what a certain beer or wine style is, how a hard kombucha gets made, what the difference is between a stout and a porter--things like that. It’s educational and informational but in the most fun way possible--consider it the perfect thing to do while you sip your favorite beverage. You’ll learn a thing or two, and no doubt develop a deeper appreciation for drink X, Y, or Z. Basically, we all get to geek out a little, and dish on the beverages we love.",
        "language": "en",
        "author_name": "TapRm",
        "slug": "wtfamidrinking",
        "cover": "20211027_191553_bfe480b59f2923938e67717dac3d3fb1.jpg"
    },
    {
        "podcast_id": 90023,
        "title": "Entrelazados",
        "description": "Latina entrelazando al mundo",
        "language": "es",
        "author_name": "Mar Ayala",
        "slug": "entwined-mar",
        "cover": "20211111_040015_47c41064d8ab9c1bdf94a1f8acb628a3.jpg"
    },
    {
        "podcast_id": 98579,
        "title": "My Life In Miniatures",
        "description": "Each week, I talk to a different guest about the miniatures that have inspired them throughout their life. From the first toy soldier they ever picked up, to their most current projects, and plenty of amazing things in between. This podcast is intended to accompany you as you sit down to hobby yourself, and provide a glimpse into the histories of gamers and painters, new and old. \n\nMy name is John and I've been running the hobby blog heresyandheroes.com for almost a decade now, and I've met so many amazing painters and gamers, that I thought I'd try putting together a podcast where I can introduce you to these talented individuals and get into why they love the hobby, and what keeps them going. There's a page on the blog featuring more details on each guest, and I'll be running seasons of 10-12 episodes with short breaks between seasons. \n\nYou can follow me on twitter at @Heresyheroes to keep up with the latest news about the show, and I encourage you to follow each of my guests too.",
        "language": "en",
        "author_name": "John Ashton",
        "slug": "mlim",
        "cover": "20220103_110109_924261c1186cf1793591ca6895e11947.jpg"
    },
    {
        "podcast_id": 99680,
        "title": "The Black Firehouse Podcast",
        "description": "A two man show dedicated to discussing Ghostbusters props, costumes, sets and special effects.",
        "language": "en",
        "author_name": "Dan Harshman & Austin Young",
        "slug": "blackfirehousepodcast",
        "cover": "20220109_050135_ef49908cf5659f6dc996af94d57b5c3e.jpg"
    },
    {
        "podcast_id": 103709,
        "title": "Jednorožec mezi nosorožci",
        "description": "<ul><li><p>Ahoj, já jsem Leontýna. Vítám vás u podcastu „Jednorožec mezi nosorožci“. Skrze podcast bych vám ráda představila příběhy lidí a jejich profesí a životních vášní. Ráda bych jim tak dala možnost promluvit o sobě a o jejich tvorbě. Zároveň je tak trochu zviditelnit. Mně samotnou totiž velmi zajímá, co všechno se skrývá za jejich tvorbou. Proč dělají to co dělají? Co je k tomu dovedlo? Jak objevili to své \"ono\"? Co musí udělat než dojdou k finálnímu výsledku své práce? Jaké to je stát na vlastních nohách v této době? Jak jsou spokojeni po finanční stránce? A jaká mají svá tajná přání? Atd. Chtěla bych zvát ty, kteří jsou sami sobě šéfem, pracují na sebe a tvoří z lásky k dílu samému. Lidi z různých odvětví - divadelníci, výtvarníci, tanečníci, hudebníci, maséři, psychologové, cestovatelé, a další. \u2028\u2028</p></li><li><p>Pokud znáte někoho, koho byste tady chtěli slyšet, anebo byste rádi přišli vy sami, neváhejte mě kontaktovat. Všechny informace jsou v popisu. Jinak budu moc ráda za jakékoliv sdílení a zpětné vazby.\u2028 Můžete se těšit každý týden na nový rozhovor. \u2028 Přeji příjemný poslech.\u2028</p></li><li><p>Kontakt na mě: FB: <a href=\"https://www.facebook.com/tynka.janku/\">https://www.facebook.com/tynka.janku/</a> , Ing: @jednorozecmezinosorozci</p><p>Podpořte mě: 1618120017/3030 (do zprávy napište třeba „Jednorožec“)</p><p>Zvuk: Miroslav Beran - <a href=\"mailto:mberan90@gmail.com\">mberan90@gmail.com</a></p></li></ul>",
        "language": "cs",
        "author_name": "Leontýna Janků",
        "slug": "jednorozecmezinosorozci",
        "cover": "20220125_070156_0291d557e1c70d23315bb2baf07e54c7.jpg"
    },
    {
        "podcast_id": 109761,
        "title": "Rigg & Drift ",
        "description": "<p>En podcast om rigg og drift i byggebransjen og livet generelt. Tømrer- Elektriker -  Direktør Bruun og murer Brendsrød prøver å finne sin plass i riggens mysterier og driftens utfordringer samtidig som tips, triks og historier kommer som perler på snor.</p><p>En podcast uten plan og manus som var intern - som plutselig ble ekstern.</p>",
        "language": "nb",
        "author_name": "Joakim Brendsrød & Mats Bruun",
        "slug": "riggogdrift",
        "cover": "20220218_040243_cb04157db92a8dc6d40172614c496150.jpg"
    },
    {
        "podcast_id": 112813,
        "title": "Paint with Lovejoy",
        "description": "Helping First-time & Beginner painters get comfortable with the painting process. We will discuss, how-to topics, perspective, and mindset for painting, as well as answer student questions in the \"Ask Lovejoy\" series. Much of the philosophy of what I teach can be applied to painting but also to life in general, so even if you are not a painter you can still enjoy the info and apply it to something in your life.",
        "language": "en",
        "author_name": "Lovejoy",
        "slug": "paintwithlovejoy",
        "cover": "20220303_100338_78567f7b582b6d2dedb19b338957c429.jpg"
    },
    {
        "podcast_id": 114003,
        "title": "Captain Ollie - Kapun kalatarinoita",
        "description": "<p>Kapun turinointia kalastuksesta, vieheen valmistuksesta ja aiheen vierestä. </p><p><a href=\"https://fi.captainollie.shop/\">https://fi.captainollie.shop/</a></p>",
        "language": "fi",
        "author_name": "Captain Ollie",
        "slug": "captainollie",
        "cover": "20220309_080327_d28ab3b0dce47f2735758a2509efd5bd.jpg"
    },
    {
        "podcast_id": 133818,
        "title": "Sloydcast",
        "description": "Conversations with greenwoodworkers, spoon carvers, bowl turners, tool makers and craftspeople from around the world.",
        "language": "en",
        "author_name": "Sloydcast",
        "slug": "sloydcast",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 138952,
        "title": "Tea N Toyz",
        "description": "Join us for a hot brew as we get into the world of designer toys.\nEach month we will have a new theme and we will each show and talk about the art toy in our personal collection which fits that theme the most, while also enjoying a new unique tea.",
        "language": "en",
        "author_name": "Jake and Emma ",
        "slug": "teantoyz",
        "cover": "20220710_020731_ad1645d167ffbf0cf2f32b8f0d95d266.jpg"
    },
    {
        "podcast_id": 141148,
        "title": "22:20 ☽",
        "description": "Hola !! qué fuerte !! bienvenidx a mi rinconcito de charlitas :) \naquí encontrarás un poquito de todo, crecimiento personal, creatividad... y mucho palique !!",
        "language": "es",
        "author_name": "Lucía Piñero :)",
        "slug": "22-20",
        "cover": "20220718_060744_e38dff48e28966fe2e9d2c8fd1c0eeac.jpg"
    },
    {
        "podcast_id": 144326,
        "title": "The Skilled Trade Show ",
        "description": "Join me as we discover the world of skilled trade. Where we will discover drama, horror, comedy, failure and success. ",
        "language": "en",
        "author_name": "Joaquin Trujillo",
        "slug": "theskilledtradeshow",
        "cover": "20220803_100840_f6b50708a2abc85fb1fe5bee06b584bf.jpg"
    },
    {
        "podcast_id": 156588,
        "title": "Hobby To Hustle Podcast",
        "description": "A podcast for creatives run by two fellow business owners who discuss the ups and downs of creative entrepreneurship - from dealing with imposter syndrome to celebrating new business milestones. ",
        "language": "en",
        "author_name": "Gemma Dillon & Candace Lam",
        "slug": "hobbytohustlepodcast",
        "cover": "20220928_080920_64043f3d69e1ed3e3eb48227c3ce5ed0.jpg"
    },
    {
        "podcast_id": 166214,
        "title": "Bootie and Bossy Eat, Drink, Knit",
        "description": "Bootie and Bossy are two sisters who share a love of cooking and crafting. Please join us in our adventures and misadventures! We'll share our best recipes and make you feel better about your craft projects. Whatever you do, don't knit like my sister! For show notes and more, please visit Bootieandbossy.com",
        "language": "en",
        "author_name": "Bootie and Bossy",
        "slug": "bootieandbossy",
        "cover": "20221107_091116_39928d5ad74dbf5457fd2b0a5f8d9c10.jpg"
    },
    {
        "podcast_id": 174249,
        "title": "Yarn Talk",
        "description": "Knitters love to talk about knitting, and we're no exception. Join Yarnist Head Honcho Johnny Vasquez, and knitwear designer Margaret Weinert-Lishner every week as we explore what it means to be a fearless knitter. Whether we're listing our favorite knitting tools, interviewing up-and-coming designers, or giving our favorite tips for making a sweater, there's bound to be something to give the fiber fanatic in you warm fuzzies. To put it plainly, if you love to knit, this is the show for you!",
        "language": "en",
        "author_name": "The Yarnist",
        "slug": "yarntalk",
        "cover": "20221213_081212_0476ab9f8028c2c4eaec28e98e08023d.jpg"
    },
    {
        "podcast_id": 192016,
        "title": "Claroscuro Cuernavaca",
        "description": "<p>Claroscuro Cuernavaca</p><p>Te contamos la parte oscura y brillante de la eterna primavera. Noticias, denuncias y más.</p><p><a href=\"mailto:claroscurocuerna@gmail.com\">claroscurocuerna@gmail.com</a></p>",
        "language": "es",
        "author_name": "Claroscuro cuerna ",
        "slug": "claros",
        "cover": "20230224_030207_1dac131d698d91889a379fa58994e82b.jpg"
    },
    {
        "podcast_id": 197652,
        "title": "Lidé Lidem - podcasty se zajímavými lidmi o neziskovém sektoru a fundraisingu",
        "description": "<p>Otvíráme témata, na která se chcete zeptat. Rozhovory se zajímavými lidmi z neziskového sektoru i businessu.</p>",
        "language": "cs",
        "author_name": "Lidé lidem",
        "slug": "lide-lidem-vlasta-urbanova",
        "cover": "20230318_010349_46fe9e5fde0c87c939902dc6c57f6cde.jpg"
    },
    {
        "podcast_id": 206770,
        "title": "Say Sew by Take Hart",
        "description": "<p>Let the seamstresses of the world say sew! We are your guide through the world of sewing bags, wallets, home goods and more. Listen to walkthroughs, helpful techniques, shopping tips, and other questions and answers. Modern sewists unite!</p>",
        "language": "en",
        "author_name": "Tammy Hart",
        "slug": "takehartcrafts",
        "cover": "20230502_070513_a30ebda3af94a27af3a35d1d1cd83754.jpg"
    },
    {
        "podcast_id": 212219,
        "title": "Último Relevo",
        "description": "<p>¡Bienvenido a tu podcast Último Relevo! Descubre la esencia y las historias detrás del maravilloso mundo del queso artesano. En cada episodio, nos sumergiremos en entrevistas apasionantes con los máximos expertos en queso, quienes compartirán sus conocimientos y experiencias únicas. Desde maestros queseros hasta afinadores y productores apasionados, exploraremos las técnicas ancestrales y modernas de elaboración, y desvelaremos cómo el queso se entrelaza con la cultura y la gastronomía. ¿Te apuntas?</p><p>Déjate cautivar por las historias que se esconden detrás de estos manjares lácteos. Permítenos compartir contigo la magia y el encanto del queso artesano, mientras te sumerges en una experiencia que deleitará tu paladar y enriquecerá tu conocimiento. ¡Prepárate para disfrutar de la pasión y el sabor del queso en cada episodio!</p>",
        "language": "es",
        "author_name": "Mauro y Andrés García",
        "slug": "ultimorelevo",
        "cover": "20230604_060617_5aa6990f85aeabede037467d9d01bd2a.jpg"
    },
    {
        "podcast_id": 215500,
        "title": "יד ברזל",
        "description": "<p>\"יד ברזל\" הוא הפודקסט שמביא אתכם לקצה העולם של העבודות הכפיים. במרכז הבמה - האנשים, המיומנויות והסיפורים של מקצועות שלא תמיד מקבלים את התשומת לב שהם ראויים לה.</p><p>המארח שלנו, עוז לוי, בן לנגר וטכנאי מטוסים בעצמו, מזמין אתכם להצצה מאחורי הקלעים של מקצועות מגוונים - מנגרים, טכנאים, פחחים, מסגרים, מלצרים ועוד. כל אחד מהם מגיע למיקרופון שלנו כדי לשתף בסיפורים, ההצלחות, האתגרים והשיעורים שלמדו בדרך.</p><p>אז אם אתם אוהבים לשמוע על יצירה, המצאה, ואת הקסם של עבודה ידנית, \"יד ברזל\" הוא המקום בשבילכם. הצטרפו אלינו למסע של התגלמות, השראה והתפתחות. בואו נגלה יחד את האמנות שמאחורי העבודה הכפית.</p>",
        "language": "he",
        "author_name": "oz levy",
        "slug": "yadbarzel",
        "cover": "20230708_090749_406cd39c44fa0e390718909a5f6b7784.jpg"
    },
    {
        "podcast_id": 215670,
        "title": "Setting Up Shoppe",
        "description": "<p>A Maker Journey from Side Hustle to Professional</p><p>Hello! we are a trio of friends who are hoping to help others on their journeys from hobbyist to professional Small business While we are not experts, between us we have a wealth of knowledge on selling, marketing, goal setting, planning and growing your craft. We are all crafters/makers ourselves at different stages of the same journey.  We hope you enjoy it and welcome any feedback</p><p>Mission Statement</p><p>To share our journeys, including any learning moments, from hobbyist to professional in our respective crafts. To inspire others to take similar steps and conquer fears that may be holding them back. To hold each other accountable so that we push forward in our respective goals.</p>",
        "language": "en",
        "author_name": "Dan Tarrant, Heidi Jacobs & Rasmus Loen",
        "slug": "settingupshoppe",
        "cover": "20230617_090646_bf8e3490ab7073c9a6392cb8a0596950.jpg"
    },
    {
        "podcast_id": 220558,
        "title": "Shadow Smokers Legion In The Shadows Podcast",
        "description": "<p>Welcome to the Shadows, This is the podcast for Shadow Smokers Legions hosted by none other than Tony the SoySauceAssassin as well as many other legion members. Enjoy our conversations and topics outside of the legion live show right here!</p>",
        "language": "en",
        "author_name": "Tony the SoySauceAssassin",
        "slug": "shadowsmokerslegion",
        "cover": "20230802_020811_3477051c80f5a9dad6e7b2bc15480786.jpg"
    },
    {
        "podcast_id": 224898,
        "title": "The Hauntingly Human podcast ",
        "description": "<p>A mundane and magical coffee table talk show about life, with host Robyn and Kellie.  We’ll dive into the strange and mysterious, by recounting personal ghost encounters, , unusual experiences, and Religious or Occult Views, while also talking about how these subjects play very average roles in human life.</p>",
        "language": "en",
        "author_name": "Wesley ",
        "slug": "huantingly-human",
        "cover": "20230820_020814_194def9fe6fc546fbab29580659a0e9a.jpg"
    },
    {
        "podcast_id": 227252,
        "title": "Crafting Joy",
        "description": "<p>Crafting Joy provides a writer's voice to crafter's hands. Join host Joy Giovanini as she carves out a space for makers to feel connection and renewal through a shared yarn.</p>",
        "language": "en",
        "author_name": "Joy Giovanini",
        "slug": "craftingjoy",
        "cover": "20230905_030937_d113d94ea66fc0f3b61ca2a042e933b5.jpg"
    }
]