[
    {
        "podcast_id": 1445,
        "title": "AI Zen with Andrew and Jen",
        "description": "A podcast where a designer and a data scientist break down how to create awesome AI experiences.\n\nTwitter: @AIZenPodcast",
        "language": "en",
        "author_name": "Andrew Freed & Jennifer Sukis",
        "slug": "aizen",
        "cover": "5ce5fd3465043.png"
    },
    {
        "podcast_id": 2533,
        "title": "Topanga Moon",
        "description": "<p>Sacred rituals and a cosmic community to enchant your mystical life. With soulful conversations by the fire and under the desert stars. Monthly Full Moon and New Moon meditations for raising your vibes and connecting to the lunar phases!</p>",
        "language": "en",
        "author_name": "Ana Alic",
        "slug": "topangamoon",
        "cover": "5d40c0788d480.jpg"
    },
    {
        "podcast_id": 4465,
        "title": "Design Thinkers Podcast",
        "description": "Unlock the world of Design Thinking as we explore its role and impact in society today on issues including climate change, transport, fashion and more. Learn from interviews and debates with some of the world's leading Design Thinkers.\n\nJoin the Responsible Revolution.\n\nFind out more: www.designthinkersacademy.co.uk\n\nFollow us: @designthinkersacademylondon",
        "language": "en",
        "author_name": "Design Thinkers Academy London",
        "slug": "designthinkersacademylondon",
        "cover": "5dc1962311b33.jpg"
    },
    {
        "podcast_id": 7026,
        "title": "Pictures and Words",
        "description": "Pictures and Words is a series of conversations with artists, photographers, publishers, gallerists and curators hosted by Fall Line Press. \n",
        "language": "en",
        "author_name": "Fall Line Press, Inc",
        "slug": "picturesandwords",
        "cover": "20200323_230345_79ad70a2cfa2e67636ac53abd19623b7.jpeg"
    },
    {
        "podcast_id": 9562,
        "title": "Revivify",
        "description": "Want to hear how others master residential construction? Grace Mase, founder and CEO of BEYREP® talks with leaders in the residential construction community. From Architects to Interior Designers, Remodelers, and Home Builders to Green Design Innovators, you get to hear who they are, how they got started, improve their crafts, and change our world through the design of our homes. We discuss everything that goes into projects from contractor and homeowner relationships to understanding the impact architecture has on communities.",
        "language": "en",
        "author_name": "Grace Mase, BEYREP",
        "slug": "revivify",
        "cover": "20200611_171344_90e075e63ca37fe11ad800a124bb4be4.jpeg"
    },
    {
        "podcast_id": 9979,
        "title": "GALA Retail Talk",
        "description": "Gala Retail Talk richtet sich an Führungskräfte im Einzelhandel, die sich nach dem Wissen und den Erkenntnissen sehnen, die erforderlich sind, um in der schnelllebigen Branche von heute erfolgreich zu bleiben.Durch anregende Gespräche und gezielte Interviews erhalten die Zuhörer nützliche Informa-tionen und praktische Ratschläge von Fachleuten aus dem Einzelhandel.",
        "language": "de-ch",
        "author_name": "Gala Design AG",
        "slug": "galaretailtalk",
        "cover": "20200624_215235_a736f2623f4c5ac6ae19a9d2c0293718.jpeg"
    },
    {
        "podcast_id": 10014,
        "title": "Cup of Jasmien",
        "description": "A more in depth version on Cup of Jasmien.",
        "language": "en",
        "author_name": "Jasmine Chan",
        "slug": "cupofjasmien",
        "cover": "20200625_201052_6b0467a8852113f31bd3437f6f90fc13.jpeg"
    },
    {
        "podcast_id": 10593,
        "title": "Extra",
        "description": "Extra é o podcast da Aprender Design que aborda o aprofundamento em temas sobre Design e sociedade.",
        "language": "pt-br",
        "author_name": "Aprender Design",
        "slug": "aprender-design",
        "cover": "20221117_011146_71ba6c33fcdc04bd08228c0157c81b7a.jpg"
    },
    {
        "podcast_id": 11701,
        "title": "On Sunday We",
        "description": "On Sunday We: Host! J & S are pulling up into your pod charts and guarantee one dose of truths and tell-alls by the week. As two former college roommates from San Francisco, we bridge the gap and wield our powers of dialogue to speak on topics that appeal to the contemporary audiences. It’s all about music for the mind as we delve into exciting and pressing themes. A handbook for positivity, career perspectives, mental wellness, changing financial & social landscapes, and staying true to your individual journey on the road to self-discovery. Stand by for a direct line to eye-opening exchanges with influencers, authors, bloggers, entrepreneurs, & budding thought leaders. On Sundays, we’ve got you covered! Follow us on Instagram  @onsundaywepod. For business inquiries, email onsundaywe@gmail.com",
        "language": "en",
        "author_name": "Jiya Shamdasani & Simran Chhada",
        "slug": "onsundaywe",
        "cover": "20200825_102434_c01b7e6ec258622454a763098637e659.jpg"
    },
    {
        "podcast_id": 12085,
        "title": "Safareig",
        "description": "El teu aperitiu setmanal on analitzem com la tecnologia està canviant la societat que ens envolta. Cada dilluns, en 20 minuts, i exclusivament en català.",
        "language": "ca-es",
        "author_name": "Ramon Gilabert i Marc Collado",
        "slug": "safareig",
        "cover": "20201108_114546_a5225305b0c7269c1d558de0bd215628.jpg"
    },
    {
        "podcast_id": 14552,
        "title": "20 Questions With... ",
        "description": "Here at UPR we are always excited about trying new things. And with people working from home and looking to be inspired or just to switch up their normal music playlist, we decided it was the perfect time to launch a series of 5 podcasts. Keeping in line with our 20 year anniversary the series is aptly titled “20 Questions With…”, and we aim to give you inspiring conversations that offer you insight into the world of PR; discussing subjects like sustainability, interior design, fashion and influencer marketing.\n\nAll podcasts were produced by UPR Agency and edited by Cas Versmessen.",
        "language": "en",
        "author_name": "UPR Agency",
        "slug": "upragency",
        "cover": "20201113_140813_c3528c89a111466f4db6a32e05188037.jpg"
    },
    {
        "podcast_id": 14553,
        "title": "Avec I/O",
        "description": "Avec is a architect led design-build firm located in downtown Ames, IA. Avec believes that there is a way to do architecture that brings together designers and contractors collaborating with the client to deliver a built project, a process that energizes and empowers the design team, the construction team, and ultimately the owner. Avec is French for “with”, meaning that we want to work alongside every entity involved in a project, as a team, with each other, working for the same end goal.\n\nExplore the multifaceted nature of the building process through the eyes of architects, designers, and contractors.  Interviews and discussions with tradespeople in the industry make up the bulk of this content with an emphasis on providing a service to all who are interested in how buildings come together both on the residential and commercial level.  Listeners can expect to gain unique insight from experts on a variety of topics as we explore the complex organism that is the built environment.\n\nWalk with us!\n\nwww.avecdesignbuild.com\nwww.patreon.com/avecdesignbuild\n",
        "language": "en",
        "author_name": "Avec Design+Build",
        "slug": "avecdesignbuild",
        "cover": "20201209_212229_32dd63823683a5cbff7e9b34a456ca27.jpg"
    },
    {
        "podcast_id": 14715,
        "title": "Super Plumber Brothers",
        "description": "A podcast where Anthony, Ben and Luke discuss Super Mario 64, Super Mario Sunshine and Super Mario Galaxy history, levels, bosses and more! ",
        "language": "en",
        "author_name": "Anthony Cortes",
        "slug": "superplumberbrothers",
        "cover": "20201118_164557_313c5870e99a3dd076e6c0088858ad3f.jpg"
    },
    {
        "podcast_id": 15356,
        "title": "Creatively Relating with Vyana Novus",
        "description": "Multimedia artist & parent Vyana Novus explores relational wellness through the lens of creativity. They merge their experiences of integrating complex trauma and chronic illness with a mindful, multidimensional mindset focused on creative expression. \n|\nSome topics you'll hear discussed on the show include personal responsibility, creatively exploring presence, sexual liberation, trauma recovery, relating after abuse, conscious parenting, cultivating sustainable joy, being in relationship with ourselves, intergenerational trauma, deep time, and more.\n|\nFor context, Vyana comes to the show with lived trauma experienced in the realms of (CW) early childhood incestuous rape, physical abuse, emotional & psychological abuse, drug addiction, and eating disorders.\n|\nTheir professional background is diverse and expansive including creative directing, writing, branding, styling, illustration, allergen-free baking, massage therapy, teaching energy medicine, yoga, meditation, and adult & children's art classes.\nAs a student of Radical Relating, Vyana's perspective is greatly informed by relating through difference in a grounded, skillful way.\n|\n|\n|\nCreatively Relating is color-coded.\nOrange Circle: episodes with a guest\nGrey/Green Circle: episodes with only Vyana\n|\nBoth circles were painted with earth pigment watercolor paint harvested and made by Vyana.\n|\nFollow Vyana on Instagram @vyana.novus\nCall into the show at 1-833-2RELATE // 1-833-273-5283 or write in at creativelyrelating@gmail.com\nSupport the show on Patreon at patreon.com/vyananovus",
        "language": "en",
        "author_name": "Vyana Novus",
        "slug": "comingbacktogether",
        "cover": "20210317_041130_3b26afdf7ab5830a0f6d6e226ced7cfd.jpg"
    },
    {
        "podcast_id": 19642,
        "title": "Non Neurotypical Art Students",
        "description": "Non Neurotypical Art Students (NNAS) is a platform where neurodivergent art students helps or contact other neurodivergent art students. Neurodivergent means that someone’s neurological development and state is considered as atypical. It goes often hand in hand with neurotypes such as: ADHD, Autism Spectrum Disorder, ADD, Bipolar Disorder, Tourette’s, Dyslexia and many others. ",
        "language": "en",
        "author_name": "Non Neurotypical Art Students",
        "slug": "nonneurotypicalartstudents",
        "cover": "20201220_111558_3b98b8c486334b650ba6355329638d4f.jpg"
    },
    {
        "podcast_id": 29030,
        "title": "Product Path ",
        "description": "聆听我们与互联网产品结缘的故事， 与我们探讨行业内的点点滴滴。Product Path 是一个北美华人互联网产品圈子， 集结产品爱好者们一起讨论，学习，互帮互助的社群。如果你想加入Product Path大家庭 欢迎关注微信公众号了解详情。",
        "language": "zh",
        "author_name": "Product Path ",
        "slug": "productpath",
        "cover": "20210201_020004_ac7e55f35cf25b456d1018a7d3a25d69.jpg"
    },
    {
        "podcast_id": 29307,
        "title": "Object Passion",
        "description": "Object Passion captures the ongoing discussion of three Industrial Designers, their loves and frustrations, and how shiny objects send them on different adventures. Join Sherif Manganas, Jo Wang, and Thomas Kim as they dive in to their passion for products, vehicles and Industrial Design.",
        "language": "en",
        "author_name": "Sherif Jo & Thomas",
        "slug": "objectpassion",
        "cover": "20210325_154314_9b14862222fc0ccf6e0df3434c8e4ee1.jpg"
    },
    {
        "podcast_id": 29738,
        "title": "ramp Podcast: »Unterwegs mit Kaminer« by BMW Bank Drivers Club",
        "description": "Immer wenn Bewegung ins Spiel kommt, wird es spannend. Wer unterwegs ist, entwickelt und verändert sich. Das Auto wird zu einem wunderbaren verstärkenden Instrument, zu einem Freund. Mit ihm sind wir unterwegs zu Menschen, Orten, Ereignissen. Mitten im Leben. Zugleich bietet sich das Auto als Rückzugsort an. Ein sehr privater Raum, in dem wir ganz bei uns sein können. Die Welt aus einer Distanz erleben. Musikhören, Nachdenken, Träumen, Ruhe im Lärm der Welt erfahren. Mit dem Auto können wir Geschichten erleben. Roadmovie-Feeling eben. \n\nGenau diese Geschichten sind es, die unseren neuen ramp Podcast prägen – und die von Schriftsteller, Bestseller-Autor und ramp-Kolumnist Wladimir Kaminer erzählt werden.",
        "language": "de",
        "author_name": "ramp.space",
        "slug": "ramp",
        "cover": "20210325_132450_f7d3104363059c8cb1ebc890488be04f.jpg"
    },
    {
        "podcast_id": 31964,
        "title": "The Fortnight Podcast",
        "description": "Welcome to The Fortnight Podcast, where I'll be speaking to founders, businesses and experts from the creative industries to talk about all things design, growth, adaptability and innovation, among other bits and bobs. Discover the secrets behind the success of others and use that insight, as well as enjoying some light hearted entertainment on occasions.",
        "language": "en",
        "author_name": "Sam Blackie",
        "slug": "fortnight",
        "cover": "20210219_134219_374c228cae057516ca5316503d099046.jpg"
    },
    {
        "podcast_id": 32830,
        "title": "The Careful Photograph",
        "description": "“The Careful Photograph” features the voices of photographers of color who are challenging, subverting, and highlighting some of the problems and paradoxes of the photographic medium in our current moment. In each episode we focus our conversation on a single photograph by the artist. From there, I try to let the artist shape the conversation, and what has emerged are nine episodes (so far) that can be used as a teaching tool, or a course in itself about how to look at photographs and look “with care.” Each episode ends with a praxis assignment, visual exercise, or creative prompt for students or listeners. I am looking forward to sharing them with you.\n\n“The Careful Photograph” is made possible by the MCSI at Pitzer College. As Director of the Monroe Center for Social inquiry this public podcast will serve as a companion to my MCSI course offering, “Photography and the Racialized Body,” a course which stems from my own long engagement with questions of identity, the body, and the history of photography and race in America.",
        "language": "en",
        "author_name": "Tarrah Krajnak",
        "slug": "thecarefulphotograph",
        "cover": "20210315_213632_de58eb04ed7b4c6c4ae0832c33464b5c.jpg"
    },
    {
        "podcast_id": 33948,
        "title": "Exit 11 podcast",
        "description": "Sports, fashion and pop culture.  Look out for links with great info to view and merchandise to purchase.",
        "language": "en",
        "author_name": "Ricardo Chery",
        "slug": "exit11podcast",
        "cover": "20210219_034237_276c8b0cef6b647a992f44c3d13419cd.jpg"
    },
    {
        "podcast_id": 34473,
        "title": "Hi",
        "description": "this is kawsar islam here",
        "language": "en",
        "author_name": "KAWSAR ISLAM",
        "slug": "kawsar",
        "cover": "20210220_052035_c6e4ea46ee748426f0c6ce9d72d2998a.jpg"
    },
    {
        "podcast_id": 35877,
        "title": "Design Prat",
        "description": "Design Prat er en studentpodcast om design på et utforskende format. Podcasten er en innsats for å skape noe klarhet og oversikt i en voksende og stadig mer kompleks designverden. Gjennom samtaler med kompetente gjester, undersøker vi designbegrepet, designerens varierende roller og generelt interessante ting og tang som finnes innenfor domenet, sammen.",
        "language": "nb",
        "author_name": "Sebastian Oliver Dahl",
        "slug": "designprat",
        "cover": "20210223_171706_c215a6676c86edda2a75c577be4cc14c.jpg"
    },
    {
        "podcast_id": 36145,
        "title": "Teh Time",
        "description": "My podcast aims to highlight inspiring and creative women from underrepresented backgrounds.",
        "language": "en",
        "author_name": "Adilla Jamaludin",
        "slug": "tehtime",
        "cover": "20210301_231802_5d7733d54673640bf5d9978407ff0b92.jpg"
    },
    {
        "podcast_id": 38288,
        "title": "Toys on Tap",
        "description": "<p>A podcast that interviews artists that make toys in the professional, independent, bootleg, and designer toy scenes!</p>",
        "language": "en",
        "author_name": "Toys on Tap",
        "slug": "toysontap",
        "cover": "20210808_010517_d436889b588ec6624d328ef1311277f1.jpg"
    },
    {
        "podcast_id": 38377,
        "title": "ArtCollab",
        "description": "ArtCollab is a monthly zoomcast with artists Sarah Matthews and Nathalie Kalbach, sharing an inspiring and entertaining look at their artistic collaborations and discussing the artistic journeys they embark upon together.",
        "language": "en",
        "author_name": "Nathalie Kalbach and Sarah Matthews",
        "slug": "artcollab",
        "cover": "20210303_142043_68b418e5a1c4ce5257753c5dea5183b9.jpg"
    },
    {
        "podcast_id": 38653,
        "title": "Flowers After Hours with My Lady Garden",
        "description": "Flowers After Hours is a conversational style Podcast where founder of My Lady Garden, Kai, speaks with likeminded creatives about business, lifestyle and music. Episodes released monthly! ",
        "language": "en",
        "author_name": "Kai ",
        "slug": "flowersafterhours",
        "cover": "20210805_134847_3237354d40060fc350264c1a71cf7dd1.jpg"
    },
    {
        "podcast_id": 39125,
        "title": "Freedom By Design",
        "description": "Host Kris Picard-Kerscher invites you behind the scenes of her design business. Sharing inspirational stories on the highs and lows of entrepreneurship while balancing life, mental health and everything in between - nothing is off the table. There's no roadmap for life or business, but you're not alone in either. @femmecollectivestudio // www.femmecollectivestudio.com",
        "language": "en",
        "author_name": "Kris Picard-Kerscher",
        "slug": "freedombydesign",
        "cover": "20210306_041645_14bab4f8a62a5f9cb6f088c323b192c5.jpg"
    },
    {
        "podcast_id": 39501,
        "title": "BUCK FIM",
        "description": "The new AEC Podcast all about everything relating to Project Lifecycle Management. We will be doing AEC Software Reviews, Speaking with AEC Industry Pro's, Speaking with AEC Software Developers about up and coming products, Contractor and Consultant Hardware Testing and even help you with some Tech tips along the way!",
        "language": "en",
        "author_name": "Dennis Dixon",
        "slug": "buckfim",
        "cover": "20210307_191045_2061bbe62bcec16a91b832d8848ff5e6.jpg"
    },
    {
        "podcast_id": 41723,
        "title": "Off Air: The Juicy Designer Podcast",
        "description": "CEO and brand designer Katie Proctor from Wildflower Design Co. is here to spill the tea on what it's really like to own a freelance design business. Unfiltered, there is nothing that she is afraid to talk about, with the episodes being jam packed full of juicy content. You'll learn, laugh and share stories as Katie and guests dive deep into behind the scenes and their experiences of owning their own businesses. Whether you're starting out or an established designer, you're bound to relate and find a community of likeminded designers. *note, our first season is co-hosted by the wonderful Abi from @_abidesign",
        "language": "en",
        "author_name": "Katie Proctor",
        "slug": "offair",
        "cover": "20210811_093906_11b8d7bab79a5ef83397de60ab89ec09.jpg"
    },
    {
        "podcast_id": 42078,
        "title": "Lives on Paper",
        "description": "A character creation podcast where two siblings make various playable characters from interesting concepts. \n\nAll character information can be found in each episode description via Google Doc.\n\nWe have no set release schedule, but aim for every other Friday. Thank you for your patience!\n\nAny ads found in an episode were not approved by the hosts. This is a non profit passion project for us and would like to know if one interrupts the episode.\n\nContact us @LivesOnPaper on Twitter.",
        "language": "en",
        "author_name": "Jordan and Megan",
        "slug": "livesonpaper",
        "cover": "20210317_024706_88aa45425474860b7f9b28bb4dd4e719.jpg"
    },
    {
        "podcast_id": 48865,
        "title": "The Makers Garage Podcast --  by Carbide 3D",
        "description": "Short bite interviews of artists, creative professionals and people building businesses  with a CNC machine and some imagination.  This show will inform your own design process, business building and creativity.  Informative and interesting stories from the front lines of design creation.  Hosted by Kevin Barnett",
        "language": "en",
        "author_name": "Kevin Barnett",
        "slug": "themakersgarage",
        "cover": "20210412_185048_32127cbfc499620eab4914ec1b636ea9.jpg"
    },
    {
        "podcast_id": 50965,
        "title": "Latitude Podcast",
        "description": "Latitude is a podcast about the built enviroment that investigates architecture, design, and visual arts, and how these relate to issues of territory, citizenship, and ecosystems.",
        "language": "en",
        "author_name": "Karla Aguiñiga",
        "slug": "latitudepodcast",
        "cover": "20210420_235953_fc0a364ce00eac9ace0f1813128c8158.jpg"
    },
    {
        "podcast_id": 51893,
        "title": "Eff the Glitter",
        "description": "Teaching Business & Life Lessons Through Women of Color in Creative Careers.\n\nCentered around the lack of representation of Women of Color in the Graphic Design & Branding space, the freelance lifestyle, growing our skills, and how we can change our demographic to have more heavy hitters.",
        "language": "en",
        "author_name": "Ashlee Green",
        "slug": "efftheglitter",
        "cover": "20210424_183048_cc10ec561636cfc96118f0a7e3661729.jpg"
    },
    {
        "podcast_id": 57233,
        "title": "Remote Work Conversations",
        "description": "For my final major project at the University of the Arts London, I looked into the rise of remote work culture along with the impact it's had on our lives, personally and professionally. The emerging culture doesn't seem to have a set of defined ethics or a formal body of foundation which is why I'm here today to start a conversation with people about Remote Work. I want to share with the world the unique perspectives that individuals across demographics and industries bring which I would hope will assist everyone in making more informed decisions and thoughtful considerations with regard to remote work.",
        "language": "en",
        "author_name": "Ashanjelly",
        "slug": "ashanjelly-coversationswithharshit",
        "cover": "20210613_063610_1a9dd2a57be2964fd2bd03bd5e5e67c9.jpg"
    },
    {
        "podcast_id": 58033,
        "title": "Can Architecture Fix This? ",
        "description": "'Can Architecture Fix This?' is a podcast from White arkitekter in Oslo. Join host Rebekah Schaberg and producer Ingjerd Sandven Kleivan for discussions and interviews with experts in the fields of design to see if we can answer the question: Can Architecture Fix This? - whatever this may be!",
        "language": "en",
        "author_name": "White arkitekter Oslo",
        "slug": "caft",
        "cover": "20210520_113352_2358b1f03e4037f8ff89a045c50153f5.jpg"
    },
    {
        "podcast_id": 60262,
        "title": "That's Fire Bro Podcast",
        "description": "A podcast amongst friends chatting it up about personal experiences, sports, entertainment, and daily topics about today's world.\n",
        "language": "en",
        "author_name": "That's Fire Bro",
        "slug": "thatsfirebropodcast",
        "cover": "20210601_003019_cf5975c28138796946e9bddef6bd9c63.jpg"
    },
    {
        "podcast_id": 60274,
        "title": "State of the Art",
        "description": "Chatting about tech, design, and whatever we want.",
        "language": "en",
        "author_name": "State of the Art",
        "slug": "state-of-the-art",
        "cover": "20210825_203401_0b88ee88c19b719af2eff81e4eee3a1e.jpg"
    },
    {
        "podcast_id": 64931,
        "title": "SCREAM*LIVE",
        "description": "Scream*Live - Ep. @\n—————————————\nConversaciones entre amigos de la comunidad creativa, en un espacio digital.\n\n\nEn SCREAM * LIVE noche a noche podrás conocer a referentes y agentes claves en el mundo de la tecnología, gastronomía, música, arte, moda, innovación y todo aquello que hoy es, o será tendencia.\n\n\nYoutube: https://tinyurl.com/337tmc85\nSpotify: https://tinyurl.com/45txpt72\nInstagram: https://www.instagram.com/mijangos\nPowered by podbox.com ",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "screamlivemijangos",
        "cover": "20210625_155744_14d3991f425520e59288bd05160e88ac.jpg"
    },
    {
        "podcast_id": 69550,
        "title": "My Awesome Podcast",
        "description": "<p>Starting my podcast on RSS.com was easy and only took a few minutes! 🙌🏼 RSSVERIFY</p>",
        "language": "en",
        "author_name": "Akira Katz",
        "slug": "awesome-podcast",
        "cover": "20210722_193050_1a4e74f3bc9470f944280c4b5b2f7eab.jpg"
    },
    {
        "podcast_id": 69716,
        "title": "No Contest",
        "description": "A series of conversations with placemakers on the stuff that makes us human and the stuff that humans make.",
        "language": "en",
        "author_name": "No Walls Studio",
        "slug": "no-contest",
        "cover": "20210723_172916_422181d19c64e160b2381891df561273.jpg"
    },
    {
        "podcast_id": 71974,
        "title": "Pabs & Charles Talk Design",
        "description": "It's Pablo Stanley & Charles Patterson talking about design with their friends (you!)",
        "language": "en",
        "author_name": "Pabs & Charles Talk Design",
        "slug": "talkdesign",
        "cover": "20210805_165002_3d285450ee6ee90caa0e4755244b94a2.jpg"
    },
    {
        "podcast_id": 71991,
        "title": "The Art of Design ",
        "description": "I am Ana Maria a wife, mother, furniture and interior designer sharing design trends, tips & tricks. Follow me to learn more about this creative designer world. Be inspired!",
        "language": "en",
        "author_name": "Ana Maria Martinez-Stumpo",
        "slug": "theartofdesign",
        "cover": "20210930_181443_eb9f9a98348a5c79a8490fc8834f63d8.jpg"
    },
    {
        "podcast_id": 73952,
        "title": "WHAT ABOUT US?",
        "description": "Everyone has a story to tell.. Whats yours?",
        "language": "en",
        "author_name": "Estela Starr",
        "slug": "whataboutus",
        "cover": "20210817_002348_dc99084b2bb0162166e4ffdbce9fc7d5.jpg"
    },
    {
        "podcast_id": 73970,
        "title": "Deeze Spaces",
        "description": "Join Deeze in a series of interviews and Twitter Spaces where he chats with the most interesting creators and collectors in the NFT world. \n\n\n\nDeeze can be found on Twitter: @DeezeFi and @DeezeSpaces\n\n\n\nArchived Episodes can be found at www.soundcloud.com/deezefi\n\n\n\nDeeze is an avid NFT collector and community manager for @fractional_art. Their work and dedication to fractionalized NFT works can be found at www.fractional.art. \n\nDisclaimer: The speakers on Deeze Spaces are not registered investment advisors. All opinions shared on Deeze Spaces or via Twitter, Discord, and other public channels are those of the respective individuals alone and do not represent any views or endorsements from The Fractional Token Company. Nothing discussed in this podcast should be relied upon for investment decisions nor is it investment advice. Deeze Spaces are solely for information and entertainment purposes only. Please consult and work directly with tax, legal, financial, and investment professionals before making any token creation, transferring, and purchasing decisions.\n",
        "language": "en",
        "author_name": "Deeze",
        "slug": "deezespaces",
        "cover": "20210817_201938_ec66ec054fb2c5d105dcaf2a6bcaa45f.jpg"
    },
    {
        "podcast_id": 74032,
        "title": "Sewing for Drag Queens",
        "description": "As a designer / maker and lover of all things drag, I'm interested in the people behind the costume as much as I'm interested in the performers wearing it. In this podcast I want to explore and understand the process behind the end product by speaking to the people that MAKE. ",
        "language": "en",
        "author_name": "Laura Blackwell",
        "slug": "sewingfordragqueens",
        "cover": "20210817_114458_eaa32a3d1ac17efb365c35b410ba16b2.jpg"
    },
    {
        "podcast_id": 76703,
        "title": "We are... Architecture!",
        "description": "Welcome to “We are… Architecture” an original podcast created by the American Institute of Architecture Students chapter at PennState. Inspired by the minds around us: from our professors, mentors, advisers, and more.. thank you for listening ",
        "language": "en",
        "author_name": "AIAS PennState",
        "slug": "wearearchitecture",
        "cover": "20210929_192526_f65790f503b23dc32d1eb0e55f26f6e9.jpg"
    },
    {
        "podcast_id": 77690,
        "title": "The Creative Trust ",
        "description": "The Creative Trust Podcast is a celebration of 20 years of Gloss Creative. Together with our Stellar Alumni we share everything we know to be true about the Creative Process and the business reality of a small but powerful design platform.\n\nSubscribe to The Creative Trust Podcast and you'll have access to behind the scenes workings of our scenography, installations, event design and creative processes. Our Creative Director Amanda Henderson chats with the creatives and makers who have 20 years of serious visual candy.\nThe Gloss Alumni share what they know, we promise there will be mountains of discussion and tips on the creative process, design knowledge shared and life experience hacks. Everything you need for a lifetime of creative work. \nAmanda is curious about where creativity starts, her first question to her guests always, how did you become creative? \nAmanda apologizes in advance for saying 'I guess' too many times but hey, you can only be yourself.\n\nWe acknowledge the traditional custodians of the land on which The Creative Trust Podcast is recorded The Wurundjeri people, Elders past and present of The Kulin Nations, Naarm (Melbourne, Australia)",
        "language": "en",
        "author_name": "Gloss Creative",
        "slug": "thecreativetrust",
        "cover": "20210906_114005_ff3563e2da9655e6df14d5117c236068.jpg"
    },
    {
        "podcast_id": 80542,
        "title": "Rose Friday",
        "description": "\nCreative conversations with exciting brands over a glass of Rosé. Our weekly conversations are continuing each week on Instagram live at 4pm with more guests and more Rosé. ",
        "language": "en",
        "author_name": "The Life Style Edit",
        "slug": "rosefriday",
        "cover": "20221018_021006_c6045257391a006a45a709b1aaaa4345.jpg"
    },
    {
        "podcast_id": 80859,
        "title": "Transformation Alley by 24G",
        "description": "Welcome to Transformation Alley by 24G, where we explore our latest digital solutions and the shaping of the digital future. Join us for exciting conversations from 24G experts and industry leaders. ",
        "language": "en",
        "author_name": "24G",
        "slug": "transformationalley",
        "cover": "20210922_192406_166fdfa6e6d8fa97bd207082c280db93.jpg"
    },
    {
        "podcast_id": 81549,
        "title": "R.CONVERSATIONS",
        "description": "The R.SPORT team are behind the mic and bringing you conversations with diverse individuals and collectives monthly! You will be in the safe hands of our show host Kit Harvey, an elite Centre Back on the pitch and Conversationalist off the pitch. Sit back and enjoy the conversations!",
        "language": "en",
        "author_name": "R.SPORT",
        "slug": "r-conversations",
        "cover": "20210926_104902_a41dd81347dab12053cbd2671b8ab7ab.jpg"
    },
    {
        "podcast_id": 84682,
        "title": "Getting Personal with Designers",
        "description": "The podcast will be hosted by Tamir Shuster from Precise, a firm that works hand in hand with designers, architects and engineers for more than 25 years. In each episode, Tamir will dive into an intimate conversation, with the leading voices in the A/E field.\n",
        "language": "en",
        "author_name": "Tamir Shuster",
        "slug": "gettingpersonawithdesigners",
        "cover": "20211202_021234_4810896dd15dc30775dfd91d2f3db28a.jpg"
    },
    {
        "podcast_id": 84775,
        "title": "Wine and Design with Megan Weeks",
        "description": "Welcome to the Wine and Design podcast where we discuss graphic design, speak with experts in the industry and inspire each other to share our craft. My name is Megan Weeks, with over 7 years of experience in graphic design I decided it was time to start sharing my knowledge about the industry. Grab your glass of wine (or coffee lol) and join me as we connect as creatives.",
        "language": "en",
        "author_name": "Megan Weeks",
        "slug": "wineanddesign",
        "cover": "20221208_041258_b1ba45768d360797f91a2ac0a41f9cb9.jpg"
    },
    {
        "podcast_id": 86064,
        "title": "Decolonising the Profession",
        "description": "A series of discussions surrounding the absence of Indigenous representation within the Australian Architectural Profession.",
        "language": "en",
        "author_name": "Nathan Brandrick",
        "slug": "decolonising-the-profession",
        "cover": "20211019_234235_5c7df98e65ce4ac419a1215fe8bc230c.jpg"
    },
    {
        "podcast_id": 86311,
        "title": "Whatever Comes Next",
        "description": "The number one podcast for creatives (according to our Mums).",
        "language": "en",
        "author_name": "Dani Hayman & Alysse Curran",
        "slug": "thewcnpod",
        "cover": "20211021_083053_f815fe0a7ae5abff0d18b1b7e0e2a5eb.jpg"
    },
    {
        "podcast_id": 87789,
        "title": "UNYQ",
        "description": "Welcome to the UNYQ podcast! In this series, we will be having conversations with inspiring human beings about their amputee journeys, body image, mental health and the prosthetic industry. We hope to encourage, educate, make you laugh, and open you up to new reflections. Grab a cup, and join in on these thought-provoking, open conversations. ",
        "language": "en",
        "author_name": "Eythor Bender",
        "slug": "unyq",
        "cover": "20220408_120413_9d78144db299d4888420408cf4825270.jpg"
    },
    {
        "podcast_id": 88272,
        "title": "Talks with Glo",
        "description": "I am a first-year doctoral student at Duke University, studying to become an occupational therapist with a certificate in theology. I am a daughter, sister, aunt, cousin, friend, and overall lover of people. This is a journey that I am not completely sure of right now, but it would be an honor to have YOU join me in this journey of this podcast, where we have Talks with Glo! Enjoy the ride. ",
        "language": "en",
        "author_name": "Gloria Cesar",
        "slug": "talkswithglo",
        "cover": "20211101_194446_03af3813150ec690d4c09af6af41285e.jpg"
    },
    {
        "podcast_id": 90690,
        "title": "Design Echo",
        "description": "<p><strong>Design Echo</strong> adhering to bringing about a change in Architecture/Interior Design Fraternity, where great minds can stretch the real dimensions, address the current state of Architecture and locate the crux of Architectural Future. The integration of great minds via this Summit will hopefully make the young and the grown to find the purpose behind Architecture and it’s meaning. PODCAST From Greatest Minds and World-Changing Thinkers in Architectural and Interior Design Community Initiative by <strong><em>The Architect's Diary</em></strong><em>.</em></p>",
        "language": "en",
        "author_name": "IIDA Summit",
        "slug": "nature-inspired-design",
        "cover": "20230602_070648_d39468703db86d76e342a1b974f2c1fb.jpg"
    },
    {
        "podcast_id": 90712,
        "title": "The Curious Creatives",
        "description": "A podcast which explores the world of art & design. Hosted by a collection of industry and teaching enthusiasts, join our discussion and listen to ideas, projects, and concepts within the creative industries sector and how you can transform your initial artistic instinct into a life-long passion and career.  Each episode will feature conversations from various disciplines within the world of art & design and invite panellists from the local and global stage to discuss their creations and concepts.\n \nThis podcast is sponsored by Wrexham Glyndŵr University.\nJoin the discussion today at @ArtDesignWales ",
        "language": "en",
        "author_name": "Various Hosts",
        "slug": "thecuriouscreatives",
        "cover": "20211115_135841_215b23be0df157b9fd0a0ef9b4b8e1b3.jpg"
    },
    {
        "podcast_id": 91098,
        "title": "The BHS PawCast",
        "description": "The BHS PawCast is a student led operation where we bring entertainment or news via a podcast.",
        "language": "en",
        "author_name": "Joey Jolin",
        "slug": "bhspawcast",
        "cover": "20211117_144104_f6e495c568766c1cf7669b3cf8fd9d2b.jpg"
    },
    {
        "podcast_id": 92280,
        "title": "FAIRMATE FOCUS",
        "description": "Fairmate is an India-based multinational company. We manufacture and market construction chemicals that enhance the build quality, longevity, and aesthetics of structures ranging from buildings, highways, airports, flyovers, tunnels, and monuments. We offer a range of 500+ products that we market through our vast network that covers fifteen countries across four continents.",
        "language": "en",
        "author_name": "FAIRMATE CHEMICALS",
        "slug": "fairmate-focus",
        "cover": "20211124_111150_2e7a75edb9f612c7041067dfd4b7118e.jpg"
    },
    {
        "podcast_id": 92334,
        "title": "Exploring Creativity",
        "description": "Our goal is to inspire, educate and provide a community for creative people to do the best work of their entire lives.",
        "language": "en",
        "author_name": "Michael J. Morgan",
        "slug": "exploring-creativity",
        "cover": "20211124_051144_1e713820231d2395e45ca57147d987ef.jpg"
    },
    {
        "podcast_id": 92623,
        "title": "BetongPod",
        "description": "podcast from our skatepark sites",
        "language": "nb",
        "author_name": "betongpark podcast",
        "slug": "betongpod",
        "cover": "20211126_111146_11ebf9d1444984b7b976bb5b0fb4474b.jpg"
    },
    {
        "podcast_id": 95203,
        "title": "MKs Archive ",
        "description": "Interviews with creatives within the technical and outdoor fashion space. ",
        "language": "en",
        "author_name": "MK",
        "slug": "mksarchive",
        "cover": "20211223_071255_a177114762acd2dc7b3354e57f29e9d2.jpg"
    },
    {
        "podcast_id": 96949,
        "title": "Test 1 ",
        "description": "I am sharing why I love churros and coffee",
        "language": "en",
        "author_name": "Test 1 ",
        "slug": "churrosandcoffee20",
        "cover": "20220402_120415_989ae608dc4355adf4631f65259fd260.jpg"
    },
    {
        "podcast_id": 100323,
        "title": "The Designers Lunch Break - by Designer Duo",
        "description": "<p>Welcome to the designers lunch break! We’re Rach and Kiya, two designers who love everything design and business. This podcast we talk about our dilemmas, nightmare clients, CrossFit (lots of it from Rach 😂), Kiya’s love of animals (especially horses 🐎!) and general life. </p><p>Disclaimer: we can’t promise we will stay on topic!!!!</p><p>Follow us on instagram: @<a href=\"http://designerduo.studio\">designerduo.studio</a></p>",
        "language": "en",
        "author_name": "Designer Duo's - Kiya & Rach ",
        "slug": "designerduos",
        "cover": "20230227_040245_795d91146ad596dc6e8f53c4e29294eb.jpg"
    },
    {
        "podcast_id": 100600,
        "title": "Parties In Our Galaxy ",
        "description": "A Fun & Informative Podcast where I share tips, tricks & inspiration for planning an amazing party! I will also feature different party vendors who share Ideas for you! I will definitely be talking about trending balloon ideas too! Sit Back & Enjoy the Party!",
        "language": "en",
        "author_name": "Wendy Stars Above Balloons",
        "slug": "partiesinourgalaxy",
        "cover": "20220113_050101_f5254cfbd62cf05e110a80d7e7b2f543.jpg"
    },
    {
        "podcast_id": 101784,
        "title": "Press Start Podcast",
        "description": "Friends talk about various video games from both Consumer and Design POVs",
        "language": "en",
        "author_name": "Daylan Weatherup",
        "slug": "pressstartpodcast",
        "cover": "20220119_120102_c0cb86335461279c2f7d04d266445389.jpg"
    },
    {
        "podcast_id": 102430,
        "title": "RCAD Initiative: Interviews with Political Artists",
        "description": "Presenting a podcast interview series designed to inspire and encourage art-activist processes and plays to catalyze social change. Featuring global political artists and their stories of resilience and care in response to our times, and informed by our histories in the making, and the socio-political spheres of our everyday lives. ",
        "language": "en",
        "author_name": "RCAD Initiative",
        "slug": "rcadinitiative",
        "cover": "20220121_050100_2ab6d0cd5839a186e5fa79a7bee270e7.jpg"
    },
    {
        "podcast_id": 104209,
        "title": "Micro Welding Tech",
        "description": "Listen to Sunstone Welders lead engineers, product managers, and micro welding consultants talk about new micro welding technologies and how it's helping people all over the world. Learn about new micro welding tech, micro welding customers, how to make money in micro welding and be the first to hear about new micro welding developments from Sunstone!",
        "language": "en",
        "author_name": "Sunstone Welders",
        "slug": "micro-welding-tech",
        "cover": "20220127_070143_23c474045dbdde19bc9f85026ce107a1.jpg"
    },
    {
        "podcast_id": 104211,
        "title": "WTMY! | Wise To Meet You!",
        "description": "Wise To Meet You! (WTMY!) gaat verder dan een 'Nice to meet you!'. We gaan verder dan het normale, beleefde praatje en het liefste praten we direct over wat relevant en belangrijk is. Wat mag best eens gezegd mag worden of naar gevraagd mag worden? Dat bespreken we graag. We willen weten wat de personen die we interviewen motiveert en hoe zij tot hun visie zijn gekomen. De gesprekken gaan in de kern over vrijheid en we nodigen je uit om samen met ons te luisteren naar elkaars ideeën hierover en er ook over in gesprek te gaan met je omgeving. ",
        "language": "nl",
        "author_name": "Wise To Meet You!",
        "slug": "wisetomeetyou",
        "cover": "20220127_070106_f74aec909e4dcce8d2be66f1cf049181.jpg"
    },
    {
        "podcast_id": 106943,
        "title": "Product Safety Broadcasting Service",
        "description": "Hosts Jared and Keith bring all-killer - no-filler, unnecessary, yet needed, consumer product safety banter to the open market. \n\nTo become a guest and BS with us - contact Keith or Jared. \n",
        "language": "en",
        "author_name": "Jared & Keith",
        "slug": "psbs",
        "cover": "20220207_040237_fa571ecb27a4c49cc0c0290bfe21f73d.jpg"
    },
    {
        "podcast_id": 107097,
        "title": "AdYack",
        "description": "The Official Podcast of the American Advertising Federation of the Greater Lehigh Valley. Our mission is to inspire creativity and enhance the professional development of the advertising and marketing communities where we live and work. I'm your host Bill Childs. And I'll talk with artists, designers, writers, directors, photographers, along with those who work in a creative capacity. Our aim here is to serve as a creative resource to help you stay informed, entertain, and above all, inspired.",
        "language": "en",
        "author_name": "American Advertising Federation of the Greater Lehigh Valley",
        "slug": "adyack",
        "cover": "20220207_070204_69d403d8884a328d3440a2d9569daf6e.jpg"
    },
    {
        "podcast_id": 108803,
        "title": "Moda por Amor",
        "description": "Diálogos irreverentes e NADA fúteis para deixar bem claro que a moda importa.",
        "language": "pt-br",
        "author_name": "Erika Gottsfritz",
        "slug": "modaporamor",
        "cover": "20220218_030244_049152b791199183881b1d0606b44650.jpg"
    },
    {
        "podcast_id": 108934,
        "title": "El Periscopio - Conversaciones Lúcidas sobre el diseño del mañana",
        "description": "El Periscopio es un espacio creado por Lúcid Design Agency con el objetivo de generar conversaciones alrededor de nuestro gran activo: el diseño.\n\nA través de El Periscopio abordamos el diseño desde múltiples perspectivas. Desde el pasado y desde el futuro. Desde las empresas, desde las instituciones o a través de nuestros referentes. Pero también desde las tendencias y la actualidad. \n\nUn espacio de conversaciones amenas e imprevisibles que pone en valor el poder transformador del diseño. \n\nAquí descubrirás más sobre nosotros: www.lucid.pro ",
        "language": "es",
        "author_name": "Lúcid Design Agency",
        "slug": "episodio1-fresh-people",
        "cover": "20220428_100452_73c68274e9e5c1b843ee3f0d52b423f7.jpg"
    },
    {
        "podcast_id": 111505,
        "title": "Habilidades Interpersonales HHGD_U2_EA_DAMD",
        "description": "Habilidades Interpersonales:\nComunicación\nResolución de conflictos\nNegociación\nMotivación",
        "language": "es",
        "author_name": "Darío Molina Díaz",
        "slug": "habilidadesgerenciales",
        "cover": "20220226_040247_23cbba86e44fdba87e69a72dcb3e6281.jpg"
    },
    {
        "podcast_id": 111916,
        "title": "FASHION LAW PODCAST",
        "description": "<p>Te doy la bienvenida a THE FASHION LAW PODCAST, el podcast de Derecho de la moda y Fashion Law Classroom</p><p>Soy Pame Echeverría, creadora de la cuenta de Instagram @derechodelamoda y del Fashion Law Classroom, primera escuela online dedicada enteramente a la enseñanza de #fashionlaw para estudiantes y profesionales de Argentina y el mundo</p><p>Desde el año 2011 trabajo en derecho de la moda, tanto en el ejercicio profesional como en el ámbito académico, formando profesionales de la industria como del derecho</p><p></p><p>En el año 2015, fui invitada por Susan Scafidi  para ser la única expositora argentina en el evento anual del Fashion Law Institute en la Ciudad de Nueva York y en el 2021, Derecho de la Moda llego a la Facultad de Derecho de la Universidad de Buenos Aires, donde dicto la primera materia de grado en derecho de la moda de la Argentina</p><p></p><p>Si sos amante de la moda y el derecho, este es tu podcast!</p><p></p><p>A lo largo de los episodios, te invito a recorrer esta fascinante disciplina y caminar esta pasarela del derecho de la moda juntos</p><p></p>",
        "language": "es",
        "author_name": "Pame Echeverría",
        "slug": "derechodelamoda",
        "cover": "20230529_110518_76af3ed87af352b60e3f6874bb6edda4.jpg"
    },
    {
        "podcast_id": 112572,
        "title": "360 MAG: a no-nonsense conversation",
        "description": "<p><strong>GREEN | DESIGN | POP | NEWS</strong></p><p>Hosts: <a href=\"https://the360mag.com/vaughn\">Vaughn Lowery</a>, <a href=\"https://the360mag.com/javier\">Javier Pedroza</a>, <a href=\"https://the360mag.com/armon\">Armon Hayes</a>, <a href=\"https://the360mag.com\">LaJune Grant</a></p><p><a href=\"https://the360mag.com/media-kit\">360 MAGAZINE</a> is an award-winning pop publication on green trends and leading brands for diverse innovators. QR-coded print/tablet formats marry podcast and website. Purchase: <a href=\"https://www.amazon.com/s?i=stripbooks&amp;rh=p_27%3A360+Magazine&amp;s=relevancerank&amp;text=360+Magazine&amp;ref=dp_byline_sr_book_1\">Amazon</a>, <a href=\"https://apps.apple.com/us/app/360-mag/id595648724\">Apple</a>, <a href=\"https://www.barnesandnoble.com/s/%22360%20MAGAZINE%22?Ntk=P_key_Contributor_List&amp;Ns=P_Sales_Rank&amp;Ntx=mode+matchall\">BN</a>, <a href=\"https://play.google.com/store/apps/details?id=com.magzter.threesixty\">Google</a></p><p><a href=\"https://instagram.com/360magazine\">360</a> an <a href=\"https://business.nglccny.org/members/member/360-magazine-bronx-4571231\">NGLCC-certified</a> LGBT business that celebrates women, people of color, and the queer community.</p><p></p><p>2022-2023 © <a href=\"https://www.tiktok.com/@360magazine?_t=8acD5TrWhT8&amp;_r=1\">360 MAGAZINE INC</a> | <a href=\"https://twitter.com/360magazine\">360®</a> is a registered trademark.</p>",
        "language": "en",
        "author_name": "Vaughn Lowery",
        "slug": "360-mag-a-no-nonsense-conversation",
        "cover": "20230919_050919_f932b4ddd1a0f3a4a6505f5489e580f2.jpg"
    },
    {
        "podcast_id": 112953,
        "title": "max’s tunes",
        "description": "<p>MAX</p>",
        "language": "en",
        "author_name": "max r ",
        "slug": "numberoneicarly",
        "cover": "20230531_080514_c99933f85655565d1bb1ba644c163a60.jpg"
    },
    {
        "podcast_id": 121710,
        "title": "Design Is Not Neutral",
        "description": "Design is Not Neutral is a podcast built from a thesis project. As a present design master's student at the University of Notre Dame, I began a broader inquiry into the way design as a field was built and the way we now teach design. After doing more research, it became clear - that design in the United States has a diversity problem. The roots of our diversity issue are squarely in how we define and teach Graphic Design. Graphic Design was made for white, cis-gendered, able-bodied men in consumer-driven societies. With this foundation, how we determine what is ‘good design’ has become extremely exclusionary. Yet, despite increased conversation around equity, design education has yet to dramatically change. The designers and design educators interviewed on Design is Not Neutral have all deeply researched the field of design education in order to improve our field. This podcast will not only provide listeners with resources on how to challenge their own perceptions of what design has been defined by, it will also provide concrete examples of how this work is being done in classrooms. I hope you enjoy each conversation as much as I did and if you liked Design is Not Neutral please check us out on Instagram.",
        "language": "en",
        "author_name": "Grace Hamilton",
        "slug": "designisnotneutral",
        "cover": "20220412_080440_6cfe197f4c914f25395fd59eb27aebe9.jpg"
    },
    {
        "podcast_id": 124454,
        "title": "Edge & Flow Podcast",
        "description": "Edge & Flow Podcast is a joint effort between knife makers TJ Schwarz and Lucas Burnley, your hosts. Free flowing, unscripted conversations unfold as we endeavor to explore the knife industry, craftsmanship, business, creativity, and beyond.",
        "language": "en",
        "author_name": "TJ Schwarz & Lucas Burnley",
        "slug": "edgeandflow",
        "cover": "20220609_020619_a3e977f509e1ae722ca23940e9f3f431.jpg"
    },
    {
        "podcast_id": 127077,
        "title": "Not Just Pixels",
        "description": "Hi there! Not Just Pixels is a student-led UX Design podcast that strives to help you grow as a designer and get that next design internship or job. This is the podcast I wished I had as a design student. So, let's get started!",
        "language": "en",
        "author_name": "Guo Chen",
        "slug": "notjustpixels",
        "cover": "20220508_070507_6611cc01f51d40ec5ab88318bd40ab70.jpg"
    },
    {
        "podcast_id": 127552,
        "title": "BUILDING STRONG WITH NEW YORK DISTRICT ",
        "description": "USACE NEW YORK DISTRICT PODCAST ",
        "language": "en",
        "author_name": "PA STAFF",
        "slug": "building-strong-with-new-york-district",
        "cover": "20220510_060542_2e33aaf9024907e5bf4cbb14f2d2bb98.jpg"
    },
    {
        "podcast_id": 130189,
        "title": "Tecnologie di produzione",
        "description": "Io che spiego a me stesso le lezioni per l’esame di tecnologie di produzione ",
        "language": "it",
        "author_name": "Alessandro",
        "slug": "tecnologie",
        "cover": "20220524_090523_fc139ba9b2d63886e275c27f789a7782.jpg"
    },
    {
        "podcast_id": 130367,
        "title": "Matters of Experience",
        "description": "Matters of Experience is a podcast about the creativity, innovation, and psychology driving designed experiences and encounters. Each week Abby and Brenda dig into the who, how, so what and why of exhibitions, branded experiences, events, spectaculars, and all the crazy things designers and creatives are putting out there for people who just can’t get enough.",
        "language": "en",
        "author_name": "Lorem Ipsum Corp",
        "slug": "matters-of-experience",
        "cover": "20220525_080510_39741b085ae2e4a3000469fe3840a402.jpg"
    },
    {
        "podcast_id": 130534,
        "title": "Satiky09_ Show",
        "description": "Chiaccheriamo insieme",
        "language": "it",
        "author_name": "Satiky09_",
        "slug": "satiky09",
        "cover": "20220526_040551_ef202e0959274f0e280a34fb1e45a7cb.jpg"
    },
    {
        "podcast_id": 130910,
        "title": "Design Dorks",
        "description": "A Youtube collaboration between Designing For and The Duke of Dorks, Pyrrhickong and Duke get together to discuss various elements of video game design! Be it targeted topics like ranking the designs of every Smash Brothers character or debating the best written video game characters, plus a monthly update on games they've been playing, news, future releases, and a mailbag! Tune in for ridiculous discussions such as \"Why is a plant the best designed Mario character?\", \"Is Joy Mech Fight actually the best fighting game?\", and \"Is Kirby the ultimate secret to happiness?\" We laugh, we cry, we have a great time discussing video games, and we hope you all enjoy listening!",
        "language": "en",
        "author_name": "The Design Dorks",
        "slug": "designdorks",
        "cover": "20220528_080536_ae7d23ae8bdaea2025919e7e20ae4034.jpg"
    },
    {
        "podcast_id": 131644,
        "title": "How to Wear Clothes",
        "description": "Fashion talk and Outfit Inspo",
        "language": "en",
        "author_name": "Jenna",
        "slug": "howtowearclothes",
        "cover": "20220602_010615_a5e832436f8de9f6201db22db33fd979.jpg"
    },
    {
        "podcast_id": 132054,
        "title": "Impronta - Lica Steiner",
        "description": "\nCi sono persone che cercano di guardare la realtà nella sua totalità, persone che danno un senso e lasciano un impronta permanente nel mondo che li circonda. Una di queste è Lica Steiner, una designer che ha sempre cercato di andare più a fondo nelle sue domande più grandi, con sguardo critico e senza lasciare nulla al caso.\n\u2028In questo podcast emerge in tutta la sua completezza la figura di Lica, attraverso il rapporto unico con la figlia Anna Steiner\n",
        "language": "it",
        "author_name": "DesignVerso",
        "slug": "lica-steiner-designer",
        "cover": "20220604_040631_c222e0e256986875d89bd20ca1eeabd6.jpg"
    },
    {
        "podcast_id": 133345,
        "title": "Rincon del extraño",
        "description": "daremos información acerca de temas variados e interesantes para todo publico",
        "language": "es-mx",
        "author_name": "RichardrawnerHaker_005",
        "slug": "richardrawnerhacker005",
        "cover": "20220610_020637_bc1e8d1d5e8f8da3e7aea83e99a7178d.jpg"
    },
    {
        "podcast_id": 136181,
        "title": "Parents in Landscape Architecture - In Conversation With... ",
        "description": "A series of candid discussions with Parents in Landscape Architecture (PLAN) about what its like to be a working parent, how its affected career progression and what your day to day looks like with kids to juggle! \n\nA PLAN Committee project as part of the Australian Institute of Landscape Architects (AILA). ",
        "language": "en",
        "author_name": "kelsie davies",
        "slug": "inconversationwithplan",
        "cover": "20220623_080621_3b1e8021586428a1154ecd3991e84455.jpg"
    },
    {
        "podcast_id": 137595,
        "title": "DTC ecommerce",
        "description": "Brought to you by M3 Digital - We build DTC brands utilising growth strategy, paid media and creative. On the DTC ECOMMERCE podcast we talk about all things customer acquisition, retention and content. This is your one-stop shop to solving every-day direct-to-consumer brand problems. We'll talk about all things DTC growth and provide insights and solutions into how we're driving our brands forward.",
        "language": "en",
        "author_name": "M3 Digital",
        "slug": "dtcecommerce",
        "cover": "20220630_010621_281b8b222e18efd307d1b7d675bf6d11.jpg"
    },
    {
        "podcast_id": 138341,
        "title": "UrFavCreativ. ",
        "description": "Your friendly, neighborhood creative sharing her journey in hopes to relate or inspire anyone along their path. (@savagelife.tv)",
        "language": "en",
        "author_name": "Sav",
        "slug": "urfavcreativ",
        "cover": "20220725_070736_b4f9318e34c922f49662f54f20b8c021.jpg"
    },
    {
        "podcast_id": 139138,
        "title": "All About Information Technology",
        "description": "An introduction to Information Technology",
        "language": "en",
        "author_name": "Kenton Jones",
        "slug": "all-about-information-technology",
        "cover": "20220720_070738_011c4c199d00d014a481f6f9395b7213.jpg"
    },
    {
        "podcast_id": 140396,
        "title": "El Podcast de Dosmedia",
        "description": "En este podcast iremos tratando temas que nos interesan, novedades, tips, noticias y polémicas relacionadas con lo que más nos gusta: el marketing.",
        "language": "es",
        "author_name": "Dosmedia Agencia de Marketing",
        "slug": "dosmedia",
        "cover": "20220714_030715_bcac282070840ef8c945f0b45c85c76d.jpg"
    },
    {
        "podcast_id": 140681,
        "title": "Design30",
        "description": "It's time to design! Design30 is a weekly podcast providing useful design tools and strategies to improve creativity, innovation, and overall design confidence. I will discuss ideas both new and old, ranging from design thinking to design reviews on books and products. If you are somebody who is constantly looking for ways to step up your design game, this podcast is for you!",
        "language": "en",
        "author_name": "Jason Bilyeu",
        "slug": "design30",
        "cover": "20220716_120746_9418d775f3c02922c5919961d5ad3491.jpg"
    },
    {
        "podcast_id": 141560,
        "title": "Three Broke College Kids",
        "description": "<p>“Three Broke College Kids” with Max Johanson, Aidan Corbitt and Eric LaChance is a podcast that highlights interesting and impactful individuals around the community.</p>",
        "language": "en",
        "author_name": "Threebrokecollegekids",
        "slug": "threebrokecollegekids",
        "cover": "20230426_010410_570583973a3cc3b45b06e11968c0ac6b.jpg"
    },
    {
        "podcast_id": 142453,
        "title": "Quorum Live",
        "description": "Aqui encontraras el mejor contenido de arquitectura!",
        "language": "es",
        "author_name": "Mario Velazquez / Vicente Ocampo",
        "slug": "quorumlive",
        "cover": "20220725_030736_9eec42ae74e5472903bc1dad1ecf286a.jpg"
    },
    {
        "podcast_id": 142483,
        "title": "Noche de Sábado en Capital",
        "description": "Un podcast bien pro!",
        "language": "es",
        "author_name": "josuédric",
        "slug": "nochedesabadoencapital",
        "cover": "20220806_110846_c58043197dd54c297c0782939799b70f.jpg"
    },
    {
        "podcast_id": 144071,
        "title": "Diseñambre",
        "description": "Diseñambre es el espacio para todos los que tienen hambre de crecer. Aquí creceremos juntos escuchando a la gente que aún sigue luchando el día a día y como es que están donde están hasta este día.",
        "language": "es-mx",
        "author_name": "Ali Quiroga",
        "slug": "disenambre",
        "cover": "20220802_040837_dd846ca0474f66b939922186694b393b.jpg"
    },
    {
        "podcast_id": 146700,
        "title": "Una pitada más",
        "description": "Hola, soy Gianni y soy un fumon. No, esto no es otra de esas organizaciones para alcohólicos anónimos, este es mi podcast en el que voy a hablar de cualquier tema meramente interesante. Antes de empezar, les recomiendo que le den, una pitada más.",
        "language": "es",
        "author_name": "Gianni",
        "slug": "unapitadamas",
        "cover": "20220815_100833_2aa3e4e74ea5447ebe3880b00b62d833.jpg"
    },
    {
        "podcast_id": 147565,
        "title": "Check the Method Podcast",
        "description": "Check the Method podcast, is a podcast about the artist/creative process. In this podcast, contemporary artist and host M.Tony Peralta interviews different creatives from Artist, Chef's, Designers, Photographers, etc about their process in making work. \n\nPodcast is created, produced & edited by: M.Tony Peralta",
        "language": "en",
        "author_name": "M.Tony Peralta",
        "slug": "checkthemethodpodcast",
        "cover": "20220819_060813_425d4f6593cddf5fed0eefab8628c132.jpg"
    },
    {
        "podcast_id": 149492,
        "title": "We Need Closure",
        "description": "With nearly 20 years of real estate experience combined, REALTORS Kalyn McKittrick and Heather Teems are joining forces to give the people what they want: hilarious real estate stories from the REALTORS, clients and industry experts who have lived to tell the unbelievable tales of buying and selling real estate. Come for the stories. Stay for the interviews, insights and entertainment. Have an unbelievable real estate story? Submit your stories at stories@weneedclosure.com or on Instagram at @WeNeedClosurePodcast.",
        "language": "en",
        "author_name": "Kalyn McKittrick & Heather Teems",
        "slug": "weneedclosure",
        "cover": "20220828_070833_355bb8e391d7266e6e8f59bc52006445.jpg"
    },
    {
        "podcast_id": 151005,
        "title": "STANDBY",
        "description": "The boys are here to deliver the most honest and reputable advice and opinions on defensive/offensive gear and training. 4 different backgrounds from 4 different people. We’re comprised of two Air Force veterans (Phil Security Forces and Justin TACP), an absolute monster of a firearms/tactics training instructor TONY and all around great guy, as well as CRIS full time COP who works Southern Los Angeles County in a small city made famous. Our point man of the whole operation is one of our Veterans who also happens to be a full time COP while maintaining his Air National Guard service as a TACP . Between the 4 of us we’re prepared to share a large scope of experiences, previous and soon to come, to the masses on what’s what in the gear and training world. \n\nOur goal is to make sure persons ranging from average joe first time handgun buyer all the way to COPs/Military persons continue to train and have a community to do it.   ",
        "language": "en",
        "author_name": "STANDBY",
        "slug": "standby",
        "cover": "20220925_030934_040d862936e88eec31321df86cb225e3.jpg"
    },
    {
        "podcast_id": 151697,
        "title": "Tatler Singapore's Decoding Brilliance, in partnership with Tiffany & Co.",
        "description": "Decoding Brilliance is Tatler Singapore's new podcast series, addressing in-depth questions and conversations relating to the world of scintillating jewels. In partnership with Tiffany & Co., we are deep diving into the illuminating realms of jewellery, the social impact of gems, language of love, masterful craftsmanship and innovative design, marrying precious moments with precious stones. ",
        "language": "en",
        "author_name": "Tatler Singapore",
        "slug": "tatler-singapore-jewellery-decoding-brilliance-tiffany-and-co-paige-parker-labgrown-natural-diamonds",
        "cover": "20220907_060953_6aab0ecd9cb7116e9006321c1f9a547a.jpg"
    },
    {
        "podcast_id": 152771,
        "title": "ENTREVISTAS ASE",
        "description": "En este espacio se encuentran las entrevistas realizadas para la investigación primaria.",
        "language": "es-mx",
        "author_name": "Juan Pablo",
        "slug": "asejuanpablo",
        "cover": "20220911_110924_4be4d3ddcd86238a5dc139a88c876f56.jpg"
    },
    {
        "podcast_id": 153140,
        "title": "UBBE",
        "description": "Wij zijn de Podcast van de studievereniging CMD op het Avans Den Bosch genaamd Uerius Brabus. Noem ons maar UBBE. Coen, Anne-Fleur, Manuela en Roy nemen je mee naar weer bizarre verhalen over de studie en erbuiten. ",
        "language": "nl",
        "author_name": "Coen, Anne-Fleur, Manuela en Roy",
        "slug": "ubbe-podcast",
        "cover": "20220913_100912_39c95ed988ec40ca5aff3d882d000d5b.jpg"
    },
    {
        "podcast_id": 158010,
        "title": "BZ Podcast",
        "description": "A dermatologista Bárbara Zalcman estreia um podcast para falar sobre tudo que cerca o mundo da mulher como: beleza, saúde, moda, comportamento e lifestyle.\n",
        "language": "en",
        "author_name": "Bárbara Zalcman",
        "slug": "bzpodcast",
        "cover": "20221005_061033_cbbff9448b6a2103e7fd18506be348f6.jpg"
    },
    {
        "podcast_id": 159203,
        "title": "Trelliswork",
        "description": "Come with us on a journey while we try to take five good people and a core idea and make a company out of it. We are a pre-seed start-up out of Seattle trying to make a better home for your teams. As we strive to build the best product we can, take a behind-the-scenes look at how we solve problems and wrestle with new features. \nFormat-wise think of it like a child of a company podcast and a process vlog...a \"plog\" if you will...",
        "language": "en",
        "author_name": "Sam Melancon",
        "slug": "trelliswork",
        "cover": "20221025_051054_1941fe5249d8fe2533759f384631f567.jpg"
    },
    {
        "podcast_id": 160567,
        "title": "The Northern Designer Podcast",
        "description": "<p>Welcome to the Northern Designer Podcast with your host Lee Bestall. Lee is an exterior stylist &amp; business owner whom has a great interest in chatting with extraordinary folk from all ends of the design spectrum - discussing everything that's design &amp; homes.</p>",
        "language": "en",
        "author_name": "Lee Bestall",
        "slug": "thenortherndesigner",
        "cover": "20230704_020752_95e90fb7ae39d799069daddeb9587233.jpg"
    },
    {
        "podcast_id": 161307,
        "title": "Walking and Talking",
        "description": "Walking and Talking is a four-part conversational Podcast series by The Line. Featuring artists, creatives and members of the local community who discuss themes and ideas related to The Line and the areas that it connects by visiting Greenwich Peninsula, the Royal Docks, Cody Dock and Queen Elizabeth Olympic Park.\n\nWhether you’re on the route or somewhere else in the world, we hope you enjoy discovering more about The Line and its context.",
        "language": "en",
        "author_name": "The Line London",
        "slug": "walkingandtalking",
        "cover": "20221018_101009_8cee868e926d7580b04830177b75b3f5.jpg"
    },
    {
        "podcast_id": 165386,
        "title": "TE LA FACCIO SIMPOL.",
        "description": "La nostra realtà è sempre più complicata, l’innovazione corre alla velocità della luce, non è facile starle dietro ma tutti vogliono conoscerla. \nEd è qui che entriamo in campo noi, il mondo digitale è il nostro pane quotidiano e ti vogliamo dimostrare che non fa così paura come sembra. \nIn questo modo conoscerai meglio Simpol. e imparerai nuove nozioni su cui potremo confrontarci insieme. Curiosità sul set, team building, background dei dipendenti, ospiti d’eccezione, eventi rtm e tanto altro.",
        "language": "it",
        "author_name": "Simpol. the reactive agency",
        "slug": "simpolthereactiveagency",
        "cover": "20221104_041143_401b572436e75133cea4eb9596cfd701.jpg"
    },
    {
        "podcast_id": 165494,
        "title": "The Sage Arts",
        "description": "Supercharge your creativity, motivation, and artistic style through novelty, story, conversation, and community. The Sage Arts podcast offers artists ways to further hone their unique voice, increase their joy and productivity, and create their version of meaningful artistic success. \nPart advice and inspiration, part thought-provoking diversions, this podcast is a varied mix of artist interviews, historical and listener stories, productivity advice, design guidance, and motivational ponderings. There will be a-ha moments, laughs, avalanches of creative inspriation, and ideas for new and novel experiences to shake up your muse.\nJoin artist, writer, publisher, and creativity coach Sage Bray Varon, for these energizing  forays into cultivating a fun and meaningful creative life. ",
        "language": "en",
        "author_name": "Sage Bray Varon",
        "slug": "thesagearts",
        "cover": "20221122_121133_e492c2389fb2e02ffd16d10f78b9b96e.jpg"
    },
    {
        "podcast_id": 166543,
        "title": "The Aaron Mello Podcast",
        "description": "The Aaron Mello Podcast features conversations with photographers, artists, makers, changers and the doers. From entrepreneurship to self-improvement and more, this is a podcast for the creative who may be in limbo from moving from their 9-to-5 job to a lifestyle built on their own artistry.",
        "language": "en",
        "author_name": "Aaron Mello",
        "slug": "mellopodcast",
        "cover": "20221109_021158_7d5c80fa5f5fbc98fcf3c3191d08021c.jpg"
    },
    {
        "podcast_id": 167672,
        "title": "Design. Build. Live.",
        "description": "I am your podcast Host Trent Raines, I live in Kansas City with my Wife and two amazing young kids. I own 1/3rd of a Design/Build remodeling and interior design business in Kansas City.  I handle the construction side of the business. When I asked the two other owners (both designers) what i should name my podcast they suggested the following options...\"The grumpy old contractor\", \"Stories of Scooching Things\", \"Anything is Possible...Or is it?\", \"You can't move that there\", and my personal favorite... \"I can move that there, but I don't want to\".  We kid. We have fun. \n\nI love good conversation and asking questions, I am hoping this podcast will give me the chance for both of those things!\n\nThe business is called Collected Living Design. Check out the business at collectedlivingdesign.com",
        "language": "en",
        "author_name": "Trent Raines",
        "slug": "designbuildlive",
        "cover": "20221113_061126_7e3aeb23cbf2ae6dfa44144595fb0d66.jpg"
    },
    {
        "podcast_id": 167811,
        "title": "The Aquarium Everything Podcast",
        "description": "The Aquarium Everything Podcast, hosted by Jeff Senske of Aquarium Design Group, covers every aspect the aquarium design, hobby and industry. Guests from every category and angle of both fresh and saltwater as well as the movers and shakers of the aquarium industry will bring insight and understanding, entertainment and enrichment to everyone who loves aquariums.",
        "language": "en",
        "author_name": "Jeffrey Senske",
        "slug": "aquariumeverythingpodcast",
        "cover": "20221117_041140_00b2010bff31d54b476a08feb4d6f21f.jpg"
    },
    {
        "podcast_id": 167969,
        "title": "Blank Radio",
        "description": "Blank Radio is your podcast into the minds of NFT icons and artists. We interview NFT artists, collectors, builders, and genuine degens within the forever expanding NFT space. Our podcast is hosted by Metalogist, the founder of Blank Studio. ",
        "language": "en",
        "author_name": "Metalogist",
        "slug": "bs-podcast",
        "cover": "20221118_021151_6703702b294d1b080e7ec1b10a0cc155.jpg"
    },
    {
        "podcast_id": 170223,
        "title": "Uložit jako…",
        "description": "Uložit jako je designový podcast, ve kterém se tři neznámí designeři bez servítek vyjadřují o všem, co je štve nebo těší. Podcast tvoří trojice designerů, kolegů a kamarádů. Grafický designer František Polák, motion designer Daniel Šmíra a UX designer Do Hoai Nam.",
        "language": "cs",
        "author_name": "Uložit jako…",
        "slug": "ulozitjako",
        "cover": "20221126_091145_3c351a3c05fc92de3a7a3b8839575d64.jpg"
    },
    {
        "podcast_id": 171526,
        "title": "Collective 1030",
        "description": "An activist group of architecture students, educators and practitioners looking for new ways to organise knowledge exchange, to progressively move out away from institutionalised and top-down systems currently dominating the education sphere. Moving towards horizontal organisations, blurring the lines between personal relationships and professional engagements. To prioritise friendship as the core motivator for collaboration and exchange that motives open discussions, evaluations, and the proposal of new methods that align with the ethics of care and social just values.",
        "language": "en",
        "author_name": "An activist group of architecture students, educators and practitioners",
        "slug": "collective-1030",
        "cover": "20221130_091123_8fda2ff1952aeb9f4b082984559b462b.jpg"
    },
    {
        "podcast_id": 171906,
        "title": "Dichotomy - Learning How to Learn & Teaching How to Teach",
        "description": "<p>A Why Hello Productions Podcast : Dichotomy. This podcast is an amalgamation of curiosity, humor, passion and drive. Join Sam and Tyler as they explore what it means to communicate in real time. The two passionate creatives teach each other about a topic/item/person/event they are passionate about. In this comparison of two out of context topics, what dichotomies emerge?</p>",
        "language": "en",
        "author_name": "Why Hello Productions",
        "slug": "dichotomylhltht",
        "cover": "20221201_101218_477caa74aafeedf631c80d9d9a929fa7.jpg"
    },
    {
        "podcast_id": 172413,
        "title": "InkLine Podcast",
        "description": "<p>Architecture &amp; Design</p>",
        "language": "en",
        "author_name": "Maitha Lootah",
        "slug": "artpodcast",
        "cover": "20221204_021212_c66f02851c1a5b2318b1041ec306241c.jpg"
    },
    {
        "podcast_id": 174048,
        "title": "Gradienty",
        "description": "<p>Gradienty to podcast o szeroko pojętym designie. Podcast składa się z czterech cykli tematycznych: architektury, wzornictwa, digital designu oraz moich przemyśleń. Nowe odcinki będą pojawiać się w ostatni piątek każdego miesiąca. ig: gradientypl fb: gradienty</p>",
        "language": "pl",
        "author_name": "Janusz Magoński",
        "slug": "gradienty",
        "cover": "20221212_061249_dcbd51577f3a0fdfae10ef205133714a.jpg"
    },
    {
        "podcast_id": 174250,
        "title": "The ARTIST: Incontri con i maestri dell'Arte Neo-Contemporanea",
        "description": "In questi podcast parleremo con artisti del nostro secolo, del loro operato e di cosa vuol dire essere un'artista nel 21esimo secolo. ",
        "language": "it",
        "author_name": "DYOS PROJ",
        "slug": "dyos-proj",
        "cover": "20221213_081238_cd6c96d9bac73fdbc3738ff902f8a888.jpg"
    },
    {
        "podcast_id": 174367,
        "title": "A Design-Led Approach",
        "description": "Welcome to A Design-Led Approach. Your one-stop shop for all things construction, business and design. We speak with entrepreneurs and business owners in the design and construction industry who share their advice, talk about the challenges in the industry and give you insight into their day-to-day lives. ",
        "language": "en",
        "author_name": "Survey Design Consult",
        "slug": "adesignledapproach",
        "cover": "20221214_101218_e9432db9afec891b3d4856e1e2ace258.jpg"
    },
    {
        "podcast_id": 174641,
        "title": "The Dankness",
        "description": "Putting cryptocreators at the front and center of the conversation, THE DANKNESS introduces new audiences to the artists and collectors behind some of the most beloved CryptoArt creations. \n\nHosted by Jason Bailey and Dan Sickles, each episode of THE DANKNESS showcases the stories from this emerging movement from the perspectives of the people who know it best.\n\nFollowing the release of each episode, a DANKTONE will be available to mint for free on the Ethereum blockchain at Async.art. Each DANKTONE is crafted with love by Stella and FFFFLOOD. \n\nNO HYPE, NO FROTH, \nJUST DANKNESS.\n\nLearn more at thedankness.xyz",
        "language": "en",
        "author_name": "dpop Studios",
        "slug": "thedankness",
        "cover": "20230104_020142_598e3547b8cad95c72b476d6b682eba9.jpg"
    },
    {
        "podcast_id": 174968,
        "title": "LIVE LIGHT PODCAST",
        "description": "<p>This podcast is brought to you by two curious lighting designers, Maryam Aghajani and Dana Moazenie. The aim for this podcast is primarily to start an open conversation with designers and fellow lighties from diverse backgrounds working in the lighting design field and discuss the dark spots existing within it. We plan to give voice and shine light on your point of view and talk about challenges within; in aim of finding solutions and improving our sometimes not so sensitive community. Lastly, we both are eager to create sessions exploring new technologies, thoughts and disciplines via our conversations with creative minds not only in our field rather from a broader circle.</p>",
        "language": "en",
        "author_name": "Maryam Aghajani & Dana Moazenie ",
        "slug": "livelightpodcast",
        "cover": "20230611_100649_1b09ce06020f80f693221415abf19084.jpg"
    },
    {
        "podcast_id": 179048,
        "title": "Fabrik Talk",
        "description": "The Fabrik talk is a podcast hosted in the Fabrik ecosystem. ",
        "language": "en",
        "author_name": "Fabrik",
        "slug": "fabrik",
        "cover": "20230108_040111_f464f6c8122fe71c4248f70e5ce4edad.jpg"
    },
    {
        "podcast_id": 179854,
        "title": "The Info Dump",
        "description": "The Info Dump is a stream of consciousness podcast hosted by the artist, professor, and living shit post Metis Christodoulou (she/they). These directionless field recordings explore a breadth of topics ranging from game design to avant-garde fashion to the many little OCD demons that live in Metis's brain. She also smokes a lot of weed while recording and is a crazy hot trans girl (づ ￣ ³￣)づ\n\nCheck us out on Instagram!\n@the_info_dump",
        "language": "en",
        "author_name": "Metis Christodoulou",
        "slug": "the-info-dump",
        "cover": "20230111_060116_4025d9635803a71c08518322c0329e21.jpg"
    },
    {
        "podcast_id": 180780,
        "title": "Who's The Boss? Cast",
        "description": "Welcome to the Who's The Boss? Cast where Bosslogic and friends talk about absolutely nothing and possibly everything!",
        "language": "en",
        "author_name": "Bosslogic",
        "slug": "whosthebosscast",
        "cover": "20230115_050130_0033c8a409b520520a4b7a5b3c23eefb.jpg"
    },
    {
        "podcast_id": 181235,
        "title": "Just Keep Blooming",
        "description": "If you're a Millennial or Gen-Z entrepreneur thinking about starting or currently running a business, Just Keep Blooming is your go-to podcast for all things 'small business' and 'branding'. Each episode is centered around hot topics & trends, tips & tricks, and general advice to help you grow your brand and stand out in the crowd. Hosted by Amber Payton—brand designer, brand strategist, product photographer and founder of Goldenbloom Studios.",
        "language": "en",
        "author_name": "Amber P.",
        "slug": "justkeepblooming",
        "cover": "20230117_070120_3dc6b514ea8484a9cc807714c34b9e9a.jpg"
    },
    {
        "podcast_id": 181449,
        "title": "Everything is Wrong and I Would Like to Fix It.",
        "description": "Malath Kamaluldeen (creative technologist) puts everything that’s wrong with the world under the microscope to dissect, intellectualize, diagnose, and (hopefully) heal with bizarre solutions backed by research, community collaboration, and love. Issues discussed are larger than just me and you and will take years to heal BUT! I believe in the butterfly effect & the power of community, love, and research.\n\n\n\n\n\n\n\n",
        "language": "en",
        "author_name": "Malath Kamaluldeen",
        "slug": "everythingswrong",
        "cover": "20230203_050239_4f24dc1690fb279bab464f2794221e62.jpg"
    },
    {
        "podcast_id": 182770,
        "title": "Everyday Talk Show",
        "description": "<p>This is your every day talk show</p>",
        "language": "en",
        "author_name": "F5VE S7VEN",
        "slug": "podcastwithme",
        "cover": "20230709_080725_ff4cd87e2a360261e4d8286999b6c915.jpg"
    },
    {
        "podcast_id": 183135,
        "title": "An amazing podcast",
        "description": "Welcome to \"An amazing podcast\", a podcast where we delve into a variety of topics and have candid conversations with experts and thought leaders. From current events to personal growth, we cover it all. Join us each week as we explore new ideas, challenge perspectives, and have meaningful discussions. So, sit back, relax and let's chat!",
        "language": "en",
        "author_name": "Manuela Navarro",
        "slug": "anamazingpodcast",
        "cover": "20230202_120215_4efefcbf1da5a65b1346715a4015ffe0.jpg"
    },
    {
        "podcast_id": 183137,
        "title": "Pláticas Super Importantes ",
        "description": "<p>Todos los miércoles nos sentamos a grabar y tener una \"Platica Super Importante\" donde platicamos de todo y nada. Somos dos amigos a los cuales nos gusta hablar y platicar de todo y porque no dar nuestra opinión. Christian y Poncho solo queremos hablar y compartir con todos ustedes nuestras Platicas Super Importantes. Bienvenidos</p>",
        "language": "es",
        "author_name": "Christian y Poncho",
        "slug": "platicassuperimportantes",
        "cover": "20230217_080227_0939e45b20c6c31a98541d390d98585b.jpg"
    },
    {
        "podcast_id": 183166,
        "title": "Pillole di Web Design",
        "description": "Ti parlo in modo semplice di siti web, web design, marketing e user experience.\n-----------------------------------------\nIo sono Valentina Olini e sono web designer freelance.\nLavoro nel campo del web design da più di 20 anni, mi sono specializzata nella realizzazione di siti web che attraverso la valorizzazione del prodotto conquistano il cliente.\nwww.valentinaolini.com",
        "language": "it",
        "author_name": "Valentina Olini",
        "slug": "pillolediwebdesign",
        "cover": "20230124_050121_eadca97782b4e6c21ffc74eb642bff93.jpg"
    },
    {
        "podcast_id": 183346,
        "title": "Emisor Cero",
        "description": "<p>En Emisor Cero hablamos con actores expertos en diseño, construcción y monitoreo de edificaciones sustentables en LATAM, acerca de los retos y alternativas concretas para mitigar esta crisis climática que nos concierne a todas y todos. Exponemos y derribamos mitos verdes. Te invitamos a tomar la acción desde el lugar en donde te encuentres. Escríbenos a emisorcero@podcastera.mx y visita www.proyectoceela.com Una producción de Podcastera.mx para Proyecto CEELA.</p>",
        "language": "es-mx",
        "author_name": "Proyecto CEELA + Podcastera.mx",
        "slug": "emisorcero",
        "cover": "20230126_050125_f0ab1880c944b4b8f49555c520e3b148.jpg"
    },
    {
        "podcast_id": 184837,
        "title": "LOS ACTIVADORES",
        "description": "Aprenderás muchas cosas que no sabías de GOD OF WAR",
        "language": "es",
        "author_name": "Daniel Iniesta y Jorge Villalba",
        "slug": "the-activatorsjorge-dani-com",
        "cover": "20230130_090150_512ffcb9d4b2fa168ddc8eacce99b527.jpg"
    },
    {
        "podcast_id": 184853,
        "title": "¿QUE VER Y DISEÑAR?",
        "description": "Esre Podcast trata de dos areas que nos gustan mucho Harry Potter,Diseño de interiores y una sorpresa incluida al final.\nGRACIAS\nNatalia y Paula ",
        "language": "es",
        "author_name": "Natalia g y Paula j",
        "slug": "queverydisenar",
        "cover": "20230130_090101_b18a2138e5009082359791e3dde56b0c.jpg"
    },
    {
        "podcast_id": 184984,
        "title": "29% Equal",
        "description": "29% Equal is a podcast celebrating significant women who have shaped how we practice architecture today, produced by Sarah Ackland. \n-\nWhy 29% Equal? The last formal survey undertaken by the ARB (or the Architects Registration Board) was in 2019, this revealed that only 29% of qualified architects are female-identifying, women are routinely excluded from the architecture profession, from the books we read and even the references and precedents we study at university. \n-\nIn an effort to eliminate this continual erasure of women I have invited a young architect, designer, artist or activist from Part W (and friends) to have a discussion with a woman they feel deserves recognition, or perhaps more recognition. We ask these amazing women about their defining moments, their activism, who inspires them, the advice they would give to their younger selves and finally what a more equitable city might look like. \n-\nThis series is in conversation with Part W.\nPart W is an action group of women working across architecture and design, infrastructure and construction campaigning for gender parity founded by Zoë Berman. Part W is an independent campaign group that has no formal funding. If you would like to support their valuable and ongoing work, please donate here or on their website.\n-\nTo give you a hint of what’s to come in this six-part series, we talk to an acclaimed social housing architect, a powerful campaign group, a member of Matrix the feminist design collective, and more. \n\nThis podcast has been created with thanks to the RIBA Research Fund and supported by my research supervisor Katie Lloyd Thomas of Newcastle University. \nAll graphics are by the amazing Linda and Ella of Mackinnon Byrne. \nPlease subscribe to stay updated.\n",
        "language": "en",
        "author_name": "Sarah Ackland",
        "slug": "29percentequal",
        "cover": "20230204_040203_ade916ed080400e4ddb845cffcaf60ca.jpg"
    },
    {
        "podcast_id": 185583,
        "title": "Talk with us-  The Latest Trends in 2023",
        "description": "Is about the Latest Trends for this year of 2023. And we are going to tell you the perfect colors and clothes that you can wear with some characteristics of each of them and I am going to tell you my recommendations and my opinions. \nAlso, I am going to tell you about the spring and summer and my colab friend is going to tell you of autumn and winter. \nHope that you like it!!",
        "language": "en",
        "author_name": "Paulina Caballero",
        "slug": "fashionntrendswithus",
        "cover": "20230201_030206_0514da7a8fd1e4144138bf3226f5a644.jpg"
    },
    {
        "podcast_id": 185584,
        "title": "Talk with us- The Last Trends in Fashion in 2023",
        "description": "The podcast is about the perfect clothes that you can wear in this 2023 and it also talks about their characteristics, and what is recommended to wear in this 2023 and what is not recommended.",
        "language": "en",
        "author_name": "Idalia Ramones",
        "slug": "fashiontrendswithhus",
        "cover": "20230201_030210_0618429ba68ab33cef944e7fba124b63.jpg"
    },
    {
        "podcast_id": 186226,
        "title": "White Rabbit Hole Podcast",
        "description": "<p>Follow us to discover the wonders behind branding, digital marketing, design and creative content for advocacy communication in the EU bubble.</p>",
        "language": "en",
        "author_name": "White Rabbit Integrated Communication",
        "slug": "whiterabbithole",
        "cover": "20230205_110241_f6e3d24e31210c57e1ad9ce5e0c9d1f5.jpg"
    },
    {
        "podcast_id": 186333,
        "title": "Technical Difficulties",
        "description": "<p>Technical Difficulties centers the stories of female leaders in tech and design. In each episode, these women share career-defining moments, unexpected pivots, values they live and design by, and advice for students and new grads. Join Liz Gerber, Northwestern Professor and founder of Design for America, as we learn alongside the leaders designing a human-centered digital future. Season 1's lineup explores design leadership, research, storytelling, identity, social impact and ethical innovation, creativity, and curiosity. If you’re a student, designer, technologist, researcher, or creative, Technical Difficulties is the podcast for you!</p>",
        "language": "en",
        "author_name": "Liz Gerber",
        "slug": "technicaldifficultiespodcast",
        "cover": "20230203_100246_fb0c58bef2f9a3ef496c579cb73155ef.jpg"
    },
    {
        "podcast_id": 188119,
        "title": "Giovani Classicisti",
        "description": "Giovani Classicisti è un podcast creato dagli studenti del Liceo Ginnasio \"San Paolo\" di Oppido Mamertina, vincitore per 3 anni di seguito del titolo \"miglior liceo classico della Calabria\". In questo podcast i ragazzi affronteranno temi di cultura generale. 1 episodio a settimana, 1 ora, argomenti diversi.",
        "language": "it",
        "author_name": "Liceo Ginnasio Classico \"San Paolo\"",
        "slug": "giovaniclassicisti",
        "cover": "20230209_080216_41b64a8744d27552a46b87f677d2288b.jpg"
    },
    {
        "podcast_id": 189167,
        "title": "Mimi",
        "description": "<p>A safe space for creativity - The Mimi Podcast brings you fun, exciting, enlightening conversations with modern artists, makers, illustrators, designers and more. Hosted by Melanie Johnsson, we hope Mimi brings you joy, comfort and inspiration to follow your wildest creative dreams!</p>",
        "language": "en",
        "author_name": "Melanie Johnsson",
        "slug": "mimiforcreativespodcast",
        "cover": "20230213_040235_07879fbe64f95a3533bc0d73e4fe921d.jpg"
    },
    {
        "podcast_id": 190512,
        "title": "INFINITI SPOSI",
        "description": "<p><strong>Ciao e benvenuti in \"Infiniti Sposi\", il podcast che svela tutti i segreti del capolavoro di Manzoni. Se vuoi conoscere a fondo la trama, i personaggi o semplicemente ti serve ripassare prima di una interrogazione o verifica, questo podcast fa per te. Riassunti veloci e approfondimenti precisi.</strong></p>",
        "language": "it",
        "author_name": "INFINITI-SPOSI",
        "slug": "infiniti-sposi",
        "cover": "20230218_110226_5a7c384d75065da6ec888703cc18be0a.jpg"
    },
    {
        "podcast_id": 192926,
        "title": "Entrepreneur Minds Speak",
        "description": "<p>Package designer Lauren Casgren-Tindall &amp; developer Natalie Saporova share insights on conquering small business hurdles, while also hosting interviews with experts from the food, beauty, supplements, and alcohol sectors.</p><p>Lauren Casgren-Tindall | Crème de Mint</p><p>Natalie Saporova | Cloud Create</p><p>Struggling with where to start? Join the free Start Your Product Line E-Course</p><p><a href=\"https://linktr.ee/entrepreneurmindsspeak\">https://linktr.ee/entrepreneurmindsspeak</a></p>",
        "language": "en",
        "author_name": "Lauren Casgren-Tindall and Natalie Saporova ",
        "slug": "entrepreneurmindsspeak",
        "cover": "20230728_090709_c7be427d4cfbf54078c9527bd3c965ea.jpg"
    },
    {
        "podcast_id": 193271,
        "title": "Monday Mornings with Cary and Willie",
        "description": "<p>Wilson Capron, a bit and spur maker from Texas, along with Cary Schwarz, a saddlemaker from Idaho engage in a wide range of topics about artistry, craftsmanship, business, and life. They are members of the Traditional Cowboy Arts Association (est 1998) Wilson and Cary have over 70 years combined experience in craftsmanship, artistry, and entrepreneurism. </p>",
        "language": "en",
        "author_name": "Cary Schwarz",
        "slug": "caryandwillieramble",
        "cover": "20230228_080253_ee52d1eaff041ce5b7485cf06944c6e0.jpg"
    },
    {
        "podcast_id": 193397,
        "title": "Evim İçin",
        "description": "<p>Evidea'nın sunduğu Evim İçin podcast serisinde, alanında uzman ünlü konuklarımız ile eve dair her şeyi konuşuyoruz!</p>",
        "language": "tr",
        "author_name": "Evidea",
        "slug": "evim-icin",
        "cover": "20230301_070338_690960672da89f72ae4ecd9506cd5db4.jpg"
    },
    {
        "podcast_id": 193621,
        "title": "VINNCI - moda z myślą o przyszłości",
        "description": "<p>Czym jest Upcycling? Skąd pomysł na VINNCI? Jak stworzyłyśmy naszą markę?</p>",
        "language": "pl",
        "author_name": "Karolina Ramus & Marta Ammar",
        "slug": "vinnci",
        "cover": "20230302_120328_3a40c8307ebf7e6e18794fbf85a23c3b.jpg"
    },
    {
        "podcast_id": 193653,
        "title": "Catch Me Outside My Comfort Zone",
        "description": "<p>A lifestyle podcast, that not only focuses on the outside of our zones, but also on the inside of our homes.</p><p>Hosted by Interior Designer and Entrepreneur, Alyssa Sutherland.</p><p>Let's build our dream life together, one step outside our comfort zone at a time!</p>",
        "language": "en",
        "author_name": "Alyssa Sutherland",
        "slug": "catch-me-outside-my-comfort-zone",
        "cover": "20230312_070345_2196ddc12ca6661cddea0ea9124015d0.jpg"
    },
    {
        "podcast_id": 194026,
        "title": "Aequitas - Design for All. Progettazione inclusiva per lo sport.",
        "description": "<p>Cos'è il Design for All e come la progettazione inclusiva viene applicata nel mondo dello sport? Scoprilo nel nuovo podcast di Aequitas, il nuovo magazine monografico pensato per tutti! Storie, design ed esperienze di disabilità nello sport.</p>",
        "language": "it",
        "author_name": "Alice Panzi",
        "slug": "aequitas-designforall-01",
        "cover": "20230303_110324_29a793bc1803de153597037058aa6a28.jpg"
    },
    {
        "podcast_id": 195464,
        "title": "Hönnunarsafn Íslands",
        "description": "<p>Leiðsagnir og frásagnir tengdar sýningum safnsins</p>",
        "language": "is",
        "author_name": "Hönnunarsafn Íslands",
        "slug": "honnunarsafn",
        "cover": "20230314_110337_bef4045aedc7a821cfa8bf9b8fb655e5.jpg"
    },
    {
        "podcast_id": 196571,
        "title": "DADAH Podcast",
        "description": "<p>Dadah Podcast is a podcast produced by the Department of Art, Design, and Art History at Webster University. In this podcast, we talk to DADAH faculty and instructors, designers, and artists. The topics are centered around art, design, technology, and any other fields that can be integrated into art and design and increase the student's knowledge. </p>",
        "language": "en",
        "author_name": "DADAH",
        "slug": "dadahpodcast",
        "cover": "20230313_050359_0987b7d57d3c0e75d069ed5a55c078b6.jpg"
    },
    {
        "podcast_id": 198941,
        "title": "What is it like to be MOSS?",
        "description": "<p>What is it like to be MOSS? è un podcast che fa parte di un progetto più ampio, mirato all'esplorazione del pensiero post-antropocentrico, per fornire in una chiave più accessibile nuove narrazioni e nuovi modi di leggere il mondo circostante in termini di rete, relazionalità, e connessioni. Con un approccio critico, il podcast si pone come uno strumento contemporaneo che mira ad aprire un dialogo sui limiti e le potenzialità del design, attraverso la contaminazione tra diversi ambiti di ricerca, come l’antropologia, la filosofia e la botanica. Tramite questo processo di apertura, riflessione e contaminazione reciproca, e grazie alla partecipazione di diversi ospiti, esploreremo come il design può comunicare con le altre discipline e verso quali frontiere ridirezionare un design riparatore, in vista di un mondo post-antropocentrico interconnesso.</p>",
        "language": "en",
        "author_name": "Ottavia Ferraris",
        "slug": "what-is-it-like-to-be-moss",
        "cover": "20230323_090306_d87cbe4a521f835b9384c01b23500211.jpg"
    },
    {
        "podcast_id": 199570,
        "title": "FUENTES DE INFORMACIÓN DISEÑO INSTALACIÓN DE MANUFACTURA",
        "description": "<p>En este caso se procede a realizar un podcast con la finalidad de explicar de manera concisa los diversos aspectos a tener en cuenta al diseñar una línea de producción en impresión 3d.</p>",
        "language": "es",
        "author_name": "diego Juarez",
        "slug": "diseno-de-instalaciones-de-manufactura",
        "cover": "20230403_010425_7cf4b458ac6fc1343d5ec4288d80e72f.jpg"
    },
    {
        "podcast_id": 201261,
        "title": "KURU Podcast",
        "description": "<p>KURU Arhitektuuri meeskond kutsub podcastidele ehitussektoriga seotud inimesi, kellega arutame tema eriala probleemidest ja paljust muust. Podcastist saab hea ülevaate konkreetsest erialast ja sellega seonduvast.</p>",
        "language": "ee",
        "author_name": "KURU Arhitektuur",
        "slug": "kes-me-oleme-ja-mida-me-teeme",
        "cover": "20230404_120457_de94bdda10071669ae6124fdbd3df916.jpg"
    },
    {
        "podcast_id": 201477,
        "title": "UX Friendly Podcast",
        "description": "<p>Chcete nakouknout do myslí těch nejlepších designerů a firem u nás? Pusťte si UX Friendly. Podcast o UX &amp; Product designu v Čechách.</p><p>V každé epizodě uslyšíte 1:1 rozhovor s odborníkem, se kterým probereme 1 téma z UX nebo Productu pořádně do hloubky.</p><p>Chcete si prohlédnout zajímavé nástroje, firmy, produkty, pluginy, co v téhle epizodě zazněly? </p><p>Kompletní seznam epizod včetně odkazů a zdrojů najdete na <a href=\"http://www.simonjun.cz/ux-friendly-podcast\">www.simonjun.cz/ux-friendly-podcast</a>.</p><p>📝 <a href=\"https://www.simonjun.cz/blog\">Blog</a> • ✉️ <a href=\"https://www.simonjun.cz/newsletter\">Newsletter</a> • 🧑‍💻 <a href=\"https://cz.linkedin.com/in/simon-jun\">LinkedIn</a> • 🎬 <a href=\"https://www.youtube.com/@simonjun\">YouTube</a></p>",
        "language": "cs",
        "author_name": "Šimon Jůn",
        "slug": "ux-friendly",
        "cover": "20230405_100408_0338915a0d8205588b32a6c61832a746.jpg"
    },
    {
        "podcast_id": 201531,
        "title": "So I Decided",
        "description": "<p>A show about changemakers who found their way through landscape architecture &amp; design to make a positive impact on the world around them.</p>",
        "language": "en",
        "author_name": "Elspeth Holland",
        "slug": "soidecided",
        "cover": "20230405_050400_b682765354f2adcab43ad32f5ecce2b5.jpg"
    },
    {
        "podcast_id": 202083,
        "title": "In the House",
        "description": "<p>Laid back conversations with builders, architects, and artists to swap stories, ideas and best practices. Develop a passion and get a glimpse into the lives of the hard working people who create the world around you.</p><p>Bi-weekly episodes.</p><p>Co-host Mark Lakins.</p>",
        "language": "en",
        "author_name": "Lonnie Armstrong",
        "slug": "inthehousepodcast",
        "cover": "20230428_030433_4342dcf097515b8ceaba372b078e6fd2.jpg"
    },
    {
        "podcast_id": 202118,
        "title": "How to | شلون ",
        "description": "<p>\"How to\" is an exciting new podcast hosted by tech content creator Shams Talaat, who brings in a new creative guest each week to explore different topics under the umbrella of \"how to do something\". From learning to coding, fitness to fashion to cooking , Shams and her guests dive deep into the nitty-gritty of the subject at hand, offering up helpful tips and tricks along the way. With a fun, conversational style and a diverse range of guests, \"How to\" is the perfect podcast for anyone looking to learn something new and have fun while doing it.</p><p>\"شلون \" هو بودكاست جديد ومثير يتم استضافته من قبل خبيرة إنتاج المحتوى التقني شمس طلعت، والتي تستضيف كل أسبوع ضيفًا إبداعيًا جديدًا لاستكشاف مواضيع مختلفة تحت مظلة \"كيفية فعل شيء ما\". من التعلم إلى البرمجة، ومن اللياقة البدنية إلى الأزياء والطهي، تتعمق شمس وضيوفها في تفاصيل الموضوع المطروح، مقدمين نصائح وحيل مفيدة على طول الطريق. بأسلوب مرح ومحادثات ممتعة، لذالك هو البودكاست المثالي لأي شخص يرغب في تعلم شيء جديد والاستمتاع خلال القيام به</p>",
        "language": "ar",
        "author_name": "How to ",
        "slug": "how-to",
        "cover": "20230408_110448_eb8801e21f2a3bbf528109778d90755b.jpg"
    },
    {
        "podcast_id": 207227,
        "title": "Deep Dives 🤿",
        "description": "<p><strong>The best designers never stop learning 💪</strong></p><p>This interview series is designed to unlock knowledge from today's most prolific designers so that you can learn from their journey and take a leap forward in your own career.</p><p>Now you can learn directly from designers like 👇</p><p>✦ <strong>Joey Banks</strong> (Design systems @ Webflow/Twitter)</p><p>✦ <strong>Femke</strong> (Design lead @ Gusto)</p><p>✦ <strong>Fonz Morris</strong> (Design lead for monetization @ Netflix)</p><p>✦ <strong>Mia Blume</strong> (Early design leader @ Square/Pinterest)</p><p>✦ <strong>Jorn van Dijk</strong> (CEO @ Framer)</p><p>✦ <strong>Charli Prangley </strong>(Creative director @ ConvertKit)</p><p>✦ <strong>Bonnie Kate Wolf</strong> (Creator of the Netflix icon library)</p><p>✦ <strong>Dan Hollick </strong>(Framer expert)</p><p>✦ <strong>Steph Engle</strong> (AR design at Snap)</p><p>Welcome to the deep end of design education 👉 <a href=\"https://www.dive.club/\">Dive.club</a></p>",
        "language": "en",
        "author_name": "Dive",
        "slug": "diveclub",
        "cover": "20230504_030559_6f41d5b525429fd1b5b08a5f7d78c240.jpg"
    },
    {
        "podcast_id": 208732,
        "title": "Legal Feet",
        "description": "<p>This podcast is deep examination of into sneaker law and the corresponding culture of the sneaker game.</p>",
        "language": "en",
        "author_name": "Taqwa Winstead",
        "slug": "legal-feet",
        "cover": "20230512_040545_2a9ada835e29931c5d25cfe0c46506f8.jpg"
    },
    {
        "podcast_id": 208931,
        "title": "No One Point Perspective",
        "description": "<p>Sofia has open, unrestricted conversations with other creative people. \"No One Point Perspective\" is all about exploring big ideas by talking them out with people that have widely different experiences to draw from (pun intended).</p><p>Keep up with me on IG <a href=\"https://www.instagram.com/manyspirits__/\">https://www.instagram.com/manyspirits__/</a> and give me feedback!</p><p>Music by Javier Suarez (Jahzzar)</p>",
        "language": "en",
        "author_name": "Sofia Raikow",
        "slug": "nopp",
        "cover": "20230513_050517_42dd0221eb89a2cae066a82b1520a613.jpg"
    },
    {
        "podcast_id": 210439,
        "title": "412 Playground",
        "description": "<p>412 Playground is a bilingual design podcast and a recreational space observing design through conversations about bookmaking, type design, branding, school, and work-life balance. Co-hosted by bilingual designers Lihao (Julie) Zhu and Weiran Zhang, each episode is available in English and Mandarin.</p><p>412游乐场是一档双语设计博客，也是是一个休闲的讨论空间，通过有关书籍制作、字体设计、品牌设计、学校生活，以及工作与生活平衡的对话来观察设计。这档播客由双语设计师朱骊好和张蔚然共同主持，每一集都有中、英文两个版本。</p>",
        "language": "en",
        "author_name": "Lihao (Julie) Zhu & Weiran Zhang",
        "slug": "412playground",
        "cover": "20230520_070536_55a08472caa661ff92cb20462f39945c.jpg"
    },
    {
        "podcast_id": 211242,
        "title": "City Take",
        "description": "<p>The other day I recorded the return home, here you are!</p>",
        "language": "it",
        "author_name": "CITY TAKE",
        "slug": "back-home",
        "cover": "20230524_050534_b6f81a5c4dc547bae4af71504a8be5a8.jpg"
    },
    {
        "podcast_id": 212070,
        "title": "Champagne & Planning",
        "description": "<p>We are so excited to launch our new Podcast, Champagne &amp; Planning with Eliza Jane. 🥂</p><p>Whether you are a couple planning your dream wedding or a wedding vendor looking to grow your business, this podcast is your go-to source for all things weddings. From choosing the perfect venue to selecting the right floral arrangements, Eliza and her guests will provide valuable insights and advice to help make your big day absolutely unforgettable.</p><p>Champagne and Planning will feature interviews with some of the most successful wedding vendors in the industry, sharing their own personal stories and strategies for success. Stay tuned for its launch and get ready to raise a glass of bubbly as we embark on this exciting wedding planning journey together! 💕</p>",
        "language": "en",
        "author_name": "Eliza Jane",
        "slug": "champagneandplanning",
        "cover": "20230529_020551_8f89df0e0e6760324e8370e663c20f94.jpg"
    },
    {
        "podcast_id": 213230,
        "title": "RIVA Spain: Surface Savvy",
        "description": "<p>Welcome to the RIVA Podcast! This captivating podcast series delves into the exciting world of design, architecture, and entrepreneurialism, exploring the latest trends and innovations shaping these industries.</p><p>Hosted by Borja Iglesias, RIVA CEO, and visionary leader, this podcast brings you insightful conversations with prominent figures from the architecture &amp; design world and the entrepreneurial community in the United States. Prepare to be inspired and enlightened as Borja and his guests share their experiences, expertise, and perspectives.</p>",
        "language": "en",
        "author_name": "RIVA Spain",
        "slug": "rivaspain",
        "cover": "20230606_070616_eaf149d6e1c3d0d9e81f4fbc1db92e47.jpg"
    },
    {
        "podcast_id": 213397,
        "title": "USURPATOR Pod",
        "description": "<p>USURPATOR is an online magazine sharing critical analysis about the user experience of our current virtual landscape.</p><p>usurpatormag.com</p>",
        "language": "en",
        "author_name": "USURPATOR Pod",
        "slug": "usurpator",
        "cover": "20230901_010941_ccc166eb3447ded0c28d0667329a8411.jpg"
    },
    {
        "podcast_id": 214136,
        "title": "Shaking my head ! ",
        "description": "<p>\"Shaking My Head!\"</p><p>Weekly podcast which makes you think. Why does no one walk about it?</p><p> Join us as we dive into a wide range of fascinating topics with a new guest in each episode.</p>",
        "language": "en",
        "author_name": "Rachit Yadav",
        "slug": "shakingmyhead",
        "cover": "20230710_040724_654baccb9c7cd8999738fca47d0d0c72.jpg"
    },
    {
        "podcast_id": 214752,
        "title": "Soleless: The Podcast About Sneakers I Don't Have",
        "description": "<p>Welcome to Soleless, the podcast where I discuss everything sneakers with my guests. We break down shoes with new drops to trends, all with my sneakerhead friends or even just my dad.</p>",
        "language": "en",
        "author_name": "Wyatt Davis",
        "slug": "soleless",
        "cover": "20230804_040830_9537b47234ca8689697de02c9875350b.jpg"
    },
    {
        "podcast_id": 214756,
        "title": "Estrategias de aprendizaje: Mapas cognitivos",
        "description": "<p>Bienvenido a este curso para conocer los diferentes tipos de mapas cognitivos a profundidad, espero que te encuentres bien y emocionado por iniciar este bello proceso de aprendizaje.</p><p> </p><p>A lo largo de este curso aprenderás mediante diversas estrategias entre las que podrás elegir la que más te guste para adquirir el conocimiento con éxito y poder participar en las actividades lúdicas que se realizarán.</p>",
        "language": "es",
        "author_name": "Karen Paola",
        "slug": "mapasconceptuales",
        "cover": "20230612_070630_cbe8500a7f7051f432f5214ab6fa5c49.jpg"
    },
    {
        "podcast_id": 215105,
        "title": "Superurbanism",
        "description": "<p>Superurbanism is a series of conversations with the most interesting people working in the field of architecture today: architects, curators, authors, designers. Host Tim Abrahams explores both the details of their work and their bigger vision.</p>",
        "language": "en",
        "author_name": "Tim Abrahams",
        "slug": "machinebooks-superurbanism",
        "cover": "20230913_070907_1ba2e9d5a620d73a1d52ed3b8f6dc0ac.jpg"
    },
    {
        "podcast_id": 215339,
        "title": "Play&Co(nversations) - A Design Thinking Podcast",
        "description": "<p>The design thinking podcast where we delve into the world of design and explore the endless opportunities that await designers and brands.</p>",
        "language": "en",
        "author_name": "Play&Co",
        "slug": "playandconversations",
        "cover": "20230705_040741_efcf1067d7173405110230e3be184045.jpg"
    },
    {
        "podcast_id": 215352,
        "title": "Diario Interiorista Con Linnet Conde ",
        "description": "<p>¿Eres amante del diseño de interiores y te encantaría saber mucho contenido de valor? Bienvenidos a Diario Interiorista, un podcast donde compartimos el proceso que hay detrás de la construcción de la marca Linnet Conde Studio y donde traeremos con mucho amor aquella información de utilidad para juntos ir construyendo el espacio de tus sueños, lleno de propósito y de intención; así como acompañarme en el proceso de crear mi marca, compartiendo reflexiones y contenido de utilidad. Si lo disfrutaste envíame un DM con tus peticiones para próximos episodios @linnetcondestudio </p>",
        "language": "es",
        "author_name": "Diario Interiorista",
        "slug": "diariointeriorista-linnetconde",
        "cover": "20230615_060632_29715faacbd5d55764cf4e59b477d737.jpg"
    },
    {
        "podcast_id": 215477,
        "title": "The Spread: Where Sports and Creativity Meet Bottom Line",
        "description": "<p>Whether you're a sports enthusiast, a design lover, or simply curious about how-in-the-world sports, creativity, and business are related, The Spread has got you covered. Join host Cari Sekendur, founder of the award-winning creative agency Butter Studio, as she interviews sports-business leaders channeling creativity to make their mark in athletics.</p>",
        "language": "en",
        "author_name": "Butter Studio",
        "slug": "butterstudio",
        "cover": "20230616_110638_a4c011f9f4fa599356932bd191b687e8.jpg"
    },
    {
        "podcast_id": 215573,
        "title": "The Side Thing",
        "description": "<p>Light-hearted and not overly motivational; this show is for all the chatty-podcast-loving creative folks who want to catch up with one midwestern designer, doing her best to balance work, life and creating side things. LSS: Let’s be internet pals that talk about projects and avoid burnout together!</p>",
        "language": "en",
        "author_name": "Taylor Rivedal",
        "slug": "thesidething",
        "cover": "20230618_050639_5c912c8ac45f10b8c1e3c3349aa3ce6d.jpg"
    },
    {
        "podcast_id": 216387,
        "title": "BUILDING HEROes ",
        "description": "<p>This year’s podcast series will revolve around the successful operation of buildings and all those involved in making that process happen. This includes the operation, maintenance, energy management, and controls within a building. We have an exciting lineup of experts in the industry to discuss these key components of building operations. Check them out!</p>",
        "language": "en",
        "author_name": "Julia K. Day",
        "slug": "buildingheroespodcast",
        "cover": "20230622_080609_c9f7e0bac7fbbcb817482be88c3406a1.jpg"
    },
    {
        "podcast_id": 216560,
        "title": "Design de Sobrancelhas",
        "description": "<p>Quem vence essa batalha? Venha ouvir mais sobre essa jornada! Iremos discutir sobre importantes fatos sobre as dificuldades que passam na jornada de uma esteticista, maquiadora ou qualquer pessoa que trabalha na area de beleza.</p>",
        "language": "pt-br",
        "author_name": "Valquíria Jourdan",
        "slug": "valspabeauty",
        "cover": "20230624_040650_38e5251b3ff60db5447351b8aa1d3411.jpg"
    },
    {
        "podcast_id": 216625,
        "title": "Work In Progress",
        "description": "<p>Hi, we’re Kat &amp; Nikoleta your hosts of the “Work in Progress” the podcast for surviving solopreneurs. Join us to recharge and unwind as we get honest about the ups and downs in our solopreneur journeys.</p><p>We talk about relatable issues we have as small business owners ourselves and how to overcome those. We’re not experts, we’re both just works in progress - so together let’s laugh at our flaws and figure out how to make the best out of this thing called solopreneurship.</p><p>If you’ve not yet subscribed to the podcast, please do. Really helps us out a lot to reach more like-minded people. See you next time!</p>",
        "language": "en",
        "author_name": "Kat Irwin & Nikoleta Angelova",
        "slug": "work-in-progress-cast",
        "cover": "20230702_070732_3adcdfb8cf9f7add9c72973cf56c2745.jpg"
    },
    {
        "podcast_id": 216852,
        "title": "nongamstopbookies",
        "description": "<p>Welcome to our podcast channel, where we talk about the best bookmakers available to UK players who are not in the Gamstop self-exclusion program. If you're looking for reliable bookmakers with high odds and a wide range of sporting events, then you've come to the right place. On our website <a href=\"https://nongamstopbookies.com/\">https://nongamstopbookies.com/</a> you'll find a list of the top 60 betting shops that aren't members of the Gamstop program. We carefully select each office and do detailed research so that you can be confident in their reliability and safety. Our podcast will help you make the right choice and get the best sports betting experience. Join us and learn more about which bookmakers are best suited for your needs.</p>",
        "language": "en",
        "author_name": "nongamstopbookies",
        "slug": "nongamstopbookies",
        "cover": "20230626_090633_26db905cb83e4949844e093d7248f059.jpg"
    },
    {
        "podcast_id": 216882,
        "title": "Io sono Dreaw ",
        "description": "<p>Il mio primo podcast </p>",
        "language": "it",
        "author_name": "Andrea Savio",
        "slug": "dreawpodcast-23",
        "cover": "20230626_030638_6333a9c01d76d2eb153b19c0de5b11fd.jpg"
    },
    {
        "podcast_id": 217002,
        "title": "Raju",
        "description": "<p>Testing</p>",
        "language": "en-us",
        "author_name": "Raju",
        "slug": "raju",
        "cover": "20230713_100715_0a0678e1060c37f05b90ada0d9378cdf.jpg"
    },
    {
        "podcast_id": 217051,
        "title": "Let's talk about life",
        "description": "<p>This is a podcast that focus on life</p>",
        "language": "en",
        "author_name": "Manuela",
        "slug": "letstalkaboutlife01",
        "cover": "20230627_030635_61119af9154279b15150289d93f7fb03.jpg"
    },
    {
        "podcast_id": 217092,
        "title": "Interior Design Podcast",
        "description": "<p>The Interior Design Podcast - A UK Based Educational Podcast created by designers for designers and people who practice good design in their lives.</p><p>My name is Hayley Roy and I’m an Interior Designer / Entrepreneur and owner of Harp Design and my co-host is Cheryl Sutton who is an Interior and Architectural Designer and owner of Rebels Design.</p><p>Cheryl and I have been working together on and off for 6 years and are also good friends.</p><p>We want to keep this podcast real, we are likely to throw a few F bombs, because we’re passionate and very opinionated about what we do and what this podcast represents. And we also love a innuendo.</p><p>Each Podcast is going to Have 3 Sections</p><p>1. Catch up - How has our week been and what projects are we working on at the moment.</p><p>2. Education – We bring in a guest to discuss anything interior design related, with the aim to educate.</p><p>3. Discussion about the education – C&amp;H – At this point we delve into a discussion around the topic or the subject that the guest speaker has presented.</p><p>Our Aim is to provide you with a podcast that is fun, but also jampacked with lots of useful information.</p><p>Please click subscribe and follow us to see more! There's some exciting things coming and we can't wait to share it with you!</p>",
        "language": "en",
        "author_name": "Hayley Roy & Cheryl Sutton",
        "slug": "interiordesignpodcast",
        "cover": "20230627_090609_450ed246aab52104d3636e6e1f7be46d.jpg"
    },
    {
        "podcast_id": 217108,
        "title": "The Design Duet",
        "description": "<p>We are passionate Interior Designers who are being asked more and more about what we do and how we do it. Throughout our podcast we will talk about all things interior decoration and design, our process from start to finish, and we will also bring along our design friends to get their insights into the industry.</p>",
        "language": "en",
        "author_name": "Caroline Touzeau and Chrissie Hart",
        "slug": "thedesignduet",
        "cover": "20230628_010635_b67fc73a940b5a49a0bdf4b945398d13.jpg"
    },
    {
        "podcast_id": 217454,
        "title": "PODCAST MUSEO TECNICA ELETTRICA",
        "description": "<p>Componenti:</p><p>Marta Bocchieri</p><p>Adriana Tumino</p><p>Cristal Rossato</p><p>Ludovica Viviani</p><p>Elia Maccolini</p>",
        "language": "it",
        "author_name": "Marta Bocchieri",
        "slug": "podcastmuseotecnicaelettricaunipv",
        "cover": "20230630_110630_d89e132050f04d0eb923e741858cb5fc.jpg"
    },
    {
        "podcast_id": 217813,
        "title": ":3",
        "description": "<p> </p>",
        "language": "en",
        "author_name": "jun",
        "slug": "joscarl",
        "cover": "20230703_090705_945e675b9845eff88a64b3427b081b17.jpg"
    },
    {
        "podcast_id": 218002,
        "title": "Loh par de chalas zico",
        "description": "<p>Un programa para hablar de estilo y ropa de hombre.</p>",
        "language": "es",
        "author_name": "Loh par de chala zico",
        "slug": "chalazico",
        "cover": "20230704_040701_c2165be4cdfa44a2233cbfd2c42f97d7.jpg"
    },
    {
        "podcast_id": 218098,
        "title": "The RadioActive FM",
        "description": "<p>A biweekly podcast companion for your design journey, with totally beginner-friendly episodes if you're just starting out as a designer. </p><p>You could think of this podcast as the Radio for Designers.</p><p>Welcome!</p>",
        "language": "en",
        "author_name": "Yellow",
        "slug": "theradioactivefm",
        "cover": "20230705_010758_0307278b2d011cd285ad37f31e265961.jpg"
    },
    {
        "podcast_id": 218446,
        "title": "Jawntfire ",
        "description": "<p>Fire edit audios</p>",
        "language": "en",
        "author_name": "Joseph abril",
        "slug": "josabr",
        "cover": "20230707_060722_57aea7950d6a8bffc0d235ccb38d4f0b.jpg"
    },
    {
        "podcast_id": 218661,
        "title": "The Creative's Journal Podcast",
        "description": "<p><strong>Welcome to the Creative’s Journal podcast, where we discuss creativity and mindsets that lead to fulfilling and productive lives. This podcast features many meaningful discussions with others about creative lessons, how they apply to life, how they apply to business, and they all revolve around the underlying excitement and joy that we as creatives feel when we apply creativity to the world around us in our own unique way- I think that feeling is incredible.</strong></p><p><strong>We share creative lessons in business, athletics, mindfulness, journaling, meditation, whatever the domain, to help us grow not just as designers and creatives, but as people. So get out your mental journal. Fire up your internal creative software. Thank you for tuning in, and please enjoy the show!</strong></p>",
        "language": "en",
        "author_name": "Andy Milligan",
        "slug": "the-creatives-journal",
        "cover": "20230723_010748_aa48edb5c22cab0430b313a2210ebef9.jpg"
    },
    {
        "podcast_id": 218918,
        "title": "Let's talk about life",
        "description": "<p>Welcome to \"Let's Talk About Life,\" the podcast where we dive deep into the complexities, wonders, and challenges of existence. Join host [Host's Name] as we explore love, relationships, self-discovery, career choices, mental well-being, and more. Through insightful conversations with experts, everyday individuals, and sometimes even celebrities, we aim to inspire personal growth and foster a deeper understanding of ourselves and the world. Subscribe now and embark on this remarkable journey of self-reflection and shared human experiences. Let's Talk About Life—because it's best understood together.</p>",
        "language": "en",
        "author_name": "Manuela",
        "slug": "letstalkaboutlifepodcast",
        "cover": "20230711_080718_fba04ed8c276abd494b9226f74d08b46.jpg"
    },
    {
        "podcast_id": 218995,
        "title": "ProArt",
        "description": "<p>- Кто написал картину, вдохновляясь сыром камамбер? И можно ли назвать современное искусство - искусством?</p><p>- Ответы на эти, и многие другие вопросы вы найдете в подкасте PRO искусство “ProArt” </p>",
        "language": "ru",
        "author_name": "Arina",
        "slug": "proart",
        "cover": "20230711_060731_9ddaa215cbe04b05725c8962dfb932d7.jpg"
    },
    {
        "podcast_id": 219606,
        "title": "ARTIST ARTICLES",
        "description": "<p>All, actually, most of my random thoughts through out the day. Theres not enough space on here for all of it. </p>",
        "language": "en",
        "author_name": "BASH",
        "slug": "artistarticles",
        "cover": "20230715_060730_320272b379776066d081272935576546.jpg"
    },
    {
        "podcast_id": 219763,
        "title": "qwqfa asda ",
        "description": "<p>Dx asdaz asda</p>",
        "language": "ar",
        "author_name": "ahmad masri",
        "slug": "ahmadmasri",
        "cover": "20230717_020726_c916c4b371845afd13608d97e7dc58e2.jpg"
    },
    {
        "podcast_id": 219905,
        "title": "clean versions",
        "description": "<p>clean versions of my fav songs </p>",
        "language": "en",
        "author_name": "stargirl",
        "slug": "clean",
        "cover": "20230717_090704_543508b4a4448889305b1416f0044cfa.jpg"
    },
    {
        "podcast_id": 219952,
        "title": "Three Cheese Blend",
        "description": "<p>POV: The podcast idea has left the group chat. Three siblings all in the design world have come to tell you how their passions have turned into a career. Jonathan, the oldest, is a Landscape and Event Lighting Designer. Libbi, the middle, is a Fashion Designer that designs and makes custom wedding gowns. Emma, the youngest, works as an interior designer. You'll learn about their careers, and how the Midwest is an attractive place. They'll sit down and speak with other industry professionals to share their love for the industry. Follow us on social media<strong> @threecheeseblendpod</strong></p>",
        "language": "en",
        "author_name": "Three Cheese Blend",
        "slug": "threecheeseblend",
        "cover": "20230718_030733_01019b8ea1751685ea3898fa7d62e6b8.jpg"
    },
    {
        "podcast_id": 220773,
        "title": "RESONANCIAS. Foro profesional de instrumentos musicais",
        "description": "<p>RESONANCIAS é unha plataforma de divulgación de diversas experiencias, reflexións e ideas relacionadas coa  investigación, a conservación e a construción de instrumentos musicais. </p><p>Os contidos deste podcast forman parte do Foro profesional impulsado pola Fundación Pública Artesanía de Galicia no festival Música no Claustro con sede na Catedral de Tui. </p><p>A creación deste podcast está financiada pola Unión Europea a través dos fondos Next Generation do Plan de Recuperación, Transformación e Resiliencia do Instituto Nacional de Artes Escénicas e Música do Ministerio de Cultura e Deporte.</p>",
        "language": "gl",
        "author_name": "Música no Claustro",
        "slug": "resonancias",
        "cover": "20230723_110756_65d931a5acc91099cc00e269ac7568cd.jpg"
    },
    {
        "podcast_id": 220857,
        "title": "unreleased",
        "description": "<p>yippee</p>",
        "language": "en",
        "author_name": "nerdgan",
        "slug": "nerdgan",
        "cover": "20230724_030750_9147455aae37a7a6762db5c45bf7d193.jpg"
    },
    {
        "podcast_id": 221147,
        "title": "Blank Drawings",
        "description": "<p>A platform where I share my experiences in the creative and graphic design industry and hopefully those experiences help the creative who is just starting out and the more mature creative who has seen it all. Sometimes it feels like in the industry you are on your own but you really aren't, I am still learning and growing and I hope we grow together!</p>",
        "language": "en",
        "author_name": "Tinotenda Vashibe",
        "slug": "blankdrawings",
        "cover": "20230725_090705_40dc46355554c49c6e7b29a28f34ec10.jpg"
    },
    {
        "podcast_id": 221266,
        "title": "My pod",
        "description": "<p>jsdfsds</p>",
        "language": "en",
        "author_name": "Kay Patel",
        "slug": "my-podd",
        "cover": "20230726_060755_44cf703e04677d8cd3fe2c50d7900ab8.jpg"
    },
    {
        "podcast_id": 221401,
        "title": "Glitz Glam and Gall",
        "description": "<p>This is just for fun and conversational </p>",
        "language": "en",
        "author_name": "Bambe",
        "slug": "glaglagal",
        "cover": "20230727_040725_4914f5eb67615141f6164d7508a8ab1b.jpg"
    },
    {
        "podcast_id": 221469,
        "title": "My vida sin dopamina ",
        "description": "<p>Marluz, mi tia, es una señora extraordinaria y apasionada por la música. A lo largo de su vida, ha enfrentado el desafío del Parkinson, una enfermedad que afecta su movilidad y estabilidad, pero eso no ha detenido su determinación ni su amor por el canto. Con una voz dulce y conmovedora, ella ha encontrado en la música una forma de expresar sus emociones y superar las dificultades que la vida le ha presentado.</p><p>A medida que el Parkinson avanza, mi tia es consciente de que su capacidad para cantar puede disminuir con el tiempo, pero esto no la detiene. Más bien, esta talentosa mujer ve en cada canción una oportunidad para dejar un legado duradero. A través de sus interpretaciones, busca tocar los corazones de quienes la escuchan y transmitir mensajes de esperanza, valentía y amor.</p><p>Su música se convierte en un testimonio de la fuerza humana y la capacidad de sobreponerse a los obstáculos. Cada nota, cada verso que entona es un recordatorio de que la pasión y la creatividad pueden trascender cualquier barrera física. Además, a través de sus actuaciones, mi tia  desea generar conciencia sobre el Parkinson y brindar apoyo a quienes también enfrentan esta enfermedad, demostrando que es posible encontrar belleza y significado en la adversidad.</p><p>La voz de mi tia sin duda se convierte en una inspiración para muchos, dejando una huella imborrable  en los corazones de quienes la conocen. Su valentía y determinación la convierten en un ejemplo viviente de la importancia de perseguir nuestros sueños, sin importar los desafíos que la vida nos presente.</p><p>Mi tia, es una persona admirable.</p>",
        "language": "en",
        "author_name": "Mariluz caldera ",
        "slug": "mariluz",
        "cover": "20230728_120713_12b8294fd252b490b8f74fc6bef09fac.jpg"
    },
    {
        "podcast_id": 221486,
        "title": "Cool Ass People Podcast",
        "description": "<p>Welcome to Cool Ass People Podcast, the podcast where we dive deep into the creative minds and souls of some of the most amazing individuals out there. Every other week, we'll embark on a journey of inspiration, exploration, and discovery. I'll be sitting down with a wide range of creatives from various fields, from architects to painters, chefs to musicians, and everything in between. Together, we'll uncover the secrets behind their incredible works of art, delve into their design processes, and explore the fascinating stories that have shaped their creative journeys.</p>",
        "language": "en",
        "author_name": "Brannon Heake",
        "slug": "coolasspeoplepodcast",
        "cover": "20230728_010759_62b50f726a99f1abca95a7c92b577f0c.jpg"
    },
    {
        "podcast_id": 221912,
        "title": "D O T Podcast ",
        "description": "<p>Welcome to Our Podcast! With Mira Prihatini and Ren Katili, we talk about design and lifestyle</p>",
        "language": "en",
        "author_name": "Benda Design Hub",
        "slug": "dotpodcastbdh",
        "cover": "20230731_080733_9935a4adb9b082cbe25b7e43f0b30604.jpg"
    },
    {
        "podcast_id": 222050,
        "title": "Hablando Claro  ",
        "description": "<p>#ESPOCH #CARRERADISEÑOGRAFICO</p><p>#HACEMOSHISTORIA</p><p>#COMUNICACIÓNORALYESCRITA</p>",
        "language": "es",
        "author_name": "Esteban Morales ",
        "slug": "estebandido420",
        "cover": "20230801_030857_03988c9bcd8e5ea3109dcb5658cd20e9.jpg"
    },
    {
        "podcast_id": 222291,
        "title": "The Podcast Show",
        "description": "<p>Welcome to THe POdcast Show</p>",
        "language": "en",
        "author_name": "H.a.",
        "slug": "this-is-a-testt",
        "cover": "20230802_030816_447011e516cebf86d057a9e1683dda72.jpg"
    },
    {
        "podcast_id": 222413,
        "title": "Креативна Практика про креативні практики",
        "description": "<p>Щочетверга ви знайомитиметесь з різними представниками креативної індустрії, аби зазирнути за її лаштунки та обговорити актуальні питання про кар’єру та розвиток в дизайні. Ведучий нового сезону — Євген Ігнатюк, провідний дизайнер освітнього відділу Креативної Практики. Подкаст створюється командою Креативної Практики, онлайн-платформи для освіти та кар’єри в креативних індустріях, створеної CASES. Маєте запитання чи пропозиції? Напишіть нам на <a href=\"mailto:team@creativepractice.com.ua\">team@creativepractice.com.ua</a></p>",
        "language": "uk",
        "author_name": "Креативна Практика",
        "slug": "creative-practice-about-creative-practices",
        "cover": "20230914_100908_0974d05e47fcb845d3004b3fd591c862.jpg"
    },
    {
        "podcast_id": 222669,
        "title": "CREATIVE THERAPY",
        "description": "<p>Welcome to CREATIVE THERAPY, where we delve into the fascinating world of design and creativity. Join us as we engage in insightful conversations with designers, experts, and thought leaders, exploring the diverse realms of visual communication, problem-solving, innovation and creative process. From graphic design and branding to user experience and sustainability, we uncover the secrets behind great design and how it shapes the way we interact with the world. Whether you're a seasoned designer or an aspiring creative, this podcast offers inspiration, tips, and stories that will ignite your imagination and fuel your passion for all things design.</p>",
        "language": "ar",
        "author_name": "Ismail Abdessamed",
        "slug": "bdrdsgn-podcast",
        "cover": "20230805_110823_9c92d3228507ffde1c05aef5bd47ff29.jpg"
    },
    {
        "podcast_id": 222901,
        "title": "agencia de marketing digital",
        "description": "<p><strong>Somos una agencia de </strong><a href=\"https://webuniversal.pe/marketing-digital/\"><strong>marketing digital</strong></a><strong> en Lima que brinda soluciones a empresas o marcas personales enfocadas en proyectos de promoción online, cuyo objetivo siempre es conseguir más conversiones mediante una campaña.</strong></p><p><strong>Creamos planes estratégicos para el éxito de tu proyecto en un moderado plazo, consiguiendo el mayor retorno de capital posible gracias a una buena planificación previa.</strong></p>",
        "language": "es",
        "author_name": "gian",
        "slug": "marketingdigitalwebu",
        "cover": "20230807_030855_431d488f80b3d418c9e41618565b66d1.jpg"
    },
    {
        "podcast_id": 224862,
        "title": "herramientas en la tecnologìa en la edicaciòn, TIC`S",
        "description": "<p>Evidencia de trabajo</p>",
        "language": "es-mx",
        "author_name": "carlos alberto juàrez hernñandez",
        "slug": "evidenicia-de-trabajo-tema-tic",
        "cover": "20230819_070835_ef3d0b207b317772b74a61f5276cba85.jpg"
    },
    {
        "podcast_id": 224869,
        "title": "MAESTRIA",
        "description": "<p>LIC. EN DERECHO </p>",
        "language": "es-mx",
        "author_name": "SAMANTHA BALDERAS",
        "slug": "innovacion-tecnologia",
        "cover": "20230819_080818_4f7c6909b852f161cb54ba06725213f3.jpg"
    },
    {
        "podcast_id": 224930,
        "title": "Windows 9",
        "description": "<p>it was windows 8.1 lol</p>",
        "language": "en",
        "author_name": "c00lkidd",
        "slug": "windows9",
        "cover": "20230820_100808_10374918b933e90f3870cc62900e271b.jpg"
    },
    {
        "podcast_id": 225125,
        "title": "Pipe and Tobacco Talk",
        "description": "<p>Tim (PapaBear's Pipes) and Jim (Emerson Southern Forged) will discuss all things Pipe and Tobacco. Each episode will have a What's new segment, Tobacco talk, Pipe talk and questions from you the viewers. As we roll along we'll have guests, updates, anything that pops into our heads. No rules, completely irreverent, it's just two friends chatting about the hobby we love. Sit back, relax, light your favorite pipe with your favorite tobacco and enjoy the show.</p><p>Info: @papabearspipes, <a href=\"http://www.pbhbp.com\">www.pbhbp.com</a> @emerson_southern_forged</p>",
        "language": "en",
        "author_name": "Hosted by Tim Beaumont and Jim Steffy",
        "slug": "pipeandtobaccotalk",
        "cover": "20230821_050817_44dfc5e37b6a6c38a3e077246b5bfdac.jpg"
    },
    {
        "podcast_id": 225309,
        "title": "Fake rasta branco mama Pixupica e come a bosta quente dele ",
        "description": "<p>FALE RASTA BROXA</p>",
        "language": "en",
        "author_name": "Pixu comedor de fake rasta",
        "slug": "gonorasta",
        "cover": "20230822_030813_e4472ff5674d7fac58c66d82a7f3a91a.jpg"
    },
    {
        "podcast_id": 225395,
        "title": "Ava's Audible Art Studio",
        "description": "<p>This podcast is all about the art community. It's a fun place for artists to come and listen and be inspired to create whatever they love to create. Please draw along with this podcast, listen to this in the background while you paint, sculpt, doodle, crochet, whatever you do. I made this to inspire you guys and I am going to be talking about all different forms of art, all different artists both small and big, lots of art history, and much much more. Enjoy y'allllllll 💗</p>",
        "language": "en",
        "author_name": "Ava Noelle Mosley",
        "slug": "avasaudibleartcorner",
        "cover": "20230901_080907_f916d59fe87d984f6305659607a1a03b.jpg"
    },
    {
        "podcast_id": 225817,
        "title": "The Path To Your Home Podcast ",
        "description": "<p>By Marah </p>",
        "language": "en",
        "author_name": "Marah Home",
        "slug": "thepathtoyourhomepodcast",
        "cover": "20230825_020812_b468fc823068526bfd6685476f678a69.jpg"
    },
    {
        "podcast_id": 225843,
        "title": "Introduccion al diseño",
        "description": "<p>Crea tus propios diseños </p>",
        "language": "es",
        "author_name": "Julia Lamas",
        "slug": "julialamaspodcast",
        "cover": "20230825_070826_3e3ceb7defb636e3e464d715950e77fe.jpg"
    },
    {
        "podcast_id": 225892,
        "title": "Kickin Back with Kasee",
        "description": "<p>Kickin Back with Kasee - Introduction 8.25.23</p>",
        "language": "en",
        "author_name": "Kasee Garrett",
        "slug": "kickinbackwithkasee",
        "cover": "20230826_020827_efd27f782f867bd265a7ac16db68f9cd.jpg"
    },
    {
        "podcast_id": 225993,
        "title": "Music ",
        "description": "<p>A</p>",
        "language": "en",
        "author_name": "Ashley Molyneux ",
        "slug": "dragonsounds",
        "cover": "20230827_120843_61c8c1bfcfee43eccffdf1ebaa1b232c.jpg"
    },
    {
        "podcast_id": 226159,
        "title": "GWC",
        "description": "<p>Ginger - Wogs - Coconuts.</p><p>Talking shit about shit and where is the entertainment business heading? </p>",
        "language": "en",
        "author_name": "matteo del mastro",
        "slug": "gwcpodcasts",
        "cover": "20230828_030832_5262809e63f8042e65680d12e0957871.jpg"
    },
    {
        "podcast_id": 226485,
        "title": "miguelpasha özel v2",
        "description": "<p>parayı çok düşünen tek adam.</p>",
        "language": "tr",
        "author_name": "miguel v2",
        "slug": "miguelbestv2",
        "cover": "20230830_120850_130b66ebf96afa1e59f47029d6a8c879.jpg"
    },
    {
        "podcast_id": 226988,
        "title": "o ta da t",
        "description": "<p>parayı çok düşünen adam (rıp)</p>",
        "language": "tr",
        "author_name": "miguelpasha özel v3",
        "slug": "miguelpashav3",
        "cover": "20230902_110930_577bccac1c15105faa26e4bba901af2e.jpg"
    },
    {
        "podcast_id": 227148,
        "title": "inzamam's unplugged: conversations that experience life and beyond",
        "description": "<p>Life is an adventure waiting to be explored. Tune in to \"Inzamam's Life Explorations\" and let's embark on this incredible expedition together.</p>",
        "language": "en",
        "author_name": "mohd inzamam",
        "slug": "inzamam-unplugged",
        "cover": "20230904_080915_27efa610ff48e2a35b0323124dcab5a3.jpg"
    },
    {
        "podcast_id": 227403,
        "title": "Humanities Podcast",
        "description": "<p>In this podcast we will be talking about our suburb Wasteago</p>",
        "language": "en",
        "author_name": "Lyan Dev",
        "slug": "lyan-developers",
        "cover": "20230906_010931_1b0c43436b7045b55935da01da537e9b.jpg"
    },
    {
        "podcast_id": 227851,
        "title": "r0blox",
        "description": "<p>bye</p>",
        "language": "en",
        "author_name": "bypassed",
        "slug": "bypassedaudio",
        "cover": "20230908_100943_e9e526251034e57a6366a9d338e6b090.jpg"
    },
    {
        "podcast_id": 227858,
        "title": "dthang savior",
        "description": "<p>legeeeeeggggeeeeeeenndddd</p>",
        "language": "en",
        "author_name": "dthang savior ",
        "slug": "dthangsavior",
        "cover": "20230908_110916_ecbfebc7fa9d1e388f6292c615230ed5.jpg"
    },
    {
        "podcast_id": 228103,
        "title": "𝙼𝚛 𝚖𝚘𝚘𝚗? 𝓨𝓮𝓪𝓱? 𝚃𝚎𝚕𝚕 𝚞𝚜 𝚊𝚋𝚘𝚞𝚝 𝚝𝚑𝚎 𝚜𝚔𝚢",
        "description": "<p>Lemon demon</p>",
        "language": "en",
        "author_name": "Ilovelemondemon",
        "slug": "codyismybestfriend",
        "cover": "20230910_100903_e42c2877aec3c119785b079716f3b15b.jpg"
    },
    {
        "podcast_id": 228157,
        "title": "ARTLESS - Beyond Limits | بی هنر - فراتر از محدودیت ها ",
        "description": "<p>در این پادکست، اهمیت بکارگیری هوش مصنوعی در فرآیند طراحی را مورد تجزیه و تحلیل قرار می‌دهم و تلاش می‌کنم تا نکات و راهکارهایی ارائه دهم که به شما به عنوان مخاطبان عزیز کمک کنند تا از این تکنولوژی به نحوه‌ای هوشمندانه‌تری در طراحی خود بهره‌برداری کنید.</p><p>همچنین در این پادکست به موضوعات مهمی نظیر توسعه مهارت‌ها و پیشرفت در مسیر خلاقیت و طراحی پرداخته و تجربه‌های شخصی خودم را نیز درباره چالش‌ها و راه‌های پیشروی در دنیای طراحی به اشتراک می‌گذارم.</p>",
        "language": "fa",
        "author_name": "Roniek",
        "slug": "artless",
        "cover": "20230911_090948_06f35e24fc6ec2bddd8561928742aaef.jpg"
    },
    {
        "podcast_id": 228184,
        "title": "Graphic Design Principles ",
        "description": "<p>Are you a graphic designer and you are looking for mind blowing principles that can elevate your designs.</p><p>Then you're most welcome to our Podcast </p>",
        "language": "en",
        "author_name": "Oriade Tobiloba",
        "slug": "oriadetobi",
        "cover": "20230911_020948_15bcb27e2ef11fc2620434f2f10b56b3.jpg"
    },
    {
        "podcast_id": 228386,
        "title": "Why We Roll",
        "description": "<p><strong><em>Why We Roll</em> is fun and practical in tone, combining the benefits of a shoot-the-shit professional chat with an advice show, and including some actual-play segments. Chris and Wythe take a sensitive, curious, ecumenical approach to game design, and their perspectives are informed by years of work on their own games. Between conversations, Chris and Wythe work through specific problems in the course of playing new games, often with one of the games’ designers.</strong></p><p><strong>On the show, Chris and Wythe speak to a roster of different TTRPG designers, with a focus on professional and professionalizing indie designers who share a broadly Leftist ideological bent. (“Designers” includes writers, artists, graphic and layout artists, voice talent, and many others, but most guests have a strong hand in mechanical game-design per se.)</strong></p><p><strong>Through the show, Chris and Wythe hope to amplify new creative voices, connect with leading indie designers, and work through a range of mechanical and narrative questions that are pertinent to many designers, players, and GMs.</strong></p><p><strong><em>Why We Roll</em> is both entertainment and resource, part of a longstanding tradition of “showing our homework” in the indie TTRPG community as well as a showcase of fresh, new, and even challenging ideas about what makes imagination-based games so powerful.</strong></p>",
        "language": "en",
        "author_name": "Chris Pickett & Wythe Marschall",
        "slug": "whyweroll",
        "cover": "20230912_060928_ff340861b339646103a5d232794fb9e0.jpg"
    },
    {
        "podcast_id": 228477,
        "title": "TripleP",
        "description": "<p>This is the podcast that is going to be my product for the IB personal project. I wanted to learn how to create a podcast and all the cool things that go into making one. My friends and I will be discussing books and see what each other thinks of them.</p>",
        "language": "en",
        "author_name": "Worthing ",
        "slug": "ppbookclub",
        "cover": "20230913_090933_ffd51dcdfa098fc44917f8905dfe318a.jpg"
    },
    {
        "podcast_id": 228881,
        "title": "Pásalo En Limpio",
        "description": "<p>Podcast de Diseñadores, para diseñadores.</p>",
        "language": "es",
        "author_name": "Pásalo En Limpio",
        "slug": "pasaloenlimpio",
        "cover": "20230916_120954_f33f712c72a227eda7cecf40562d7a67.jpg"
    },
    {
        "podcast_id": 229232,
        "title": "teste",
        "description": "<p>flando besteirada adoidado</p>",
        "language": "pt-br",
        "author_name": "teste",
        "slug": "testepodca",
        "cover": "20230918_070922_cdb4204c944e4213686c0e7b87d922a4.jpg"
    }
]