[
    {
        "podcast_id": 3360,
        "title": "Gap Time",
        "description": "<p>Conversations with Ali and Ghazaal on miscellaneous topics</p>",
        "language": "fa",
        "author_name": "Gap Time",
        "slug": "gaptime",
        "cover": "20230306_050329_93a9364e82301769934f56cdd1ba9db4.jpg"
    },
    {
        "podcast_id": 6612,
        "title": "Radio Pug",
        "description": "Luis Guerrero \"Wendy\", Carlos Avella \"Búho\" y Armando Morales \"Shane\" repitiendo mucho la palabra “wey”, mientras compartimos historias de nuestras vidas echando chela. Porque lo que el mundo necesitaba era un podcast más y un pug de mascota.",
        "language": "es",
        "author_name": "Luis Guerrero",
        "slug": "radiopug",
        "cover": "20200306_055232_e4fa4a76f3afe03a3fc1483c9fa53bea.jpeg"
    },
    {
        "podcast_id": 8121,
        "title": "Not Before Coffee",
        "description": "Welcome to Season 4!! Be a fly on the wall as 2 longtime, coffee loving, free spirited friends converse about current events, sports, and MORE. This unscripted podcast is guaranteed to make you chuckle and even make your father blush!",
        "language": "en",
        "author_name": "Haydan Magana, TJ Hewitt",
        "slug": "notbeforecoffee",
        "cover": "20220623_100637_8e01f5f79005c40851f5fed79aab2de0.jpg"
    },
    {
        "podcast_id": 9402,
        "title": "Getting Buckets",
        "description": "Twitter: @getbucketpod\n\nThe Getting Buckets Podcast is your source for nuanced and detailed analysis of the NBA and its related storylines and politics. We'll give you our unique takes on the latest news from the greatest sports league in the world -- all we need from you is your support!",
        "language": "en",
        "author_name": "Ethan Vizgan, David Vizgan, Matthew Rotlevi and Jordan Grossman ",
        "slug": "gettingbuckets",
        "cover": "20200608_031749_67103d0c78472316e371c84e13671ecf.jpeg"
    },
    {
        "podcast_id": 9781,
        "title": "Ray Nell Jones-Podcast-Currently Running Segment-Women of Power",
        "description": "Reality is the new sexy. Each and every Sunday\nRay Nell Jones will bring some new reality and authentic conversation back into the world by bringing awareness to the day to day struggles that single moms and fathers face daily while struggling to simply SURVIVE. This podcast was created to impact and inspire listeners by hearing success stories from celebrities, community leaders, business owners, and activist. This is great downloadable content.",
        "language": "en",
        "author_name": "Ray Nell  Jones",
        "slug": "theallignmentchapter",
        "cover": "20220312_070315_7be8dc1a8d441357303dc7e11555172c.jpg"
    },
    {
        "podcast_id": 11098,
        "title": "China&Ronnie",
        "description": "Welcome to our podcast! \nAllow us to introduce ourselves!\nWe are two whimsical dreamers\nborn and raised in Los Angeles, California.\ntake a listen as we talk about our adventures \nand day to day life updates and of course we will be discussing many more topics \nevery Monday and Wednesday... \n\n\n",
        "language": "en",
        "author_name": "ChinaaxRonnie",
        "slug": "chinaaxronnie",
        "cover": "20200804_001037_13a77184f906a54043a7c5b88261d2e0.jpg"
    },
    {
        "podcast_id": 11138,
        "title": "Kahaniwala- Hindi Stories",
        "description": "Kahaniwala is a podcast where new, unheard stories, poems, and anecdotes are narrated. Stories that touch human emotions, create nostalgia and takes you down the memory lane. Like, Share, and Subscribe to the podcast. \nFollow us on YouTube @ www.youtube.com/kahaniwala \nFollow Kahaniwala on Facebook, Instagram, Twitter - @yourkahaniwala \nWrite to Kahaniwala at- kahaniwalamail@gmail.com",
        "language": "en",
        "author_name": "Rishabh",
        "slug": "kahaniwala",
        "cover": "20200805_092458_a70b57741311a4f6b4a6b04c5e2fd5b8.jpg"
    },
    {
        "podcast_id": 11686,
        "title": "Standby for Places",
        "description": "Welcome to Standby for Places! Taking the classic radio play style and introducing it to modern technology. \nCreated by Freda Mattea, Margie Zarcone, Graydon Gund. Other creative team members include Dunya J. Karam and Benjamin Mandell.",
        "language": "en",
        "author_name": "Freda Mattea, Margie Zarcone, and Graydon Gund",
        "slug": "standbyforplaces",
        "cover": "20201021_030621_6a2da83de98a6b9f12a572777b2a6d0e.jpg"
    },
    {
        "podcast_id": 11966,
        "title": "\"Almost\" - A Novel by Stefan Molyneux",
        "description": "A powerful novel by philosopher Stefan Molyneux, the host of Freedomain, the largest and most popular philosophy show on the internet, with over 700 million views and downloads.\n\nTwo families - one German, and one English - find love, friendship and combat from the trenches of World War One to the skies of World War Two.",
        "language": "en",
        "author_name": "Stefan Molyneux, MA",
        "slug": "almost",
        "cover": "20200904_143032_d8dd13535ebff365c33aed2ad2ead862.jpg"
    },
    {
        "podcast_id": 12812,
        "title": "Kiss And Tell with Sofie Dossi and Kyla Kenedy ",
        "description": "Sofie FINALLY decides to KISS and TELL after years of being a very private person. Not only does she reveal some of her own personal juicy news, she dishes about the latest rumors of the trendiest people on the Hollywood scene.  Join Sofie with her friend and co-host, actress Kyla Kenedy, as they expose the truth behind the gossip headlines of some of the hottest news in the lives of young Hollywood.",
        "language": "en",
        "author_name": "Sofie Dossi",
        "slug": "kissandtell",
        "cover": "20200927_053243_42a593ed992d447132b44899cb9cce37.jpg"
    },
    {
        "podcast_id": 14652,
        "title": "Luisme y Compadre Show",
        "description": "Dos chicos mexicanos cuentan sus anécdotas  y experiencias viviendo en la ciudad de Nueva York. Las anécdotas relatadas son basadas en vivencias propias de cada individuo, con un dinamismo motivador pero al mismo tiempo de una manera divertida y única. Cada uno con su personalidad que los caracteriza. \nQue esto o que lo otro, saludcita de la buenaaaaa 🎙🙃🍾",
        "language": "es",
        "author_name": "Luisme y Compadre",
        "slug": "luismeycompadreshow",
        "cover": "20210325_050330_0871abed0edca7c267560971100988e7.jpg"
    },
    {
        "podcast_id": 15967,
        "title": "BedtimeSCP",
        "description": "Hello, I read SCP articles, attempting to keep to as true to the article as possible.",
        "language": "en",
        "author_name": "BedtimeSCP",
        "slug": "bedtimescp",
        "cover": "20201128_193636_0064b064a7c039ac8de18f4132715780.jpg"
    },
    {
        "podcast_id": 26023,
        "title": "LA NOTA MASACRE",
        "description": "<p>\"La Nota Masacre\" a tu celular mandanos un Whatsapp al 5614088437</p>",
        "language": "es-mx",
        "author_name": "Mike Convey / Angel Maya ",
        "slug": "convey1",
        "cover": "20230523_080557_9b742ff9ef6e44638cce23f0cb7ed2da.jpg"
    },
    {
        "podcast_id": 26606,
        "title": "A Filmfreak's Conversation",
        "description": "Elke maand kun je genieten van de fantastische podcast van het filmblog 'a Filmfreak's Guide to Life' genaamd 'A Filmfreak's Conversation'. In deze podcast bekijken Maureen en Marre een film, die ze nog niet hebben gezien, en gaan deze bespreken en vertellen ze welke levensles zij eruit hebben gehaald. Elke maand een andere interessant onderwerp en een boeiende film. ",
        "language": "nl",
        "author_name": "Marre en Maureen",
        "slug": "afilmfreaksguidetolife",
        "cover": "20210131_112238_17df8b1388b34258300b72b9bf03892e.jpg"
    },
    {
        "podcast_id": 28881,
        "title": "Sipping n Spilling with Sues ",
        "description": "Grab some gin or a peppermint tea and sip along while me and my guests spill all. We'll be discussing topics from all aspects of life. New episodes every week\nInstagram: @suesthemuse ",
        "language": "en",
        "author_name": "Susanne Moody",
        "slug": "sippingnspillingwithsues",
        "cover": "20221011_101027_b438e781681442b84b9f248ad0a12a67.jpg"
    },
    {
        "podcast_id": 33239,
        "title": "Who Wrote This Sh*t?",
        "description": "Three friends review a bad book, drink some bad wine, and talk about why we make these bad decisions.",
        "language": "en",
        "author_name": "Erin, Hope, and Juniper",
        "slug": "whowrotethisshitpodcast",
        "cover": "20210309_020240_3517f2539a0138bdaeb4407fa9516757.jpg"
    },
    {
        "podcast_id": 38935,
        "title": "The Waystation",
        "description": "The crew of an orbital station discovers a strange celestial object, creating something that threatens to enmesh them all. Armed with the recordings of the events, a federal agent scours the logs and entries of the crew in search of the truth behind the station's mysterious destruction.\n\nYour worst enemy is you.\n\nhttps://twitter.com/waystation_pod",
        "language": "en",
        "author_name": "Wired Cowslip",
        "slug": "thewaystation",
        "cover": "20210311_000722_7760d7653d17b12d767f164e35d8880c.jpg"
    },
    {
        "podcast_id": 41469,
        "title": "Missives from a New Ghost Town",
        "description": "Utopia means \"no place,\" but here are some voice memos from everywhere.",
        "language": "en",
        "author_name": "A New Ghost Town",
        "slug": "missivesfromanewghosttown",
        "cover": "20210314_200122_f0adcdffa2976799c8f6e28bcb648624.jpg"
    },
    {
        "podcast_id": 44761,
        "title": "Into The Ring",
        "description": "Newcomer to the town of Breag, Lorie and town troublemaker Henry discover a tape recorder and decide to set off on a journey to create an expose on this weird country town. Soon unexplainable events start to happen and Lorie and Henry realize they are the only ones who can save their town. ",
        "language": "en",
        "author_name": "Olivia Spreen and Thomas Malinovsky",
        "slug": "intothering",
        "cover": "20210327_065938_05c32ef26ed9f5855510cca66c53428d.jpg"
    },
    {
        "podcast_id": 45153,
        "title": "The Morgue The Merrier Podcast",
        "description": "Ghost hosts Angelina and Desiree laugh you through all things spooky. Join us for a spine chilling adventure!",
        "language": "en",
        "author_name": "Desiree Alves",
        "slug": "themorguethemerrier",
        "cover": "20210328_214613_2b85f66fcda1a07361374f47061c0144.jpg"
    },
    {
        "podcast_id": 45372,
        "title": "Project: Maternity",
        "description": "This story follows the experience that Noah and Ryan went through while participating in an experiment that... they are not even sure what it is.",
        "language": "en",
        "author_name": "fredrick piquette",
        "slug": "pmatpod",
        "cover": "20210329_175133_122f3fb7b03c03fa57ec59de753d51a5.jpg"
    },
    {
        "podcast_id": 45971,
        "title": "\"So let me tell you...\"",
        "description": "There comes a time where a person gets fed up with holding all of their thoughts about life to themself. So let me tell you I have had enough and I'm ready to share my thoughts with the world! Each episode will be a different topic (i.e: love, friendship, family, self-reflection, etc.) and will ultimately consist of my views about life. In a simple way to put it, I JUST WANT TO TALK!",
        "language": "en",
        "author_name": "Deja' Haley",
        "slug": "soletmetellyou",
        "cover": "20210401_044057_a524fe94fbed5532f950b2919f6e66be.jpg"
    },
    {
        "podcast_id": 47222,
        "title": "The Sonic Corridor",
        "description": "Welcome to The Sonic Corridor, where you will find doorways to confounding, twisted and stupefying stories...shall we take a walk?",
        "language": "en",
        "author_name": "Phones On Silent",
        "slug": "thesoniccorridor",
        "cover": "20210406_141401_f73f7a6fff546016b3fa70aaa8f881c2.jpg"
    },
    {
        "podcast_id": 47276,
        "title": "Blue Cheese by Ebony L. Haynes",
        "description": "This podcast is a conversation between the host, Ebony L. Haynes, and an invited guest from the \"art world.\" Each guest is given the prompt: What is a song you currently have on repeat / What is one of your regular \"go-to\" songs? The conversation starts with that song and goes...wherever it wants to go.\nRecorded  by Montez Press Radio\nEdited by Taryn Collymore\nGraphics by Sebastien Pierre\n",
        "language": "en",
        "author_name": "ELH",
        "slug": "bluecheese",
        "cover": "20210422_113838_0539a992c711b415587eee9b99dad7df.jpg"
    },
    {
        "podcast_id": 47907,
        "title": "Fulmar's Folly",
        "description": "<p>Two years after civilisation collapsed from a terrifying zombie like pandemic, the Cooper family fight for survival aboard their small sailboat Fulmar’s Folly. Hunted by pirates, haunted by the infected and forever battling the sea herself - each episode is told from a different family members point of view.</p><p>Fulmar’s Folly will test your anxiety, provoke your emotions and ultimately take you on an unforgettable journey - a zombie drama set at sea.</p>",
        "language": "en",
        "author_name": "Static Airwaves",
        "slug": "fulmarsfolly",
        "cover": "20230803_030844_6897c870bf6594734a116307cd586785.jpg"
    },
    {
        "podcast_id": 49095,
        "title": "Rowdy Rocca ",
        "description": "The podcast where we talk about everything the girls won’t tell you.",
        "language": "en",
        "author_name": "Sam Rocca ",
        "slug": "rowdyrocca",
        "cover": "20210910_144400_4a6f34c1fe4ec82698df5fe6454ec300.jpg"
    },
    {
        "podcast_id": 50717,
        "title": "Potato Squad",
        "description": "Hey everyone! Welcome to our random af podcasting series. Potato is our code word for cannabis and when I (Queen P) get together with the buds to smoke some bud, we get the Potato Squad! Enjoy our unfiltered moments and laugh with us as you bake up. Welcome to the squad.\n\n",
        "language": "en",
        "author_name": "Queen P and Squad",
        "slug": "potatosquad",
        "cover": "20220419_100428_f8476ec78526617cb1c929062456ea09.jpg"
    },
    {
        "podcast_id": 50730,
        "title": "The Chickadee Prince Books Podcast ",
        "description": "A show about books of all kinds, featuring dramatizations, interviews and conversation, brought to you by Chickadee Prince, the diverse and adventurous Brooklyn small press. And if you enjoyed the \"Watt O'Hugh\" preview in episode 1, head over to the Strange and Astounding Memoirs of Watt O'Hugh podcast to hear more!.",
        "language": "en",
        "author_name": "Steven S. Drachman",
        "slug": "chickadee-prince-podcast",
        "cover": "20210420_013842_e0e6dd4e96b827c80bde1d94e2eb850b.jpg"
    },
    {
        "podcast_id": 51240,
        "title": "The Strange and Astounding Memoirs of Watt O'Hugh the Third",
        "description": "A Weird Western / science fiction radio drama, based on Steven S. Drachman's acclaimed series of novels. Watt O'Hugh the Third is a self-made man, Civil War vet, Time Roamer, former orphan of the New York slums and dime novel hero of the lost, magical West of the 1870s, and his story is one of the most original, riotous literary adventures in recent memory. WE HAVE BEEN RENEWED FOR A FULL SEASON! NEW EPISODES ON THEIR WAY. Starring Anthony Tether and Emily Dalton.",
        "language": "en",
        "author_name": "Sal Rendino",
        "slug": "watt-ohugh",
        "cover": "20210422_020538_b21e911241cb8efbd75e006721ae201c.jpg"
    },
    {
        "podcast_id": 58533,
        "title": "Name of Podcast",
        "description": "A student created, written and performed post-apocalyptic narrative.",
        "language": "en",
        "author_name": "Christopher Hanks",
        "slug": "rchsproductions",
        "cover": "20210523_023155_3b9dd6ed0e7e7df6a374cad1630c497b.jpg"
    },
    {
        "podcast_id": 59740,
        "title": "LITERATURA E DIREITO",
        "description": "Podcast com narrações de contos e livros inéditos de autoria de Kleiton Ferreira. \n\nEntre no site e confira todos os livros nas versões e formatos digitais e físicos.\nwww.kleitonferreira.com\n",
        "language": "pt-pt",
        "author_name": "Kleiton Ferreira ",
        "slug": "joaojose",
        "cover": "20220916_010937_146dbdb54bc342217dac18c670b0e328.jpg"
    },
    {
        "podcast_id": 62649,
        "title": "Old World of Darkness 1921: Sins of The Father",
        "description": "A Vampire the Masquerade podcast taking place in an original world set in Whitewolf's second edition World of Darkness. Taking place in 1921, shortly after the conclusion of The Great War, the Sabbat have established the capital city of the newly formed Second Republic of Poland as a fortress city. The coterie has been sent to establish a connection for the Camarilla.",
        "language": "en",
        "author_name": "Aleksander Whitesides",
        "slug": "sinsofthefather",
        "cover": "20210811_235251_d809e3f4c4647dc2c582a177cf8b2cb5.jpg"
    },
    {
        "podcast_id": 63482,
        "title": "D&Disaster ",
        "description": "Welcome to D&Disaster! a live play Improv Dungeons and Dragons podcast. Follow adventures on Kanasper, an LGBT friendly, diverse fantasy world created and lead by Dungeon Master Ben.\n\nJoin him and his players as they fumble their way through a chaotic and enjoyable, yet deep and intense journey. Expect action, intensity but most of all disaster!\n",
        "language": "en",
        "author_name": "Disaster Productions",
        "slug": "danddisaster",
        "cover": "20210617_121355_8e80474c7903eaa2fd4a8f1077c448fd.jpg"
    },
    {
        "podcast_id": 65320,
        "title": "In The Trench With Esteban",
        "description": "New episodes every Monday and Wednesday morning for you to listen to throughout the week!\nWeekly discussions about everything from bigfoot to the latest TacoBell burrito...",
        "language": "en",
        "author_name": "esteban sarasti",
        "slug": "inthetrench",
        "cover": "20210629_005956_e478c9771b30b35b712efaf70ed0703c.jpg"
    },
    {
        "podcast_id": 70356,
        "title": "Dshenise - von Talk bis Mord",
        "description": "<p>Dshenise - von Talk bis Mord ist eine Mischung aus True Crime und Talk Podcast, bei dem sowohl gelacht als sich auch gefürchtet wird. Es geht um Morde rund um die Welt und nebenbei, um unseren und euren Seelen etwas Gutes zu tun, sprechen wir über den alltäglichen Gossip und über lustige Geschichten die uns bereits widerfahren sind. Was genau euch erwartet wissen wir zu diesem Zeitpunkt genauso wenig wie ihr.. aber wir freuen uns auf die Reise!</p>",
        "language": "de",
        "author_name": "Dshenise",
        "slug": "dshenise",
        "cover": "20230315_120343_45dac53fa6ba2df71b8fe68e4ef1dc43.jpg"
    },
    {
        "podcast_id": 74441,
        "title": "I’m With Stoopid ",
        "description": "Welcome to the I'm With Stoopid Podcast!\n\nI am your host, Stoopid and I am going to change the world, one podcast episode at a time.\n\nWe cover personal tales & experiences, movie & tv reviews, political issues, zodiac signs, life advice and more! \n\nWith (almost) every episode serving you a special guest :)\n\nBe sure to share to the people you hate, and follow! x",
        "language": "en",
        "author_name": "Vita",
        "slug": "imwithstoopid",
        "cover": "20220104_050138_3ea59ac52b8ce76fecc098754ac31b25.jpg"
    },
    {
        "podcast_id": 75751,
        "title": "Bad Bitches Club",
        "description": "Two bad bitches that are approaching their 30's and reflecting back on everything that they have experienced, whether its together or apart in this crazy place we call Dubai! \n\nFollow us on Instagram - @badb_tchesclub",
        "language": "en",
        "author_name": "Samira & Anastasia",
        "slug": "badbtchesclubdxb",
        "cover": "20210906_164919_35aac59d901007efd7b75690a7b9f25c.jpg"
    },
    {
        "podcast_id": 77365,
        "title": "The Reckoning Book One: The Anointed Angel Comes",
        "description": "Good Friday. 1917. The front lines of The Great War. Hell unleashed. A biblical scale armageddon, sparked by the horror of the conflict, ends the war and begins to consume the world. Demons rise. They take possession of the slain and hunt humanity, like an army of serial killers, exacting retribution for mankind’s sins. A disparate group of survivors—soldiers and civilians from all the warring nations—bands together and seeks sanctuary, while their pasts come to life and force them to face the reckoning for their sins. TheReckoningSeries.com",
        "language": "en",
        "author_name": "Jeffrey Pierce",
        "slug": "thereckoningseries",
        "cover": "20210904_201138_dd39f7ce7e2e362e39473cd8ee4b0bd5.jpg"
    },
    {
        "podcast_id": 78689,
        "title": "BrokenCrow Theatre for Children",
        "description": "Brand new quality Audio Dramas made by BrokenCrow. Created in Ireland for children all over the world.",
        "language": "en",
        "author_name": "Deirdre Dwyer",
        "slug": "brokencrowtheatreforchildren",
        "cover": "20210911_192614_a56384f8159b19e99e026b13e11bec88.jpg"
    },
    {
        "podcast_id": 80125,
        "title": "The Double O Show with Osawaru Ogbebor",
        "description": "Hello everyone and thank you for tuning in. My name is Osawaru Ogbebor and this is The Double O Show. I'm here to simply share some encouraging words through enlightening topics, with the help of special guest whom i invite, to motivate you one step closer to your dreams. My motto is \"treat people how you want to be treated.\" ",
        "language": "en",
        "author_name": "Osawaru Ogbebor",
        "slug": "thedoubleoshow",
        "cover": "20210919_032557_8a0ab61749c6ed514e30fa6ed62a120f.jpg"
    },
    {
        "podcast_id": 80487,
        "title": "The Dark Volumes Podcast",
        "description": "Like horror stories? Like audio books? Like to be read to by a voice as soft as black velvet and as sinister as a phantom?\n\nThe Dark Volumes podcast brings you monthly stories from the greats such as H.P. Lovecraft, Edgar Allan Poe, Mary Shelley, Robert Chambers, and others. There's some commentary, sure, but it's all about the stories, here.\n\nTurn off the lights, pour some wine, and (maybe) get under the covers. The Dark Volumes are here to remind you why you should be afraid of the dark.",
        "language": "en",
        "author_name": "Russell Archey",
        "slug": "thedarkvolumes",
        "cover": "20210920_214911_3f05d5301eac4c550e6d7a934430728d.jpg"
    },
    {
        "podcast_id": 81420,
        "title": "Macbeth: The Podcast",
        "description": "Designed as an exciting and immersive learning tool for students, Macbeth is performed by our professional acting company in five action-packed episodes, complete with cinematic score and soundscape.   Read along with the text as you listen, get entangled in Shakespeare's bloody, murderous plot, and discover why Macbeth is still one of the greatest tragedies ever written. \n\nThis activity is made possible by the voters of Minnesota through a grant from the Minnesota State Arts Board, thanks to a legislative appropriation from the arts and cultural heritage fund.\n\nDirected by Doug Scholz-Carlson and Victoria Nassif | Text Coaching by Victoria Teague | Sound Design by Scott O’Brien | Sound Editing by Nathanael Brown\n\nFeaturing: Andrew Carlson (Macbeth) | Leah Gabriel (Lady Macbeth) | Michael Fitzpatrick (Duncan) | Will Sturdivant (Banquo, Siward) | Vanessa Morosco (Macduff) | Valerie Lynn Brett (Lady Macduff, Hecate) | Alex Campbell (Malcolm) | Chris Pow (Ross) | Brittany Proia (Lennox) | Melissa Maxwell (Seyton) | Victoria Nassif (1st Witch, 1st Murderer, Doctor) | Gavin Mueller (2nd Witch, 2nd Murderer) | Lauren Winder (3rd Witch, Gentlewoman) | Doug Scholz-Carlson (Captain, Caithness) | Jackson Mixon (Donalbain) | Liam Carlson (Fleance) | Emma Bucknam (Servant) | Lyda Carlson (Macduff Child) | Hannah Young (Young Siward).  Thanks to KQAL and WSU.\n\nScore and soundscape originally designed for GRSF’s 2019 season production, directed by Paul Mason Barnes. Thanks to KQAL and WSU.",
        "language": "en",
        "author_name": "Great River Shakespeare Festival",
        "slug": "greatrivershakespearefestival",
        "cover": "20211010_221244_b4c3edd7e481dde3f52e3278fff056ab.jpg"
    },
    {
        "podcast_id": 81592,
        "title": "Folklore Of Cumbria 'Kast",
        "description": "In a sparse county, all the ghosts, ghoulies, myths, and legends can lie dormant for a long time.\nSo I'm gonna wake some of 'em up.\n\nThroughout this 'Kast, there will be a lot of the lore that's fit to sing as well as some stories straight from the pony's face - and as an added bonus, anything said pony has witnessed first hand.\nSo hop up on this amateur and trot through tales old and new from County Cumbria.",
        "language": "en",
        "author_name": "C.L.R.",
        "slug": "fock",
        "cover": "20210926_164536_3a2f6367bc3da57ff710946c147cec55.jpg"
    },
    {
        "podcast_id": 81698,
        "title": "Fresas Con Crema ",
        "description": "Our podcast is a place where women can come and listen and feel like they are part of the \"break room girl talk.\" We will hit topics on dating, sex, and relationships. We are all about sexy and juicy stories, and dating in todays generation. Tune in every Thursday and join our girl talk. ",
        "language": "en",
        "author_name": "Fresas Con Crema",
        "slug": "fresasconcrema",
        "cover": "20211014_223136_6a89f765f7ef40c638a0326b0975214e.jpg"
    },
    {
        "podcast_id": 85739,
        "title": "OUTTA POCKET PODDER",
        "description": "If you are easily offended this is not the podcast for you. Always remember.... stand up its not that deep. This is the realest and most honest podcast you'll ever listen too.",
        "language": "en",
        "author_name": "Jay Lane",
        "slug": "outtapocketpodcast",
        "cover": "20211220_031252_65d6056c770dc986e7d2ca84361ead11.jpg"
    },
    {
        "podcast_id": 85936,
        "title": "Sweet 'N' Sour Twenties",
        "description": "With your host Jasmin, Lynda, Ayi and Belinda.",
        "language": "en",
        "author_name": "Sweet 'N' Sour Twenties",
        "slug": "sweetnsourtwenties",
        "cover": "20211019_070147_ac19320ed59015061203fa2ed62cda82.jpg"
    },
    {
        "podcast_id": 86223,
        "title": "We’ll Laugh About This Tomorrow ",
        "description": "This podcast is about life, addiction, sports the world & current events with a little bit of fun. ",
        "language": "en",
        "author_name": "Nicholas Sigston",
        "slug": "laughtomorrow",
        "cover": "20211029_135016_bc015887a03bb40d73de14453fcde267.jpg"
    },
    {
        "podcast_id": 86399,
        "title": "Split Oak Lane",
        "description": "Split Oak Lane is a podcast presented as a series of audio logs by an apartment manager as he searches for a missing tenant--and discovers the secrets of the mysterious complex along the way.",
        "language": "en",
        "author_name": "The Residents",
        "slug": "splitoaklane",
        "cover": "20211025_182025_aafe69e7a720e5cd93e344ff48feef6d.jpg"
    },
    {
        "podcast_id": 86783,
        "title": "Words For The Deaf",
        "description": "Words For The Deaf is a series of audio recordings spurring from personal short form narratives. The title of the series, \"Words For The Deaf\" comes from the idea that these narratives are most likely not going to be listened to.\n\nI'd love to hear feedback and get to know my listeners, feel free to contact me anytime!\nContact Info: words4thedeaf@gmail.com\n",
        "language": "en",
        "author_name": "C.J.",
        "slug": "wordsforthedeaf",
        "cover": "20211024_051329_006ba73df6d74eadab63f9a45f5bf7a0.jpg"
    },
    {
        "podcast_id": 86878,
        "title": "Paranormal Minds",
        "description": "<p>Everyone takes life too seriously - and the world of the paranormal is no different! Join us in our light hearted take on the unexplained.</p>",
        "language": "en",
        "author_name": "The Paranormal Minds of JST",
        "slug": "theparanormalmindsofjst",
        "cover": "20221112_021148_56cff90f8b58b1fc4cb65a4081ca487a.jpg"
    },
    {
        "podcast_id": 86967,
        "title": "Mortuus Est: Legacy",
        "description": "Breaking free, falling in love, and secrets and lies. Mortuus Est: Legacy is a new audio drama podcast that follows the aftermath of the death of Rafael Guerrero. His fiancée, Elaina, is left behind to pick up the pieces as her future becomes intertwined with his shadowed past.",
        "language": "en",
        "author_name": "Crazy10 Entertainment",
        "slug": "mortuusestlegacy",
        "cover": "20211025_045732_f5d640e31d07cabfeeb1278c80cc614d.jpg"
    },
    {
        "podcast_id": 87793,
        "title": "Christian og Jesper vs The Walking Dead",
        "description": "<p>En podcast der går i kødet på Robert Kirkman's apokalyptiske zombieunivers, med fokus på AMC's TV-adaption af tegneserien The Walking Dead.</p>",
        "language": "da",
        "author_name": "Christian Guldager og Jesper W. Lindberg",
        "slug": "christian-og-jesper-vs-the-walking-dead",
        "cover": "20230513_060550_04c19d74d3a8405422d075c6a6fb26f9.jpg"
    },
    {
        "podcast_id": 87947,
        "title": "The Starport Inn",
        "description": "Federal Agent Weaver is sent to investigate strange disappearances in a quiet coastal town in North Carolina.",
        "language": "en",
        "author_name": "J.D. Dennis & K.D. Lalonde",
        "slug": "thestarportinn",
        "cover": "20211030_132817_9f0f70f732b839909b35d8fd8df3b38c.jpg"
    },
    {
        "podcast_id": 88046,
        "title": "We Suck!",
        "description": "We get it, life sucks. But for us, you don't even know the half of it.\nDrop of blood DM: \n@admiral_plays\n\nCoffin Cast: \n@beesmileys\n, \n@DarkMimiTV\n, \n@Nrrdgirl805\n & \n@Juniebug3313",
        "language": "en",
        "author_name": "We Suck!",
        "slug": "wesuck",
        "cover": "20211031_050526_b7ba1a4f86795eff63eb7544e1e7c3e0.jpg"
    },
    {
        "podcast_id": 89844,
        "title": "Glo's Dark Tales",
        "description": "Short Horror Stories",
        "language": "en",
        "author_name": "Gloria V Bueno",
        "slug": "618b634c1ba17306ef76f0e2618b63a34e19815ce15c5b02",
        "cover": "20211110_071909_eab8286bb522c1dc6a2c3d6bf736b33a.jpg"
    },
    {
        "podcast_id": 91850,
        "title": "Chisme On Home",
        "description": "Hi hi, it is finally time for me to join the podcasting life. I am still learning but bare with me as this will be a fun journey for all.",
        "language": "en",
        "author_name": "Daisy Munoz",
        "slug": "chismeonhome",
        "cover": "20211122_055105_ff256bc0ed8b0df7012eefd8e93150e6.jpg"
    },
    {
        "podcast_id": 93775,
        "title": "Audio Bard",
        "description": "An Audiobook & Fiction Podcast Channel. All content narrated by a highly trained professional actor.\n\n——————————————————————————————————————————-\n\nMy name’s James, I trained at one of the best drama schools in England for four years, East 15 Acting School.\n\n——————————————————————————————————————————-\n\nNow living with brain injury caused chronic fatigue, via this project - I am slowly but surely returning to my craft. \n\n——————————————————————————————————————————-\n\nPlease write a short review, give my channel 5 stars, and share with anyone you know who are into audiobooks.\n\n——————————————————————————————————————————-\n\nPlease also subscribe on YouTube ( ‘Audio Bard - Audiobooks’ ) for more content, including coming soon : straight to camera video storytelling / fiction  content.\n\n——————————————————————————————————————————-\n\nIf you’d like to support me further? Head to : patreon.com/AUDIOBARD\n\n——————————————————————————————————————————-\n\nHere’s my LinkTree for professional actor links, my other YouTube channel (a Video Podcast / Vlog), Podcast appearances, media interviews etc : LinkTree/James_InksonStevens\n\n——————————————————————————————————————————-\n\nThank you in advance. :)",
        "language": "en",
        "author_name": "James Inkson-Stevens",
        "slug": "audiobard",
        "cover": "20220225_120201_fdaac3db0f63acdb0be896283774958b.jpg"
    },
    {
        "podcast_id": 94451,
        "title": "Haute Honnah presents: Empty Talk",
        "description": "Haute Honnah presents Empty Talk is a podcast where they talk, debate, review and create film and TV content mainly from Britain. \nImeldha Eloni and Michael Honnah are two freelance filmmakers from the UK creating an exciting space for new and interesting stories in the British film and TV industry. Their company, Haute Honnah, was founded in 2019.\n",
        "language": "en",
        "author_name": "Imeldha Eloni & Michael Honnah",
        "slug": "hautehonnahemptytalk",
        "cover": "20211206_061243_0a54b2d7da24d882a27fe26806d319f3.jpg"
    },
    {
        "podcast_id": 94947,
        "title": "Z tej strony ego",
        "description": "Startujący podkast o wszystkim co mi ślina na język przyniesie. [z perspektywy czasu widzę, że dosyć niefortunne jest używanie w pierwszym zdaniu swojego opisu słowa ślina, ale nevermind].",
        "language": "pl",
        "author_name": "Z tej strony ego",
        "slug": "ztejstronyego",
        "cover": "20220109_090100_cb53d01dc9492416c7026f5f6356fbe0.jpg"
    },
    {
        "podcast_id": 95098,
        "title": "Shitcom",
        "description": "Shitcom is a shitty podcast of two people talking shit. You don't have to listen to it. But you might as well do when you taking a doodoo. *scream in horror*.\n\n",
        "language": "en",
        "author_name": "We Do Good",
        "slug": "shitcom",
        "cover": "20211210_081228_50b755968a085305c7d631ec8f836d8a.jpg"
    },
    {
        "podcast_id": 97625,
        "title": "Witchaar with Moon & Hershey!",
        "description": "An experimental podcast about everything we fangirl to! From Movies, Music, K-Pop, K-Drama, anything and everything of relevance and irrelevance on the web!",
        "language": "en",
        "author_name": "Witchaari ",
        "slug": "witchaar-podcasts",
        "cover": "20211228_081251_c41724d8017063590ea5d435268fa785.jpg"
    },
    {
        "podcast_id": 101383,
        "title": "Two Brain Cells & Daniel",
        "description": "Three best friends talk about stupid shit no one cares about. It’s kinda funny. Sometimes. ",
        "language": "en",
        "author_name": "Daniel Rey & Keia ",
        "slug": "two-brain-cells-and-daniel",
        "cover": "20220117_100109_12b7bf885fc6e43885e915206e9beae5.jpg"
    },
    {
        "podcast_id": 105593,
        "title": "Let's Talk KrissyO Podcast",
        "description": "Let's Talk KrissyO is a hot new weekly podcast that talks about all the raw and intimate things that we humans dealing with on a daily basis. New episodes every Wednesday where we talk about current events, love, sex, life, dating, and so much more.  ",
        "language": "en",
        "author_name": "KrissyO",
        "slug": "letstalkkrissyo",
        "cover": "20220202_120244_be7c38fc12ccc63745491aa53c3babc1.jpg"
    },
    {
        "podcast_id": 106164,
        "title": "Heksen",
        "description": "Casos de misterio, terror y más. Acompáñame al mundo del misterio y suspenso, donde encontraras la verdad de diferentes sucesos alrededor del mundo que nos dejaron con dudas, tal vez, alguno ya esté resuelto.",
        "language": "es",
        "author_name": "Mery",
        "slug": "meryagherheksen",
        "cover": "20220204_010216_cfe134e44c6c3691eba770c35ca95706.jpg"
    },
    {
        "podcast_id": 106493,
        "title": "The Alluring hour with: Alura Dannin",
        "description": "The Alluring Hour is a riveting experience created by host Alura Dannin.  The Alluring Hour is just a podcast but a connection to community. You will laugh, cry, and maybe even yell to the sky; regardless, this podcast will keep you on the edge of your seat. One of the main focuses of this podcast is to create a place you can receive healing and understanding.",
        "language": "en",
        "author_name": "Yvette Cain",
        "slug": "ucjzz2htqb-sugjalldafg0q",
        "cover": "20220304_090301_eb686683f2c5bdea983163348f43b7d3.jpg"
    },
    {
        "podcast_id": 107249,
        "title": "Ginja Ninja Talk Show",
        "description": "Live Love Kitty $mallz",
        "language": "en",
        "author_name": "Ella Anisfeld",
        "slug": "ellaanisfeld",
        "cover": "20220208_080226_62f9d8b927585b08b1fea6d2d667e97c.jpg"
    },
    {
        "podcast_id": 107514,
        "title": "Backtalk ",
        "description": "Hey what’s up! I’m Morgan, as of now i’m 17 and a senior in high school. Life can be kind of challenging sometimes and I want this channel to be a form for help and support in a way. I like talking and I like helping so what better way than to start a podcast where I talk about school, drama, adulting and more irrelevant stuff you probably don’t care about. \nOn my page you’ll find: \n- Random drama \n- How to’s \n- Crazy weird stories about my crazy weird life (i know, so quirky) \n- Everything there is to know about me :)",
        "language": "en",
        "author_name": "Morgan Lee",
        "slug": "backtalk-ml",
        "cover": "20220210_070203_103ea3b0df3fb10b5565ba82dfcec37e.jpg"
    },
    {
        "podcast_id": 110778,
        "title": "LEER",
        "description": "JENNA is an 18-year old in 1995, returning to her coastal hometown after months away grieving the sudden loss of her father. At a beach party with her best friend LIZ, the two cross paths with a mysterious young man named JADE, whose interest in Jenna seems beyond the physical realm. A love story at its heart, LEER marries nostalgic horror and existential romance as Jenna is unwittingly drawn into a plot to reunite two soulmates separated by death.",
        "language": "en",
        "author_name": "Brighton Carper Ballard",
        "slug": "leer",
        "cover": "20220319_090305_2ad0f7afee2a940be091ef9908920a9f.jpg"
    },
    {
        "podcast_id": 111890,
        "title": "Sessions with Tyler Turnbull",
        "description": "People talk when they're in pain. 'Sessions' allows the listener to sit alongside artist Tyler Turnbull as he tattoos a new guest every week, poking and prodding them to extract the most interesting back and forth possible. No topic is too taboo and, without the safety bumpers on, anything can come up. Think conversational jazz.",
        "language": "en",
        "author_name": "Tyler Turnbull",
        "slug": "sesssionpodcast",
        "cover": "20220228_030239_213a73c8ff297f00f1c008ee72a8f9c9.jpg"
    },
    {
        "podcast_id": 111891,
        "title": "Give A Crit: Fall of Mireon Campaign",
        "description": "A DnD 5e homebrew AP campaign, long-term with lots of roleplaying and shenanigans!\n\nYou want crying and conflict? We've got you.",
        "language": "en",
        "author_name": "Give A Crit",
        "slug": "fallofmireon",
        "cover": "20220302_110354_a0ccfe2855a02a3a9599f3e2f611dcf8.jpg"
    },
    {
        "podcast_id": 112237,
        "title": "Néplélek",
        "description": "Gondolatok morzsákban. Word dokumentumban ragadt pillanatok. Naplónak indult életjelentések.",
        "language": "hu",
        "author_name": "Peter Samuel Novak",
        "slug": "neplelek",
        "cover": "20220301_010318_6dd63e9dfd3676322f990808378007fc.jpg"
    },
    {
        "podcast_id": 113097,
        "title": "Persuasion (Narrated by Tim Ryan)",
        "description": "Arcana Publishing presents: An amateur reading of Jane Austen's Persuasion. Narrated by Tim Ryan.",
        "language": "en",
        "author_name": "Tim Ryan",
        "slug": "persuasion-by-tim-ryan",
        "cover": "20220305_060355_a0a0887ec662b25d1219ff733cdac5b9.jpg"
    },
    {
        "podcast_id": 113729,
        "title": "Lost Lake",
        "description": "<p>A teenaged student named Ben runs away from home and ends up in a mysterious town called Lost Lake. Ben and his friends end up battling supernatural creatures together, mess time together, open up portals, and discover that everyone seems to be hiding some sort of secret... nothing is as it seems. Everything you hear is a collection of Ben’s cassette tapes. Everything has been logged and recorded from beginning to end.. listen if you dare.</p>",
        "language": "en",
        "author_name": "Jane Black",
        "slug": "lost-lake",
        "cover": "20230207_110247_ef1a8ee28f05d9049b73a69523e74e7e.jpg"
    },
    {
        "podcast_id": 115284,
        "title": "E-rated Chisme",
        "description": "We'd like to welcome you to the roller coaster we call life. We hope that you'll join us for the ride. Mexican, American, Mother-Daughter duo that want to share our everyday lives, past, present & future events.  Thanks for \"Sticking it in\" with us....",
        "language": "en-us",
        "author_name": "Jocelyn Mauricio",
        "slug": "eratedchisme",
        "cover": "20220315_030358_1fa7fceefc32d165c876adea4506b06a.jpg"
    },
    {
        "podcast_id": 115662,
        "title": "JG Tales",
        "description": "I write and read fictional stories of the creepy variety. Topics ranging from everyday life to sci fi. \"CreepyPasta\".",
        "language": "en",
        "author_name": "Joe G",
        "slug": "jgtales",
        "cover": "20220316_080358_35fbb1beebe4dcee7f312367a8c9fabf.jpg"
    },
    {
        "podcast_id": 115913,
        "title": "Idiozia Evolutiva ",
        "description": "E se la strategia evolutiva della specie umana non fosse stata l'intelligenza ma, tutto al contrario, l'idiozia? Podcast brutto, sporco e cattivo, registrato male e con poca serietà. Come merita l'argomento. ",
        "language": "it",
        "author_name": "Astrò",
        "slug": "idioziaevolutiva",
        "cover": "20220317_070341_56939146481c27b37b6ef53daff5066e.jpg"
    },
    {
        "podcast_id": 115997,
        "title": "Love In All Times",
        "description": "Love Stories by Shruti Sodhi",
        "language": "en",
        "author_name": "Shruti Sodhi",
        "slug": "loveinalltimes",
        "cover": "20220318_040328_e3a1e3e1892f4a964737ca545d48b7bc.jpg"
    },
    {
        "podcast_id": 116469,
        "title": "ALL NIGHT DELI",
        "description": "scripted, sci-fi podcast about a Caribbean women-led mafia fighting over their designer drug cartel, when a portal to an alternate earth is discovered",
        "language": "en",
        "author_name": "yohanna emelinda baez",
        "slug": "all-night-deli-coming-soon-premieres-may-2",
        "cover": "20220322_120307_0b754641d4f10013ac343957ecd924f1.jpg"
    },
    {
        "podcast_id": 116919,
        "title": "Progetto Cerbero",
        "description": "Un commento appassionato, ma non ingessato, alla Divina Commedia di Dante Alighieri. Un viaggio alla scoperta della storia e delle storie dell'Inferno dantesco",
        "language": "it",
        "author_name": "Marco Benghi",
        "slug": "progettocerbero",
        "cover": "20220322_040322_b2aaaf6055141787ad8d0e3cf8c8a2d3.jpg"
    },
    {
        "podcast_id": 118294,
        "title": "Beanie B*tches Podcast",
        "description": "Two twenty-something’s with very little credibility commenting on subjects far beyond their pay grade.",
        "language": "en",
        "author_name": "Commander Pugwy and Lord Schnoodle",
        "slug": "beaniebtches",
        "cover": "20230203_050250_d6eac646c353179feffe74bd77bc862a.jpg"
    },
    {
        "podcast_id": 118758,
        "title": "Telling Tales - Classic Fairy Tales",
        "description": "<p>These are the stories you were never told as a child. Yet, these are the tales that have survived humankind for centuries. Here you'll find a Little Red Riding Hood that escaped using her clever brain. You'll find out why stepmothers get such a bad rap. Here you will find violence, deceit, love, and hope.</p>",
        "language": "en",
        "author_name": "Rissa",
        "slug": "tellingtales",
        "cover": "20220330_020316_39bdeeb582e5bfd3c0eb9c95170ab32b.jpg"
    },
    {
        "podcast_id": 119259,
        "title": "Memento - Ranking Things Together",
        "description": "My name is Maple, and In this podcast. We rank various things. \nWe are all here. \nTogether. \nAgain. ",
        "language": "en",
        "author_name": "Grant Flannery",
        "slug": "memento",
        "cover": "20220417_070449_5db7523d04d101cc5e67fc592069da99.jpg"
    },
    {
        "podcast_id": 120194,
        "title": "Gekleurde Gedachten ",
        "description": "Wij zijn Shar en Zoos! Twee vriendinnen die graag hun meningen delen over van alles en nog wat! De podcast waarbij wij jouw verhaal willen delen en bespreken! Ook gaan we het hebben over juice, obstakels waar we dagelijks tegen aan lopen en random gebeurtenissen. Wil jij je verhaal delen? Stuur ons dan een appje of voice memo via WhatsApp naar 06-49275776 of volg ons op instagram: @gekleurde_gedachten. Email: gekleurdegedachten@gmail.com",
        "language": "nl",
        "author_name": "Gekleurde Gedachten",
        "slug": "gekleurdegedachten",
        "cover": "20220501_060541_af7cc4234c4817b6e30f5d8aeb583671.jpg"
    },
    {
        "podcast_id": 120715,
        "title": "Is This Just Fantasy?",
        "description": "The book club where we review all things fantasy! Join Duncan and Geordie as they embark on a quest to track the breadth and history of the fantasy genre, one epic at the time.\nWhether you're a fan of book-stopper tomes like Duncan, or lighter YA fantasy like Geordie, we want you to read-along with us. Episodes are released every two weeks, giving you enough to read the book (or skim the synopsis if you're just here for the banter.)",
        "language": "en",
        "author_name": "Is This Just Fantasy?",
        "slug": "is-this-just-fantasy",
        "cover": "20220705_090726_6d9c8137e16a9c2796f215a7f0b04c0c.jpg"
    },
    {
        "podcast_id": 121739,
        "title": "The Hoodlum Hours ",
        "description": "so this is a show about darksydephil (dspgaming) and wings of redemption and others around the lolcows in general hoodlum hours is a daily show on youtube https://www.youtube.com/channel/UCn7jg_cslSkl2FBv7la6XWg",
        "language": "en",
        "author_name": "raven J frazier",
        "slug": "hoodlumhours",
        "cover": "20220415_020434_a8ab8bc1fcbe2f91a5e712b502546e76.jpg"
    },
    {
        "podcast_id": 123232,
        "title": "Partiremos antes del amanecer. ",
        "description": "Dicen que si dejas que una serpiente te muerda podrás ir a un planeta en donde solo hay una rosa. ",
        "language": "es",
        "author_name": "Alex J. ",
        "slug": "sansbruit",
        "cover": "20220420_040420_e833fef4d607aa2d69afa82dc951c9cf.jpg"
    },
    {
        "podcast_id": 123447,
        "title": "Let's Wine About It",
        "description": "3 of your favourite girls w(h)ine-ing about topics that make you need a drink. From  flaming hot red flags to discharge, BDSM and pregnancy scares… if you don't want to hear about it, listen to this — that’s kinda the whole point. \n",
        "language": "en",
        "author_name": "Victoria, Vanessa and Juliana",
        "slug": "wineaboutit",
        "cover": "20220421_010405_1759719e55eaee270479219cd7cd333e.jpg"
    },
    {
        "podcast_id": 123921,
        "title": "Mindfulness for Malice",
        "description": "Embrace the day, breath by breath, with a mysterious narrator who struggles with being present after losing his zest for malice.",
        "language": "en",
        "author_name": "Sebastien",
        "slug": "mindfulnessformalice",
        "cover": "20220423_010413_e6d25496d4bbe3454ad7b10dc169d801.jpg"
    },
    {
        "podcast_id": 126070,
        "title": "The Donut of Truth",
        "description": "Emergency medicine physicians discussing life in and out of the emergency room. ",
        "language": "en",
        "author_name": "The Donut of Truth",
        "slug": "thedonutoftruth",
        "cover": "20220611_120613_1d058ebb71948b89baf04be040e770ad.jpg"
    },
    {
        "podcast_id": 126125,
        "title": "Mozkovej tábor",
        "description": "Děláme chyby a mluvíme o nich.\nPořad rádia Orlicko - pondělí 20:00 ON AIR. \nwww.radioorlicko.cz\n",
        "language": "cs",
        "author_name": "Mozkovej tábor",
        "slug": "mozkovejtabor",
        "cover": "20220503_010502_30260bb84f16c26815da9bca435c94c9.jpg"
    },
    {
        "podcast_id": 126561,
        "title": "Dandy Chase & The Abominable Case",
        "description": "<p>In this surreal tale, disoriented detective Dandy Chase attempts to remember where he was last night as the ensuing events continue to become more and more muddled.</p>",
        "language": "en",
        "author_name": "Lobster Bowtie Association",
        "slug": "lobsterbowtieassociation",
        "cover": "20230523_110507_82e1988d34b6e3a2b77081abe419c7ef.jpg"
    },
    {
        "podcast_id": 126661,
        "title": "Rogues! The Podcast",
        "description": "<p>AKA The CodotVerse. Beginning with <em>The Riddler Speaks</em>, then introducing <em>Dr. Jonathan Crane MD</em>, this series of question-and-answer style episodes eventually became the full-length scripted episodes of <em>Rogues</em>. Incorporating appearances by most of the Rogues Gallery, and, occasionally, the heroes. </p><p>Contains adult language and adult situations. </p><p>All character voices performed by Codot or Dee unless otherwise credited.</p>",
        "language": "en",
        "author_name": "Codot and Dee",
        "slug": "roguespodcast",
        "cover": "20220507_010548_9514c0830e0f3e04086ab9f8f7902f3f.jpg"
    },
    {
        "podcast_id": 127416,
        "title": "La Sorprendente Fuga de María Pérez Inmaculada, un radiodrama documental",
        "description": "\"La Sorprendente Fuga de María Pérez Inmaculada\" es un radiodrama documental que cuenta la historia de una mujer en silla de ruedas que desaparece. Su familia la busca, pero nadie sabe dónde está...\n\nEkiwah, su maestro de poesía y amigo, quién también se encuentra en una silla de ruedas, intenta reunir las pistas de su desaparición y en este ejercicio descubre  una increíble respuesta...",
        "language": "es",
        "author_name": "Fuego Creativo",
        "slug": "podcastlafuga",
        "cover": "20220510_020543_e094f6bece1e5a1b1ada998e75eb9380.jpg"
    },
    {
        "podcast_id": 128465,
        "title": "Nashtural y Moke ",
        "description": "Dos amigas contando su vida y cositas ",
        "language": "es",
        "author_name": "Nashtural y Moke",
        "slug": "nashmoke",
        "cover": "20221103_091136_ab2f567f4c17bb3f275bf0bb9f44fbc7.jpg"
    },
    {
        "podcast_id": 128700,
        "title": "Single life with The British Bombshell",
        "description": "So let's get into it!! After being single for 8 years straight and then getting into two back to back failed relationships I'm back on the market. Not sure if I want to get into another relationship but I'm going to be dating and bringing you all along on my adventures! Please note, I'm not sleeping with the men I'm dating!! But if and when that happens it'll be in the story!! Feel free to let me know when you think I've got a keeper or a loser. I'll be sure to fill you in on all the details!!!",
        "language": "en",
        "author_name": "British Bombshell",
        "slug": "singlelifewiththebritishbombshell",
        "cover": "20220517_010514_b02699885b1d98b56d9249b385c41c3f.jpg"
    },
    {
        "podcast_id": 129920,
        "title": "Vapor Trail",
        "description": "At a chance meeting at the farmers market, two strangers find a connection rooted in their own unspeakable tragedies. The evening they spend together becomes an encounter they can’t forget. Starring Maulik Pancholy and April Matthis. \nWritten by Ken Urban / Directed by Knud Adams / Audio Produced and Mixed by Daniel Kluger / Recorded by Noel Nichols / Edited by Noel Nichols and Christian Frederickson / Foley by Daniela Hart / Additional Sound Design by Christian Frederickson / Produced by John Albert Harris / Original Music by Daniel Kluger and Occurrence",
        "language": "en",
        "author_name": "Ken Urban",
        "slug": "vaportrail",
        "cover": "20220523_050546_a671cead9cad8f4c7b80ecb6d1b81d3c.jpg"
    },
    {
        "podcast_id": 131183,
        "title": "Random Gab",
        "description": "All you need to know here is, what goes on the head and never comes outta mouth ; will come out here. Sometimes gossip, sometimes advice ,sometimes random shit and sometimes just nothing at all. Me and my bff are going to chat about all teen drama , life, arguments, growing up, annoyances and BEYOND. \nNothing is off limits. So,\n\"Buck Up, Sissy pants!\" we're in a comfort of our own self to bitch about it all.",
        "language": "en",
        "author_name": "Shiksha gupta",
        "slug": "random-gab",
        "cover": "20220530_040508_72fede10ca70c1a622f3de13541f841f.jpg"
    },
    {
        "podcast_id": 132880,
        "title": "Time To Chill",
        "description": "Welcome! My name is Jocelyn and Thank you for taking time out of your day to listen to all the random things and stories shared on this podcast. Sit back, relax, and listen to my friends and I share laughs, secrets and drama going on in our daily lives. You never know what you're going to get. It's TIME TO CHILL. ",
        "language": "en",
        "author_name": "Jocelyn ",
        "slug": "timetochill",
        "cover": "20220608_010626_6ea92d1f48bf4081e7688897206c82a0.jpg"
    },
    {
        "podcast_id": 133306,
        "title": "Five Minute Coffee Break Mysteries",
        "description": "Short juicy stories and dark mysteries for the best five minutes you can ever spend.",
        "language": "en",
        "author_name": "Oneda E Harris",
        "slug": "five-minute-coffee-break-mysteries",
        "cover": "20220901_080919_aab1a45a9f0540bf7658d54198d9280b.jpg"
    },
    {
        "podcast_id": 134178,
        "title": "The Chatterbox Crew",
        "description": "A place for people who wanna be entertained and laugh. Here to share stories and stories of my own",
        "language": "en",
        "author_name": "Nathaniel Nicklaus",
        "slug": "thechatterboxcrew",
        "cover": "20220922_010939_92cc650784fdb5a780f41fdbf26d4b5c.jpg"
    },
    {
        "podcast_id": 136675,
        "title": "AquaThots",
        "description": "Imagine: You're at a coffee shop with your gilrfriends. You gab, you sip, and you are immersed into girl world where the only rule is don't drop first and last names in a public place. ",
        "language": "en",
        "author_name": "Lauren Sanchez & Tori Pond",
        "slug": "aquathots",
        "cover": "20220804_020809_68d8982e492c9f9f36183326c0fbbe8c.jpg"
    },
    {
        "podcast_id": 137075,
        "title": "The Dirty Toy Box",
        "description": "(MA) Mature Audience..... A Mature podcast where two men talk about obscene topics that could lead to persecutions. If you are easily disturbed or offended by these topics please do not listen to this podcast. -Good Day",
        "language": "en",
        "author_name": "Sir Johnny and Mr. Cash",
        "slug": "thedirtytoybox",
        "cover": "20220718_040705_afbe16d11cf41d92e29dd27e0b07a8f1.jpg"
    },
    {
        "podcast_id": 137089,
        "title": "The Weekend's End with Travis Wade",
        "description": "Weekly Podcast",
        "language": "en",
        "author_name": "Travis Wade",
        "slug": "theweekendsendwithtraviswade",
        "cover": "20220628_120647_c5a1c2c599c7c9897d8edbcdba009727.jpg"
    },
    {
        "podcast_id": 137301,
        "title": "Valley of the Sunset",
        "description": "A Vampire the Masquerade - 5th Edition actual play podcast set in the outskirts of Phoenix, AZ. Every night our cast of undead misfits navigates the treacherous politics of the local Camarilla, while trying to stay one step ahead of Final Death. Join the embrace!",
        "language": "en",
        "author_name": "Justin General",
        "slug": "scaryzona",
        "cover": "20230108_070153_af517d49200ea81accd6b9ffb2b0e30b.jpg"
    },
    {
        "podcast_id": 137525,
        "title": "BUS STORIES PODCAST",
        "description": "     Welcome to the new podcast Bus Stories!  Coming very soon this fall, take a ride with Bruce the Bus Driver as he chats with all kinds of people who share their most memorable and incredible experiences while riding mass transit.  \n     Bruce the Bus Driver gives a brief breakdown about the podcast and tells you about the route we will be taking this season.  Bruce will navigate the city bus along dark lanes and bumpy roads as he speaks with some of his passengers who recount sometimes disturbing, occasionally amazing and often hilarious stories.  So take a seat or grip a stanchion and hang on!  Bus Stories is a real trip.\n\n     Don't miss the bus!\n\nwebsite:  busstoriespod.com\n",
        "language": "en",
        "author_name": "Bruce the BusDriver",
        "slug": "busstoriespod",
        "cover": "20230115_110103_9f6ab9ab8a102b8baaec1d2331a9f00e.jpg"
    },
    {
        "podcast_id": 137999,
        "title": "Better Big Sisters Podcast",
        "description": "Welcome to the Better Big Sisters Podcast!\nWe are here to give you tips and answer any questions you have! Leave stories & any questions you have below in the comments! \nMake sure to SUBSCRIBE!\nGo check out the Instagram & TikTok @betterbigsisters. ",
        "language": "en",
        "author_name": "Real Hype Creative",
        "slug": "betterbigsisters",
        "cover": "20220701_100736_9670173f0dca6aa09bbb97f17813bf95.jpg"
    },
    {
        "podcast_id": 138361,
        "title": "Creepypasta dall'Oltrenotte",
        "description": "<p>Dieci notti, cento storie dell'orrore. Creepypasta originali in italiano.</p><p>.</p><p><a href=\"https://linktr.ee/oltrenotte_creepypasta?utm_source=linktree_profile_share&amp;ltsid=18c65b4e-eeef-4f8a-8b29-461b529c8542\">https://linktr.ee/oltrenotte_creepypasta?utm_source=linktree_profile_share&amp;ltsid=18c65b4e-eeef-4f8a-8b29-461b529c8542</a></p>",
        "language": "it",
        "author_name": "Oltrenotte",
        "slug": "uc7fllcb8gv7vylsfeqr0z0q",
        "cover": "20221126_101110_23c98af5906bbd0092fa545b71476918.jpg"
    },
    {
        "podcast_id": 138473,
        "title": "VIERNES LOVER ",
        "description": "Charla banal sobre la vida, y todas sus movidas, desde el amor hasta la lujuria, aunque parezca obvio, y lo que nos de la gana sobre la marcha. ",
        "language": "es-mx",
        "author_name": "CAROLINA RAMOS COLIHUINCA ",
        "slug": "vierneslover",
        "cover": "20220704_020718_6728cd80c4d9707f3390d66982f65943.jpg"
    },
    {
        "podcast_id": 138506,
        "title": "Freshly Baked Nightmares",
        "description": "Welcome to Freshly Baked Nightmares: Retelling Nightmare Stories of Working with the Public. Join your hosts CC and MC as they tell their stories and fan stories of experiences with rude customers, messy stores, and more nightmares that would keep anyone up. Grab a glass of milk and a cookie and join us in some Freshly Baked Nightmares.\nPosted every other Wednesday!",
        "language": "en",
        "author_name": "CC and MC",
        "slug": "freshlybakednightmares",
        "cover": "20220704_050708_4e012082ca7e089c60358394dbf03d42.jpg"
    },
    {
        "podcast_id": 140306,
        "title": "The Jaw Jackers",
        "description": "<p>Come sit with us while we talk all crazy types of s*hit.</p>",
        "language": "en",
        "author_name": "Zoe and Jesse",
        "slug": "girlsuncovered",
        "cover": "20230607_110637_9f88de471c6941b883009396dac67b21.jpg"
    },
    {
        "podcast_id": 141031,
        "title": "Que no panda el cunico",
        "description": "Podcast dedicado a la divulgación de experiencias del fenómeno OVNI y paranormales con un toque de humor.",
        "language": "es",
        "author_name": "Luis Angüis",
        "slug": "quenopandaelcunico",
        "cover": "20220718_040717_dfedeaac74fcb33e8111d2e3d81e3265.jpg"
    },
    {
        "podcast_id": 143226,
        "title": "HBHOES",
        "description": "<p>Add hosts Sam &amp; Maddy to your weekly hoetation where we discuss trending pop-culture shows and movies. 🍑 'The Idol' streaming now.</p>",
        "language": "en",
        "author_name": "Sam & Maddy",
        "slug": "hbhoes",
        "cover": "20220730_020707_21f2f1e2d2f4ff188db372c7166522cc.jpg"
    },
    {
        "podcast_id": 143340,
        "title": "Voces en mi Cabeza",
        "description": "Cuando las letras no te sumergen lo suficiente para sentir, escucha la voz de tu interior. ",
        "language": "es",
        "author_name": "Radel Montilla",
        "slug": "radelmmontilla",
        "cover": "20220729_060741_ec19200c22803d92bf23ebf59446669d.jpg"
    },
    {
        "podcast_id": 143490,
        "title": "Misteries Unknown",
        "description": "<p>The City. Even during the daylight, many things lurk beneath its shadows. In a place where gods and monsters can exist, there's so much of the City to explore and discover. Misteries Unknown is a Let's Play podcast in which I (the Master of Ceremonies) lead the players on a deep dive into the underbelly of the City in the tabletop roleplaying game City of Mist by Son of Oak Studios. We'll be playing various other ttrpgs as well.</p>",
        "language": "en",
        "author_name": "Hunter the GM",
        "slug": "mistunkpodcast",
        "cover": "20230422_040449_0507c4a919267583f1941033a5c58edf.jpg"
    },
    {
        "podcast_id": 143906,
        "title": "Durgeons & Dargons",
        "description": "The world doesn't need another D&D podcast - but you do. \n\nWe are Durgeons & Dargons: a D&D real-play podcast for the whole family, so long as your family is into intense, bloody adventures. We take Dungeons and Dragons seriously from the grim moments to the gaffs and gags - but we're not about to teach your 6 year old any unfortunate vocabulary words or off-color jokes. \n\nFollow the tale of Runyll, Jet, and Daren, a story of (mostly) ordinary folk plunged into bizarre circumstances. Just you wait... stuff is gonna get weird!",
        "language": "en",
        "author_name": "Durgeons & Dargons",
        "slug": "durgndarg",
        "cover": "20220807_050833_60dde2c208262542c65726c82723a3d5.jpg"
    },
    {
        "podcast_id": 144624,
        "title": "Mildly Inconsistent",
        "description": "Tea Cassius is joined by the incomparable Justin Alvarez in \"Mildly Inconsistent\" the podcast where our hosts chat with awesome guests. and try to stay on topic. we love talking about whatever we want, but sometimes we care about what you want to hear! Check us out on our website https://www.Mildlyinconsistent.com to view our episodes, or catch up with our latest content! you can find us on Spotify, google podcast, apple podcasts, or wherever else you get your podcasts!",
        "language": "en",
        "author_name": "Tea Cassius",
        "slug": "mildlyinconsistent",
        "cover": "20220805_050816_ae7ed676a8cbf22ee022af2cd8416fd2.jpg"
    },
    {
        "podcast_id": 144706,
        "title": "Reserved Gamers Podcast (RG)",
        "description": "This is just me and a couple of friends getting together on a weekly bases talking about just random things in our lives that we enjoy.",
        "language": "en",
        "author_name": "RGB Podcast",
        "slug": "rgbpodcast",
        "cover": "20220805_040831_2eb52dfc2c49564ffdf383df287486c5.jpg"
    },
    {
        "podcast_id": 144772,
        "title": "The Monster Box",
        "description": "Welcome to the Monster Box, a collection of audio stories of and about monsters, inspired by the D&D universe. These stories have been written by a collective of monster lovers, like yourself, known as the Monster Nation. Come and lift the lid and see what awaits you inside. ",
        "language": "en",
        "author_name": "Chuck D Yager",
        "slug": "themonsterbox",
        "cover": "20220806_030826_0f2ef03468483cfb96779393b5f9d994.jpg"
    },
    {
        "podcast_id": 146246,
        "title": "OKolkata Audio",
        "description": " বাংলা ডিজিটাল প্লাটফর্ম 'ও কলকাতা'র পক্ষ থেকে আমরা নিয়ে আসছি এই পডকাস্ট, যেখানে শুনতে পারবেন বিভিন্ন স্বাদের বাংলা গল্প, কবিতা, শ্রুতিনাটক ও অন্যান্য মনোজ্ঞ আলোচনা। ",
        "language": "bn",
        "author_name": "OKolkata",
        "slug": "okolkata",
        "cover": "20220813_010803_3e8ca2ca0d56544c85d62d7ff86a7221.jpg"
    },
    {
        "podcast_id": 146880,
        "title": "A BRIDGE OF DOOM",
        "description": "<p><strong><em>THE THEATRICAL AUDIOBOOKS OF KURT HOTELLING --------thehearkentheatre.com</em></strong></p><p><strong>THREE PATHS CONVERGE… PRELUDE: THE HOSTAGE PRINCE</strong> – The bonds are tight, his sword broken, the possibility of rescue hopeless; heir to the throne of the western kingdom, Prince Kajor will soon be sacrificed on the reptilian Grems’ primitive altar of blood and revenge. And yet, he fears neither his enemies, the endless torture, nor death but the eventual ruin of his people under their hateful claws. Doubtful of her charged task, a young woman, Royal Messenger under guidance from the only Master Enchanter, undertakes an impossible mission: seeking help from a mythical and almost forgotten demigod. <strong>AGENTS OF THE DARK ONE </strong>– A final heartbeat, demons at the door, an appeal for help, and a chance bridge across the void of the Unknown… violations of metaphysical law during the rescue of Prince Kajor have brought the inescapable wrath and cold justice of Spectres; dark retribution and a singular, violent death stalk Royal Messenger Marie. Back home, bereft of any trace of his adventure, Paul is heartbroken amidst questions about his own sanity. Rothson can only hope his final expenditure of Power will reach demigod and enchanter before disaster befalls and all that they have achieved is overturned. <strong>ENCHANTER’S LOT</strong> – A faint breath of shadow whispers past Maximillian amidst his private ritual of black magic, bidding him find someone; Paul helps Marie adjust to existence in his complicated world, unaware of the dark forces seeking them out; Enchanter Gaiwan's manhunt for a renegade sorcerer turns sour, bringing upon him the wrath of dragons, and a nearly impossible errand. Relentlessly, all are drawn to meet across <strong>A BRIDGE OF DOOM.</strong></p><p>A lot of time and energy is required to present my <strong>THEATRICAL AUDIOBOOKS</strong>, to provide productions of my published novels with the high quality and detail I expect of myself in this personal endeavor. And, if you haven't keyed to it, yet, listening with good headphones provides the most immersive experience! I would be extremely grateful for you to 'buy me a coffee,' as this will help production and equipment costs. <strong>Go to </strong><a href=\"http://Ko-fi.com/thehearkentheatre\"><strong>Ko-fi.com/thehearkentheatre</strong></a><strong>.</strong> And thank you, truly! <strong><em>thehearkentheatre@yahoo.com</em></strong></p>",
        "language": "en",
        "author_name": "KURT PAUL HOTELLING",
        "slug": "thehearkentheatre",
        "cover": "20220909_060942_e95f778d59a5b5eb9c85375560ffa4b6.jpg"
    },
    {
        "podcast_id": 146952,
        "title": "Bowls with the Bard",
        "description": "Shakespeare for the Stoners!\n\nShakespeare is typically seen as being difficult to approach, but if people can talk about it while high, maybe it's not as intimidating as you think.\n\nStoners are typically stereotyped as stupid, but maybe if they can approach Shakespeare after smoking weed, they aren't as dumb as you think.\n\nJoin us as we challenge traditional norms in Shakespeare and society at large. ",
        "language": "en",
        "author_name": "Micaela Mannix",
        "slug": "bowlswiththebard",
        "cover": "20220816_110823_d81df394462743752802b0c455e579b5.jpg"
    },
    {
        "podcast_id": 146959,
        "title": "The Double AA Podcast",
        "description": "Just a couple of teens trying to figure out life",
        "language": "en",
        "author_name": "Caden Allinder",
        "slug": "thedoubleaapodcast",
        "cover": "20220817_110821_72a4a928fec614f168e54af98f670160.jpg"
    },
    {
        "podcast_id": 147797,
        "title": "Stream Queen ",
        "description": "KAYLA's living her best, unfiltered life, vlogging to a loyal, but tiny crowd of 934 followers. Dishing out truth becomes a problem when her MOTHER arrives unannounced to survey the urban trappings her daughter showcases weekly. KAYLA's transparent world is targeted by her mother's overt skepticism, triggering KAYLA to bare it all to prove her mother wrong.\n\nStarring Brenna Coates and Jessica Steen.  \n\nFeaturing Patrick Desmond, Tyson Kash, Gina Dineen, Debbi Dable.\n\nSound Edited & Mixed by - Justin Maradin\nCover Photo - Theresa Kennedy \nWritten, Directed & Produced by Hayley Tyson",
        "language": "en",
        "author_name": "Stream Queen Productions",
        "slug": "streamqueen",
        "cover": "20220821_120833_4cc19698c3397eff03a96d02ccf2b985.jpg"
    },
    {
        "podcast_id": 147851,
        "title": "Hablando X Hablar",
        "description": "Bienvenidos parceros a nuestro podcast; les hablaremos de divertidas e interesantes experiencias, con el fin de conectarnos como latinos en un pais lleno de aventuras.",
        "language": "es",
        "author_name": "H x H",
        "slug": "hablarporhablar",
        "cover": "20220829_020837_2745ace7e6d5996a35106a5853eeb550.jpg"
    },
    {
        "podcast_id": 148595,
        "title": "Hometown Hero",
        "description": "A Midwestern Gothic Tale that centers in a small town called Circleville. In season one, we follow the events that take place during a single Friday night. Various characters lead us through their eerie, macabre, tragic, and even mundane lives as their paths cross, creating unthinkable outcomes. Each episode is a small glimpse into an existential reality that is life in the gothic midwest. \n\nczstudio.works",
        "language": "en",
        "author_name": "CZ Studio",
        "slug": "hometownhero",
        "cover": "20220825_070835_5d2aa11f90c9b3bc418c75e49b8cb1c3.jpg"
    },
    {
        "podcast_id": 149322,
        "title": "Delirious Gurl",
        "description": "An audio podcast series channeling the controversy topics from social media & the intake on new tunes all through the lens of a DELIRIOUS GURL!   Instagram : @deliriousg_ Youtube: DeliriousGurl ",
        "language": "en",
        "author_name": "Natasha J. ",
        "slug": "deliriousg",
        "cover": "20220827_100825_e867d9ad3ae1673f0cdc0f22aa7bdb1d.jpg"
    },
    {
        "podcast_id": 149931,
        "title": "Whispers in the Night",
        "description": "Every Friday night, tune in to get a snippet of the inner sanctum of our brain. From mental health, to feminism, to relationships, and of course, our uncertain futures, we'll be ranting about it all. \n\nSo you're more than welcome to join two teenagers, going on about their mystifying life in high school, while also being blatantly honest about other stuff that really matters-well at least to them it does. \n\nTell us about all that you want to hear, by DM'ing us (@whispersinthenightpodcast) or via email (whispersinthenight0212@gmail.com), for ONE of us, in particular, is too lazy to bother coming up with any idea that won't get us cancelled! \n\nOkay we love you, toodles.",
        "language": "en",
        "author_name": "yours truly ",
        "slug": "whispersinthenight",
        "cover": "20220830_040842_7c849320b469f3f40570fb7f69b80543.jpg"
    },
    {
        "podcast_id": 149944,
        "title": "Moonbreaker: Tales from the Reaches",
        "description": "Blast off to adventure in Moonbreaker: Tales from the Reaches! This fully produced audio drama series explores the world and characters of Moonbreaker, the brand new digital tabletop strategy game by Unknown Worlds Entertainment (Subnautica, Natural Selection) and from the mind of acclaimed author Brandon Sanderson (The Mistborn Series). Experience the Reaches through a series of unique stories that feature a diverse cast of characters, both new and familiar to fans of the game, voiced by some of the industry's top talent including JB Blanc, Matthew Mercer, and Khaya Fraites. The audio drama series, written by Dan Wells, kicks off on September 29, 2022 when Moonbreaker launches into Early Access on Steam!",
        "language": "en",
        "author_name": "Unknown Worlds Entertainment",
        "slug": "moonbreaker",
        "cover": "20220926_040923_abd1055641211f014573bde0c6ed9f78.jpg"
    },
    {
        "podcast_id": 150151,
        "title": "TruTheater Radio",
        "description": "Audio Drama Meets Long \nForm Discussions.\n\nHollywood and the main stream media has taken over the minds of the masses. However, many have become wise to this fact and have turned to alternative sources to seek truth to asend to greater heights of conciousness. This has left something lacking in the truth seeking movement. Trutheater Radio is stepping in the fill the void. Dramatization through audio to make us laugh, cry, uplift and inspire while discussing the deeper truths and mysteries of this realm. Join us in our assent",
        "language": "en",
        "author_name": "Joshua and Jonah Earl",
        "slug": "trutheaterradio",
        "cover": "20221106_051153_d0ac07666a849ea9363b65eafb0b6c0a.jpg"
    },
    {
        "podcast_id": 150481,
        "title": "E.C.P",
        "description": "We bring to you the best and most infuriating Podcast, ranging from comedy to controversial discussions. We aim to give an open mind to the audience as well as explore the different realities of life. While you get ready to listen, We would like to point out that most things said and done are for entertainment purposes only. Enjoy!",
        "language": "en",
        "author_name": "E.C.P CREW",
        "slug": "extremelycertified",
        "cover": "20230207_090252_71a828db24c4e10a83f1a55bb7288ea5.jpg"
    },
    {
        "podcast_id": 150616,
        "title": "Johnnie's Song: A 1920s Style Radio Hour Drama",
        "description": "<p>At nearly 17, Johnnie knows love: love for his family and for his biggest passion, playing the piano. But when alcohol is outlawed, making work harder on his police officer father, life in 1920s Atlantic City isn't as simple as it used to be. With the help of some friends, both new and old, Johnnie must find his place and his voice in the sometimes dangerous world of jazz and prohibition. \"Johnnie's Song\" was written by award-winning playwright DC Cathro and produced by ERALôR NFT. ERALôR is a registered business dedicated to creating nostalgic experiences, while promoting positive, human connection through vintage art, performance based storytelling, and immersive events and travel. To purchase a piece of character art from the \"Johnnie's Song\" series, visit https://eralor.io or follow us on twitter, @ERALORnft. Voice Over Cast: Johnnie .... Jacob Albert Gross Clara .... Brianna Galligan Fred .... DC Cathro Della .... Amanda Tossman Winnie .... LaTasha Do'zia Dewey .... John Glymph Levi .... Marlon Wood</p>",
        "language": "en",
        "author_name": "EraLore Studios",
        "slug": "johnniessong",
        "cover": "20220902_020913_622993bb841f546ef57dfd0e526f16f9.jpg"
    },
    {
        "podcast_id": 150824,
        "title": "Avandria",
        "description": "Hello and welcome to Avandria. We are a bunch of friends who like to roll dice and play pretend and we wanted to share it with you guys. you are about to Listen to the audio only version of our Youtube Videos that we upload Every Saturday on youtube.com/AdventureInn. We mostly play Role Playing Games such as Dungeons and Dragons and sometimes some others Games. Now sit back and unwind, as you immerse yourself into the World of Avandria…\n\n\n\n",
        "language": "en",
        "author_name": "Adventure Inn",
        "slug": "avandria",
        "cover": "20220903_120955_60e57c3fd367314cb5d4bc77125aaf01.jpg"
    },
    {
        "podcast_id": 151430,
        "title": "The Outside World",
        "description": "An original radio drama from Silo Voice Studios set in a dystopian future Montreal where DESK controls all aspects of life. Two unlikely allies, Madeline and Harlan, will uncover a secret that could shake society to its core. Also, humans and androids date and androids like cheese.",
        "language": "en",
        "author_name": "Silo Voice Studios",
        "slug": "silovoice-theoutsideworld",
        "cover": "20220906_020935_89829e9be3b84579a9de4e2cb50eacc4.jpg"
    },
    {
        "podcast_id": 151620,
        "title": "EL ANALISTA",
        "description": "Un investigador retirado del medio nos ofrece un sin limite de experiencias propias, relatos populares e investigaciones realizadas a lo largo de muchos años en el estudio del Fenómeno OVNI y Extraterrestre.  ",
        "language": "es",
        "author_name": "El Analista",
        "slug": "elanalista",
        "cover": "20220906_090939_af6e36874500ac7297bd10da888fcab7.jpg"
    },
    {
        "podcast_id": 151856,
        "title": "SadbutTrue Podcast",
        "description": "<p><strong><em>SadbutTrue podcast is a refreshing take on the typical relationship podcast. Hosted by life long friends, Laurie and Crista. the podcast discusses personal relationships, including drama involving exes, current relationships, and friendships. The hosts also share their \"Sad but True thoughts of the day,\" which range from humorous to thought-provoking.</em></strong></p><p><strong><em>One of the standout features of SadbutTrue podcast is its comical and quirky approach to discussing serious topics. The hosts are not afraid to laugh at themselves and their experiences, which makes the podcast relatable and enjoyable to listen to. They share their personal stories with honesty and vulnerability, which helps to create a sense of connection with their listeners.</em></strong></p><p><strong><em>Another strength of the SadbutTrue podcast is the knowledge and insight the hosts bring to the table. They are not afraid to delve into complex topics and offer their perspectives on them. Whether discussing the challenges of maintaining a long-distance relationship or the importance of setting boundaries in friendships, the hosts provide valuable advice and guidance for their listeners.</em></strong></p><p><strong><em>One of the most memorable aspects of the podcast is the \"Sad but True thoughts of the day\" segment. Each episode, the hosts share a thought-provoking quote or observation that encourages listeners to reflect on their own lives. The quotes are often humorous or witty, but they also offer genuine insight into the human experience.</em></strong></p><p><strong><em>Overall, SadbutTrue podcast is a must-listen for anyone interested in relationships, friendships, and personal growth. The hosts' comical and quirky approach to serious topics makes the podcast both entertaining and informative. Listeners will come away from each episode with a renewed sense of understanding and empathy for themselves and others 🤣 Its all SadbutTrue😘🤣🙌</em></strong></p>",
        "language": "en",
        "author_name": "Laurie Martin, Crista Hernandez",
        "slug": "sadbuttruepodcast",
        "cover": "20230522_080509_019dd15cd6e783a35ced53e87af34d75.jpg"
    },
    {
        "podcast_id": 151924,
        "title": "Voiceover Sessions",
        "description": "Join Seshicus as he narrates some epic stories and Internet stuff!\n\nHit me up with any requests or inquiries!\n\nContact:\nEmail: thunderhawkds@gmail.com\nTwitter: @xigbarassassin (seshicus)",
        "language": "en",
        "author_name": "Seshicus",
        "slug": "narrationsessions",
        "cover": "20220908_020937_be74010a7317a5a4c9746120610eab2c.jpg"
    },
    {
        "podcast_id": 152556,
        "title": "No Vex - A Nigerian Podcast ",
        "description": "<p>A podcast and platform for Nigerians - and Africans in general - to have a safe space to discuss prevalent news, gossip, and topics that are affecting us both back home and in the diaspora. If you no gree about anything you hear, please no vex.</p>",
        "language": "en",
        "author_name": "Naija Nation",
        "slug": "novex",
        "cover": "20220910_100930_de29b0c811e035ab1d9ab636f1570b29.jpg"
    },
    {
        "podcast_id": 153547,
        "title": "Modified Mayhem ",
        "description": "Modified Mayhem is an actual play DND podcast. We have so much fun playing DND that we thought you might want to join in and listen! We hope you enjoy our Mayhem as much as we do! ",
        "language": "en",
        "author_name": "Reed Dougherty",
        "slug": "modifiedmayhem",
        "cover": "20220930_030923_35199ebbb5c392dae2166b50d38998bf.jpg"
    },
    {
        "podcast_id": 153989,
        "title": "Horror Stories ",
        "description": "Fictional horror stories that will make your skin crawl. Background sound improved since episode 4. Check our YouTube channel https://youtu.be/5s9_spSYcas",
        "language": "en",
        "author_name": "Horror Storiess",
        "slug": "horrorstoriess",
        "cover": "20220917_080919_807894c408c6f8997f67d4898f10b036.jpg"
    },
    {
        "podcast_id": 154583,
        "title": "Smoke N Bitch ",
        "description": "Smoking and bitching about everyday life... basically being blunt while smoking a blunt ",
        "language": "en",
        "author_name": "Maddie and Ivy",
        "slug": "smokenbitch",
        "cover": "20220919_080905_902eb8d58e3c0aa952f5e0f360f2cfb8.jpg"
    },
    {
        "podcast_id": 155121,
        "title": "Anno Amagium",
        "description": "A long-form, contemporary fantasy series following wizard detectives in a world where everyone commands the power of magic. Supported by patrons of Patreon.com/AnnoAmagium.\n\n---\nThe scholar-warriors of the Amagium swear themselves to a sacred charge: governing humanity’s inherent capacity to wield magic. Through a complex licensure system, they decree which spells and arcane artifice are permissible for public, “asfalis” use.\n\nArroyo, The City of Bridges and Roses, is a suburb of Los Angeles that seems like it crawled out of a storybook. Five palatial terraces of land are connected by a myriad of bridges over gulches where the brambles of a colossal, petrified rose briar reside. But this seemingly-tranquil city seethes with dark secrets and otherworldly threats amass in its shadows.\n\nSevardin Harker, a newly minted member of the Amagium’s Peacekeeping Force, is thrust into the deep end on his second day on the job, when he has a life-threatening encounter with a form of magic most people believe to be fiction.\n\nMeanwhile, Hace Matthews and Alinore Valmont, two precocious aspiring peacekeepers, begin their 11-year matriculation at Arroyo’s Athenaeum, the Amagium’s rigorous training ground...\n---\n\nFor more episodes, references, and other information, please visit AnnoAmagium.com. I hope you enjoy the story! If it resonates, please share it with fellow fantasy fans, and consider backing us to fund more episodes. Thank you for listening!  -Hank",
        "language": "en",
        "author_name": "Hank Whitson",
        "slug": "annoamagium",
        "cover": "20220922_020955_a31dbc1b629ab0aafd44b2acab08f533.jpg"
    },
    {
        "podcast_id": 156927,
        "title": "Experiment 31E",
        "description": "<p>A scientist is attempting a dangerous experiment in this Frankenstein-inspired, speculative fiction podcast that takes place during an alternate version of the Victorian era. As the scientist seeks to perfect her formula and find a suitable specimen for testing, unexpected threats rear their heads while her own motives lurk in the dark. Written and performed by Lauren Triola, with music by Shannon Triola, new episodes will be released every other Monday. Transcripts available at www.experiment31e.com.</p>",
        "language": "en",
        "author_name": "Lauren Triola",
        "slug": "experiment31e",
        "cover": "20221126_011141_35f43b18b9465c72fe56cb777a5e2891.jpg"
    },
    {
        "podcast_id": 157241,
        "title": "Accused Occult",
        "description": "Welcome to the world of the Accused Occult, a world much different to ours where the paranormal, the mystical and the occult are all understood facts of life.\nCredits:\nProduced by Bad For The Soul\nWritten by Callum Lasslett\nDirected by Callum Lasslett\nSpecial thanks to Penola Catholic College for providing the software needed to complete the project and the necessary schooling.\nSpecial thanks to Neale Irwin for support and assistance to the entire year 12 class. This project would not have been possible without his help and therefore I am eternally grateful.\nAnd thanks to you for listening",
        "language": "en",
        "author_name": "Callum Lasslett",
        "slug": "accusedoccult",
        "cover": "20221001_061044_3b71a198a02faa2d9480aeab51f6caf3.jpg"
    },
    {
        "podcast_id": 157438,
        "title": "The Terra Arcanum Chronicles: The Audio Drama",
        "description": "<p>Let me introduce you to The Terra Arcanum Chronicles, a modern fantasy adventure following two unlikely heroes as they are transported to a fantastical world following a freak accident! After finding themselves in a foreign land, and a foreign body, Adam and Melanie must work together to solve the mystery of this brave new world, and stop an ancient evil that has once again reared its ugly head.</p><p>To support the creation of this show, consider becoming a <a href=\"https://patreon.com/HopelessOpus?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=creatorshare_creator&amp;utm_content=join_link\">Patreon </a>subscriber!</p>",
        "language": "en",
        "author_name": "HopelessOpus ",
        "slug": "terraarcanumchronicles",
        "cover": "20221119_081145_87ef9e57a9ead3ce3da8f2fb9ff1fd18.jpg"
    },
    {
        "podcast_id": 157503,
        "title": "K O N T R O V E R Z N Í ",
        "description": "nejkontroverznější podcast ve sluneční soustavě 💕\n\nodebírejte naše HEROHERO pro early content, celé necenzurované epizody, extra bonusový kontent & nový pořad KONTROVERZNÍ PORADNU https://herohero.co/podcastkontroverzni",
        "language": "en",
        "author_name": "Podcast Kontroverzní",
        "slug": "podcastkontroverzni",
        "cover": "20221002_031027_5890266251784c027708e67beb729b6b.jpg"
    },
    {
        "podcast_id": 157580,
        "title": "Toxics Do It Better",
        "description": "We all know toxicity isn’t good for oneself or anyone, but it is fun–most of the time.\nJoin me as I share my experiences with men, how I dealt with them toxically and everything in between, along with sharing others' stories as well. Each episode will contains a story. For all my toxic babes out there, hope you find my stories amusing or find them utterly disgusting, Toxics Do “What” better? That’s up to you to decide.\n\nThis podcast was created for mere entertainment purposes and all names will be replaced with fictitious ones.",
        "language": "en",
        "author_name": "Robin",
        "slug": "toxicsdoitbetter",
        "cover": "20221002_091010_f529474fce65cf04044f365572afe07c.jpg"
    },
    {
        "podcast_id": 158024,
        "title": "Yiddishklang",
        "description": "Des fictions radiophoniques contemporaines du monde yiddish. Podcast issu de Yiddish haynt, l'émission radio de la Maison de la culture yiddish.",
        "language": "fr",
        "author_name": "Shahar Fineberg",
        "slug": "yiddishklang",
        "cover": "20221006_021039_0fa866db7a1b4595950a2905443d1235.jpg"
    },
    {
        "podcast_id": 158032,
        "title": "REMStories Anthology",
        "description": "A collection of audio trailers and voice narrations of my stories published on Amazon and Google Books",
        "language": "en",
        "author_name": "Richard E McCallum",
        "slug": "remstories",
        "cover": "20221004_071004_8a97b6e9bd9b8fd7400ddc62a49cc2fa.jpg"
    },
    {
        "podcast_id": 158304,
        "title": "Out of context ",
        "description": "We are two coworkers Zander and Halo. We work in the child care industry, so we hear a lot of crazy things.'We created this podcast to share the things we hear and our own personal story's. This podcast is meant to share our lives out of context to make you laugh and make you second guess every thing you hear. Art Credit Lilly Vonfelt \n",
        "language": "en",
        "author_name": "Zander and Halo",
        "slug": "outofcontextquotesandstorys",
        "cover": "20221005_091056_e1209ac6fa9a5ce5db5aaeb3743c883c.jpg"
    },
    {
        "podcast_id": 158331,
        "title": "Twisted Curiosities",
        "description": "Welcome to the shop with only haunted items for sale, trinkets from another world. Each item in my shop holds a story, as equally horrifying as the last. ",
        "language": "en",
        "author_name": "Delayed Reaction Media",
        "slug": "twistedcuriosities",
        "cover": "20221026_091046_e5892aa6ce049b3ffebeb8391a74785e.jpg"
    },
    {
        "podcast_id": 158778,
        "title": "AK on the PK",
        "description": "Welcome to the PodKast! Join Alexis (AK) as she talks about all things New York Rangers, Hockey, Women in Sports, and more!\n\nNew episodes every week.",
        "language": "en",
        "author_name": "AK",
        "slug": "akonthepk",
        "cover": "20221007_111027_a4bdd16de8e5d1cb8846417beb70e6a2.jpg"
    },
    {
        "podcast_id": 159200,
        "title": "Bearstone County",
        "description": "In the fictitious county of Bearstone, citizens must weather the calamity of existence, and the darkest reaches of humanity in this mountain gothic podcast.  ",
        "language": "en",
        "author_name": "Luke Mott",
        "slug": "bearstonecounty",
        "cover": "20221111_041137_1ff8d654737c7a224aca6e63087ec0be.jpg"
    },
    {
        "podcast_id": 159743,
        "title": "Let's Agree To...",
        "description": "Hi! We're Amber and Raven, the founders of 'Let's Agree To.' A special podcast where we rewatch our favorite or not-so favorite rom-coms and attempt to sway the other person to adopt our point of view. You'll hear the viewpoints of a film novice and a rom-com enthusiast. Each episode ends with a final verdict, where we decide to agree or disagree. Stream our latest episode now. ",
        "language": "en",
        "author_name": "Amber and Raven",
        "slug": "letsagreeto",
        "cover": "20221012_041028_4a9506e2e323c21300d7cfa0bac2e718.jpg"
    },
    {
        "podcast_id": 160563,
        "title": "TAMONIM'S PODCAST",
        "description": "בת 17 מארחת בני נוער וביחד מדברים ומדברות על החיים",
        "language": "he",
        "author_name": "tama dror klein",
        "slug": "tamonim",
        "cover": "20221015_121026_091cbde5785e79c3785d04e2603ffd64.jpg"
    },
    {
        "podcast_id": 160745,
        "title": "Phoenix & Rose Productions ",
        "description": "Poetry by James Lloyd George ",
        "language": "en",
        "author_name": "James Lloyd George ",
        "slug": "jlgwordsmith",
        "cover": "20221016_061013_f0b05d56fb093a1ae322024e9183e946.jpg"
    },
    {
        "podcast_id": 161365,
        "title": "Of Dice & Death",
        "description": "Of Dice and Death is an actual play podcast! \n\nOur current campaign is a V5: Vampire the Masquerade game. Set in the dark streets of Chicago...\n  ",
        "language": "en",
        "author_name": "Digitally Dead",
        "slug": "ofdiceanddeath",
        "cover": "20221105_021116_0ca4d3a6d131a0b59c02e56a754559b8.jpg"
    },
    {
        "podcast_id": 162173,
        "title": "The Civil War with Kevin Yaney",
        "description": "Kevin Yaney, author of The Fourth of July trilogy, talks about different aspects of the American Civil War, what led to the war and how he came to write the historical fiction books that make up The Fourth of July trilogy.",
        "language": "en",
        "author_name": "Kevin Yaney",
        "slug": "fourthofjulybook",
        "cover": "20221021_031059_70dbad7370ee9be9388f2c6583af8fdd.jpg"
    },
    {
        "podcast_id": 162985,
        "title": " Random Rambles",
        "description": "The reason we need to start a podcast? We have loads of conversations with deep thoughts, \nrandom thoughts, idiotic thoughts,  about everything & everybody. We're ready to share them with you! Stay tooned.",
        "language": "en",
        "author_name": "J&V",
        "slug": "jv",
        "cover": "20221025_061057_ed4f2bc48b693a7c9c7d025dda6cce71.jpg"
    },
    {
        "podcast_id": 163486,
        "title": "Drivin’ & Barely Thrivin’",
        "description": "This is Megan, Katie, & Brittany! \nThree friends with a lot to say, some makes sense, others make you think twice about listening to us. We are here to bring you the tea, the crime, and our love! ",
        "language": "en",
        "author_name": "Megan, Katie, & Brittany",
        "slug": "drivinandbarelythrivin",
        "cover": "20221027_031055_96da34974e12c4920e54d01599788f86.jpg"
    },
    {
        "podcast_id": 163790,
        "title": "KEMI",
        "description": "-",
        "language": "en",
        "author_name": "Karen Asamoah & Gbemisola Oloko",
        "slug": "kemi",
        "cover": "20221028_121058_fdf58125da3200f02f17419487ad5a3a.jpg"
    },
    {
        "podcast_id": 164126,
        "title": "Overnight For Observation",
        "description": "<p><strong>Hi ho, everyone! Doctor Plink here. These recordings are on hiatus in support of the Writers' Guild Strike.</strong></p><p>The lost recordings of Doctor Cornelius Plink, restored thanks to the efforts of Miskatonic University. Having moved to the town of Arkham after serving in the Great War, the Doctor tries to puzzle out such mysterious happenings as a disappearing house, a genius morphine-pushing guinea pig, and why bootleggers are showing up to his office with giant sucker marks across their bodies.</p>",
        "language": "en",
        "author_name": "Daniel Fox",
        "slug": "overnight-for-observation",
        "cover": "20221030_011059_7d3a6af05a60f457706c801aef3208f7.jpg"
    },
    {
        "podcast_id": 164361,
        "title": "Delta Green: Impossible Landscapes with Green Box Gaming",
        "description": "<p>Four friends launch into a game of horror, mystery, and conspiracy where regular people fight against the unknown at the expense of their relationships, sanity, and lives. We are playing Delta Green: Impossible Landscapes! Brad, Dace, and Gian join Handler Joe to delve into a world of Carcosa and the King in Yellow!</p><p>We play our recorded session live on Twitch every other Saturday! Come and join us live or catch up with weekly episodes on Twitch, YouTube, and all major podcast platforms! Come to our subreddit to say hi and to receive updates and announcements!</p><p>==========</p><p>Our reddit HQ: <a href=\"https://www.reddit.com/r/GreenBoxGaming/\">https://www.reddit.com/r/GreenBoxGaming/</a></p><p>==========</p><p>Streaming and vods</p><p>Twitch: <a href=\"https://www.twitch.tv/greenboxgaming_/videos\">https://www.twitch.tv/greenboxgaming_/videos</a></p><p>YouTube: <a href=\"https://www.youtube.com/@greenboxgaming8464/videos\">https://www.youtube.com/@greenboxgaming8464/videos</a></p><p>==========</p><p>Socials</p><p>Patreon: <a href=\"https://www.patreon.com/greenboxgaming_\">https://www.patreon.com/greenboxgaming_</a></p><p>Twitter: <a href=\"https://twitter.com/GreenBoxGaming2\">https://twitter.com/GreenBoxGaming2</a></p><p>Instagram: <a href=\"https://www.instagram.com/greenboxgamingofficial/\">https://www.instagram.com/greenboxgamingofficial/</a></p><p>TikTok: <a href=\"https://www.tiktok.com/@greenboxgaming\">https://www.tiktok.com/@greenboxgaming</a></p><p>Facebook: <a href=\"https://www.facebook.com/people/Green-Box-Gaming/100086783479102/\">https://www.facebook.com/people/Green-Box-Gaming/100086783479102/</a></p><p>==========</p><p>Podcast</p><p>Apple Podcasts: <a href=\"https://podcasts.apple.com/us/podcast/delta-green-impossible-landscapes-with-green-box-gaming/id1658184243\">https://podcasts.apple.com/us/podcast/delta-green-impossible-landscapes-with-green-box-gaming/id1658184243</a></p><p>Spotify: <a href=\"https://open.spotify.com/show/4sVHaTLUqvYP2MYRKFkSan\">https://open.spotify.com/show/4sVHaTLUqvYP2MYRKFkSan</a></p><p>Google Podcasts: <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9tZWRpYS5yc3MuY29tL2dyZWVuLWJveC1nYW1pbmcvZmVlZC54bWw?sa=X&amp;ved=0CAMQ4aUDahcKEwiQ35mv07v8AhUAAAAAHQAAAAAQFA&amp;hl=en\">https://podcasts.google.com/feed/aHR0cHM6Ly9tZWRpYS5yc3MuY29tL2dyZWVuLWJveC1nYW1pbmcvZmVlZC54bWw?sa=X&amp;ved=0CAMQ4aUDahcKEwiQ35mv07v8AhUAAAAAHQAAAAAQFA&amp;hl=en</a></p><p>==========</p><p>Published by arrangement with the Delta Green Partnership. The intellectual property known as Delta Green is a trademark and copyright owned by the Delta Green Partnership who has licensed its use here. The contents of this media are © Green Box Gaming 2023, excepting those elements that are components of the Delta Green intellectual property.</p>",
        "language": "en",
        "author_name": "Green Box Gaming",
        "slug": "green-box-gaming",
        "cover": "20221110_081103_f6c1a208507e8fbd11a36b99054d6573.jpg"
    },
    {
        "podcast_id": 164820,
        "title": "Mortuorio Podcast",
        "description": "Bienvenidos a Mortuorio podcast, en este espacio les relataré historias reales que me han sido aportadas por el público; historias de sucesos paranormales, inexplicables, misteriosos o simplemente eventos que hicieron pasar a su autor momentos de terror.\n\nQuédate para escuchar las historias que tengo para ti, si son de tu agrado apóyame siguiéndome en todas las plataformas de audio y video en que me encuentres.\n\nMi nombre es Alexandro Agúndez, comenzamos…\n\n\n\nContacto: mortuorio.podcast@gmail.com",
        "language": "es",
        "author_name": "Alexandro Agúndez",
        "slug": "mortuorio-podcast",
        "cover": "20221105_061104_a07e2cdf72e594859d10bd0a06781010.jpg"
    },
    {
        "podcast_id": 164872,
        "title": "The New Persian Times",
        "description": "A new school of thought for Persians that breaks all the rules.\nIndependent. Unaffiliated. Uncensored. ",
        "language": "en",
        "author_name": "Andy Alem",
        "slug": "newpersiantimes",
        "cover": "20221102_021136_288b2484d81b2434350656120114dbd5.jpg"
    },
    {
        "podcast_id": 165706,
        "title": "Another D&D Party",
        "description": "<p>Welcome, traveler, to a land of high fantasy and adventure! Come follow our group of adventurers as they travel the land of Elderon to see what dangers they may face and what they might find out about themselves along the way!</p><p>Main Cast:</p><p>Anthony Smith as the Dungeon Master</p><p>Killian Wolfe as Saol</p><p>Sheila Saxer as Ezlyn</p><p>Andrew Reidel as Volkyr</p><p>Nikki Wolfe as Naia</p><p>Stephen Carpenter as Hammer</p><p>Ryan Turco as Rhyolite</p>",
        "language": "en",
        "author_name": "Anthony Smith and Company",
        "slug": "addp",
        "cover": "20230315_050315_ba6ac43c5ee922226951106c03b01ff4.jpg"
    },
    {
        "podcast_id": 166195,
        "title": "Master Hacker",
        "description": "Like action-packed crime stories with bad guys, good guys, heroes, heroines? Master Hacker follows FBI agent Matias Kingston’s hunt for international cyber criminal Liam Smith and his gang of hackers. Hailed as a computer genius, but known for being rebellious and foolhardy, Kingston won’t let Smith go no matter what crippling cybercrime Smith throws at him and the world.",
        "language": "en",
        "author_name": "Marcus Durand",
        "slug": "masterhacker",
        "cover": "20221107_081124_567dffaf709869a05823e91b03116611.jpg"
    },
    {
        "podcast_id": 166609,
        "title": "Varey Tales",
        "description": "Short stories and soundtracks, written and composed by Nick Varey. These stories are inspired by one-word prompts and convey messages of philosophy, humanity's struggles and emotions, all through the lens of off-the-wall scenarios. ",
        "language": "en",
        "author_name": "Nick Varey",
        "slug": "vareytales",
        "cover": "20221118_051122_dad1e559e021b220235ed6be923f9e20.jpg"
    },
    {
        "podcast_id": 166689,
        "title": "ODISEAS del INFIERNO",
        "description": "ODISEAS DEL INFIERNO.\nUn canal de terror y misterio;\n\nAquí el Demonio se hace presente y\nnos narra historias provenientes del mismísimo infierno; \nOdiseas de Locura, Tragedia y Terror; \npara recordarnos la fragilidad de la psique humana,\ny desenmascarar a los verdaderos Demonios.\nadéntrate y conoce la cara real del Averno,\nPara aquellos que desean alargar\nla época de día de Muertos y \nel Halloween les parece fugaz.\n\nIÑAKI el Gato Rojo presenta 10 trágicos cuentos cortos \nque espero provoquen un estremecimiento de todo tu ser,\ny el escalofrió recorra tu cuerpo.",
        "language": "es",
        "author_name": "IÑAKI el Gato Rojo (Julio j Montes)",
        "slug": "odiseas-del-infierno-573",
        "cover": "20221109_071111_ca0b8cbe2dbba8e8f800bb514684b1bd.jpg"
    },
    {
        "podcast_id": 167944,
        "title": "Full Moon Mischief",
        "description": "<p>A collection of thrilling horror dramas from Wolf &amp; Magpie media. 1. Red River Reaper 2. A Coal For Your Soul 3. Shot Through The Hart 4. Eat Your Heart Out 5. On Further Reflection 6. A Trust Perceived 7. Kill The Reaper (Coming Soon)</p>",
        "language": "en",
        "author_name": "Wolf & Magpie Media",
        "slug": "fullmoonmischief",
        "cover": "20221114_071132_f84c8fb524ec1ecd68f57caed037f34e.jpg"
    },
    {
        "podcast_id": 170135,
        "title": "Higher Education: A 5e Strixhaven AP",
        "description": "Strixhaven University is known for its illustrious undergraduate program -- but what about its grad students? HIGHER EDUCATION is an explosive dark academia campaign that follows five brilliant, jaded, and caffeine-fueled grad students on the verge of burning out. The Cycle of Ascension is coming -- a magical phenomenon by which mortals can become gods -- and each student has their own reason for wanting to ascend... or not. Either way, Arcavios beckons! Can our heroes wrangle their conflicting ideals about godhood, their obligations, and their graduate thesis? Or will the very real threats lurking in the halls of Strixhaven consume them all?",
        "language": "en",
        "author_name": "Vana, Connie, Drak, Hamnah, Liv and Sea",
        "slug": "higheredrpg",
        "cover": "20221124_031137_203dcb8e67b4cd23af99752c3a1ef2e8.jpg"
    },
    {
        "podcast_id": 170526,
        "title": "Adventure SMP",
        "description": "Follow the adventures of Bussiness Ray, Groqy and Peebus as they travel from SMP to SMP and figure out what's happening to players and worlds alike.\n\nMusic from Artlist.io, C418 ",
        "language": "en",
        "author_name": "Adventure SMP",
        "slug": "adventuresmp",
        "cover": "20221126_041146_8cde10e1dae14b6fae3efbef83dea8f1.jpg"
    },
    {
        "podcast_id": 173078,
        "title": "James Kingdon - Classic Audiobooks",
        "description": "I have an absolute passion for narration and voice-over. It’s an unparalleled arena for fabulous imaginative creativity. I find it so exciting to be able to create pictures and emotions simply by using my voice and to share that with listeners. From a young age I was a voracious reader and would spend hours inventing character voices for whichever book I was enthralled by at the time. As a child I read Dickens, Tolkien, Eddings, Stevenson… I trained at the Bristol Old Vic Theatre School receiving outstanding training from Voice Specialists Francis Thomas and Lynette Irving, refining my vocal technique and flexibility, plus excellent radio technique training from BBC producer Brian Miller. I work as a professional voice over artist and actor and have a particular affinity with the Classics, Science Fiction and Fantasy. I also co run Summer Light Theatre with my partner Joanna, dedicated to bringing world class theatre to everyone via our YouTube channel (https://www.youtube.com/@SummerLightTheatre/).\n",
        "language": "en",
        "author_name": "James Kingdon",
        "slug": "jameskingdon-classic-audiobooks",
        "cover": "20221215_101259_8911c90ee59d518326376bce45a2cdcf.jpg"
    },
    {
        "podcast_id": 173093,
        "title": "Detective Bryan",
        "description": "I Miniature - et kaotisk sted, fyldt med tosser og godtfolk - hvor græsset ikke er grønnere, og fuglene sjældent synger om sommeren - forsøger helte-detektiven Bryan, at opklare sager, som politiet skal bruge hjælp til. \nMen kan Bryan holde snor i det hele, og sikre Miniatures velbefindende - når korruption, bedrageri, og grådighed er konstitutionelle borgerrettigheder..?                 Lyt med og få svar.",
        "language": "da",
        "author_name": "Gregers Clausen",
        "slug": "detective-bryan",
        "cover": "20221207_061225_f6b104cbb0c9710cd2e3e953e276ac5a.jpg"
    },
    {
        "podcast_id": 174173,
        "title": "Bacardis & Smarties",
        "description": "Bacardi Boyz bringing entertainment and laughter. Sit back, relax, and tune in with Bacardis & Smarties",
        "language": "en",
        "author_name": "Bacardis&Smarties",
        "slug": "bacardis-smarties",
        "cover": "20221213_081232_f98b1dfc6b1aded939022eb4081993a9.jpg"
    },
    {
        "podcast_id": 174994,
        "title": "Behind The Lighthouse",
        "description": "Short Stories from Byron Bay and Beyond.\nThe Northern Rivers, Australia, is a richly creative place. This podcast takes one small element of this, Short Stories, and brings these to the world. They range in length, genre, and energy, from very short, five-minute sparks of life to some that are around 45min. The subjects of the stories are also highly diverse, from sweet little stories about birds to psychological thrillers. \n\nAll writers and performers live in the Northern Rivers area, from Byron Bay westwards however inspiration draws from anywhere and everywhere.\n\nSit back and be transported by the magic of creative storytelling from one of the most creative places in the world. \n",
        "language": "en",
        "author_name": "Steve Nossiter",
        "slug": "behindthelighthouse",
        "cover": "20221217_091206_2e56cfb798f29cc38b4c239905277cbc.jpg"
    },
    {
        "podcast_id": 175238,
        "title": "Last Legend from Above",
        "description": "Dungeons and Dragons 5e Live Play Campaign. ",
        "language": "en",
        "author_name": "Brothers In Gaming Productions Ltd",
        "slug": "lastlegendfromabove",
        "cover": "20230129_110114_d8f78e9c51a2051d3ea8a78078d509c9.jpg"
    },
    {
        "podcast_id": 175556,
        "title": "Talk Sexy with Lexy ",
        "description": "<p>Hi, I’m Lexy Thornberry. You might know me from Love Island Australia but I’m here with this podcast to show you the REAL Lexy! On this podcast I’ll be talking about everything from relationship advice, health and fitness pro tips, funny dating stories, sex, drama, gossip, behind the scenes and insight of my life, Love Island Drama. Lexy interviews a range of different people, from reality stars, public figures, friends, models, creators etc.. clearing up any fake stories with insider info</p>",
        "language": "en",
        "author_name": "Lexy Thornberry ",
        "slug": "talksexywithlexy",
        "cover": "20230504_040552_136d4cc206ff72d31a15a3d7350b8e7c.jpg"
    },
    {
        "podcast_id": 176417,
        "title": "Att: Mi corazón y yo ",
        "description": "Aquellas palabras escondidas en mi alma, esas que nadie conoce pero ahí están. ",
        "language": "es",
        "author_name": "Giovanna Alamilla ",
        "slug": "alamilla",
        "cover": "20221227_051232_1e125d379e8e2b23e981bd5b57fe5c1b.jpg"
    },
    {
        "podcast_id": 177566,
        "title": "Alex’s Podcast",
        "description": "Hey! Welcome to Alex's podcast where Alex talks about whatever is on her mind- which is often a lot. She loves running, musicals, writing, singing, bath time, and so much more. Check out new episodes every week!",
        "language": "en",
        "author_name": "Alex Larson",
        "slug": "alexspodcast",
        "cover": "20230102_010105_a9147a71b282f22de342cd83f090d121.jpg"
    },
    {
        "podcast_id": 177906,
        "title": "Yokai Detective Agency ",
        "description": "<p>Welcome to Darkness Falls, a quiet sanctuary for the supernatural nestled in a shadowed corner of New England. The Yokai Detective Agency is the enforcer of this haven and follows a diverse group of supernatural beings. Our lead homicide detective Ren Black has been battling the aftermath of his partner and lover's murder.</p><p>Shutting himself away in his grief for a year, a new partner assignment in a young kumiho named Hiro Akashi coincides with the return of the serial killer that took away his light. Are the embers of love and revenge too mixed for Black to sift through? Will the Yokai Detective Agency be able to band together and close this case for good?</p><p>Take a trip to Darkness Falls and see what lies in wait.</p><p>Ending theme:</p><p>'Save Me' by Eye One Fifty. <a href=\"https://youtu.be/T3DrpFCyQ-k\">https://youtu.be/T3DrpFCyQ-k</a></p>",
        "language": "en",
        "author_name": "Tragedy Faye",
        "slug": "darkness-falls",
        "cover": "20230530_020558_89ea70150b4d6d2d1564a74bdf853455.jpg"
    },
    {
        "podcast_id": 179389,
        "title": "LuckyTxei",
        "description": "El programa preferit dels cabirols",
        "language": "ca-es",
        "author_name": "Escolanets de Sant Llorenç 2023",
        "slug": "luckytxei",
        "cover": "20230110_120111_297f997f2ae7b8deb2b4f52a5ab28973.jpg"
    },
    {
        "podcast_id": 179725,
        "title": "RELATOS REALES DE TERROR",
        "description": "Relatos Reales de Terror de Efecto Radio. Es un Pódcast donde se cuentan historias de terror, fantasmas o sobrenaturales; pero de la vida real. Algunas de estas historias me han sucedido y otras las personas las han compartido o han enviado a investigacionesdemisterio@gmail.com.\n\n",
        "language": "es",
        "author_name": "AMIN",
        "slug": "relatosrealesdeterror",
        "cover": "20230111_050136_73e056a8d93b1cd893ed1442eb442a12.jpg"
    },
    {
        "podcast_id": 181883,
        "title": "Noir di Edith ",
        "description": "La vita è una fusione tra il bene e il male, il bene è il cuore di essa, il male è un veleno dannoso, oscuro e misterioso. E anche vero però che lo stesso male, in tutte le sue forme a volte è inspiegabilmente attraente.\nMi chiamo Edith e vi do il benvenuto nel mio piccolo mondo. Vi leggerò e vi canterò le mie storie. Ognuna ha come la protagonista quell'attrazione oscura! \nSono qui per osare nella mia più assoluta umiltà! Buon ascolto! \nUn ringraziamento speciale per la mia correttrice Paola Suraci. ",
        "language": "it",
        "author_name": "Edith",
        "slug": "noirdiedith",
        "cover": "20230119_060132_3f10b8bfa1e9e860e4c417c16c7e8190.jpg"
    },
    {
        "podcast_id": 182240,
        "title": "STYX",
        "description": "<p>Blake Wayman was a cop until a criminal syndicate had Blake and his wife killed... there's only one problem: Blake didn't stay dead. Now Wayman is a wheelchair bound P.I. with a gift. He can walk the streets of Underworld City, a purgatory on the banks of the River Styx, run by the mysterious Boatman, teeming with lost souls, spiritual forces, and long dead gangsters. There Wayman searches for his lost love and solves crimes no one else can, bringing justice from beyond the grave... Styx is the fictional supernatural noir detective series you didn't know you were waiting for.  Follow us on Twitter at @TheStyxPodcast or support us on the web:</p><p><a href=\"http://www.ko-fi.com/styxpodcast\">www.ko-fi.com/styxpodcast</a></p><p><a href=\"http://www.styxpodcast.com\">www.styxpodcast.com</a></p>",
        "language": "en",
        "author_name": "Mat Raney",
        "slug": "styxpodcast",
        "cover": "20230120_110108_1a2996aca096852739794461cf0b38eb.jpg"
    },
    {
        "podcast_id": 183163,
        "title": "Out of the Dark by Chioces (Drarry Podfic)",
        "description": "<p>This is a Harry Potter Podfic.</p><p>Pairing: Drarry</p><p>Link to the written version: <a href=\"https://archiveofourown.org/works/29814189/chapters/73351563\">https://archiveofourown.org/works/29814189/chapters/73351563</a></p><p>Summary: Ten years after the war, most Slytherins have either been executed or gone into hiding. A few, like Draco, exist on the outskirts of society. Not that Draco minds, his life is simple and respectable. He runs a business he loves and keeps his head down. It's not perfect, but for Draco, it's more than enough. That is, until he makes the ill-advised decision to help a very drunk Harry Potter.</p><p>Potter, true to form, takes this as an open invitation to not only invade Draco's home, but also to drag Draco into the political mess that Wizarding Britain has become. And of course he does, because how can Harry Potter come into contact with anyone, and not get them involved in the self sacrificing bullshit that is saving the world?</p><p>Abruptly Draco's well curated life is careening out of control, and worse, his stupid heart is chasing right on after it.</p>",
        "language": "en",
        "author_name": "Chioces",
        "slug": "ootd",
        "cover": "20230124_010137_f3153153783d9093af927ce5dc0c49a4.jpg"
    },
    {
        "podcast_id": 183410,
        "title": "WildTrials",
        "description": "<p>A high octane, mech racing audio drama! Welcome to the WildTrials, where pilots race transforming mechs against each other in order to win all their hearts desire! For Abe Soriano, he's only desired one thing--to stand out from the shadow of his older brother. But when his brother finds himself entangled in darkness, Abe throws himself into the WildTrials to save him, working with a ragtag team to face dangerous puzzles, tough opponents, and hidden secrets. Can Abe speed through the dangers that lie ahead and save all that's precious to him? Or will he loose it all to...the WildTrials?!</p>",
        "language": "en",
        "author_name": "Joaquin Evia Del Puerto",
        "slug": "wildtrials",
        "cover": "20230125_040123_06e40c2c233e51a6ddc0a1192498e5e2.jpg"
    },
    {
        "podcast_id": 183831,
        "title": "Wonder World Comics",
        "description": "Welcome to Wonder World Comics, an actual play podcast of Masks: A New Generation! Witness the Midnighters do battle with time traveling villains, wrangle rampaging hormones, and discover what it means to be a hero.\n\nPlease excuse the brief audio issues in our first few episodes while we get our feet under us, the audio quality is much better in our future issues",
        "language": "en",
        "author_name": "Wonder World",
        "slug": "wwcomicspodcast",
        "cover": "20230126_080138_c935271a5dde44478e3d7cc7ee0127bc.jpg"
    },
    {
        "podcast_id": 184107,
        "title": "Journal Collection",
        "description": "Me llamo Mireya Romero y hacer un podcast siempre ha sido un camino por cumplir. Quiero que sea un sitio donde desahogarme, donde contar mi vida, mis anécdotas en el trabajo, con mis amigos..etc ",
        "language": "es",
        "author_name": "Mireya Romero",
        "slug": "collectiondevida",
        "cover": "20230128_020123_dfd4b25496670309748ce56a5ab09ff8.jpg"
    },
    {
        "podcast_id": 184597,
        "title": "Stories That Granny Tells",
        "description": "<p>Fiction Short Stories for relax and entertainment.</p>",
        "language": "en",
        "author_name": "Carlton Morris",
        "slug": "sstoriesthatgrannytells",
        "cover": "20230129_110154_e30c220b0f03e37ca05abdd1b7db3854.jpg"
    },
    {
        "podcast_id": 185563,
        "title": "Who said it?",
        "description": "In this podcast you will get to know how girls think about each other by hearing their opinions. You will also learn about the biggest trends and very interesting topics. ",
        "language": "en",
        "author_name": "Balbina Pérez and Ivanna Mireles ",
        "slug": "whosaidit",
        "cover": "20230201_030232_e89184c772c3876929c7ab192c217aa8.jpg"
    },
    {
        "podcast_id": 185582,
        "title": "Unhealthy obsession like boys",
        "description": "In this podcast we will talk about relatable things such as boys and obsessions, how a simple interaction can lead you to do many things, we want people to understand that they are not the only ones and that many people also suffer from this. ",
        "language": "en",
        "author_name": "Obsessers",
        "slug": "unhealthyobsessionlikeboys",
        "cover": "20230201_030230_af6d8712ec2a4ce5909eb131abe1b1c4.jpg"
    },
    {
        "podcast_id": 186081,
        "title": "I'm Listening Live Podcast",
        "description": "The names and music mentioned in this podcast I do not own the rights too. I have Hot Topics one of the hot topic's discussions are how Atlanta Ga is being roasted on social media, also when gun control started and comments from myself and my fans. A section where the fans answer my trivia questions.",
        "language": "en",
        "author_name": "Debra White",
        "slug": "debrawhite",
        "cover": "20230203_010248_f3323013d9f78e0fc284307d87a47dcd.jpg"
    },
    {
        "podcast_id": 186346,
        "title": "Getaway Car ",
        "description": "<p>Follow Kat and April as they cover some of the most infamous true crime cases!</p>",
        "language": "en",
        "author_name": "Kat Pinheiro",
        "slug": "getawaycarpodcast",
        "cover": "20230203_110247_9bf774c7fbbd7171618953c495dffa6c.jpg"
    },
    {
        "podcast_id": 187145,
        "title": "Metagaming Monstrosity",
        "description": "<p>It's around 2014 and the world is falling to pieces, magically speaking. Despite the increase in unexplainable disasters and missing people, the U.S. government's own \"Council of Human Development\" has made no moves since the 1980's. So, a member of the DoE tries yet again to form an underground group aimed at protecting people before it's too late. Too bad it's these guys... This is a set of test recordings from a homebrew modern world based on mythos built up over 2 unrecorded campaigns (technically 1 and 1/2, since the \"second\" campaign used the same characters). System used is Monster of the Week, a Powered by The Apocalypse game created by Michael Sands. It's been heavily customized and most likely none of us are following the rules as intended. Note: A lot of the beginning of this was recorded on a 15 dollar recorder. Everyone makes mouth noises even when we try not to, and hopefully over time I will be able to make the players stop chewing on all of the equipment and hitting each other. </p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p>",
        "language": "en",
        "author_name": "Katie",
        "slug": "metagaming-monstrosity",
        "cover": "20230209_050237_9bf095393bef52d5c6acd8640ee5868a.jpg"
    },
    {
        "podcast_id": 187460,
        "title": "Spanglish Joda",
        "description": "CHILL AND LAUGH",
        "language": "en",
        "author_name": "Ana Rivera-Cruz",
        "slug": "spanglishjoda",
        "cover": "20230207_080212_ebc5e4b7e825cbab5b6523d57105acf5.jpg"
    },
    {
        "podcast_id": 187547,
        "title": "You Didn't Ask Us",
        "description": "<p>Here's a podcast that is simply just a big bit.</p>",
        "language": "en",
        "author_name": "Hailey and Julie",
        "slug": "youdidntaskus",
        "cover": "20230518_100510_5fd256bcd18b1fed0fc376c141cad902.jpg"
    },
    {
        "podcast_id": 192575,
        "title": "کافه یک فنجان آرامش",
        "description": "<p>Café Stories</p><p>داستان‌های کوتاه کافه‌ای کوچک در گوشه یکی از دهکده‌های انگلستان</p>",
        "language": "en",
        "author_name": "Sanaz Eghtesadinia",
        "slug": "acupofpeace",
        "cover": "20230226_030257_f71556ffb0b59e9c0ad3cb49e905e36f.jpg"
    },
    {
        "podcast_id": 193415,
        "title": "Tomate, pera y manzana ",
        "description": "<p>Somos tomate, pera y manzana</p>",
        "language": "es",
        "author_name": "Carmen,Víctor y Aitana ",
        "slug": "spotifytomateperaymanzana",
        "cover": "20230306_020308_4e138190f8b321525898ad0f3175bef5.jpg"
    },
    {
        "podcast_id": 193886,
        "title": "Dark and Twisted Tales: Season 1",
        "description": "<p>Short, dark, and twisted stories, Each horror story is told with realistic and automated voiceovers. </p>",
        "language": "en",
        "author_name": "William Bowser",
        "slug": "darkandtwistedtales",
        "cover": "20230302_110315_6a983d68e72e6e94648acf1e37b87a37.jpg"
    },
    {
        "podcast_id": 195310,
        "title": "The Jointed Chronicles",
        "description": "<p>Following the dark adventures of Lestat De Lioncourt from Anne Rice’s The Vampire Chronicles and The Mayfair Witches. Join us in divulging into these fictional gothic master pieces and connecting the dots. Every book will be its own season, chapter by chapter breakdown of the books, funny commentary and probably some mispronunciations because hey we’re human. Welcome to The Jointed Chronicles.</p>",
        "language": "en-us",
        "author_name": "The Jointed Chronicles",
        "slug": "the-jointed-chronicles",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 196200,
        "title": "YarnSaga",
        "description": "<p>YarnSaga<strong> </strong>is an audio experience of allegories and metaphors composed by storytellers and set in a universe beyond our space and time.</p>",
        "language": "en",
        "author_name": "YarnSaga",
        "slug": "yarnsaga",
        "cover": "20230314_030340_05e7799ecc07c58504908ee3c74e7b11.jpg"
    },
    {
        "podcast_id": 196630,
        "title": "By Way of the Sea: A Regency Era Audio Drama",
        "description": "<p><em>The year is 1814, and Elena's life is about to change forever.</em></p><p>When Elena learns from her father that her past has been a lie, her entire life is uprooted all in one night. Along with a trunk of her mother's belongings, she is dropped off the next day at the pier to begin a voyage to her new home and her arranged marriage. While aboard the ship, she befriends Captain Jeremiah and his wife, Lucia, all while avoiding the condescending eyes of the first mate, Silas.</p><p>One night, after their ship runs aground in a storm, Silas is left to watch over Lucia and Elena on a tropical island, while the Captain goes to find help. Soon after, Kwesi and Bahia wash ashore, creating a new dynamic among the stranding souls, forcing Elena to determine what she wants for her life, and what she truly considers home.</p><p>A regency era story, with layers of humor, adventure, love, and self-discovery. A great episodic-series for fans of historical fiction, Jane Austen, Bridgerton, and other 19th century dramas.</p><p><strong>By Way of the Sea</strong> is an original, immersive audio drama created by <a href=\"https://twitter.com/eralorestudios\">EraLore Studios</a>, in collaboration with <a href=\"https://twitter.com/StayBizze\">Stay Bizze.</a> With voice acting by <em>Brenna Patzer, Seth Rosenke, Karina Hilleard, John R. Smith Jnr, Enzo Leone, </em>and <em>Gervais Weekes.</em></p>",
        "language": "en",
        "author_name": "EraLore Studios",
        "slug": "bywayofthesea",
        "cover": "20230313_090328_32a5b88cccf11f4206c5e26ed6f4fc95.jpg"
    },
    {
        "podcast_id": 196664,
        "title": "Recently Deleted",
        "description": "<p>hey y'all we are Em and Angel. We are irresponsible, mentally ill baristas in our 20s but funny as fuck (deadass). This is purely for our entertainment and we have nothing better to do besides clout chase.</p>",
        "language": "en",
        "author_name": "Em and Angel",
        "slug": "recentlydeleted",
        "cover": "20230314_120332_e002f9b1e986dbe3325aab9184c609a6.jpg"
    },
    {
        "podcast_id": 198594,
        "title": "STRANGER THAN FICTION",
        "description": "<p>Collected short stories that mirror your reality. </p>",
        "language": "en",
        "author_name": "Josh Diaz",
        "slug": "strangerthanfiction",
        "cover": "20230322_090328_7161d50a3b0e059726312f63b2caae5e.jpg"
    },
    {
        "podcast_id": 200636,
        "title": "Leggi con calma",
        "description": "<p><strong>ATTENZIONE: questa sinossi potrebbe contenere spoiler della trama, anche se l'autore non ritiene che siano tali; ma è anche da considerare che l'autore gradisce molto conoscere il finale di un film per poi gustarsi il come si arrivi a quella conclusione...</strong></p><p><strong><em>Sinossi</em></strong>: <em>Una mail misteriosa, inviata da una persona che non potrebbe farlo in quel momento. Una corsa contro il tempo senza sapere perché e cosa sta succedendo.</em></p><p><em>Attraversando a bordo del suo furgone arancione un intero universo, Oscar tornerà dalla sua amata Elena.</em></p><p><em>Elena capirà quanto ama il suo uomo sapendolo perso nell'immensità dello spazio.</em></p><p><em>Entrambi riusciranno a collaborare per il medesimo fine senza necessità di parlarsi, e scopriranno di conoscere l'uno dell'altra molto più di quanto non immaginassero fino a quel momento.</em></p><p><em>“Leggi con calma” è profetico nella sua apparente contraddizione con il contesto, in cui si richiede rapidità di pensiero e di azione. La calma richiesta è più una qualità zen, che una spinta verso la fretta sconsiderata.</em></p><p><em>Vorrei ringraziare Douglas Noel Adams per quello che ha fatto per l'umanità.</em></p>",
        "language": "it",
        "author_name": "Nicola \"evanmac\" Lomartire",
        "slug": "leggi-con-calma",
        "cover": "20230401_100455_9239a98ab5d41f01aa1f00c75e6fc249.jpg"
    },
    {
        "podcast_id": 200872,
        "title": "Pó de Fada: Diário de Investigação - (Spin-off \"Fada Branca\")",
        "description": "<p>Experiencia cada episódio da série \"Fada Branca\" aos olhos do Inspector Rui Raposo. Descobre informações nunca reveladas em série, como os vários mistérios relacionados ao caso \"Titânia Cafés\". Entra no mundo privado de Rui e a cada semana ouve uma nova gravação da sua investigação.</p><p>Com as vozes de:</p><ul><li><p>João Candeias como Rui.</p></li><li><p>João Craveiro como Edmundo.</p></li></ul>",
        "language": "pt-pt",
        "author_name": "Fada Branca - Mini-Série",
        "slug": "fadabranca",
        "cover": "20230402_050425_8e21719753da535406f73e29bc476bf1.jpg"
    },
    {
        "podcast_id": 200938,
        "title": "Beyond Reality: Tales of the Unknown",
        "description": "<p>Dive headfirst into the enigmatic world of Beyond Reality – a mind-blowing podcast series that will have you utterly hooked from the very first moment.</p><p>Experience pulse-pounding tales of futuristic dystopias and mind-bending science fiction that'll make your heart race and your imagination soar.</p><p>Each episode whisks you away to a vivid, uncanny universe where the fabric of reality unravels, and the unfathomable becomes your new normal. Prepare to be mesmerised by gripping stories that will send shivers down your spine, ignite your curiosity, and have you clamouring for more.</p><p>Dare to plunge into this mesmerizing odyssey beyond the limits of the conceivable.</p><p>Be sure to like and subscribe!</p>",
        "language": "en",
        "author_name": "Adrian Bruno",
        "slug": "beyondrealitystories",
        "cover": "20230403_080427_66c6f555e60c27f253705fac512610b9.jpg"
    },
    {
        "podcast_id": 201139,
        "title": "VHS AUDIO DRAMAS",
        "description": "<p><strong>Audio Dramas</strong> that are part of one connecting arc, each spanning across the stars, transcending space &amp; time itself.​</p><p>Join us on our new venture of audio entertainment created by author J.R. Manga. For publications and more please visit our website.</p><p><a href=\"https://www.jrmanga.com\">https://www.jrmanga.com</a></p><p>[Sign up to our newsletter for a free urban fantasy horror novel that will be released this year]</p><p>Follow us</p><p><a href=\"https://www.instagram.com/vhs_reader/\">https://www.instagram.com/vhs_reader/</a></p><p><a href=\"https://youtube.com/@vhsreader\">https://youtube.com/@vhsreader</a></p>",
        "language": "en",
        "author_name": "VHS READER",
        "slug": "vhsaudiodramas",
        "cover": "20230404_070408_c7da7d60d753e430ac649e031d09ad44.jpg"
    },
    {
        "podcast_id": 202712,
        "title": "The Present",
        "description": "<p>A novel by Stefan Molyneux</p>",
        "language": "en",
        "author_name": "Stefan Molyneux",
        "slug": "present",
        "cover": "20230414_030422_6365b96d2240460b826c046d04649680.jpg"
    },
    {
        "podcast_id": 203552,
        "title": "Voci Arcane",
        "description": "<p>Luoghi, persone, storie...un salto nel buio, dove la realtà si fonde con leggende tramandate e parole a volte troppo dettagliate per lasciare tutto all'immaginazione. Un viaggio dove, ogni capitolo proverò ad affrontare e trasmettere sensazioni a volte cupe, altre claustrofobiche, altre ancora folli. Le voci arcane che, in tutto il mondo, create in centinaia di anni fanno incuriosire tutti noi. </p>",
        "language": "it",
        "author_name": "Filippo Rossi",
        "slug": "voci-arcane",
        "cover": "20230416_040402_6d0dbbcfb9856205a887b99ba79a6303.jpg"
    },
    {
        "podcast_id": 203614,
        "title": "Que Roche",
        "description": "<p>Dos Perunidenses contando sus anécdotas, experiencias, y roches!</p>",
        "language": "es",
        "author_name": "Aracelli, y Rina",
        "slug": "queroche",
        "cover": "20230825_120854_a3265300f54cf3460bd71d582f3aa76e.jpg"
    },
    {
        "podcast_id": 204175,
        "title": "Red Panda Report",
        "description": "<p>Red Panda Adventures by Gregg Taylor tells the epic story of Canada's greatest superheroes who battle evil in all forms, from common criminals to Nazi super-soldiers and demonic forces. Join MJ weekly, as he listens to the old-time radio worthy episodes and reads the pulp novels as he assembles the Red Panda Report!</p><p>Visit <a href=\"http://MJMunoz.com\">MJMunoz.com</a> for more analysis, art and fiction.</p>",
        "language": "en",
        "author_name": "MJ Muñoz",
        "slug": "mjmrpr",
        "cover": "20230419_020458_d8e80f41b9c5643880efa9efe67f91d8.jpg"
    },
    {
        "podcast_id": 204615,
        "title": "Mad Cat in the Attic ",
        "description": "<p>Weekly horror story readings by the creepo that hides in your attic.</p><p>Patreon: <a href=\"https://patreon.com/MadCatPodcast\">https://patreon.com/MadCatPodcast</a></p><p></p><p>Submit a story!: <a href=\"mailto:madmanintheatticpodcast@gmail.com\">madmanintheatticpodcast@gmail.com</a></p><p></p><p></p><p>Follow me on instagram!: <a href=\"https://instagram.com/mad_cat_podcast?igshid=NTc4MTIwNjQ2YQ==\">https://instagram.com/mad_cat_podcast?igshid=NTc4MTIwNjQ2YQ==</a></p><p></p><p>Thanks for listening!</p>",
        "language": "en",
        "author_name": "C. Lucian",
        "slug": "madmanpodcast",
        "cover": "20230504_040510_94b888d06ccd281d57c3df41458d926d.jpg"
    },
    {
        "podcast_id": 204714,
        "title": "Historias de Terror y Creepypastas",
        "description": "<p>Cuentos Creepy te invita a escuchar algunas historias de terror, creepypastas, relatos de terror y algunas historias un tanto extrañas, solo para valientes y uno que otro curioso, espero sean de tu agrado y muchas gracias.</p>",
        "language": "es",
        "author_name": "Miguel Angel Crispin Baltazar",
        "slug": "cuentoscreepy",
        "cover": "20230421_100430_762f39d5a04e61532b09f5779db7eec4.jpg"
    },
    {
        "podcast_id": 205678,
        "title": "Two Monkeys One Mic",
        "description": "<p>Presentamos podcast educativos</p>",
        "language": "es",
        "author_name": "Two Monkeys One Mic",
        "slug": "predicciondesimpson",
        "cover": "20230510_100537_279dcdbaac722640ea31c279ba7ac692.jpg"
    },
    {
        "podcast_id": 206928,
        "title": "Silas Gnaw",
        "description": "<p>What does terror mean to you?</p><p>In this world, fear arrives not in the form of ghosts or demons, spirits or vampires. Instead, it is the faintest touch at the back of your neck — a gnawing sense that something is wrong.</p><p>Silas Gnaw is a horror anthology podcast that tells stories of guilt, madness, horror and peculiarity. The characters who navigate these pockets of darkness are everyday people. A former convict trying to feed his family. A failed artist looking for inspiration. A young woman in love. But the nightmares they face get to the heart of what it means to look in the mirror and see nothing worth salvaging.</p><p>New episodes on the third Tuesday of every month. For episodes with visuals, check out <a href=\"http://Youtube.com/@silasgnaw\">Youtube.com/@silasgnaw</a>. For more information, email <a href=\"mailto:silasgnaw@gmail.com\">silasgnaw@gmail.com</a>.</p>",
        "language": "en",
        "author_name": "Silas Gnaw",
        "slug": "silasgnaw",
        "cover": "20230502_100542_b47ecc905e568e047484ec21a93eedc2.jpg"
    },
    {
        "podcast_id": 208082,
        "title": "POEMANIA",
        "description": "<p>Bienvenidos a Poemaina, donde actualmente hablamos sobre poemas </p>",
        "language": "es",
        "author_name": "Sebastian, Luis, Alexandra, Gustavo",
        "slug": "poemania",
        "cover": "20230509_040541_28067753d2ed6f3c7b603df47cac6235.jpg"
    },
    {
        "podcast_id": 208197,
        "title": "se os ha hecho bola.",
        "description": "<p>a ver, si entráis aquí preparaos para un viaje que no os esperáis porque te cuento mi vida y cosas que no me gustan... =)</p>",
        "language": "es",
        "author_name": "Uriel Notó Marmaneu",
        "slug": "seoshahechobola",
        "cover": "20230518_080516_fe6a3814a71f569a4fb612abd54117b1.jpg"
    },
    {
        "podcast_id": 209053,
        "title": "Scarlet Stiletto Bites",
        "description": "<p>Scintillating short crime stories by Australian woman.</p><p>Narrated by Susanna Lobez</p>",
        "language": "en",
        "author_name": "Sisters in Crime Australia",
        "slug": "scarlet-stiletto-bites",
        "cover": "20230514_120540_c809fc3b49601a3cd2d1f1b2ea5031f2.jpg"
    },
    {
        "podcast_id": 209405,
        "title": "MORNEAU",
        "description": "<p>A private investigator and his mysterious assistant fend off bombs, a homicidal ex, the FBI, and an alligator while trying to manage their sexual attraction and ever-growing resentment.</p><p>Music by Blue Dot Sessions</p>",
        "language": "en",
        "author_name": "Jeni Decker",
        "slug": "morneau",
        "cover": "20230515_080528_8f2dce49043a559d4dcf3989bd5a4658.jpg"
    },
    {
        "podcast_id": 209983,
        "title": "Invertiti",
        "description": "<p>INVERTITI, storie di gay, lesbiche, bisessuali, trans e travestite che hanno invertito</p><p>la Storia. Qui parliamo di loro, di chi ha trasformato le proprie vite in</p><p>terreno di battaglia per la conquista di diritti, senza mai mietere vittime sul terreno. Protagonisti esclusi, s’intende.</p><p>Un podcast di Cathy La Torre e Guglielmo Scilla.</p><p>Con il contributo autoriale di Sarah Buono, Emilio Mola, Valentina Volpi.</p><p>Suoni e regia di Simone Lanza.</p><p>Strategia comunicativa di Willwoosh srl e Isabella Borrelli.</p>",
        "language": "it",
        "author_name": "Cathy La Torre & Guglielmo Scilla",
        "slug": "invertitipodcast",
        "cover": "20230518_090540_cffeb0c060a8a219217ea3905503f7cf.jpg"
    },
    {
        "podcast_id": 210386,
        "title": "Emmanuel - The broken diary - Second season",
        "description": "<p>Il romanzo è tratto da un diario autentico, scritto da un adolescente di cui si sono perse le tracce anni fa, che chiameremo per convenzione Emmanuel; la sua scomparsa risale al 1997, quindi il libro è ambientato nei primi anni '90. Emmanuel è un adolescente irrequieto, incapace di accontentarsi del molto che possiede e con una personalità borderline che lo porterà a fare esperienze intense e disordinate, alla ricerca di un \"senso\". In questa sua ricerca travolgerà diversi personaggi, tra cui Antonia, la fidanzata del fratello Michele. Gli interpreti sono due bravissimi attori-doppiatori, Elisa Gandolfi e Paolo Malgioglio.</p><p>...</p><p>The novel is based on a true diary, written by a teenager whose traces went missing years ago, whom we will call by convention Emmanuel; his disappearance dates back to 1997, so the book is set in the early 90s. Emmanuel is a restless teenager, unable to satisfy himself with the much he possesses and with a borderline personality that will lead him to make intense and messy experiences, in search of a \"meaning\". In this search for him he will overwhelm several characters, including Antonia, his brother Michele's girlfriend. The performers are Elisa Gandolfi and Paolo Malgioglio.</p><p>SUBSCRIBE:</p><p><a href=\"https://podcasters.spotify.com/pod/show/antonia-delmonaco/subscribe\">https://podcasters.spotify.com/pod/show/antonia-delmonaco/subscribe</a></p>",
        "language": "it",
        "author_name": "Antonia Del Monaco",
        "slug": "emmanuel",
        "cover": "20230520_020554_ca55d4fee09272338e44d9ef12fe0db7.jpg"
    },
    {
        "podcast_id": 210417,
        "title": "DE TODO UN POCO. Ariadne Acevedo Leyva - Lizzeth Castrejón Sánchez.",
        "description": "<p>Un podcasts en donde relatamos algunos casos de nuestra vida con nuestra invitada Lizbeth Castrejón Sánchez.</p>",
        "language": "es",
        "author_name": "lizzeth castrejón sánchez - ariadne acevedo leyva",
        "slug": "cosasdenuestravida",
        "cover": "20230520_050533_239e38c69e6a3dc6e15f78fd6823f92c.jpg"
    },
    {
        "podcast_id": 210517,
        "title": "Fearful Symmetry",
        "description": "<p>Sonic tales of sordid histories, tender parables, and lost creatures. Frightening and cuddly, Fearful Symmetry is a shape-shifting beast lacking commercial smarts or sense enough to come in out of the rain.</p>",
        "language": "en",
        "author_name": "Bob Paris",
        "slug": "fearfulsymmetry",
        "cover": "20230521_050540_96d3e90d42cec10bcb6bd3742716a153.jpg"
    },
    {
        "podcast_id": 211320,
        "title": "Synaptic Theater",
        "description": "<p>Jack in to Synaptic Theater, where stories aren't just told, they're experienced. Each episode is a journey into the mind, a slow burn that unfolds in your consciousness, using meditation techniques to deeply explore narratives and concepts. Set against a backdrop of a cyberpunk future, where stories are downloaded directly into your brain, Synaptic Theater is more than a podcast - it's a fully immersive mental experience. Tune in, download the story, and let your mind do the rest. Welcome to the Synaptic Theater - where your mind is the stage, and the stories are limitless.</p>",
        "language": "en",
        "author_name": "John P",
        "slug": "synaptictheater",
        "cover": "20230604_020615_87081abd03787d882e8dad21c2f7ee5e.jpg"
    },
    {
        "podcast_id": 211963,
        "title": "Pocos Pero Locos ",
        "description": "<p>Get to know more of what goes on at the Oakland Roots tailgates, games, events and listen to personal experiences from members of the supporter groups.</p>",
        "language": "en",
        "author_name": "Jorge Bejarano",
        "slug": "losroots",
        "cover": "20230603_110625_d965ad184afa88d0cf1b782a77a55ccb.jpg"
    },
    {
        "podcast_id": 212869,
        "title": "THE HATCHERY",
        "description": "<p>A select few survivors are tasked with colonizing and repopulating a New Earth. Strong female characters drive the action in this dystopian post-apocalyptic thriller. Georgia, one of several beautiful genetic Exotics, dares to break free from the tightly controlled social structure that forces women like her into a life of sexual slavery and forbids all women to bear and raise their own babies. Enter THE HATCHERY.</p>",
        "language": "en",
        "author_name": " DrJoVO, written by JM Vella",
        "slug": "the-hatchery",
        "cover": "20230603_120647_d9a7eeabea0d21ddf6e4fd0940c180db.jpg"
    },
    {
        "podcast_id": 213369,
        "title": "3 Girls 1 Brain Cell",
        "description": "<p>In the life of 3 delusional girls, talking about love, sex, drama, and navigating life.</p>",
        "language": "en",
        "author_name": "Linn Ha, Kylie Jerdan, Talia Barbosa",
        "slug": "3girls1braincell",
        "cover": "20230622_040607_7dce7d562659b11282340e093484a0de.jpg"
    },
    {
        "podcast_id": 213379,
        "title": "Le Fou - Cronache Della Follia ",
        "description": "<p>podcast che ha come scopo l'intrattenimento attraverso un diario che registra il protagonista, oramai delirante della vita che lo circonda e che affronta quotidianamente</p>",
        "language": "it",
        "author_name": "Vi ",
        "slug": "le-fou",
        "cover": "20230605_080657_7d987b377d4bbd47bfd77c0fed0e15f2.jpg"
    },
    {
        "podcast_id": 213816,
        "title": "Barcelona no perdona",
        "description": "<p>El Guiu i la Mariona són dos agents dels Mossos d'Esquadra que patrullen Barcelona de nit. El seu objectiu és combatre el narcotràfic que aflora a la ciutat.</p>",
        "language": "ca-es",
        "author_name": "Daniel Llobet Gea",
        "slug": "barcelonanoperdona",
        "cover": "20230903_100942_d4611c70b67276a2c4f591a34489fa30.jpg"
    },
    {
        "podcast_id": 213990,
        "title": "A Voice In Violet",
        "description": "<p>Synopsis<em>:   </em></p><p>Violet, a damaged singer whose dreams were shattered, headlines at The Driftwood, an infamous Hollywood club. The comfort of that stage is not enough when her traumatic past comes to visit. Bash, her manipulative former music manager, and his pop star girlfriend, Charlotte, destroy Violet's career. With everything taken away from Violet, all she has left is to seek revenge. Things get more complicated for Violet when Wang, the love of her life who broke her heart and sense of trust, visits her at the club. This bittersweet symphony is also composed of Salim, Violet's protector, and Lopez, an unhinged stalker. What will happen of Violet, those who stand in her way... and the voices in her head?</p><p>Tagline:   </p><p><em>There is always an Encore…</em></p><p><em>A Voice In Violet </em>is brought to us by Philly Chick Pictures, Writer and Director Curt Wiser (<em>Cam-Girl</em>), Executive Producer Brooke Lewis Bellas (<em>iMurders</em>), Producers Brooke Lewis Bellas and Curt Wiser, and Produced By Brooke Lewis Bellas. This talented podcast production team also includes, Casting Director Alison B. Buck (<em>Pig</em>), Composer Michael Trapp (<em>Groupies)</em>, Music and Singer-Songwriter Fawn (Billboard Hit Recording Artist), Post Audio Engineer and Post Audio Mixing &amp; Mastering Alex Hope (<em>GoldenEye: Rogue Agent</em>), Graphic Designer Jonathan Olaes (<em>A Voice In Violet</em>), Editor Curt Wiser, and Sound Effects and Sound Design Curt Wiser.</p><p><em>A Voice In Violet</em> stars Film, TV, and Broadway veterans Brooke Lewis Bellas (<em>Sinatra Club)</em>, Bronson Pinchot (<em>True Romance; </em>Emmy Nominee), Nikki Blonsky (<em>Hairspray</em>; Golden Globes Nominee), Eric Etebari (<em>The Lincoln Lawyer</em>), Nelson Lee (<em>Mulan</em>), and Wilson Jermaine Heredia (<em>RENT</em>; Tony Winner).</p><p><em>\"Our A Voice In Violet Audio Drama Thriller Podcast has been an unbelievable education for me in the narrative podcast world in Hollywood. Like many creatives, I was navigating the virtual and audio space during the pandemic. I had been in-talks with my Talent Managers at Bohemia Group to develop a full Audio Drama Series and have Philly Chick Pictures and I produce a project, while still quarantining, to keep me creatively inspired. I greatly appreciated Curt’s writing talents and was impressed with his expertise in Sound Effects. Curt had pitched me a few fantastic storyline ideas, I fell in love with A Voice In Violet, and we began our production development process in the fall of 2021. We spent ample time fleshing out this series and assembling the necessary components. I was blessed to have Casting Director, Alison Buck, sign-on to help me cast our talented Actors (I had dreamed of!) Bronson Pinchot, Nikki Blonsky, and Nelson Lee (Thank you, Kat Seigworth!), then I had to have my talented friends and associates, Eric Etebari and Wilson Jermaine Heredia, onboard, as their roles were written for them, along with songs from my darling Diva Songstress Fawn, and score from the wild musical mind of Composer Michael Trapp. We truly assembled a dream cast, as well as keeping our commitment to diverse and inclusive character development and casting. As an Actress, I loved playing Violet so very much. Curt wrote this role perfectly for me and I had so much fulfillment finding the layers of this character throughout the audio series. I only hope the narrative audio podcast fans and listeners are entertained by A Voice In Violet.\" </em>- Brooke Lewis Bellas</p><p><em>\"It has been a thrill creating in the audio space, and with our talented cast who truly elevated the words off the page. Many thanks to Brooke Lewis Bellas for bringing this project together.\" </em>- Curt Wiser</p><p><em>A Voice In Violet</em> releases on multiple podcast platforms in 2023. Listen now with your free VIP pass to The Driftwood and a Champagne Toast!</p>",
        "language": "en",
        "author_name": "Philly Chick Pictures - Written & Directed by Curt Wiser - Produced by Brooke Lewis Bellas - Starring Brooke Lewis Bellas, Nikki Blonsky, Eric Etebari, Special Appearance by Wilson Jermaine Heredia, With Nelson Lee, And Bronson Pinchot",
        "slug": "avoiceinviolet",
        "cover": "20230609_120601_3063739c89d98bcecbb08b44c73827fe.jpg"
    },
    {
        "podcast_id": 214202,
        "title": "That's Scary AF",
        "description": "<p>Hey listeners! A couple of things we want to add  here are our email (<a href=\"mailto:thatsscaryaf@gmail.com\">thatsscaryaf@gmail.com</a>) and also the fact that we want YOUR stories that are creepy, scary, and downright terrifying to also share on the podcast. You are welcome to leave your name so we can give you credit or you can keep it anonymous by leaving your name out. We like to keep our stories a secret so our reactions are genuine, so if you could say who it's for in the subject line that would be amazing! Jo does mainly True Crime and Nick does Paranormal and Cryptid stories.</p><p>Thanks again for listening and don't forget to leave a like and review to help us out!</p>",
        "language": "en",
        "author_name": "That's Scary AF",
        "slug": "lakecabin-theboyinthebox-isimplymustbegoingnow",
        "cover": "20230609_060612_3c4eb871813ded2edd4e24f3e812e397.jpg"
    },
    {
        "podcast_id": 214522,
        "title": "Il Piccolo Principe",
        "description": "<p>Audiolibro in italiano de \"Il piccolo principe\" di Antoine de Saint-Exupéry, letto da Marco Di Felice.</p><p>Copertina di Jack Pan.</p><p>Contatto: marco.difelice1@gmail.com</p>",
        "language": "it",
        "author_name": "Marco Di Felice",
        "slug": "audiolibroilpiccoloprincipe-marcodifelice",
        "cover": "20230611_080602_e93cca4998124327fdd220f73f0a449f.jpg"
    },
    {
        "podcast_id": 214638,
        "title": "A Voice in the Dark",
        "description": "<p>A story of a stalking victim and her struggle to overcome her torture.</p>",
        "language": "en",
        "author_name": "Peter Smith",
        "slug": "a-voice-in-the-dark",
        "cover": "20230612_030639_ae1469f9f4211a362149541137cfbf88.jpg"
    },
    {
        "podcast_id": 214961,
        "title": "The Anything Podcast",
        "description": "<p>Welcome to the Anything Podcast With Isaiah And Tatum. This is the show where anything can happen from jumping from planes to sitting in our living room. Tune in to find out more. New episodes every Tuesday on where ever you are listening right now</p>",
        "language": "en",
        "author_name": "Isaiah and Tatum",
        "slug": "theanythingpod",
        "cover": "20230613_040659_dff2fdc93fa5129202e564afddac26e1.jpg"
    },
    {
        "podcast_id": 215552,
        "title": "The Tally Ho Hoes",
        "description": "<p>A DnD podcast about a bunch of idiots.</p><p>We love playing Dnd, making our own entertaining content, and getting creative with the use of Homebrew. We're always learning and improving the way we do things. Come along, pull up a chair, and have some fun with the Tally Ho Hoes!</p><p>Check out our Channel Trailer <a href=\"https://www.youtube.com/watch?v=v-eCiudjLtg\">Here</a>!</p><p><a href=\"https://www.youtube.com/channel/UCgfIrbOej9rL4KrT8nt_zXw\">Deceptive Reality</a> does our Intro!</p><p>Our background music comes from <a href=\"https://tabletopaudio.com/\">Tabletop Audio</a>!</p>",
        "language": "en",
        "author_name": "Rich Webster",
        "slug": "thetallyhohoes",
        "cover": "20230616_100629_f1f1a69d921f3d47521678a51bb76d27.jpg"
    },
    {
        "podcast_id": 215564,
        "title": "Kdramáticas ",
        "description": "<p>En este podcast hablamos de series coreanas, chinas y japonesas sin spoilers.</p>",
        "language": "es-mx",
        "author_name": "Martha y Nancy",
        "slug": "kdramaticas",
        "cover": "20230629_020615_a30903c5bd37b5f67e2f804773ac7b3b.jpg"
    },
    {
        "podcast_id": 215949,
        "title": "Waters of Vor Rukath - Season 1",
        "description": "<p>Welcome to the great Vor Rukath....or what used to be the great Vor Rukath. After a suspicious event that led to the entire world being submerged to the deep depths of the oceans, common folk and other species had to learn to evolve and continue surviving. Technology became more advanced, and new species were discovered. All was well, until a sudden disturbance occurred in the Hadal Zone, and that is where we stop for now. </p><p>Waters of Vor Rukath is presented by The Bards Table which is a group of musicians that like to take risks and embark on adventure through the best RPG Dungeons and Dragons (5e). Become part of the adventure as we take you on an aquatic adventure like never before! The Waters of Vor Rukath is an all original campaign that includes original SFX, music, characters, species, and so much more! Join us as we navigate through the zones and find out more information about what happened to this once great land....or try to. Season 1 starts now! </p>",
        "language": "en",
        "author_name": "Ethan Brown",
        "slug": "thebardstablewaters1",
        "cover": "20230619_100648_53e7a37de915483e588642a1aff6e238.jpg"
    },
    {
        "podcast_id": 216002,
        "title": "The Red Witch-Hunt",
        "description": "<p>Relatives of some of the closest players to the Hollywood Red Scare and the HUAC's hunt for Communists create a pirate radio show to honestly discuss the topic with political figures, theatre &amp; film experts, and everyday Americans. </p><p>Created by the Scottsdale Conservatory Theatre's Summer 2023 Class.</p>",
        "language": "en",
        "author_name": "SCT Summer 2023",
        "slug": "theredwitchhunt",
        "cover": "20230620_070632_7578478555c588b8372c73c638d2a784.jpg"
    },
    {
        "podcast_id": 216221,
        "title": "Caught Red In 4K",
        "description": "<p>Hey guys this is Sarah and Claire's podcast. In this podcast, we will be talking about drama or murder. I hope You enjoy it!</p>",
        "language": "en",
        "author_name": "Claire and Sarah",
        "slug": "murduer-234",
        "cover": "20230621_070616_715a377e4935f1b41f6c5692749598df.jpg"
    },
    {
        "podcast_id": 216675,
        "title": "Versi Divini: Esplorando la Divina Commedia",
        "description": "<p><strong><em>Versi Divini: Esplorando la Divina Commedia</em></strong> è il podcast che ti accompagna nella lettura avvincente dell'opera di <em>Dante Alighieri</em>. Unisciti a me mentre ci immergiamo nei versi intrisi di saggezza di Dante, canto dopo canto. Ogni episodio inizia con una breve introduzione che ti offre una chiave di lettura per apprezzare appieno i significati nascosti e le profonde simbologie dell'opera. Attraverso<em> Inferno, Purgatorio e Paradiso</em>, esploreremo le profondità dell'anima umana e affronteremo le sfide morali che Dante ci presenta lungo il cammino. </p>",
        "language": "it",
        "author_name": "Enrico Beninato",
        "slug": "versidivini",
        "cover": "20230624_080615_1c0ca92e833b8d35536dbfe5a9afb1ba.jpg"
    },
    {
        "podcast_id": 216923,
        "title": "Stories from Different Worlds ",
        "description": "<p>Join Blake Gilbert, a storyteller and podcaster, as he takes you on a journey through Stories From Different Worlds. In this anthology series, Blake tells stories from fantasy, science-fiction, horror, crime, and more. These stories explore themes of the hero’s journey and beyond, such as courage, betrayal, revenge, redemption, and more. Whether you’re looking for adventure, mystery, or horror, Stories From Different Worlds has something for you.</p><p>If you enjoyed this episode, please leave a review on Apple Podcasts or wherever you listen to podcasts. You can also follow Stories From Different Worlds on Twitter @StoriesfromDifferentWorlds</p>",
        "language": "en",
        "author_name": "Blake Gilbert ",
        "slug": "tavernoftales",
        "cover": "20230810_040834_915c2b7aea1d7ed806cac08fc51536af.jpg"
    },
    {
        "podcast_id": 216998,
        "title": "Dark Tales of Podcast",
        "description": "<p>Kyla Verano a fan of horror stories. In this podcast, you will hear different horror stories.</p>",
        "language": "en",
        "author_name": "The Haunting of Hollow Creek",
        "slug": "kylaverano",
        "cover": "20230627_080653_ce24be285f3f16e1e0a66657dad5a4ff.jpg"
    },
    {
        "podcast_id": 217028,
        "title": "3am Podcast KE",
        "description": "<p>Anything and everything goes. This is where we lay it all down! Talking about our experiences as young people in all diverse topics! A - Z</p>",
        "language": "en",
        "author_name": "3am Podcast KE",
        "slug": "3ampodcastke",
        "cover": "20230627_020630_b44cd256d1234a3cf1c6cc49f4e916ce.jpg"
    },
    {
        "podcast_id": 217265,
        "title": "Foul Mouthed Mamas",
        "description": "<p>Just 2 moms getting together every week to discuss anything from everyday life, to just straight up bullshit. Explicit, raw, and funny. Come hang out!</p>",
        "language": "en",
        "author_name": "Jessie & Baleigh",
        "slug": "foulmouthedmamas",
        "cover": "20230702_040710_799a95923a65f0871917d2615a4a91af.jpg"
    },
    {
        "podcast_id": 217434,
        "title": "Los Relatos Oscuros de Ánved Stranger.",
        "description": "<p>Los podcast son del próximo libro de relatos oscuros.</p><p>Los relatos más oscuros y misterios que escucharás. cómo:</p><p>Nora Grey del Jardín oscuro, una asesina que colecciona mujeres.</p><p>El asesinato de Andrea, un relato que te dejará con la piel erizada.</p><p>El río de sangre, un relato realmente escalofriante.</p><p>La resurrección de Alisa, algo aterrador, donde te sumergirás a lo más oscuro.</p>",
        "language": "es",
        "author_name": "Ánved Stranger.",
        "slug": "strangeroscuro",
        "cover": "20230717_080753_96d71c9b66f0265c101194c52c815aa7.jpg"
    },
    {
        "podcast_id": 217606,
        "title": "rozebrali mi składaka",
        "description": "<p>hfkn ytihfjofjfudihfihsfihsvihdvhi</p>",
        "language": "en",
        "author_name": "Jacuś Placuś",
        "slug": "romisk",
        "cover": "20230701_030743_7f8eb4d9507bc8105e1629a7277cbf06.jpg"
    },
    {
        "podcast_id": 217639,
        "title": "The Darker Side of Things Podcast ",
        "description": "<p>Welcome to The Darker Side of Things Podcast. My brother and I love all things true crime, unexplained, paranormal, creepy, weird; the list is never ending. Join us as we explore the unknown and try to explain the why's and where's of it all, while adding our strange senses of humor to lighten the mood.</p><p>And remember, be wary of the rabbit holes, they're dark and deep, you never know what you'll find!</p><p>COVER ART: patrick-mueller-5sAl6dHUHBg-unsplash%20(1).jpg</p><p>INTRO MUSIC: Richard Bodgers</p>",
        "language": "en",
        "author_name": "Susan Scheffler",
        "slug": "thedarkersideofthings",
        "cover": "20230812_080857_7f0ef5aafbf2acb6ada9c74f22ec36ef.jpg"
    },
    {
        "podcast_id": 217830,
        "title": "Frente al Escenario: Audio Music Drama ",
        "description": "<p>Bienvenidos a <strong>\"Frente al Escenario\"</strong>, un audio drama que te sumergirá en la apasionante vida de Anna, una adolescente del nuevo milenio que descubre su verdadera pasión a través de su primera desilusión amorosa: la música.</p><p>Acompaña a <strong>Anna</strong> mientras narra sus experiencias como bajista de la banda <strong>Amnesia </strong>y te sumerge en su mundo musical y en las complejidades de la vida en general.</p><p>En cada episodio, Anna compartirá anécdotas, reflexiones y lecciones aprendidas en su viaje musical. Desde los momentos de éxtasis en los conciertos hasta los desgarradores desamores, Anna te llevará a través de sus viajes y te hará descubrir lugares mágicos y personas extraordinarias que solo existían en sus sueños.</p><p>Prepárate para sumergirte en una historia llena de emociones intensas, superación personal y la búsqueda de la verdadera identidad. Al ritmo de las mejores canciones de rock y punk que se han escrito, \"Frente al Escenario\" te invita a disfrutar de una experiencia inmersiva que te hará vibrar y reflexionar sobre la importancia de perseguir tus pasiones y seguir tu corazón.</p>",
        "language": "es-mx",
        "author_name": "Valerie Hernandez",
        "slug": "frentealescenario",
        "cover": "20230703_030739_3045329b79cbaf4ac43b8ffbc398af38.jpg"
    },
    {
        "podcast_id": 217872,
        "title": "Darkeport - Campaign 1: Gold, Green, and Red",
        "description": "<p>“Campaign One, “Gold, Green, and Red”, is primarily a war story. Specifically, it chronicles the burgeoning city of Juramentum’s fight to determine its freedom-embracing fate. As the only city in the entire world of Terra not to utilize the institute of slavery, it stands as a shining beacon of hope for what could yet be. Likewise, “The Secret of the Word” (literacy) is legal in Juramentum, unlike everywhere else in this dark world.</p><p>Of course, war contains many elements: sacrifice, gut-wrenching decisions, and dire tests of loyalty among them. Alongside the violence and hardship of battle may spring new friendships, deepening old ones, and even love. The final fate of Juramentum, of its people, and its friends and enemies all has yet to be writ.</p>",
        "language": "en",
        "author_name": "Darkeport Productions",
        "slug": "darkeport",
        "cover": "20230919_030953_81e9750fc70fd7768bc388150cd502c6.jpg"
    },
    {
        "podcast_id": 217909,
        "title": "Teatro del Terror",
        "description": "<p>Bienvenidos a Teatro del Terror, este canal está dedicado a relatar e investigar sucesos paranormales de México y el mundo. Suscribete si te gusta el mundo de lo paranormal, cuéntanos tu experiencia paranormal al siguiente correo: <a href=\"mailto:terrorbajoelteatro@gmail.com\">terrorbajoelteatro@gmail.com</a></p><p> ¡¡¡¡ A V I S O !!!! </p><p>El objetivo del canal es con el fin de entretener a la audiencia y así mismo se pide discreción con los temas compartidos.</p><p>Suscribete a nuestro canal de Youtube y también nos podrás encontrar en Facebook, Twitter, Instagram y TikTok.</p>",
        "language": "es-mx",
        "author_name": "Teatro del Terror",
        "slug": "terrorbajoelteatro",
        "cover": "20230703_110736_d41633ea162174aab6c9b025537a3bac.jpg"
    },
    {
        "podcast_id": 218241,
        "title": "Talk show on Gazal",
        "description": "<p><strong><em>Podcast emphasis on Hindi Gazal sing by me hope you all enjoy.</em></strong></p>",
        "language": "en",
        "author_name": "Jaideep Singh",
        "slug": "my-awesomesinging",
        "cover": "20230708_070738_d46ee20307e8b159372811a6b02e5b84.jpg"
    },
    {
        "podcast_id": 218350,
        "title": "The cycle",
        "description": "<p>Ahaha</p>",
        "language": "en",
        "author_name": "Nonex",
        "slug": "the-cycle",
        "cover": "20230707_030740_85221a7bcad585fd3a61f5675437848c.jpg"
    },
    {
        "podcast_id": 218482,
        "title": "Spooky Cast",
        "description": "<p>Welcome to Spooky Cast Podcast</p><p>This podcast writen by Jake Setya</p><p>Produced by: <a href=\"https://tafsiran.com/\">Tafsiran Media</a></p><p>Cast: Narator - Jake Setya</p>",
        "language": "en",
        "author_name": "Jake Setya",
        "slug": "spookycast",
        "cover": "20230707_110712_bc20e3d18913f8a4e37445686bee4102.jpg"
    },
    {
        "podcast_id": 218932,
        "title": "Arian stark show ",
        "description": "<p>Hello and welcome to the show 🦄</p>",
        "language": "en",
        "author_name": "Arian ",
        "slug": "arianstark",
        "cover": "20230713_100730_e4cb500032790230ccfb6601d0787391.jpg"
    },
    {
        "podcast_id": 219321,
        "title": "Beyond the Legends",
        "description": "<p>Legends, scary stories and bizarre encounters are all universal. However, have we thought about what makes that monster, the person, the legend exist? This podcast is a combination of immersive stories and my written inspirations by infamous (and maybe not so infamous) legends of lore.</p>",
        "language": "en",
        "author_name": "Courtney Adkisson",
        "slug": "beyond-the-legends",
        "cover": "20230713_040736_63be486bd1588cd01d798272d35cb083.jpg"
    },
    {
        "podcast_id": 219529,
        "title": "AA Batteries",
        "description": "<p>Welcome to Double AA's podcast. We are new to this whole podcast, and we love doing this; we hope you'll love listening to us. We will have different topics in each episode, and we hope you enjoy them.</p>",
        "language": "en",
        "author_name": "Anonymous",
        "slug": "doubleaabatteries",
        "cover": "20230715_020749_037becffca9f31d43472e929305bb0ba.jpg"
    },
    {
        "podcast_id": 219778,
        "title": "Seared Secrets",
        "description": "<p>we decided to start this pod so that we can laugh at ourselves</p>",
        "language": "en",
        "author_name": "Natalie Towns & Eve Davis",
        "slug": "searedsecrets",
        "cover": "20230719_010733_40233581ba150f2cfe38d17748f783e8.jpg"
    },
    {
        "podcast_id": 219870,
        "title": "LA PARTERA DE SEVILLA (DIARIO DE UNA \"INDIVIDUA DE DUDOSA MORAL PÚBLICA Y PRIVADA\")",
        "description": "<p>Novela que se desarrolla en los años veinte y treinta. Su protagonista sufrirá las consecuencias de la Guerra Civil (1936-39) española. Intento desmontar las mentiras de las derechas desde Alfonso XIII. A medida que voy escribiendo los capítulos, los voy subiendo. Son borradores. Consuelo narra su historia enterrada en Pico Reja, en el cementerio de Sevilla, una de las mayores fosas comunes de España</p>",
        "language": "es",
        "author_name": "Ángel Francisco Sánchez Escobar",
        "slug": "comenzabaelcurso",
        "cover": "20230717_050701_ce7337e9438b063fa341ebc11badf271.jpg"
    },
    {
        "podcast_id": 220002,
        "title": "Lytham Audio Theatre",
        "description": "<p>Lytham Audio Theatre (<a href=\"http://www.LythamAudioTheatre.uk\">www.LythamAudioTheatre.uk</a>) is a non-commercial, non-profit and ad-free project; providing a small quantity of high quality free audio books and plays for anyone to listen to on their computer, Tablet, Phone, MP3 player etc., or to download and burn to a CD, so that you can listen to them whenever you wish, at absolutely no cost to you. Our books and plays have been recorded by volunteers, which enables us to provide totally free audio books and plays. You don’t even have to register, but please do join the Library so we can advise you of our latest recording.</p><p>We do have access to over 50,000 eBooks from Project Gutenberg and we are always looking for suggestions so if you would like us to record a specific Project Gutenberg eBook then please do suggest it using the form on the Contacts page, we look forward to hearing from you; although we obviously can’t guarantee recording it for you. Or why don’t you become one of our readers? Most parts only take a matter of minutes to record, we come along to your home with a script, a microphone and a tape recorder, and we do the rest; it couldn’t be easier and it is a lot of fun.</p><p>We generally only use Project Gutenberg eBooks as our source material as all their books are in the public domain and are no longer covered by copyright law, i.e., the copyright has expired. We believe therefore that all our recordings are also no longer covered by copyright law, however because of the nature of the internet, please do check before listening to or downloading or redistributing our audio books and plays that they are out of copyright in your country. Please visit the Project Gutenberg Permissions and License page for information about their rights to use etc.</p><p>Lytham Audio Theatre Plays &amp; Books are totally free, you don’t even have to register to listen to a recording, but please do Join the Library so we can advise you of our latest recordings.</p>",
        "language": "en",
        "author_name": "a source of Free Audio Books & Plays...",
        "slug": "lythamaudiotheatre",
        "cover": "20230718_100732_e567f6a0d5e86d3bc8ed7af63f548575.jpg"
    },
    {
        "podcast_id": 220143,
        "title": "shitting out our intestines",
        "description": "<p>doing this because we love the tea and I love natalie towns</p>",
        "language": "en",
        "author_name": "Clara and sophia",
        "slug": "962-kimberton-ct",
        "cover": "20230719_030716_d0733ae2ab90a056ddb13b5b377968ae.jpg"
    },
    {
        "podcast_id": 220213,
        "title": "Saga of the Change",
        "description": "<p>Post-apocalyptic Mage The Ascension campaign</p>",
        "language": "en",
        "author_name": "Benjamin Allen",
        "slug": "sagaofthechange",
        "cover": "20230719_010702_635459dfc70ce9cd09b4eea941d0c407.jpg"
    },
    {
        "podcast_id": 220219,
        "title": "Exodus: Rise Of The Infinites",
        "description": "<p>Angels, Demons, The Seven Horseman Of The Apocalypse And The Journey Of Tommy Sampson Navigating His New Reality As Exodus. The Newest Member Of The Infinites.</p>",
        "language": "en",
        "author_name": "Kenneth Matherly",
        "slug": "exodus",
        "cover": "20230719_030731_74aba54775c379ad40ec999b8eca9cc5.jpg"
    },
    {
        "podcast_id": 220464,
        "title": "Luganda Radio Podcast",
        "description": "<p>Luganda Radio Podcast is a station dedicated to the popularization and promotion of Luganda language in the diaspora. The presenter reads famous Luganda books and folktales to listeners to enjoy, reflect and learn about Luganda and the rich culture of the Baganda people. </p>",
        "language": "en-us",
        "author_name": "Martin Muganzi",
        "slug": "lugandaradiopodcast",
        "cover": "20230720_110720_c550d1ac194069ea6dade7e659ade242.jpg"
    },
    {
        "podcast_id": 220673,
        "title": "All podcast | Podcast Life",
        "description": "<p>For paid promotion:-</p><p>podcast.life09@gmail.com</p>",
        "language": "en",
        "author_name": "Podcast Life",
        "slug": "podcast-life",
        "cover": "20230722_010746_b63d09514837295801c1ba4c24843123.jpg"
    },
    {
        "podcast_id": 221320,
        "title": "Datura, The Long Road",
        "description": "<p>This is the audio version of my book,  Datura, the long road,  which you can read as I put it out on either wattpad or neobooks, under the name Datura. This initial work is an urban fantasy with elements of horror and romance throughout! Uploads will be semi frequent till catching up with the book,  which is currently in its second of three acts!</p>",
        "language": "en",
        "author_name": "Agni Dolliver",
        "slug": "datura",
        "cover": "20230727_120705_1e9be8da65d6d8856fc82dd26fa5de00.jpg"
    },
    {
        "podcast_id": 221648,
        "title": "The Adventure of Lily",
        "description": "<p>Welcome to \"The Adventures of Lily\": Tales of Adventure!\" Embark on an exhilarating journey with us as we bring you captivating stories from daring adventurers across the globe. Each episode will take you to far-flung corners of the earth, where our intrepid guests will recount their most thrilling, heartwarming, and jaw-dropping experiences.</p><p>From conquering majestic mountains and traversing dense jungles to surviving treacherous expeditions and encountering awe-inspiring cultures, our podcast will immerse you in the essence of adventure. Delve into the triumphs and challenges faced by explorers as they share their raw and unfiltered accounts of the great unknown.</p><p>Whether it's a solo escapade to find self-discovery, a team endeavor pushing the limits of human endurance, or a serendipitous encounter that changed lives forever, \"The Adventures of Lily captures the essence of wanderlust and the thrill of exploration.</p><p>Join us every week as we weave together these tales of courage, resilience, and the unyielding spirit of adventure. So, fasten your seatbelts, put on your headphones, and get ready to embark on an unforgettable auditory expedition with \"The Adventures of Lily Tales of Adventure - because the world awaits, and extraordinary stories beckon!</p>",
        "language": "en",
        "author_name": "Allwin Rex",
        "slug": "allwin-rex",
        "cover": "20230729_040738_22f4e32fad154e6dd53f85ad887fdb75.jpg"
    },
    {
        "podcast_id": 221851,
        "title": "Little chicken and bob",
        "description": "<p>Reverse wired and delusional! Here to have fun!</p>",
        "language": "en",
        "author_name": "Maggie and raegan",
        "slug": "chicken-little-and-bob",
        "cover": "20230730_110741_e08903af546154c358a6f5580f9b5188.jpg"
    },
    {
        "podcast_id": 222059,
        "title": "Last Coliseum",
        "description": "<p>Gutted and left for dead, ex-arena brawler Haytham comes home to take revenge against the brother who betrayed him.</p><p>New episodes every Monday!</p>",
        "language": "en",
        "author_name": "Josh Call",
        "slug": "lastcoliseum",
        "cover": "20230801_060807_116dd48c029e803491edac7ec3d78c2e.jpg"
    },
    {
        "podcast_id": 222134,
        "title": "Jack Malone, Private Dick ",
        "description": "<p>AI Generated Stories of Detective Jack Malone working different cases, sometimes supernatural ones. Follow along as he continues to try and solve each one.</p>",
        "language": "en",
        "author_name": "Jack Malone",
        "slug": "redactedmedia",
        "cover": "20230803_060814_dfe909f46d983d1453e724fe812bb866.jpg"
    },
    {
        "podcast_id": 222177,
        "title": "Dope-N-Mean ",
        "description": "<p>Dope-N-Mean Podcast serving you a dopamine broadcast.</p><p>Tips Welcome on CashApp: $dopenmeanpodcast</p><p>(If you want your tip to go to a specific person, type their name or episode number in the \"for\" line. Thank you!)</p>",
        "language": "en",
        "author_name": "Brittani",
        "slug": "dopenmeanpodcast",
        "cover": "20230801_110846_6452c83b929b2b661aa88d04ae9e7552.jpg"
    },
    {
        "podcast_id": 222275,
        "title": "$hit talk",
        "description": "<p>nun too special</p>",
        "language": "en",
        "author_name": "mikel silvia ekow uche",
        "slug": "talking-fornogoodreason",
        "cover": "20230802_020807_8f43895295984f304f7c6c57f4be4195.jpg"
    },
    {
        "podcast_id": 222316,
        "title": "Looking for Sally ",
        "description": "<p>A quiet family man is confronted with the departure of his psychotic wife and decides that he must bring her back at all costs. Taking his teenage daughter on a wild road trip, he is soon overtaken by the vengeful spirit of a dead serial killer who infuses him with his homicidal madness.</p><p>Looking for Sally the podcast - October 2023</p><p>Created by Stéphanie Munch</p><p>2023 All rights reserved</p>",
        "language": "en",
        "author_name": "Stéphanie Munch ",
        "slug": "lookingforsally",
        "cover": "20230802_050826_dcd72ca14a70f8fdb273715d616c7437.jpg"
    },
    {
        "podcast_id": 222510,
        "title": "Harry Styles: Dream with me.",
        "description": "<p>Intenta dormir mientras Harry Styles te habla con gentileza.</p>",
        "language": "en-us",
        "author_name": "Rodrigo Pedroza",
        "slug": "harrystylesdream",
        "cover": "20230804_010832_18df2c2f8ba00d37ae44a5b25ffc2fa8.jpg"
    },
    {
        "podcast_id": 222606,
        "title": "Udti Patang | A Stirring Story By Smriti Bhatheja",
        "description": "<p><strong>Udti Patang</strong> is a <strong>beautiful love story</strong>, set in the capital of <strong>India</strong>, year <strong>1969</strong>. The story and portrayal is dominantly influenced by the cultural and linguistic approach of Punjab.</p><p>The <strong>protagonists</strong>, Guru and Bani lay out a beautiful display of <strong>Love, Compassion, Sacrifice </strong>and<strong> Accomplishments</strong> through out the play.</p><p>Other respective characters like the <strong>family and friends</strong> of the protagonists have very <strong>distinctive characteristics</strong> and each role adds its own essential value to the play to make it <strong>exceptionally distinguished</strong>.</p><p>There’s <strong>drama</strong> of course, but it substantially involves <strong>emotion</strong> of love and <strong>romance</strong>, <strong>aggression</strong> and <strong>militance</strong> with a hint of <strong>humour</strong> and <strong>political</strong> semblance of varied personalities and psychologies respectively.</p><p>The Stirring Stories, as the name suggests is all about the stories that are fictional but very close to the reality of Life. Every Life on Earth is beautifully full of Drama with a multitude of emotions - This channel just intends to channelize those emotions and stir them up to the surface in form of smiles, tears and goosebumps. Some stories might evoke some memories, some may sound like your own story and some will be just amusing to ears!</p>",
        "language": "hi",
        "author_name": "Smriti Bhatheja",
        "slug": "udtipatang",
        "cover": "20230804_070811_3bc8e72117c56e856620abde36a377c1.jpg"
    },
    {
        "podcast_id": 223355,
        "title": "Mortuus Est: Origins",
        "description": "<p>Thirty years before the events of <em>Mortuus Est: Legacy, </em>Nico and Lawrence, alongside Hera Marroquin Silva, are working as part of Operation: Zeus, a covert paramilitary unit led by the Tactical Defense Department (TDD). Everything changes when a mission goes awry.</p><p>Series Page: <a href=\"https://bit.ly/me-origins\">https://bit.ly/me-origins</a></p><p>Instagram:<a href> @mortuusestseries</a></p><p>Twitter: <a href>@MortuusEst__</a></p>",
        "language": "en",
        "author_name": "Crazy10 Entertainment",
        "slug": "mortuusestorigins",
        "cover": "20230809_110818_007503b7188df7a94b02aba2904927ca.jpg"
    },
    {
        "podcast_id": 223944,
        "title": "Silly Cat Podcast",
        "description": "<p>just two cats in a big world. Named after mason's animal crossing island. Talks of serious things</p>",
        "language": "en",
        "author_name": "Mason and Aster",
        "slug": "sillycat",
        "cover": "20230814_010823_e060268785a6ee9871c64f1ab971aca7.jpg"
    },
    {
        "podcast_id": 224078,
        "title": "slackwoods",
        "description": "<p>this show talks about the music producer called slackwoods, who started his carrer on a windows 7 in 2020, and still going, we did some questions like why he doesnt update to a newer OS.</p>",
        "language": "en",
        "author_name": "flyx",
        "slug": "slackwoods",
        "cover": "20230814_090846_8198dc715c423861dad626260191f3ec.jpg"
    },
    {
        "podcast_id": 224190,
        "title": "Revelaciones",
        "description": "<p>Revelaciones es un podcast hecho por un grupo de estudiantes de grado 6A 2022-2023 del colegio CIEDI.</p><p>Créditos: Thomas Caballero, Martín Fajardo, Danna Isabella Díaz, Juan Diego Gómez, Esteban Villamil y Juan Sebastián Payome.</p>",
        "language": "es",
        "author_name": "Revelaciones Studio",
        "slug": "revelaciones-studio",
        "cover": "20230815_030829_be67899d1c89b2517ecab66c65006eb4.jpg"
    },
    {
        "podcast_id": 224363,
        "title": "رادیو پردیس",
        "description": "<p>با هم به دنیای ادبیات ایران و جهان و موسیقی هایشان قدم میگذاریم. اوقات تنهایی ، خلوت ، بیکاری با من علی قصری باش</p>",
        "language": "fa",
        "author_name": "ali ghasri",
        "slug": "radiopardis",
        "cover": "20230816_030826_e1f2679e9b2bb5d776b0d524b3fd13e3.jpg"
    },
    {
        "podcast_id": 224640,
        "title": "the evan cleghorn collection",
        "description": "<p>a collection of my first songs :)</p>",
        "language": "en",
        "author_name": "Evan Cleghorn",
        "slug": "theevancleghorncollection",
        "cover": "20230818_060825_58803ee031bc82fe23aeeb2f5c96eb45.jpg"
    },
    {
        "podcast_id": 224968,
        "title": "Seven Strands",
        "description": "<p><strong>This is a fictional story of a Girl named Hazel. This is the first episode where Hazel is embarking her journey towards new adventures, she boards the train for the first time in her life that too all by herself, let us see where life takes her. This story is originally written by Harshita Jaiswal, out of her love to tell good stories to the people. Hope it is fulfilling the purpose to entertain the reader.</strong></p>",
        "language": "en",
        "author_name": "Harshita J.",
        "slug": "harshitaa",
        "cover": "20230820_050845_f1606daae7eb6d0fa1f13b0289890e42.jpg"
    },
    {
        "podcast_id": 224991,
        "title": "The REALEST words about my life you'll EVER hear! ",
        "description": "<p>Pre-Warning/Trigger Warning!- I'ma nut job lol I'm loud, I cuss, I'm dramatic BUT NOT exaggerative! I switch thought processes quickly lol and this podcast includes the following: </p><p>Child abuse including sexual abuse, domestic violence, drug and alcohol addiction, rape, suicide attempts, depression, and gang violence..might be more not so good things lol </p><p>Finally I am ready to bare the truth no holds barred. Regardless of ANYONE else's feelings. This is MY LIFE, what IVE been thru and SURVIVED from! And this is the ONLY LIFE I have to answer to at the end of this. So..y'all ready? And I put a trigger warning, so I'm not liable for anyone's reactions to this...ijs. </p>",
        "language": "en",
        "author_name": "Filter-Free-Mama",
        "slug": "therealestwordsyoulleverhear",
        "cover": "20230820_070848_cd45496edf85a80ef9a9bbf699309e39.jpg"
    },
    {
        "podcast_id": 224997,
        "title": "As Luck Would Have It // M:tA 20th anniversary",
        "description": "<p>An actual play of Mage: The Ascension 20th anniversary edition, \"As Luck Would Have It\" is the story of several grad students awakened as mages, under the guidance of their physics professor, and the trials and tribulations that they endure as they learn about their new lives in the World of Darkness.</p>",
        "language": "en",
        "author_name": "Sako Tumi",
        "slug": "alwhi",
        "cover": "20230823_050811_2aad8f2b197825eb85093c2135af156d.jpg"
    },
    {
        "podcast_id": 225335,
        "title": "Historias de las Almas Sin Rumbo",
        "description": "<p>Explorando el lado más profundo del ser humano, los sentimientos y emociones que nos hacen sentir perdidos en el mundo A través de distintos relatos y testimonios quiero mostrarles como la vida puede ser complicada, pero también como podemos encontrar luz en la oscuridad</p>",
        "language": "es",
        "author_name": "Christian Cardoza",
        "slug": "historias-de-las-almas-sin-rumbo",
        "cover": "20230822_050844_ea8f8a6f51b7d7a0782b7e4cd813aebe.jpg"
    },
    {
        "podcast_id": 225379,
        "title": "嗨！一起噹朋友嗎",
        "description": "<p>先隨便發笑死</p>",
        "language": "zh",
        "author_name": "嗨！一起噹朋友嗎",
        "slug": "emono123",
        "cover": "20230822_110835_dca755d6464cf7c8b930635e1ba7b9cb.jpg"
    },
    {
        "podcast_id": 225453,
        "title": "Batman II Audio Play Based on the Unused Batman Returns Sam Hamm Script",
        "description": "<p>Batman II Audio Play Based on the Unused Batman Returns Sam Hamm Script</p>",
        "language": "en",
        "author_name": "Gareth Packham",
        "slug": "batman2",
        "cover": "20230823_110815_ab86d341614aa9a5a76a9b8c5deec757.jpg"
    },
    {
        "podcast_id": 225523,
        "title": "unemployment in california",
        "description": "<p>be on hold with me while i wait on hold to speak with a person at edd.</p>",
        "language": "en",
        "author_name": "ELISA BECERRA",
        "slug": "myworldonhold",
        "cover": "20230823_060851_4ebbf20bbda563cbc42ae53cb246f141.jpg"
    },
    {
        "podcast_id": 225551,
        "title": "Mumbuki, le policier",
        "description": "<p>Dans un monde où les mystères et les phénomènes occultes semblent régner en maîtres, il est facile pour les hommes de succomber à la fascination de la toute-puissance. Les histoires de pouvoirs surnaturels et d'êtres aux capacités extraordinaires peuvent éveiller en nous une tentation de croire que nous aussi, nous sommes capables de tout. Pourtant, il est crucial de réaliser que cette toute-puissance n'est pas absolue, qu'elle a ses propres limites et que les hommes doivent en être conscients. Un exemple frappant de cette erreur de jugement peut être observé chez le policier ​Mumbuki, dont l'arrogance et la confiance en sa capacité à manipuler les événements le mènent vers des conséquences inattendues et dangereuses.</p><p>Dans cette histoire, maître Omra yezal explorera les dangers qui guettent ceux qui se laissent aveugler par l'apparente toute-puissance des forces occultes. Nous suivrons les pas de Mumbuki, un homme sûr de lui, mais qui se retrouvera confronté aux limites de ses propres pouvoirs, mettant en jeu sa vie et celles de ceux qui l'entourent. À travers son parcours, nous découvrirons que la véritable force réside dans la compréhension des limites de ce monde et surtout dans l'humilité de reconnaître que nous ne sommes pas tout-puissants et dans la prudence de ne pas se laisser aveugler par des illusions de grandeur que vendent les apprentis et autres bandits de la mystique et de l occulte</p><p>Alors, plongez dans cette histoire captivante où la tentation de la toute-puissance se heurte à la réalité des limites humaines. Une invitation à la réflexion sur notre nature et sur la place que nous occupons dans un univers où les forces occultes peuvent sembler fascinantes, mais où elles ne sont pas invincibles.</p><p>rendez vous pour le premier épisode de umbuki le policier......très bientôt</p>",
        "language": "fr",
        "author_name": "Compaoré oumarou ",
        "slug": "omrayezal",
        "cover": "20230823_090842_7b0f05716923098a668bf73205105341.jpg"
    },
    {
        "podcast_id": 226060,
        "title": "Tales From the Janitor",
        "description": "<p>Tales from the Janitor - An urban legend series where the listener is taken through ghost stories, science fiction adventures and creepy unexplained events in history. A series of short stories covering elements of crime, horror, drama and comedy. A series about people of different backgrounds committing murders, suicides, rituals, and other events caused by the unknown and where ordinary people find themselves in extraordinarily situations.</p>",
        "language": "en",
        "author_name": "Janitor Productions",
        "slug": "tales-from-the-janitor",
        "cover": "20230912_120937_77249be3210c9e8336090fc5b873cc26.jpg"
    },
    {
        "podcast_id": 226073,
        "title": "The Amazing Spider-Man: The Audio Drama",
        "description": "<p>The Amazing Spider-Man is a twelve-part Audio Drama based on \"The Amazing Spider-Man Vol. 1\". With the first season going over the early issues of the 1960s along with his debut, Amazing Fantasy #15. Witness a modernized retelling of these classic Spider-Man stories given to us decades ago by Marvel Comics!</p><p>Reach out via panelismprod@gmail.com!</p>",
        "language": "en",
        "author_name": "Connor Scott",
        "slug": "theamazingspiderman",
        "cover": "20230827_040808_6b963969ba29dd382e72a1791871c23a.jpg"
    },
    {
        "podcast_id": 226082,
        "title": "Forde Podcast",
        "description": "<p>Forde Podcast brings you life fact stories, motivational stories and humanities </p>",
        "language": "en",
        "author_name": "Prince Akoto",
        "slug": "forde",
        "cover": "20230827_050831_e50e820e0c0f5ac7498d943fe13f8838.jpg"
    },
    {
        "podcast_id": 226124,
        "title": "On The Road ",
        "description": "<p>On the road never off</p>",
        "language": "en",
        "author_name": "Jkalen Jones",
        "slug": "ontheroadpodcast",
        "cover": "20230827_100853_918dee80f425e8fb18f9387817bd2180.jpg"
    },
    {
        "podcast_id": 226275,
        "title": "The C.U.N.T Podcast",
        "description": "<p>The Podcast You've Been Waiting For!</p><p>NEW EPISODE EVERY TUESDAY!!</p><p>Welcome to The C.U.N.T Podcast!</p><p>For inquiries, please contact us at:</p><p>nexttuesdaypodcast101@gmail.com</p>",
        "language": "en",
        "author_name": "Next Tuesday Podcast",
        "slug": "nexttuesdaypodcast",
        "cover": "20230828_100858_63819d799fc109df648e8a0c1b39a54c.jpg"
    },
    {
        "podcast_id": 226305,
        "title": "Udderly Terrifying",
        "description": "<p>When the farmer's away, the cows will play! Join Bluebell and Marcy as they dive into the good, the bad, and the absolute campiest the horror genre has to offer. New episodes every Friday!</p>",
        "language": "en",
        "author_name": "Udderly Terrifying",
        "slug": "udderly-terrifying",
        "cover": "20230829_010838_334981cda3e61219e574539d34de3b07.jpg"
    },
    {
        "podcast_id": 226485,
        "title": "miguelpasha özel v2",
        "description": "<p>parayı çok düşünen tek adam.</p>",
        "language": "tr",
        "author_name": "miguel v2",
        "slug": "miguelbestv2",
        "cover": "20230830_120850_130b66ebf96afa1e59f47029d6a8c879.jpg"
    },
    {
        "podcast_id": 226500,
        "title": "Am I the asshole podcast",
        "description": "<p>Am I the asshole podcast is about taking some of the craziness stories on the internet and talking about them </p>",
        "language": "en",
        "author_name": "Am I The Asshole Podcast",
        "slug": "am-i-the-asshole-podcast",
        "cover": "20230830_030800_5ade5d4796bc8211dbcd24b3d1a6d08f.jpg"
    },
    {
        "podcast_id": 226627,
        "title": "Goblin Hour",
        "description": "<p>In this exciting paranormal podcast, I – along with some incredible guests – take a look at evidence or tales of the unexplainable happening. Join us as we investigate, ridicule, and joke about the some of the spookiest stories around while inevitably getting off topic.</p>",
        "language": "en",
        "author_name": "Benjamin Snyder",
        "slug": "goblinhour",
        "cover": "20230918_100917_85158e7517aae7d36742cb337f3363cc.jpg"
    },
    {
        "podcast_id": 226887,
        "title": "Shadow of the Badge",
        "description": "<p>\"Shadows of the Badge\" is a gripping 10-episode fiction series that delves into the moral gray areas of law enforcement. The story follows Detective Daniel Morgan, a respected and decorated officer with the city's police force. To the public, he is a hero, but behind the scenes, he leads a double life as a crooked cop involved in shady dealings. Each episode unravels a layer of deceit, as Detective Morgan's actions become increasingly complex and morally ambiguous.</p>",
        "language": "en",
        "author_name": "Aime Studios",
        "slug": "shadowsofthebadge",
        "cover": "20230905_110913_177fdc1d35ea7eec948c0393b8a1a770.jpg"
    },
    {
        "podcast_id": 226902,
        "title": "Different Perspectives",
        "description": "<p>Different perspectives are a series of short stories about drug and alcohol addiction or abuse. </p>",
        "language": "en",
        "author_name": "Brittni G Trammell",
        "slug": "btrammellradio",
        "cover": "20230902_030925_a62b4acd36e9c0acbe6691c5d9ba61dd.jpg"
    },
    {
        "podcast_id": 227405,
        "title": "Fantastic 4",
        "description": "<p>2023 fantastic 4</p>",
        "language": "en",
        "author_name": "F4",
        "slug": "asj",
        "cover": "20230906_010912_f70058d0eee27fe68161b5cc8a7c57b2.jpg"
    },
    {
        "podcast_id": 227598,
        "title": "WeVoice Africa",
        "description": "<p>spreading africa's voice across the world!</p>",
        "language": "en",
        "author_name": "WeVoice Africa",
        "slug": "wevoiceafrica",
        "cover": "20230907_090957_e76bffc4fdfd8948f190122fb060adc8.jpg"
    },
    {
        "podcast_id": 227920,
        "title": "Kaput Kitsch™",
        "description": "<p><strong>Kaput:</strong> This is a German loanword that has been adopted into English. It means \"broken\" or \"no longer functioning.\"</p><p><strong>Kitsch:</strong> Kitsch refers to art, objects, or design that is considered in poor taste, overly sentimental, or gaudy. It is often characterised by its low artistic value and a shallow or excessive focus on superficial aesthetics.</p>",
        "language": "en",
        "author_name": "STEALING HORSES™",
        "slug": "kaputkitsch",
        "cover": "20230909_020914_e030706742641a18186ed0e3b53ecd69.jpg"
    },
    {
        "podcast_id": 228369,
        "title": "Terry Pratchett - Strata Audiobook (Full Audiobook) ",
        "description": "<p>Born Terence David John Pratchett, Sir Terry Pratchett sold his first story when he was thirteen, which earned him enough money to buy a second-hand typewriter. His first novel, a humorous fantasy entitled <em>The Carpet People</em>, appeared in 1971 from the publisher Colin Smythe.Terry worked for many years as a journalist and press officer, writing in his spare time and publishing a number of novels, including his first Discworld novel, <em>The Color of Magic</em>, in 1983. In 1987, he turned to writing full time.There are over 40 books in the Discworld series, of which four are written for children. The first of these, <em>The Amazing Maurice and His Educated Rodents</em>, won the Carnegie Medal.</p>",
        "language": "en",
        "author_name": "Raghvendra Singh",
        "slug": "terry-pratchett-strata",
        "cover": "20230912_040919_79bb7a2e6a22e46ba9374e4d889d1f03.jpg"
    },
    {
        "podcast_id": 228426,
        "title": "Mutual Interest",
        "description": "<p>Two cousins who have been best friends from birth bring you a podcast of chisme, TMI Talks, family drama, and so much more. Kassey Serrano and Desairee Vasquez are two personalities that will make you crave more so hurry up and watch, because you will become obsessed. Like watch it right now. Like you think we can't see you...</p>",
        "language": "en",
        "author_name": "Kassey Serrano & Desairee Vasquez",
        "slug": "mutual-interest",
        "cover": "20230912_100934_a4ff371bf083f21f3c71660949994b11.jpg"
    },
    {
        "podcast_id": 228964,
        "title": "The Lord of the Rings Disc 1",
        "description": "<p>The Lord of the Rings is a series of three epic fantasy adventure films directed by Peter Jackson, based on the novel The Lord of the Rings by British author J. R. R. Tolkien. The films are subtitled The Fellowship of the Ring, The Two Towers, and The Return of the King</p>",
        "language": "en",
        "author_name": "Raghvendra Singh",
        "slug": "the-lord-of-the-rings",
        "cover": "20230916_070924_210baedf15578b2d1d50db2723759308.jpg"
    },
    {
        "podcast_id": 229125,
        "title": "Kimaya's Closet",
        "description": "<p>Listen to sweet, short and immersive stories delivered to your ears. Stories range from innocent, dramatic, to full on erotic.</p><p>You choose your desires.</p><p>If you're into gritty, unapologetic stories that don't lineup with general customs and norms, or you're just feeling naughty, this podcast is for you.</p>",
        "language": "en",
        "author_name": "Kimaya Sloane",
        "slug": "kimayascloset",
        "cover": "20230918_060942_3bfac042d5c189222ad38010f2b9767b.jpg"
    },
    {
        "podcast_id": 229228,
        "title": "The Carpet People by Terry Pratchett Audiobook ",
        "description": "<p>\"In the beginning, there was nothing but endless flatness. Then came the Carpet.\" That’s the old story that every tiny citizen of the empire found in the Carpet knows. But now a new story is in the making. The story of Fray, sweeping a trail of destruction across the Carpet, of power-hungry villains wreaking havoc, and of two brothers on an adventure to end all adventures.</p><p>It's a story that will come to a terrible end—if someone doesn't do something about it. If everyone doesn't do something about it...</p><p>First published in 1971, this novel marked the debut of Sir Terry Pratchett, storyteller extraordinaire. Years later, Sir Terry revised his early work. This edition includes the updated text, his original illustrations, and the original short story that was the forerunner to The Carpet People.</p><p>Discover more of Sir Terry's fierce and funny tiny heroes in The Wee Free Men and The Bromeliad Trilogy!</p>",
        "language": "en",
        "author_name": "Raghvendra Singh",
        "slug": "the-carpet-people",
        "cover": "20230918_070918_a670c41073e6d52e23415e9e220f90fd.jpg"
    },
    {
        "podcast_id": 229269,
        "title": "the buddies podcast.",
        "description": "<p>welcome to the buddies podcast! this podcast was crafted in 2021 but here we are making it work in 2023! on this podcast, lani will be talking to/interviewing their friends about wrestling, video games, hobbies, etc! this is all shits and giggles, so don't take anyone seriously. enjoy the show!</p>",
        "language": "en",
        "author_name": "lani geraldine",
        "slug": "thebuddiespodcast",
        "cover": "20230919_120944_716ee8ade98ca357472c85c2931437c2.jpg"
    }
]