[
    {
        "podcast_id": 669,
        "title": "Eco Futures - Welcome to the New Generation of Planet Restoration: Join the Evolution",
        "description": "A podcast/radio program from Australia about the environment, conservation, climate change and living sustainability in an earth of ever diminishing resources and more waste. The program is based in Byron Bay though the issues we cover affect all people and planet Earth. Your host Michelle Michels has updates, interviews and stories about climate change, conservation, indigenous perspectives on land management, ecology, energy and sustainability topics. Local, national and international topics are discussed. Local communities, academics, activists and anyone concerned about the environment speak about their concerns and projects. \n Included is the project on Modern Slavery legislation in Australia, kindly funded by the Community Broadcasting Foundation. Written and produced by Michelle Michels in collaboration with Jodee Sydney (aired on Bay FM 'Eco Futures' from June 2020 - March 2021).  \nWeekly program broadcast on www.bayfm.org 11 am -12 pm Wednesdays available online https://www.bayfm.org//shows/eco-futures/",
        "language": "en",
        "author_name": "Michelle Michels",
        "slug": "ecofuturesradio",
        "cover": "20210310_044523_4ebb025435cbe8f8ec8b6fc9767ee419.jpg"
    },
    {
        "podcast_id": 14524,
        "title": "Довколаботаніка",
        "description": "Подкаст про ботаніку та інші природничі науки",
        "language": "uk",
        "author_name": "Oleksii Kovalenko",
        "slug": "dovkolalabotanika",
        "cover": "20201112_124058_e33ef75097a3d68091d92ea2d09562fe.jpg"
    },
    {
        "podcast_id": 14659,
        "title": "For the love of weather",
        "description": "Meet Gemma and Aisling. They have worked in the UK as meteorologists for over ten years. Gemma came up with the idea that maybe others might like to listen to the non stop conversations they still have all these years later about the weather.\n\nOver the years they have forecast for festivals, farming, road, rail, energy, media, aviation and even the humble ice cream demand forecast and so much more. They have gone through job changes, life changes and delved in and out of many hobbies and somehow the weather still weaves in and out of their lives. \n\nSo this podcast is for anyone who would like to join our weather conversations and wherever the jet stream may take us!\n                                   \nWe hope you join us for our bi weekly chat and leave each episode loving the weather just that little bit more.",
        "language": "en",
        "author_name": "Gemma Plumb & Aisling Creevey",
        "slug": "for-the-love-of-weather",
        "cover": "20201117_204905_44c7c33c7ced457da5272cf078496f9d.jpg"
    },
    {
        "podcast_id": 17889,
        "title": "Siren Sundays",
        "description": "Reconnecting people with nature; 🌎Saving the world one ocean at a time, w/one conversation at a time 🎥🧜🏽‍♀️",
        "language": "en",
        "author_name": "Lashanti Jupp",
        "slug": "sirensundays",
        "cover": "20201214_115012_4251fca625f2e13699eb8dcdd924151f.jpg"
    },
    {
        "podcast_id": 20916,
        "title": "Nero's Fiddle",
        "description": "Global warming - we know what's happening. We know what we can do about it. What we don’t understand is why we won’t take the measures necessary to stop it. Nero's Fiddle will trace the arrow of history that brought us to this point. I will explain how we got here, why we haven’t begun to tackle the difficult issues of climate change, and what we can do to end our current climate malaise and begin to address climate change in a meaningful way.",
        "language": "en",
        "author_name": "Brad Brown",
        "slug": "nerosfiddle-episode1",
        "cover": "20210118_055146_ef220c676256255b5647a3c07eb23229.jpg"
    },
    {
        "podcast_id": 27740,
        "title": "One World Podcast",
        "description": "Climate change and pollution are gradually endangering the Earth’s vitality. Join podcast leaders Tristan Miller and David Han in their endeavor to interview impressive individuals and organizations that strive to create a greener, more sustainable future. Each episode contains powerful information that depicts the work of environmental pioneers who are the beacons of tomorrow. The One World Podcast is the Orange County Climate Reality Project’s official podcast. \n",
        "language": "en",
        "author_name": "Climate Reality OC",
        "slug": "oneworldpodcast",
        "cover": "20210127_014502_912bf4af5b610b9fc18a1fad83fa2e98.jpg"
    },
    {
        "podcast_id": 31982,
        "title": "Down To Earth",
        "description": "Climate change tends to trigger strong emotions. There is a lot of noise surrounding the concept. It’s complex, abstract but the impact is very real and every single person on planet Earth is concerned. The story tends to be pretty gloomy but four keen Imperial College beans pursuing a master in Climate Change, Management and Finance decided to shift the narrative. Down to Earth is a podcast which aims at reuniting people on our power to act together. Through different episodes, Danielle, Marie, Chris and Anne-Laure go beyond the infuriating climate news and critically look at how sustainability is approached in different local contexts. Curiosity and climate justice are at the very heart of this podcast. We believe a better understanding of different and unknown realities allows for a stronger collective action on climate change.",
        "language": "en",
        "author_name": "Danielle Miranda Leibu, Marie Neveu, Anne-Laure Rajaona, Chris van Der Merwe",
        "slug": "downtoearth",
        "cover": "20210218_112354_2fa20bb4c96d0b9f699bb4e40797e87a.jpg"
    },
    {
        "podcast_id": 37005,
        "title": "RECOUP Pledge2Recycle Plastics",
        "description": "<p>As part of the resource and recycling charity RECOUP, Pledge2Recycle Plastics is the citizen and engagement team.  We focus on cutting the confusion about plastics recycling. With over 30 years experience in the industry, RECOUP bring you the facts and evidence from the plastics resource and recycling industry.</p>",
        "language": "en",
        "author_name": "RECOUP",
        "slug": "pledge2recycle",
        "cover": "20210301_094123_feb04f890933da29d264f6674038687b.jpg"
    },
    {
        "podcast_id": 38780,
        "title": "ReEnergizing Communities",
        "description": "Reducing energy use today means securing a safer, more affordable, and sustainable tomorrow. Hear from leaders across Southern California who are working to make a difference. Whether showing property managers and local governments better choices for energy use or highlighting opportunities for individuals in disadvantaged communities to pursue careers in energy and water efficiency, this podcast connects you to conversations that can help you influence change at home, at work, and in your community. ",
        "language": "en",
        "author_name": "SoCalREN",
        "slug": "reenergizingcommunities",
        "cover": "20210304_202510_538eb5e26841593d5b2dbca733f988a0.jpg"
    },
    {
        "podcast_id": 45847,
        "title": "Gin + Gems Podcast",
        "description": "This podcast will cover several life topics through a spiritual lens! Are you into something more solid? We'll talk about geology and crystals. What about divination? We have that too! What if you're trying to connect with your body or do some deep light and/or shadow work? We have you covered!",
        "language": "en",
        "author_name": "Gin and Gems Podcast",
        "slug": "ginandgems",
        "cover": "20210331_180809_fac73a15bdd7529c324ebc48ee57216d.jpg"
    },
    {
        "podcast_id": 49475,
        "title": "Papers Aloud",
        "description": "This podcasts features readings of open-access (CC BY) primary research articles and reviews relevant to evolutionary and cell biology, environmental and clinical microbiology, symbiosis, geobiology, and bioinformatics. \n\n\nI avoid Methods sections, and sometimes Results (depending on how amenable it is to reading out loud). Abstract, Introduction, Discussion, and Conclusions are always included.\n\n\nIf you are an author of a research article and would like to have your work converted to an audio format, or send me an audio recording of your paper, please reach out to rkdgarber@gmail.com.",
        "language": "en",
        "author_name": "Arkadiy Garber",
        "slug": "audiolit",
        "cover": "20210415_073451_2d764e8f8254c03bc6e85ac462a67a36.jpg"
    },
    {
        "podcast_id": 52488,
        "title": "CycloPod",
        "description": "showcasing work by early-career researchers that is of relevance to the cyclostratigraphic community",
        "language": "en",
        "author_name": "David De Vleeschouwer",
        "slug": "cyclopod",
        "cover": "20210427_065102_7c325ada14bb51896298b9baeca8cf63.jpg"
    },
    {
        "podcast_id": 52726,
        "title": "Conservation Talk Story",
        "description": "Conservation Talk Story is a storytelling forum for conservationists in Hawaii. We host experts on topics covering every aspect of conservation science, including mitigating human impacts, protecting rare species, and improving public education. Our goal is not only to increase awareness regarding specific conservation issues in the state but also to provide correct information, backed by science, to our listeners so they are equipped to make decisions about sustainability and conservation in their own lives. Hosted by Emily Sesno and Max Bendes, Conservation Talk Story is brought to you by the Hawaii chapter of The Society for Conservation Biology (HISCB) with support from KTUH.",
        "language": "en",
        "author_name": "Max Bendes",
        "slug": "contalkstory",
        "cover": "20210428_033503_657810a74d62dd6f64651e8f7d52cda8.jpg"
    },
    {
        "podcast_id": 53079,
        "title": "Klimakrøller",
        "description": "<p>I Klimakrøller bliver vi klogere på de emner, som hverken er så ligetil at forstå eller blive enige om, når det gælder jordens klima. Værter: Jakob Fritzbøger Christensen og Rasmus Arildsen. Produceret af GRØN - Fonden for Bæredygtig Udvikling i samarbejde med Sustainability Science Centre på Københavns Universitet. </p>",
        "language": "da",
        "author_name": "GRØN",
        "slug": "klimakroeller",
        "cover": "20230503_050539_899786105372d63529237cbcb8af363d.jpg"
    },
    {
        "podcast_id": 54609,
        "title": "Chester is Rising",
        "description": "Arson, break-ins, death threats, the Ku Klux Klan - all tried to stop her.\n\nZulene Mayfield is a zealous resident whose family is being poisoned by one of the United States’ largest trash incinerators. Her hometown, the city of Chester, Pennsylvania, was invaded by a unique clustering of solid waste facilities in the late eighties and early nineties. Her activism fostered Supreme Court cases which sparked the US environmental justice movement, but after a decade of leading the fight, she vanished in 2001. \n\nAfter nearly twenty years of lurking in the shadows, Zulene resurfaces in 2019. She connects with a local podcaster to not only tell her story, but make one thing abundantly clear: she will reclaim Chester’s right to breathe.\n",
        "language": "en",
        "author_name": "David DeMarco",
        "slug": "chesterisrising",
        "cover": "20210505_174231_75663f39067ec4b88c6ff40b30b1d532.jpg"
    },
    {
        "podcast_id": 57528,
        "title": "Climalytics",
        "description": "Climate change is real, and it is important to stay informed about it so we can work to reduce its impact. Climalytics provides an analysis of the past, present, and future of the climate crisis including the factors that have positively and negatively changed its trajectory. Follow @climalytics on instagram for updates and sustainability recommendations!",
        "language": "en",
        "author_name": "Gabriella Cate",
        "slug": "climalytics",
        "cover": "20210518_070230_c3e35e80fb28ea9c3e11217e9e8e0e32.jpg"
    },
    {
        "podcast_id": 60200,
        "title": "Weather or Not?",
        "description": "From Tropical Talk to Space Chats, Climate Change, and Environmental Concerns, will any of them impact you?",
        "language": "en",
        "author_name": "WSVN-TV",
        "slug": "weatherornot",
        "cover": "20210531_182944_1295ffb083ac8e753ef61aa31d8459af.jpg"
    },
    {
        "podcast_id": 61518,
        "title": "Taste sustainability_ Wired X PasquaWines",
        "description": "Taste sustainability_ Wired X PasquaWines",
        "language": "en",
        "author_name": "Pasqua Wines",
        "slug": "tastesustainability-wiredxpasquawines",
        "cover": "20210610_201948_91a36f11373659329883a5309c0c7d6d.jpg"
    },
    {
        "podcast_id": 62206,
        "title": "Is It All Just A Game? ",
        "description": "This is GoogliBearjr's podcast where they talk about reality and game design, and what the world would look like and change if the game was real! \n\nGoogli has a background in environmental studies and is currently studying for her master's in sustainability. She has been playing video games since she was little.",
        "language": "en",
        "author_name": "Googlibearjr",
        "slug": "googlitalks",
        "cover": "20210610_155248_76fa63c4a64c26624770318cb9d2db78.jpg"
    },
    {
        "podcast_id": 65324,
        "title": "Earth Lad's Roundup",
        "description": "Welcome to Earth Lad's Roundup! A show diving into the most pressing topics surrounding environmental sustainability, hosted by me, Michael Fanelli. In each episode, I'll round up some timely news and information related to the climate crisis, and we'll consider what it means for us humans, and what we can do about it. Come learn along with me as I attempt to get a grasp on the unwieldy beast that is climate change.",
        "language": "en",
        "author_name": "Michael Fanelli",
        "slug": "earthladsroundup",
        "cover": "20210811_045653_59a949830a2e41a41f160cc9e2be9bc8.jpg"
    },
    {
        "podcast_id": 67776,
        "title": "Clean Sailors podcast",
        "description": "Welcome to our Clean Sailors podcast!\n\nHosted by Clean Sailors founder, Holly, we talk all about sea, sailing and keeping it clean, exploring some of the areas in which sailing and our wider marine industry can become that bit cleaner. \n\nThrough conversations with experts, innovators, inventors and activists, all working towards the health of our seas, we showcase the people and projects changing the way things are done.\n\nWe believe great ideas should be shared so our podcast is free to appear on. If you've got a project, idea or topic you think we should be discussing - get in touch!",
        "language": "en",
        "author_name": "Clean Sailors Crew 🌊",
        "slug": "cleansailors",
        "cover": "20210714_103957_987d5c508296eed5c084e38049cb4b7a.jpg"
    },
    {
        "podcast_id": 69179,
        "title": "The Climate Discussion Nexus ",
        "description": "Join the Climate Discussion Nexus for more open debate on all aspects of climate change, especially better use of scientific information in public discussion and policy formation.",
        "language": "en",
        "author_name": "John Robson",
        "slug": "climatediscussionnexus",
        "cover": "20210721_175613_d621c7273dba48296a7180d61e366df0.jpg"
    },
    {
        "podcast_id": 72800,
        "title": "Restore Our Planet Podcast",
        "description": "<p>Welcome to the Restore Our Planet Podcast where we delve into the great minds of the heroes on the frontline of conservation across the UK and the Globe. </p><p>If you would like to donate to one of our causes: restoreourplanet.org/donate/ Or follow Restore Our Planet: </p><p><a href=\"https://www.linkedin.com/company/79297440/\">https://www.linkedin.com/company/79297440/</a> </p><p><a href=\"https://www.facebook.com/restoreourplanet/\">https://www.facebook.com/restoreourplanet/</a> </p><p></p><p><a href=\"https://twitter.com/Restore_Planet\">https://twitter.com/Restore_Planet</a></p><p></p><p><a href=\"https://www.instagram.com/restoreourplanetpodcast/\">https://www.instagram.com/restoreourplanetpodcast/</a></p>",
        "language": "en",
        "author_name": "Jack Cole",
        "slug": "restoreourplanet",
        "cover": "20210810_110706_5ec3e1fe33d520d99d557bb893446e12.jpg"
    },
    {
        "podcast_id": 88858,
        "title": "The Green Screen Podcast",
        "description": "Account run by University of Minnesota Duluth Student Association. College students talking about sustainability and a variety of topics associated with it! A new episode will be released each week so make to hit the follow button!  ",
        "language": "en",
        "author_name": "The Green Screen Podcast Group",
        "slug": "thegreenscreenpodcast",
        "cover": "20211110_231513_436ed1854457a828609e3ba17b3675b8.jpg"
    },
    {
        "podcast_id": 92799,
        "title": "Planet of the Klimates",
        "description": "POTK is the official podcast for KlimaDAO.\n\nKlimaDAO is blockchain protocol backed by carbon credits that gives people a chance to fight climate change as a collective. \n\nTune in the hear the latest news and insight regarding blockchain technology and climate science!",
        "language": "en",
        "author_name": "KlimaDAO",
        "slug": "potk",
        "cover": "20220212_060254_0aa21fd292c3156a3b3189c9db007ac0.jpg"
    },
    {
        "podcast_id": 94800,
        "title": "EKKERT RUSL",
        "description": "Ruslið okkar kemur upp um okkur segja sérfræðingarnir. EKKERT RUSL er að vonum skemmtilegt og lifandi hlaðvarp um umhverfismál í umsjón Lenu Magnúsdóttur, sem hefur verið umhverfissinni frá fæðingu og Margréti Stefánsdóttur, sem er ekki beint umhverfissinni en er öll af vilja gerð að læra. Við fáum til okkar skemmtilega og jafnvel óvenjulega gesti í samhengi við umhverfismál sem og viðmælendur sem þekkja hvað best til málanna.  Umhverfisvernd er heita kartaflan í dag – flestir hafa eitthvað til málanna að leggja, eða vilja það að minnsta kosti. Það er ekki nóg að kaupa Teslu og telja sig umhverfisverndarsinna - það þarf víst aðeins meira til. Kannski slæðast nokkrir fræðslumolar með inn á milli í þessu hlaðvarpi til þess að hjálpa venjulegum íslenskum heimilum að bæta sig í umhverfisvernd. Við sitjum víst öll í sömu súpunni og þurfum að hysja upp um okkur. Við getum þetta saman.\n",
        "language": "is",
        "author_name": "EKKERT RUSL - Lena og Margrét",
        "slug": "ekkert-rusl",
        "cover": "20211209_081209_20cf6f4ee84e902a58f514d3cb32561b.jpg"
    },
    {
        "podcast_id": 97138,
        "title": "Podcasting with Cass ",
        "description": "<p>Spiritual awakenings come in this form. Discover methods to heal from God. Learn about suave from Seth and learn about life experiences from Cass. If you are spiritual you’ll like this.</p>",
        "language": "en",
        "author_name": "Cassandra Bright",
        "slug": "ahealthydashofcass",
        "cover": "20230823_040844_797341bdbb7e540183f35ad5523f7633.jpg"
    },
    {
        "podcast_id": 102307,
        "title": "Here by the Owl (audiobook)",
        "description": "At the height of WWII, the United States plucked nine farm boys from across the country and sent them to a remote island in the Atlantic Ocean for what was designated a \"special mission.\" Here by the Owl is the untold true story of one of those farm boys, a native of the Blue Ridge Mountains named Robert Gray Shipley. While his pregnant wife Agnes is struck with a deadly illness back home, Shipley struggles to understand the horrifying reason why the leaders of the military have made his mission so vital. This full-length audiobook, performed by the author, uses interviews, historic newspaper and magazine articles, long-lost letters, and records from the National Archives to tell a true story of love, loss, and a forgotten Air Force mission that changed the world.",
        "language": "en",
        "author_name": "Evan Peter Smith",
        "slug": "here-by-the-bowl-audiobook",
        "cover": "20220120_060144_a840c58c697fdba4f686d747a6e8cc47.jpg"
    },
    {
        "podcast_id": 112641,
        "title": "RED: Abya Yala",
        "description": "RED: Abya Yala - Continental Communications : Communicaciones - Media : Medios",
        "language": "en",
        "author_name": "Tupak Huehuecoyotl",
        "slug": "redabyayala",
        "cover": "20220303_050304_73754651f38d1aad922aad30fa7176e2.jpg"
    },
    {
        "podcast_id": 116145,
        "title": "It’s Soil Not Dirt: A Geotechnical Engineering Podcast",
        "description": "From designing solar foundations to erosion hazard assessments, It’s Soil Not Dirt focuses on all aspects of geotechnical engineering and the topics that matter most today, with an emphasis on sustainability and renewables.",
        "language": "en",
        "author_name": "PRI Engineering",
        "slug": "soilnotdirt-geotechnical",
        "cover": "20220413_030438_7bec7a7da3343586a092f9714987b55e.jpg"
    },
    {
        "podcast_id": 119293,
        "title": "Way To Zero Waste",
        "description": "Bienvenidos al podcast de Way To Zero Waste, un espacio de entrevistas a los mejores profesionales de cada sector para tratar la sostenibilidad desde un enfoque crítico y con una mirada hacia los diferentes ámbitos donde esta puede ser aplicada.\n\nwww.waytozerowaste.com",
        "language": "es",
        "author_name": "Maria Cantó Martínez",
        "slug": "waytozerowaste",
        "cover": "20220401_040408_dfc4f41c0a3af30e17aa46d1674b131d.jpg"
    },
    {
        "podcast_id": 125348,
        "title": "The Everyday Wonders of Science",
        "description": "Rural communities are oftentimes neglected when it comes to science communication. This leaves individuals feeling excluded, negatively impacting their relationship with science. The aim of this project is to get more people, especially those in rural communities, to engage with science. For this project, I have created a podcast mini-series highlighting the ways that science impacts our daily lives. Episodes include How the Internet Connects Us, The Importance of Improving Water Quality, and Why the Scientific Method Isn’t Just for Scientists. In order to cater this podcast to rural communities, I have partnered with various public libraries across the state of Iowa to establish content areas of interest and ways to reach their patrons. The podcasts consist of interviews with professionals and faculty at the University of Iowa that have extensive experience in the areas of interest. These short episodes are intended to be easily digestible in order to get people excited about science and how it works without us even knowing.",
        "language": "en",
        "author_name": "Preston Johnson",
        "slug": "the-everyday-wonders-of-science",
        "cover": "20220429_040444_a0802896070364f862888623cf373d80.jpg"
    },
    {
        "podcast_id": 125950,
        "title": "Tér-kép-infó",
        "description": "Az Eötvös Loránd Tudományegyetem Térképtudományi és Geoinformatikai Intézetének podcastja térképekről, térinformatikáról, távérzékelésről és földtudományokról.",
        "language": "hu",
        "author_name": "ELTE Térképtudományi és Geoinformatikai Intézet",
        "slug": "terkepinfo",
        "cover": "20220502_060534_e7109b65be25b097f5ff88f121ff5214.jpg"
    },
    {
        "podcast_id": 129177,
        "title": "Y.E.A.! il podcast green degli studenti",
        "description": "Un podcast creato dai ragazzi di una scuola media montessoriana, una serie di episodi fresh and cool a tema green, \"visto l'ambiente\", che proveranno a raccontare un percorso didattico sulla relazione Natura ed Essere Umano cercando di strappare un sorriso ogni tanto. Ah, il nome? YEA! = Yellow (la nostra classe) Envirorment (il nostro tema) Amazing (il modo in cui lo facciamo)!  \nSeguici anche su Youtube!",
        "language": "it",
        "author_name": "Classe dei \"Gialli\" ",
        "slug": "classe-yea",
        "cover": "20220601_070650_38837f681ae79a348885f7b2d5d62ecb.jpg"
    },
    {
        "podcast_id": 131374,
        "title": "RESENHA RURAL",
        "description": "<p>Podcast da RURALSERVICE voltado aos profissionais e simpatizantes do agro. Estamos no mercado do agronegócio desde 1986. Além de atender as exigências legais do crédito rural, com foco na elaboração de projetos, organização e gestão da documentação necessária, orientamos os agropecuaristas sobre boas práticas para produção, cuidados com a proteção e preservação do meio ambiente, contando com a parceria e respaldo técnico dos maiores desenvolvedores de tecnologia do setor. Em 1999, ingressamos na atividade de seguro agrícola e como empresa de inspeções rurais, primamos pela ética, transparência e precisão nas avaliações. Fornecemos apoio constante e treinamentos periódicos para toda a rede de engenheiros agrônomos credenciados, além de mantê-los alinhados com as expectativas da empresa e dos clientes. Nosso time, vanguardista nos dois segmentos de atuação, nos garante além da excelência na execução e conhecimento dos processos, uma rede de contatos de alto impacto que possibilita aproveitar as oportunidades do mercado para agregar ainda mais valor à cadeia.</p>",
        "language": "pt-br",
        "author_name": "RURALSERVICE",
        "slug": "ruralservice",
        "cover": "20220531_030503_7bdc2f8c6b2dc676b3172945e5a8b2fc.jpg"
    },
    {
        "podcast_id": 131578,
        "title": "A Just Natural Africa ",
        "description": "Africa holds up to 30% of the global biodiversity yet losing it at the fastest rate then ever recorded in the history of humanity. \nThis podcast brings forth unique narratives, experiences and insights from young African across the continent speaking to and sharing stories from their landscapes. ",
        "language": "en",
        "author_name": "Aiita Joshua Apamaku ",
        "slug": "naturewild",
        "cover": "20221022_081033_32afded38d28f315169abb981d613250.jpg"
    },
    {
        "podcast_id": 138556,
        "title": "Seafood Matters Podcast",
        "description": "Providing a voice for the UK fishing industry Jim Cowie speaks with fishermen, fisheries scientists and seafood industry leaders.",
        "language": "en",
        "author_name": "Jim Cowie",
        "slug": "seafoodmatterspodcast",
        "cover": "20220708_080700_cbbb3e56fb84fb4f455efd55e1729d19.jpg"
    },
    {
        "podcast_id": 142931,
        "title": "Big World, Small Bites",
        "description": "As the climate crisis carries on, it can be daunting to try and follow along and find your role. Is it worth it to recycle? Does composting make a difference? Do we blame the corporations and step back? In Big World, Small Bites, hosts Calli Lambard and Grant Rowe walk you through the wicked problem of climate change, offering action in small, digestible pieces. Listen in and learn about the true impact of your actions, what you can do, and how to find your place in this fight. Using their campus as a small case study, Calli and Grant exemplify how impactful small actions can be. We all play a part in our future. The world can seem big, but Calli and Grant will break it down into small bites. ",
        "language": "en",
        "author_name": "Grant Rowe and Calli Lambard",
        "slug": "bigworld-smallbites",
        "cover": "20220915_020927_1adf4dff29c354c4f6f4aee4ace3ac4f.jpg"
    },
    {
        "podcast_id": 143155,
        "title": "BluProjects",
        "description": "BluProjects is a consultancy, community and learning platform based in Istanbul, passionate about collaborative working for a better future. \n\n",
        "language": "tr",
        "author_name": "Sinem Çelik",
        "slug": "moda-tasariminin-donusumu-asli-abbasoglu",
        "cover": "20220728_080712_7fd70c879e3cdbd320d84724cf5e94a9.jpg"
    },
    {
        "podcast_id": 151757,
        "title": "Przemysław Białkowski podcast",
        "description": "<p>Podcast skupia się na tematach dotyczących polityki klimatycznej w Polsce i na świecie. Prezentuje m.in. technologie, ciekawostki ze świata przyrody i porady, jak żyć w zgodzie z naturą.</p>",
        "language": "pl",
        "author_name": "Interia",
        "slug": "przemyslawbialkowskipodcast",
        "cover": "20230907_120919_2b23c316062e3aaedf69f8866f51d076.jpg"
    },
    {
        "podcast_id": 153255,
        "title": "Here We Grow",
        "description": "Welcome to Here We Grow, a grassroots podcast by Southwest Georgia Farm Credit focused on education and inspiring growth down on the farm, at home, and in rural communities.\n\nWe hope to take our listeners beyond the scope of agriculture and into the real life stories and conversations taking place in Southwest Georgia.  Whether you are farmer or farmHER, agvocate, land lover, or southern dweller, we have industry experts and homegrown leaders ready to share their knowledge with you.   Each podcast contains industry insights, advice, and resources for your agribusiness and rural living toolbox.  If you are seeking information and understanding on topics like agronomy, farm equipment, financing, equipment, or homes with acreage, our show is for you!\n\nThanks for listening and make sure to subscribe to be notified of new episodes!",
        "language": "en",
        "author_name": "Southwest Georgia Farm Credit",
        "slug": "swgafarmcredit",
        "cover": "20220922_060943_af55f267be525946ac1eb6822fa0cb01.jpg"
    },
    {
        "podcast_id": 154264,
        "title": "Ìsula",
        "description": "Lo spazio per raccontare di isole, di persone e di mare.",
        "language": "it",
        "author_name": "Placido Benzi",
        "slug": "isulapodcast",
        "cover": "20220918_110958_fb4ac839143c08d91d75a8bdc43370e7.jpg"
    },
    {
        "podcast_id": 155079,
        "title": "THE POWER CLUB",
        "description": "The POWER CLUB was born in 2022 since TEERAK inc established. We realized about the climate change situation. We can't make it change by our self, we need everyone to join in our pack to make the effects to our earth together.\n\n|| - GET a FREE!! \"Climate change NEWS\" \n- \"NOTIFICATION\" for a new podcast episode \n- get FREE \"FUN STUFF!!!!\" and GIFT treat!!!!!!. \n&gt;&gt;&gt; JUST click \"FOLLOW\" button and go REGISTER on WWW.POWERTABLETS.NET &lt;&lt;&lt;",
        "language": "en",
        "author_name": "TEERAPAT.KKK",
        "slug": "thepowerclub",
        "cover": "20220927_050913_3b47f343391c4b3d26d4093a6129ae62.jpg"
    },
    {
        "podcast_id": 158858,
        "title": "The Environment Today",
        "description": "Welcome to the Environment Today! Every week we talk all things environment. What are the pressing issues? What is going on around the world? What is the future going to look like? Join us every Friday for a new episode!",
        "language": "en",
        "author_name": "Kevin Tankersley",
        "slug": "theenvironmenttoday",
        "cover": "20221008_021037_d500fe4b1059561955316b35641fcf88.jpg"
    },
    {
        "podcast_id": 165186,
        "title": "Mining & Markets",
        "description": "<p>Mining &amp; Markets, hosted by Aleem Fidai from Senergy Capital, empowers savvy retail investors to discover new opportunities in the junior mining sector through the wisdom of exceptional CEOs and visionary C-suite executives.</p>",
        "language": "en",
        "author_name": "Senergy",
        "slug": "senergy",
        "cover": "20230615_060626_c2769faba3ecc0f520839e4015bedb29.jpg"
    },
    {
        "podcast_id": 165336,
        "title": "Mother's Money",
        "description": "Our podcast is an informal/casual conversation with our hosts Mary Grace & Mark. Where we discuss environmental-related topics, with guests about their role and involvement in the topic.",
        "language": "en",
        "author_name": "Mother's Money",
        "slug": "mothersmoney",
        "cover": "20221104_051145_5564b1669b47e4369abdd47b72ad52c0.jpg"
    },
    {
        "podcast_id": 171609,
        "title": "A Cup of Atmospheric Science",
        "description": "Have you ever wondered about the ins-and-outs of the science and policy of climate change causing gases? How do we know the emissions of different greenhouse gases? How do scientists engage with policy makers to ensure we are meeting our emissions targets? \n\nWell you've come to the right place. Get your reusable cup ready for a filling of atmospheric science. ",
        "language": "en",
        "author_name": "Eric Saboya",
        "slug": "cup-of-atmospheric-science",
        "cover": "20221130_051157_2dcc2f810caa6a9953164405d3892271.jpg"
    },
    {
        "podcast_id": 174580,
        "title": "Wet",
        "description": "In each episode, Anya breaks down ongoing marine science research for everyday listening. Topics range from coral bleaching to the deep sea in this fresh take on pop-science podcasts.&nbsp;",
        "language": "en-US",
        "author_name": "Anya Stajner",
        "slug": "wet",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 175177,
        "title": "Freshwater Perspectives",
        "description": "Hosts Riley and Matt have a combined 20+ years experience working in and around freshwater. Their love of freshwater, eagerness to continue to learn, and passion to educate has brought them to sharing their discussions with the world. On a weekly basis, Matt and Riley will cover anything from the illegal caviar market, to using mussels to monitor water quality.",
        "language": "en",
        "author_name": "Riley Buley & Matt Gladfelter",
        "slug": "freshwaterperspectives",
        "cover": "20221219_121255_1b2294d415506f576f6c8dc0e1099add.jpg"
    },
    {
        "podcast_id": 175245,
        "title": "Simon Says Recycling",
        "description": "<p>SIMON SAYS RECYCLING, czyli recycling po ludzku. </p><p>Stworzyliśmy podcast, żeby uświadomić społeczeństwu po co segregować, jak segregować i co dzięki segregacji możemy uzyskać.</p><p>___________________________________________________________________________</p><p>Podcast poprowadzą: Szymon Dziak-Czekan polski przedsiębiorca, menedżer, prezes Stowarzyszenia „Polski Recykling” oraz grupy SPDC Holding zajmującej się recyklingiem tworzyw sztucznych. W latach 2006-2021 wprowadził na rynek ponad 200 000 ton recyklatów z tworzyw sztucznych, stanowiących alternatywę dla surowców pierwotnych. Autor ponad 200 publikacji dotyczących ochrony środowiska, recyklingu i zrównoważonego rozwoju przedsiębiorstw. Prywatnie jest zapalonym żeglarzem, który uwielbia narty, golfa oraz tenis stołowy.</p><p>Host - Bogna Komorowska- Jędrzejewska: Przedsiębiorca, mama, prezenterka radiowa, dziennikarka, lektorka. Od 18 lat prowadzi swoją agencję PR, która specjalizuje się w komunikacji kampanii społecznych, programów telewizyjnych oraz wielkich wydarzeń medialnych. Jej misją jest zachęcanie ludzi do dialogu, w każdej sprawie. Sztukę komunikacji zamienia w sztukę słuchania. Interesuje się ludźmi, ich różnorodnością, motywacjami i historiami.</p>",
        "language": "pl",
        "author_name": "Szymon Dziak-Czekan",
        "slug": "simonsaysrecycling",
        "cover": "20221221_091245_520911baf29f6ef4d674c1241dba7a02.jpg"
    },
    {
        "podcast_id": 183346,
        "title": "Emisor Cero",
        "description": "<p>En Emisor Cero hablamos con actores expertos en diseño, construcción y monitoreo de edificaciones sustentables en LATAM, acerca de los retos y alternativas concretas para mitigar esta crisis climática que nos concierne a todas y todos. Exponemos y derribamos mitos verdes. Te invitamos a tomar la acción desde el lugar en donde te encuentres. Escríbenos a emisorcero@podcastera.mx y visita www.proyectoceela.com Una producción de Podcastera.mx para Proyecto CEELA.</p>",
        "language": "es-mx",
        "author_name": "Proyecto CEELA + Podcastera.mx",
        "slug": "emisorcero",
        "cover": "20230126_050125_f0ab1880c944b4b8f49555c520e3b148.jpg"
    },
    {
        "podcast_id": 188912,
        "title": "\"Get the Lead Out\" with Doctor Chuck Stead",
        "description": "<p>Dr. Chuck Stead was raised in the Village of Hillburn, in the Ramapo Mountains of Lower New York. Get the Lead Out is a chronical of the environmental degradation of a water shed and its deadly impact on an indigenous population. A skilled storyteller, Dr. Stead studied at the Vermont Institute of Social Ecology and received his PhD at the Antioch New England School of Environmental Studies. This podcast follows his journey from boyhood, hunting and trapping in the Torne Valley of Ramapo where he first discovered Ford Motor Company’s pollution of the watershed, and on to the culmination of a Forty-million-dollar clean-up. Along the way we are introduced to members of the Ramapough Lunaape Nation, as well as citizen scientists, archaeologists, herpetologists, engineers, politicians, journalists, and Dr. Steads students who experienced what it means to speak truth-to-power. We are looking into Traditional Ecological Knowledge and its application to our contemporary environmental crisis.</p>",
        "language": "en",
        "author_name": "Doctor Chuck Stead Phd.",
        "slug": "gettheleadout",
        "cover": "20230301_030300_2de85daaada23b203f27ba13f722992d.jpg"
    },
    {
        "podcast_id": 189951,
        "title": "Rockhound Talk LIVE",
        "description": "<p>The only LIVE rockhounding podcast! Guests include lapidary artists, miners, prospectors, mineral collectors, geologists, and more! </p>",
        "language": "en",
        "author_name": "Amber Nichole & Ben Chorn",
        "slug": "rockhoundtalklive",
        "cover": "20230216_070244_819022d7b768b92a095fb57c17775c06.jpg"
    },
    {
        "podcast_id": 190071,
        "title": "Living on a Changing Planet",
        "description": "<p>Climate change has been endlessly debated. Is it happening? Are humans causing it? How bad is it going to get? What should we do about it? In this podcast a climate scientist and clinical psychologist team up to tackle the topic that’s missing from the climate conversation: how do you learn to live with it?</p><p>Whether you’re an energy worker who’s facing the loss of your job and ability to provide for your family, a youth activist afraid of what the future holds, or a nature-lover grieving the rapid ongoing destruction of our biosphere<strong> - <em>we sit down with world-leading experts on climate change and the energy transition to explore the thoughts and feelings that keep them up at 2 A.M., and talk about how they manage them productively.</em></strong></p><p>No political agenda. No alarmism. Just open, fact-based conversation about what it means to be a human being living on a changing planet. New episodes weekly!</p>",
        "language": "en",
        "author_name": "Carter Powis & Patrick Kennedy-Williams",
        "slug": "livingonachangingplanet",
        "cover": "20230323_060354_54105b3fae22a308fac85c197f0b5626.jpg"
    },
    {
        "podcast_id": 192522,
        "title": "Rabbithole fantasy",
        "description": "<p>Cryptids, conspiracies and the paranormal. Buckle up and let's go down the rabbit hole.</p>",
        "language": "en",
        "author_name": "Cpt Redbeard, Tala, Mr Hobbit and Sawtooth",
        "slug": "rabbit-hole-fantasy",
        "cover": "20230315_060305_4bc2384499d4d85c3523080a3e5049df.jpg"
    },
    {
        "podcast_id": 194847,
        "title": "Edible Oceans",
        "description": "<p>Prof. Tony Winson talks to Canadian and world experts on fisheries, ocean ecology, and humanity's impact on marine environments and the ocean species we take for food.</p>",
        "language": "en",
        "author_name": "Tony Winson",
        "slug": "edibleoceans",
        "cover": "20230306_050335_af8730979256733bb084b5d5a2931582.jpg"
    },
    {
        "podcast_id": 198132,
        "title": "Día Mundial da Meteoroloxía",
        "description": "<p>Dende a <a href=\"https://ucc.webs.uvigo.es/\">Unidade de Cultura Científica e da Innovación</a> da Universidade de Vigo presentamos unha serie de 5 podcasts para celebrar e conmemorar o Día Mundial da Meteoroloxía, 23 de marzo de 2023.</p><p>Esta actividade non sería posible sen a colaboración do persoal investigador do <a href=\"https://cim.uvigo.gal/\">Centro de Investigación Mariña (CIM)</a>, protagonistas das pezas.</p><p>A acción encádrase dentro do plan anual de actividades da UCC+I 22-23 \"Ciencia de Ida e Volta\" que conta co apoio da <a href=\"https://www.fecyt.es/\">Fundación Española para la Ciencia y la Tecnología - FECYT.</a></p>",
        "language": "es",
        "author_name": "Unidade de Cultura Científica e da Innovación da Universidade de Vigo",
        "slug": "ucc-metereoloxia",
        "cover": "20230320_030346_824db9521959ebfe9e164b2ebef0a58c.jpg"
    },
    {
        "podcast_id": 205938,
        "title": "Legally Green",
        "description": "<p>We are Legally Green - the number one podcast on the current sustainability trends that shape the evolution of the law of the future.</p><p>Legally Green is a podcast of three law students - Rob, Hanna and Zuza - who explore together the influence of sustainability on the present and future of law, in the context of European Union, but taking into account the global trends.</p><p>The predominant aim of this podcast is to provide predictions based on the current sustainability trends shaping the evolution of the law and the law’s influence on our daily lives. The overarching question guiding our podcast is “how does sustainability influence the various fields of law?” and each of the episodes will be guided by the current developments in a different area of the law. Some of the topics you might expect to hear about are legal philosophy, transport, sustainable finance and more.</p>",
        "language": "en",
        "author_name": "Zdzisław Robert Rypniewski, Zuzanna Węsierska, Hanna Kud",
        "slug": "legallygreen",
        "cover": "20230427_070447_fd043f781ed7b51e1b286a5003ef3ecc.jpg"
    },
    {
        "podcast_id": 208278,
        "title": "Zero Waste PFLC",
        "description": "<p>El plástico está constantemente hiriendo nuestro cuerpo y destruyendo nuestro planeta. Este podcast lo hacemos con el fin de concientizar sobre este tema. No tenemos planeta B, cuidemos el que ya tenemos!</p>",
        "language": "es-mx",
        "author_name": "PFLC",
        "slug": "pflcgoesgreen",
        "cover": "20230511_110506_8684d6310bfd29d07cb12268691edcc2.jpg"
    },
    {
        "podcast_id": 212583,
        "title": "Arkansas Weather Watchers Podcast",
        "description": "<p>Cameron and Derek have been running Arkansas Weather Watchers since 2014. AWW is an organization that covers local Arkansas weather, as well as chases through the heartland severe weather storms.</p><p>Our podcast will cover both current weather topics as well as past weather events that impacted the lives of many throughout the heartland.</p>",
        "language": "en",
        "author_name": "Arkansas Weather Watchers",
        "slug": "awwpodcast",
        "cover": "20230610_020658_019476ddf161d26aef0aef69821dcced.jpg"
    },
    {
        "podcast_id": 216419,
        "title": "TEAMS PODCAST",
        "description": "<p>Technology</p><p>Engineering</p><p>the Arts</p><p>Mathematics</p><p>Science</p>",
        "language": "en",
        "author_name": "Steve Hazlett",
        "slug": "teamspodcast",
        "cover": "20230714_080724_a3ae5918a8f6a7256fc53201df49931d.jpg"
    },
    {
        "podcast_id": 217087,
        "title": "APP",
        "description": "<p>Apartment Party Podcast</p><p>Lance Jake Mary and Steve</p>",
        "language": "en",
        "author_name": "Jacob Smith",
        "slug": "apartmentpartypod",
        "cover": "20230627_090606_4970255ab8f5d679043a29b6f44120ce.jpg"
    },
    {
        "podcast_id": 217745,
        "title": "The Eco Trails",
        "description": "<p>A Journey Through Earths Ecological Wonders</p>",
        "language": "en",
        "author_name": "Ryan Nicolas Lotz",
        "slug": "theecotrails",
        "cover": "20230703_010758_e333ee0442d9fd9a341c68db5bbdd47b.jpg"
    },
    {
        "podcast_id": 217798,
        "title": "From Glitter to Grit : The Unicorn's True Form",
        "description": "<p>In the captivating podcast, we journey into the realm of mythical beasts and their surprising connections to creatures that roam our world today. Each episode weaves ancient lore with modern biology, revealing fascinating parallels between legendary creatures and real-life animals. From dragons echoing the might of the Komodo Dragon, to the majestic Unicorn's semblance to the Rhinoceros, \"From Glitter to Grit\" uncovers the roots of our mythical creatures in the natural world. It's a thrilling exploration of the intersection between mythology and nature, where fantastical beasts meet earthly reality. Prepare to see our world's wildlife in a whole new light.</p>",
        "language": "en",
        "author_name": "Mish Cavanagh-Downs",
        "slug": "fromglittertogrit",
        "cover": "20230703_080720_b1c45ce2134862974d7fc5e26e13c336.jpg"
    },
    {
        "podcast_id": 218996,
        "title": "سبب تسمية الظاهرات الطبيعية فى مصر",
        "description": "<p>يحتوى البودكاست على معلومات عن سبب تسمية بعض الظاهرات الطبيعية فى مصر</p>",
        "language": "ar",
        "author_name": "M.A",
        "slug": "monaabdelmonem",
        "cover": "20230711_060706_66089c797abb57884bb85618f6eac402.jpg"
    },
    {
        "podcast_id": 222133,
        "title": "On-Farm Trials Podcast with the PNW Farmers' Network",
        "description": "<p>Here on the On-Farm Trials Podcast, host Carol McFarland dives into the different trials that come with farming systems innovation in the inland Pacific Northwest, speaking with professionals all across the region about how they get things done.</p>",
        "language": "en",
        "author_name": "PNW Farmers' Network",
        "slug": "pnwfarmersnetwork",
        "cover": "20230801_080853_f8bd34ba2d3643fc3372865b639f6744.jpg"
    },
    {
        "podcast_id": 222313,
        "title": "Logan Black Twitter Space",
        "description": "<p><strong><em>All things paranormal.</em></strong></p>",
        "language": "en",
        "author_name": "loganblack",
        "slug": "loganblack",
        "cover": "20230812_070824_3ef5475156b56dd01bd841a9ba1ce585.jpg"
    },
    {
        "podcast_id": 222624,
        "title": "J-Term Conference Podcasts on Himalayan Waters and Geopolitics",
        "description": "<p>Dialogue between Curious Students and Knowledgable Experts.</p>",
        "language": "en",
        "author_name": "Geopolitics and Ecology of Himalayan Water",
        "slug": "2023-nepal-jterm-podcasts",
        "cover": "20230804_100811_af6f9e10d8e5c168dc94bb660503e8c0.jpg"
    },
    {
        "podcast_id": 223178,
        "title": "The Future of Agriculture",
        "description": "<p>Welcome to our engaging podcast, hosted by the passionate members of the Sierra Club Food and Agriculture Outreach team. Join us as we delve into enlightening conversations with esteemed industry professionals and experts, centered around the future of agriculture in the United States. Tune in and embark on a journey of discovery as we navigate the exciting realms of food, farming, and sustainability. Hope you enjoy!</p>",
        "language": "en",
        "author_name": "Sierra Club Food and Agriculture Subteam",
        "slug": "sierraclubfoodandagteam",
        "cover": "20230808_080842_c3f008a32b24150b80e4917301efbec3.jpg"
    },
    {
        "podcast_id": 226050,
        "title": "Introduction to the Geological Wonders of Nigeria ",
        "description": "<p>Discover the captivating geological wonders of Nigeria in this introductory podcast. Unveil the secrets of its diverse landscapes, from ancient rock formations to stunning caves and mineral deposits. Join us to explore the hidden stories etched in the earth's canvas and gain a newfound appreciation for Nigeria's unique and awe-inspiring features. Perfect for geology enthusiasts, nature lovers, and curious minds eager to uncover the geological marvels that have shaped this remarkable nation.</p>",
        "language": "en",
        "author_name": "Irene Bernard ",
        "slug": "geological-wonders-of-nigeria",
        "cover": "20230828_040820_ce30021ae476ead0e63ec313bc1c010a.jpg"
    },
    {
        "podcast_id": 229217,
        "title": "What In The Fashion?!",
        "description": "<p>What In The Fashion?! Is a judgement free zone discussing and questioning current sustainable developments and practices around fashion and culture, as well as all other weird and wonderful things about the world of FASHION.</p>",
        "language": "en",
        "author_name": "Millie Fullalove",
        "slug": "whatinthefashionpodcast",
        "cover": "20230918_060957_2dee524dc7f3f54c75be66f63939e6be.jpg"
    }
]