[
    {
        "podcast_id": 734,
        "title": "The Sole Supplier Podcast",
        "description": "The Sole Supplier talks all things sneakers, business and industry.",
        "language": "en",
        "author_name": "George Sullivan",
        "slug": "thesolesupplierpodcast",
        "cover": "5c7aa31a6bad8.jpg"
    },
    {
        "podcast_id": 4429,
        "title": "The Human Behind The Chair",
        "description": "The human experience from the perspective of various hairstylist and their journey.",
        "language": "en",
        "author_name": "Thao Le",
        "slug": "humanbehindthechair",
        "cover": "20200125_025253_a748e1610f2c8278bec2dbd31f4c759b.jpeg"
    },
    {
        "podcast_id": 6036,
        "title": "Mitchell & Ness",
        "description": "The Mitchell & Ness Nostalgia Company was created in the 1980’s based on the idea to resurrect authentic jerseys significant to sports history. Headquartered in Philadelphia, PA, Mitchell & Ness has been “Defining Authentic” for over 100 years. ",
        "language": "en",
        "author_name": "Figures",
        "slug": "mitchellandness",
        "cover": "20200204_234933_e9df9a47678da3655c64469bdafe66ba.jpeg"
    },
    {
        "podcast_id": 6774,
        "title": "Gyrl Talk with j Marie!",
        "description": "Gyrl Talk With j Marie will recreate the way the most POWERFUL creation on this earth views themselves; THE WOMAN. \n\nWe will empower, motivate, entertain, inform, uplift and encourage women through LOVE, but more importantly SELF-LOVE. This podcast WILL inspire and unite women with GREAT convo and fun!! \n\nI mean....We always have fun on Gyrl Talk w/ j Marie. Press play, you’ll see!\n\nHost: j Marie\nWritten and Produced By: Jennifer Marie aka j Marie \nThank you so much for listening! Please subscribe and follow us on all platforms!\nhttps://linktr.ee/GyrlTalk",
        "language": "en",
        "author_name": "j Marie",
        "slug": "gyrltalkwithjmarie",
        "cover": "20200315_005204_e97ff9f6f6e9ef1ad867f4f993e9a534.jpeg"
    },
    {
        "podcast_id": 7066,
        "title": "The Uncluttered Wardrobe ",
        "description": "Personal Wardrobe Stylist and Makeup Artist Lorrie Pearson helps you create your personal style. She offers helpful advice and tips on creating a wardrobe with clothes you'll love; dressing for your body type; makeup and skin care for every skin type, designer fashions, shoes, accessories and feeling more confident with what you wear every day. \n\nLorrie specializes in luxury style and works with many designer brands to dress her clients for every occasion. Her makeup artistry skills have afforded her many opportunities to work on numerous commercial and print advertising campaigns. \n\nMs. Pearson loves to work with clients one on one because she enjoys  helping you refresh your style and uplift your confidence. ",
        "language": "en",
        "author_name": "Lorrie Pearson ",
        "slug": "theunclutteredwardrobe",
        "cover": "20200324_235306_6c83fd7aabd96dceaf75fbd44e788a36.jpeg"
    },
    {
        "podcast_id": 7276,
        "title": "Lost Artistry Lash",
        "description": "Join the founders of Lost Artistry as they discuss everything lashes, business and more. Subscribe to learn their methods to help propel YOUR business. \n\nLet us know what ya think :)",
        "language": "en",
        "author_name": "Kaitlyn Elford",
        "slug": "lostartistrylash",
        "cover": "20200331_201658_dfe1fa75e87d747d5c16f69b1cdba79c.jpeg"
    },
    {
        "podcast_id": 7299,
        "title": "Bay Area Essentials",
        "description": "Diana and Meridith answer questions about relationships relating to red flags, rebounds, jealousy, cheating, burnout, being single, and working on yourself first. We into the nitty-gritty on women's opinion around dating, so men listen up! \n\nWe don't hold back on the stories, enjoy!",
        "language": "en",
        "author_name": "Bay Area Essentials",
        "slug": "bay-area-essentials",
        "cover": "20210121_062537_4c44979ff3fd5eb486c9eeeacecb267f.jpg"
    },
    {
        "podcast_id": 8006,
        "title": "Cinetrola",
        "description": "<p>CINETROLA es un podcast sobre cine y moda. En realidad sobre todo un poco. Barbi Miranda (o Barbucks, Bárbara, Barbs, como le quieras decir, tiene mil apodos) es promíscua cinematográficamente, pues se casa con todas las películas y a la vez con ninguna. Acá te habla sobre arte en una serie de episodios en donde analiza películas, directores, diseñadores, estilos, décadas y un par de conexiones entre Hollywood y la Fashion Week. Instagram: @cinetrola Twitter: @barbuckss Tik Tok: @cinetrola YouTube: cinetrola</p>",
        "language": "es",
        "author_name": "Barbucks",
        "slug": "fashfilm",
        "cover": "20230310_050329_dfed674acff90b3a0d09aa3239cb34ae.jpg"
    },
    {
        "podcast_id": 9229,
        "title": "The Raw Truth",
        "description": "The Raw Truth will be telling all. Lauryn Yost talks about the uncertainties of different life aspects and the benefits of understanding them. Special guests and fun activities are in store for every episode.",
        "language": "en",
        "author_name": "Lauryn Yost",
        "slug": "therawtruth",
        "cover": "20200530_213628_1df6c84b59b99f7140b3433d83dbc08d.jpeg"
    },
    {
        "podcast_id": 10152,
        "title": "Mental Health Makeover with Nana (Nanatural Life)",
        "description": "<p>Instagram @nanaturallife Website https://nanaturaljp.com 運営中\"心に素直に、心身ヘルシーでいれること\"それにはマインドの状態がとっても大切。そんなお話や、 そしてGuided Meditationガイデットメディテーションもお届けしていきます。</p>",
        "language": "ja",
        "author_name": "Nana",
        "slug": "nanaturallife",
        "cover": "20221102_021123_2b66290f213ddbfd4c10126d1a2f40e1.jpg"
    },
    {
        "podcast_id": 10408,
        "title": "What's The Chat?",
        "description": "Join us whilst we debrief on 'the chat' of the moment and navigate our way through life as young people today. Keira is currently a business student and Christy is a young professional in health care. Although from different backgrounds we have found each other through serendipity, and are following a similar path in life. We're looking forward to delving into all things lifestyle, health, relationships and discussing the sagas of everyday life. \n\nFollow our instagram: @whatsthechatt",
        "language": "en",
        "author_name": "Keira Mclean and Christy Houston",
        "slug": "whatsthechatepisodeone",
        "cover": "20200709_201958_03e8005ea6dd322cde7dcebeb8e52f28.jpg"
    },
    {
        "podcast_id": 10453,
        "title": "Tongue & Chic",
        "description": "We are sisters, stylists, and pop culture vultures in couture. This podcast is a light hearted segment that's a little bit sweet and a lot a bit sassy. The show will focus on pop culture, fashion and most importantly, breaking down (predominantly Bravo) reality TV shows. (Real Housewives franchises, Vanderpump Rules, Shahs of Sunset, Below Deck Franchises, Summer House etc).",
        "language": "en",
        "author_name": "Elana and Dina Solomon",
        "slug": "tongueandchic",
        "cover": "20200711_194705_7d38fdaf0c8e3ab1b9afc557527adf00.jpg"
    },
    {
        "podcast_id": 11469,
        "title": "Your House, My House",
        "description": "A safe space for conversation - like talking to your best friends. Friends that have your back, that are encouraging, and that challenge you to not only improve your life, but yourself.  \n",
        "language": "en",
        "author_name": "Priscilla & Madison",
        "slug": "yourhousemyhouse",
        "cover": "20200817_191121_eaebd865bc7393826c4457aa559ededc.jpg"
    },
    {
        "podcast_id": 11701,
        "title": "On Sunday We",
        "description": "On Sunday We: Host! J & S are pulling up into your pod charts and guarantee one dose of truths and tell-alls by the week. As two former college roommates from San Francisco, we bridge the gap and wield our powers of dialogue to speak on topics that appeal to the contemporary audiences. It’s all about music for the mind as we delve into exciting and pressing themes. A handbook for positivity, career perspectives, mental wellness, changing financial & social landscapes, and staying true to your individual journey on the road to self-discovery. Stand by for a direct line to eye-opening exchanges with influencers, authors, bloggers, entrepreneurs, & budding thought leaders. On Sundays, we’ve got you covered! Follow us on Instagram  @onsundaywepod. For business inquiries, email onsundaywe@gmail.com",
        "language": "en",
        "author_name": "Jiya Shamdasani & Simran Chhada",
        "slug": "onsundaywe",
        "cover": "20200825_102434_c01b7e6ec258622454a763098637e659.jpg"
    },
    {
        "podcast_id": 11805,
        "title": "Typically Peachy",
        "description": "I’m starting this to take you out of your world, find new things to love and enjoy, and give you some advice as I live my unguided life into adulthood. Let’s figure it out together and maybe feel some sense of unity in the fact that A-B-S-O-L-U-T-E-L-Y no one knows what the hell they’re doing. Stay peachy my friends.",
        "language": "en",
        "author_name": "Typically Peachy",
        "slug": "typicallypeachy",
        "cover": "20200828_051041_7e3409fa5af4232f51b6d22e8c07f267.jpg"
    },
    {
        "podcast_id": 12069,
        "title": "Too Glam to Give a Damn",
        "description": "Fashion stylist, costume designer, creative director & LA native Lindsey Evans takes you behind the scenes of Hollywood and offers an insider's perspective on all things GLAM! Backed by ten years of industry experience Evans tells it like it is, even the not so glamorous truths about Hollywood. Too Glam to Give a Damn covers all things pop culture including real housewives, red carpets, and celebrity street style while Evans gives her take on what’s hot & what’s not in the entertainment world. Evans also sits down with industry \"glam experts” to gain added insights, learn about their various career paths and uncover their biggest tips of the trade. Tune in for brutal honesty, belly laughs & beauty secrets to maximize your glam factor!",
        "language": "en",
        "author_name": "Lindsey Evans",
        "slug": "tooglamtogiveadamn",
        "cover": "20200909_160312_d8c66423afa23f066986347d74386c56.jpg"
    },
    {
        "podcast_id": 12829,
        "title": "Unboxed Beauty ",
        "description": "Diana and Julia, aka the DĒAWY duo, host this beauty-meets-comedy podcast titled Unboxed Beauty. Julia and Diana are business partners, truth-tellers, and best friends. Listen to the hilarity unfold as they share wild stories of building a small ethical company and feature special guest interviews with the best in the beauty game. Unboxed Beauty podcast serves as a reminder that beauty, comedy, and honesty is the best way to approach well...everything.",
        "language": "en",
        "author_name": "Julia Ruiz and Diana Saadeh",
        "slug": "unboxedbeauty",
        "cover": "20201106_060803_ecbdf7faa068c5eb4cd3e9e2bad29ded.jpg"
    },
    {
        "podcast_id": 12972,
        "title": "The Balanced Beautiful Body",
        "description": "The Balanced Beautiful Body Podcast explores how women are finding balance and beauty in the pursuit of their dreams one cup-versation at a time. Whether you are an entrepreneur, business owner, mother, student, wife, friend, or any other title, we are serving up hot conversations for you every week of women just like you finding balance and beauty daily. \n\nHosted by female entrepreneur, coffee connoisseur, full time working wife, fitness instructor and dog mom to two wild GSPs, Alex Hushek takes you to coffee for a weekly cup-versation with fellow boss babes just like YOU! \n\nIf you are looking to ditch the highlight reel and step into the \"Reel Life\" arena of finding balance and beauty with other like minded women, you are in the right place.  Get rid of the inauthentic, sit down with your favorite beverage, and let’s do our work together, as one body, founded on authentic balance and beauty. ",
        "language": "en",
        "author_name": "Alex Hushek",
        "slug": "thebalancedbeautifulbody",
        "cover": "20201001_051706_ac7f4302a61eab8b2bcc9332c069a375.jpg"
    },
    {
        "podcast_id": 13516,
        "title": "The Up & Coming Podcast",
        "description": "The Up & Coming Podcast was created to shine a light on talent, creatives and those making a difference, who aren’t necessarily getting the recognition their abilities call for. Host, Quari Alleyne, sits with each guest for an in-depth interview that will provide listeners with a better idea of who these Up & Coming individuals are.",
        "language": "en",
        "author_name": "Quari Alleyne",
        "slug": "theupandcomingpodcast",
        "cover": "20201016_032656_d5b2fd2d7675e593e69f3d84a4d24939.jpg"
    },
    {
        "podcast_id": 13593,
        "title": "AWD BALL PODCAST ",
        "description": "Basketball podcast! Bringing you all things NBA! Exploring players, teams, kicks, and all things NBA culture!",
        "language": "en",
        "author_name": "Anthony ",
        "slug": "awdballpodcast",
        "cover": "20201018_060516_30391cfe12bb82473c037dd2fd2f605d.jpg"
    },
    {
        "podcast_id": 14552,
        "title": "20 Questions With... ",
        "description": "Here at UPR we are always excited about trying new things. And with people working from home and looking to be inspired or just to switch up their normal music playlist, we decided it was the perfect time to launch a series of 5 podcasts. Keeping in line with our 20 year anniversary the series is aptly titled “20 Questions With…”, and we aim to give you inspiring conversations that offer you insight into the world of PR; discussing subjects like sustainability, interior design, fashion and influencer marketing.\n\nAll podcasts were produced by UPR Agency and edited by Cas Versmessen.",
        "language": "en",
        "author_name": "UPR Agency",
        "slug": "upragency",
        "cover": "20201113_140813_c3528c89a111466f4db6a32e05188037.jpg"
    },
    {
        "podcast_id": 14876,
        "title": "The Truth About Locs",
        "description": "Everything you need to know about locs and everybody who does them correctly.",
        "language": "en",
        "author_name": "Yesha Nashiym-El",
        "slug": "truthaboutlocs",
        "cover": "20201120_022225_2bd9d44d85e33862487a03ec2c21b4db.jpg"
    },
    {
        "podcast_id": 17949,
        "title": "Overdressed n' Underpaid",
        "description": "welcome to overdressed n' underpaid! Hosted by Sabrina and Madison ",
        "language": "en",
        "author_name": "Ovedressed n Underpaid",
        "slug": "overdressednunderpaid",
        "cover": "20201211_224851_00633f7994f086cbd847260193706095.jpg"
    },
    {
        "podcast_id": 18986,
        "title": "COMING SOON",
        "description": "<p>COMING SOON!</p>",
        "language": "en",
        "author_name": "Lils & Blacko",
        "slug": "session22podcast",
        "cover": "20230628_120613_6110617aa2ecdde05e3796f042cd08c1.jpg"
    },
    {
        "podcast_id": 19325,
        "title": "Give Game Podcast ",
        "description": "The “Give Game Podcast” which is hosted by Eric “Red Sinatra” Dixon is focused on conversations pertaining to the latest sports,fashion,hip hop culture news and topics. Sinatra schedules his guest and they become his co host for the episode. A good look and listen. Enjoy!",
        "language": "en",
        "author_name": "Eric “Red Sinatra” Dixon",
        "slug": "givegamepodcast",
        "cover": "20210217_024630_db9ad722aaa2927d2b9f1e7fa2116643.jpg"
    },
    {
        "podcast_id": 21619,
        "title": "Talking Locs",
        "description": "Locitude is the platform for people with authentic locs; through our hair studio, products, events, content, education and podcast, we serve!\n\nAde Balogun, Chief Loc Officer at Locitude hosts the Talking Locs podcast; in our current season (Meet The Experts) Ade has conversations with experts that help set the tone, frame of mind and practices for proper hair care maintenance. \n\nIn January of 2021 the Talking Locs with Locitude podcast started out as a mini series of seven episodes where Ade discusses locs from an interesting, informative and dynamic perspective.\n\nIn the second season, Ade interviews Everyday People with Locs. Episodes are produced by Xavage Media.\n\nFor enquiries and feedback, kindly reach us at on instagram @locitude, call +234 818 900 1122 or +1 240 733 9047 or email us at info@loc-itude.com.",
        "language": "en",
        "author_name": "Locitude",
        "slug": "locitude",
        "cover": "20210102_192947_dccd7237a5f82a34a8dccf030cfcf98e.jpg"
    },
    {
        "podcast_id": 21869,
        "title": "she talks",
        "description": "<p>Ale Hurtado loves to talk, and can really never stop. On \"she talks\", join Ale as she talks about life, love, and anything you can pretty much think of. There is no holding back, everything is put out in the open. The podcast where you can feel safe and know that Ale is being real 24/7.</p>",
        "language": "en",
        "author_name": "Ale Hurtado",
        "slug": "shetalks",
        "cover": "20230228_050211_eee5ebb1b0b46bd9184760a01bdf796e.jpg"
    },
    {
        "podcast_id": 22753,
        "title": "The Fashion Cupboard ",
        "description": "The Fashion Cupboard is a podcast for those looking to gage a deeper understanding of the Editorial and Fashion world. Forget what you learnt from The Devil Wears Prada, we will be speaking to an array of individuals across the Editorial landscape. From Stylists, Editors & Fashion Assistants, to Fashion Entrepreneurs and Digital Journos. We'll be asking them the questions you want to know, no holding back. \nNew episodes every Sunday! \nContact us with your questions on Instagram @TheFashionCupboardPodcast\nOr via Email! thefashioncupboardpodcast@gmail.com",
        "language": "en",
        "author_name": "Emma Gold",
        "slug": "thefashioncupboard",
        "cover": "20210113_202422_818f9f0a9393832b667d887d64ccfc9e.jpg"
    },
    {
        "podcast_id": 24768,
        "title": "Natural Beauty Podcast",
        "description": "<p>Natural Beauty Podcast brings you the latest news from the natural beauty scene. In the episodes, we share trending beauty tips of course, though we are also having important and deep discussions on the state of our beauty industries around the world. Natural Beauty Podcast is powered by the Nordic &amp; European Natural Beauty Awards. By following the Natural Beauty Podcast, you will stay updated with the highlights from both awards. Your host is the founder of the awards, Satu Mäkinen, originally from Finland herself. Disclaimer: This podcast is for entertaining and educational purposes only. If you have health concerns, seek professional medical advice. Note: Prior, this podcast was Nordic Natural Beauty Podcast, hence the episodes from 2020-2022 are the original Nordic Natural Beauty Podcast episodes.</p>",
        "language": "en",
        "author_name": "Natural Beauty Directory",
        "slug": "nordicnaturalbeautypodcast",
        "cover": "20221208_011247_7dfa5440fb559518c2b8ba4e712e56de.jpg"
    },
    {
        "podcast_id": 25957,
        "title": "FrequenShe Podcast",
        "description": "We hope you will listen, follow and become our friends. We will tell real stories, be brutally honest and give you a few chuckles in between. So join us once a week so we can be on the same frequency or FrequenShe! ",
        "language": "en",
        "author_name": "Nautica de la Cruz and Amy Lopez",
        "slug": "frequenshe",
        "cover": "20210119_232037_fc6cf4a1fabe8a4884435cf89ee34349.jpg"
    },
    {
        "podcast_id": 26424,
        "title": "The Human Method",
        "description": "I am on a mission to help organizations drive long term success and results by implementing an unshakeable transformation model. This model puts the employee at the center and works outward to support every aspect of the human experience in the workplace. Founder and CEO of The Bond Consulting Group, Meagan Bond interviews incredible guests who are experts in a variety of professions to learn more about the tools that can transform an organization one person at a time. If you are seeking to improve yourself and how you live your life or if you are an organizational leader seeking to make a larger impact on your company through culture change, then this podcast is for you! ",
        "language": "en",
        "author_name": "Meagan Bond",
        "slug": "thehumanmethod",
        "cover": "20210504_210955_219e06faffaaef668db605e98c213d45.jpg"
    },
    {
        "podcast_id": 31713,
        "title": "Skinpharma Aesthetics: Viv talks about non-surgical aesthetic treatments",
        "description": "Viv from Skinpharma Aesthetics in Stockton-on-Tees in the UK, is a clinical pharmacist prescriber & an advanced, non-surgical aesthetics practitioner.\n\nHis podcasts focus on his passion for his work. He talks to a wide range of individuals about their views regarding different aspects of aesthetics work in the UK.",
        "language": "en",
        "author_name": "Skinpharma Aesthetics",
        "slug": "skinpharma",
        "cover": "20210211_144426_5473ae45fe153d8ee6de75f8f65f8da6.jpg"
    },
    {
        "podcast_id": 31762,
        "title": "Make Waves with Jaclyn Sage",
        "description": "Welcome to Make Waves with Jaclyn Sage. Learn how to turn grit into greatness and hustle into home runs as Jaclyn interviews entrepreneurs, inspiring celebrities, fashion/entertainment experts, and successful risk-takers from all genres of life and business. Are you ready to make waves? ",
        "language": "en",
        "author_name": "Jaclyn Sage",
        "slug": "makewaves",
        "cover": "20210228_174659_26c9f37511eabb76504744e6d1c9f9fd.jpg"
    },
    {
        "podcast_id": 34791,
        "title": "Mostly Messy",
        "description": "Life, relationships, sex, dating, kids and everything in-between...it’s a mess! If you are interested in relatable stories, laughing, learning, mediocre advice and general shit; this is the podcast for you! Because let’s be honest, we all make a mess. ",
        "language": "en",
        "author_name": "Melissa Boosalis",
        "slug": "mostlymessy",
        "cover": "20210514_162417_bcfb93c15fcc8bfe56d1054ca3a31dc9.jpg"
    },
    {
        "podcast_id": 35657,
        "title": "Fashion, Adventure, Beauty",
        "description": "     Welcome to the Fashion Adventure Beauty Podcast Series! We love beautiful fashion, traveling with friends and exploring, and embracing beauty in the world. In the FAB podcast series, we will shine a spotlight on everything from our favorite boutiques to the must see sites at our favorite travel destinations.                                                       \n      We are interested in what you are looking to learn more about in these three categories, so please send us your questions and suggestions and we will be sure to reply to all of them!  Website: FashionAdventureBeauty.com IG: @FashionAdventureBeauty Email: FashionAdventureBeauty at Gmail dot com.\n",
        "language": "en",
        "author_name": "Fashion, Adventure, Beauty",
        "slug": "fashion-adventure-beauty",
        "cover": "20210629_185441_3b415f761feed7cfc5058042d95626fd.jpg"
    },
    {
        "podcast_id": 37352,
        "title": "a little taste of everything",
        "description": "Mckinnlei and Lexi here with a little taste of everything. This is where we talk about a lot of food and a little of everything else. Thanks for joining!",
        "language": "en",
        "author_name": "a little taste of everything",
        "slug": "alittletasteofeverything",
        "cover": "20210303_174939_840b87a43919ec38155892e51ffe7f2f.jpg"
    },
    {
        "podcast_id": 38107,
        "title": "Hablemos Moda",
        "description": "Bienvenidos a Hablemos moda,  un espacio de análisis sobre moda y tendencias en el entorno actual.\n\nConducido por Alexandra y Natalia García, comunicadoras de nacimiento y de profesión, analistas de tendencias involucradas en el diseño de moda y en el marketing digital.\n\nUn espacio que pretende impulsar a las marcas, que tengas mayor conocimiento de este rubro y que puedas implementarlos en tu negocio, o atreverte a incursionar en este mundo de forma fácil y entretenida.\n",
        "language": "es",
        "author_name": "S-08 Consultora",
        "slug": "hablemosmoda",
        "cover": "20210307_152452_ec113919f21fad4f4db9d34c845d98ca.jpg"
    },
    {
        "podcast_id": 38295,
        "title": "Ask all from Yourself ",
        "description": "Introduction ",
        "language": "en",
        "author_name": "Georanny Gil ",
        "slug": "ask-all-from-yourself",
        "cover": "20210426_215333_feaab0f521f3c4522250912f6d75a6c9.jpg"
    },
    {
        "podcast_id": 39261,
        "title": "Pretty Titty Talk",
        "description": "Life. Entrepreneurship. Advice. Tea.",
        "language": "en",
        "author_name": "Samira V & Makayla M",
        "slug": "prettytittytalk",
        "cover": "20210306_200059_21f043b68c878fb495cc71aaa8390d09.jpg"
    },
    {
        "podcast_id": 39561,
        "title": "Queen Conversations",
        "description": "Queen Conversations is a podcast hosted by DaQuawna Farrow intended to empower, inform, and inspire women through candid conversations about career, love, faith, food, travel, and more!",
        "language": "en",
        "author_name": "DaQuawna Farrow",
        "slug": "queenconversations",
        "cover": "20210307_231339_7f93bab9eb9f3ab202405a6d6fc4c8dc.jpg"
    },
    {
        "podcast_id": 40340,
        "title": "Roarin' Twenties",
        "description": "Meet Sarah and Clíodhna. Two girls in their twenties, in the 2020s, trying to figure it all out. ",
        "language": "en",
        "author_name": "Roarin' Twenties",
        "slug": "roarintwentiespod",
        "cover": "20210310_122910_41899877280d6858c3f3a64cfb32453c.jpg"
    },
    {
        "podcast_id": 44078,
        "title": "Evolution!!!!",
        "description": "Helping others begin the  journey to reach a state of better health. Body, Mind and Finances!",
        "language": "en",
        "author_name": "Michael Madden",
        "slug": "myhealthjourney",
        "cover": "20210828_121319_ce96fdec9f78efe2d816e53307330479.jpg"
    },
    {
        "podcast_id": 44289,
        "title": "Style",
        "description": "\"Fashion Fades But Style is Forever\" Redefinition and creativity ​is not always an easy feat, and it takes Style. Our definition of Style is centered around your life. Who you are, Who you want to become, What Inspires you, and Your mindset is your Style.",
        "language": "en",
        "author_name": "Style Team",
        "slug": "style",
        "cover": "20210325_161045_f610fc6d6065148750ffa24e66724de0.jpg"
    },
    {
        "podcast_id": 44517,
        "title": "Glow by Tropic",
        "description": "Picture a whole new era of Tropic, one where we’re better than ever… in every way. What does it look like? Well, you’ll find out in the latest edition of our bestselling brand magazine, Glow. ",
        "language": "en",
        "author_name": "Tropic Skincare",
        "slug": "glowbytropicissue1",
        "cover": "20220906_120912_8e7acbfd2171d00f733068abd788c1f4.jpg"
    },
    {
        "podcast_id": 49448,
        "title": "Crème de la Crème",
        "description": "Por Joana Nobre.\nSou Farmacêutica, com mestrado em Ciências Farmacêuticas e especialista em Cosmética, tendo feito uma pós-graduação nesta área e ainda outra em Branding e Gestão de Imagem. Tenho um fascínio assumido pela Psicanálise, a Estatística e a Comunicação. Trabalho na Indústria Farmacêutica desde 2005, leciono em diversas Instituições de ensino superior e sou Program Manager de um Curso de Especialização em Dermocosmética. A Cosmética é uma ciência e nela vivem muitas outras. Adoro escrever sobre o tema, sempre com o objetivo de contribuir para a literacia na área. O rigor é a minha imagem de marca. Viajo muito em trabalho e fora dele. Nas minhas viagens e tempos livres, faço fotografia e crio playlists no Spotify. O meu dia favorito é o sábado, quando arranjo tempo para me aventurar em receitas de bolos e passear em família sem horas marcadas. No meu Crème De La Crème mostro-vos que a cosmética tem um futuro muito promissor.",
        "language": "pt-pt",
        "author_name": "Joana Nobre",
        "slug": "cremedelacreme",
        "cover": "20210414_202523_dd2f0838dc19a236ef3c683c8cb41b80.jpg"
    },
    {
        "podcast_id": 52428,
        "title": "Rainbow Radio",
        "description": "Welcome to Rainbow Radio; the Del Rainbow Podcast. Bringing you raw conversations with creatives, intuitives, entrepreneurs, motivational speakers & information seekers. ",
        "language": "en",
        "author_name": "Rainbow Radio",
        "slug": "rainbow-radio-episode-6",
        "cover": "20210426_233540_ae1b629446233909acc982e0dfe59c93.jpg"
    },
    {
        "podcast_id": 58256,
        "title": "La Station Beauté - Beauty Academy",
        "description": "La Station Beauté - Beauty Academy est une école de formation en esthétique spécialisée dans toutes les nouvelles technologies. Regroupant les meilleures artistes au Québec, ce Podcast est destiné à toutes les passionnées du domaine. \n\nPrésenté par Chloé Jacques, formatrice spécialisée en Maquillage Permanent & Microblading et Alexane Palica esthéticienne formatrice en Esthétique & Technologies Avancées.\n\nNous discuterons ici librement de stratégies d'affaires, de mindset, de marketing, de start-up, etc. Nous couvrirons également tout ce qui touche l'esthétique et les technologies avancées telles que:\n\n-Maquillage Permanent\n-Microblading\n-Skin Care\n-Microneedling\n-Extension de cils\n-Russian Volume\n-Lashlift\n-Henné\n-Freckles\n-Areola Reconstruction\n-Micro Pigmentation Capillaire\n-Laser\n-Nanoliner\n-Stroke Pattern\n-Colorimétrie\n\nEt plus encore!\n\nVous désirez apprendre de façon ludique & rapide? Joignez-vous à nous!",
        "language": "fr",
        "author_name": "Chloé Jacques & Alexane Palica",
        "slug": "lastationbeaute",
        "cover": "20220905_110957_f4ce6ad34a12756adbeffa22345f8f8c.jpg"
    },
    {
        "podcast_id": 59495,
        "title": "Holas",
        "description": "Hola hola hola https://genius.com/Willow-come-home-lyric",
        "language": "en",
        "author_name": "Itz y maria",
        "slug": "joder",
        "cover": "20210527_165835_082d7760a5f330a36c3836c598700787.jpg"
    },
    {
        "podcast_id": 59659,
        "title": "REALITEA LLC",
        "description": "This podcast is to create a platform that brings exposure to artists and businesses: locally as well as worldwide . RealiTEA will become a safe haven for listeners to laugh, cry , learn , and be inspired ! Welcome to RealiTEA where the TEA is REAL !",
        "language": "en",
        "author_name": "Lady TreSciana Carter",
        "slug": "realiteallc",
        "cover": "20210528_151218_609859f40b881e5e666bcd8868da8fef.jpg"
    },
    {
        "podcast_id": 60529,
        "title": "Filterlos",
        "description": "Kirsty und Sarah reded jedi Wuche filterlos über allerlei Theme wo si gad beshäftigt. Es wird gfluecht, vo Alkohol und Tindr gred drum eher 18+. Ganz alltäglichi, lushdigi, wildi oder au mal trurigi stories. Wies mit 25+ halt so ish. Erwachse aber iwie doch no Chind. ",
        "language": "en",
        "author_name": "Kirsty Stephenson und Sarah Giger",
        "slug": "filterlospodcast",
        "cover": "20210602_144542_d3dc2142269caac8daf202c2ba4a7926.jpg"
    },
    {
        "podcast_id": 61925,
        "title": "Natan - More Than Fashion",
        "description": "Natan is a Belgium based contemporary womenswear and accessories brand founded in 1930, Edouard Vermeulen is the head designer. #MaisonNatan \nwww.natan.be\n",
        "language": "en",
        "author_name": "Edouard Vermeulen",
        "slug": "natancouture",
        "cover": "20210609_104141_4cd73aa39b6c5a5ee3a0217f5d430f98.jpg"
    },
    {
        "podcast_id": 62623,
        "title": "Honestly Naturale ",
        "description": "An interactive raw and real podcast, where co-host Christina and Sam discuss controversial topics within the beauty industry, pop-culture, political/ social arena, and so much more. No topics are left untouched, so tune in to hear what we and others will have to say! ",
        "language": "en",
        "author_name": "Samantha Adelson  & Christina Gaillard ",
        "slug": "livelynaturale",
        "cover": "20210614_210214_ac6c975013610d6d6ba64d886fd17c50.jpg"
    },
    {
        "podcast_id": 64412,
        "title": "Трусы. Подкаст Даши Бамбалиной",
        "description": "Подкаст ТрУсы, или трусЫ, о невероятных любовных историях из жизни Даши Бамбалиной, где случились эти самые трУсы, о которых, по сути, у меня только хорошие воспоминания, или же трусЫ, которые когда-то съела одна собака, но это уже совсем другая история. Но я бы хотела рассказать эти истории, будто мы сидим у меня на кухне, пьем просекко, и неистово смеемся от над всеми этими трусами, или трусами, которые к счастью сушатся уже на чужом балконе. \n\n",
        "language": "ru",
        "author_name": "Daria Bambalina",
        "slug": "trusy",
        "cover": "20210622_200612_07acb93e977b28c13ca93999e46f04fc.jpg"
    },
    {
        "podcast_id": 73952,
        "title": "WHAT ABOUT US?",
        "description": "Everyone has a story to tell.. Whats yours?",
        "language": "en",
        "author_name": "Estela Starr",
        "slug": "whataboutus",
        "cover": "20210817_002348_dc99084b2bb0162166e4ffdbce9fc7d5.jpg"
    },
    {
        "podcast_id": 74032,
        "title": "Sewing for Drag Queens",
        "description": "As a designer / maker and lover of all things drag, I'm interested in the people behind the costume as much as I'm interested in the performers wearing it. In this podcast I want to explore and understand the process behind the end product by speaking to the people that MAKE. ",
        "language": "en",
        "author_name": "Laura Blackwell",
        "slug": "sewingfordragqueens",
        "cover": "20210817_114458_eaa32a3d1ac17efb365c35b410ba16b2.jpg"
    },
    {
        "podcast_id": 74220,
        "title": "Mad Beauty Talks",
        "description": "Žinoma plaukų stilistė, salono „Mad Beauty Squad“ įkūrėja, Margarita Jakučinskaitė kviečia klausytis pokalbių laidos  „Mad Beauty Talks“. Laidoje išgirsime žinomus šalies veidus drauge atvirai kalbančius apie įvairias grožio bei mados tendencijas,  gyvenimiškas situacijas ir įdomiausias pašnekovams nutikusias istorijas kol tuo metu jie sėdi plaukų stilisto kėdėje ir yra atsidavę į profesionalias Margaritos rankas. Šia laida žinoma plaukų stilistė nori edukuoti plačią auditoriją ir suteikti kuo daugiau žinių apie kokybišką plaukų priežiūrą, dažymus, kirpimus bei padėti suprasti, kas yra kokybiškas meistras.",
        "language": "en",
        "author_name": "Margarita Jakučinskaitė",
        "slug": "madbeautytalks",
        "cover": "20211001_090200_95b2911f8165c1d49c9b1cfe78c2e503.jpg"
    },
    {
        "podcast_id": 76438,
        "title": "Redressing Weddings",
        "description": "For queer and trans folks, wedding attire is a portal into much larger questions: of belonging, visibility, and politics. Join us as we talk to thoughtful people about everything from suits and gowns to how wedding clothes shape family ties and body image. Learn more at redressingweddings.com.",
        "language": "en",
        "author_name": "Redressing Weddings",
        "slug": "redressingweddings",
        "cover": "20210830_192528_7d58d825f6bc630510d9c795d09e09bd.jpg"
    },
    {
        "podcast_id": 76702,
        "title": "FM con Eleane y Oscar",
        "description": "Femme Modele (FM) es una academia de modelos que nace en 2006 en San Luis Potosí, Mexico.  Fundada por Eleane Eguia, ex modelo, ganadora del certamen Nuestra Belleza SLP y conductora de Televisión para Mexicanal, ahora reside en Sydney, Australia. Oscar Lopez fue modelo, ganador del Male top model, conductor de television y reside en San Luis Potosí, Mexico. \nJuntos están promoviendo los cursos de modelos y talentos para varias plataformas. Queremos ayudar a estudiantes de modelaje y conducción a  desarrollar su talento en los medios o simplemente para desarrollo personal.\nMás información;\nhttps://linktr.ee/Femme_Modele ",
        "language": "es",
        "author_name": "Eleane Eguia & Oscar López ",
        "slug": "femmemodele",
        "cover": "20220922_010942_eb4443f2fffb5b5bc78d3f2406a4f5e0.jpg"
    },
    {
        "podcast_id": 77148,
        "title": "Bitchin' with Bella ",
        "description": "A podcast of just bitching, advice, fashion, pop culture and personal stories ✩ \nfor more content follow my instagram at @Bella.lombardi \nhttps://www.instagram.com/bella.lombardi/",
        "language": "en",
        "author_name": "Bella Lombardi",
        "slug": "bitchinwithbella",
        "cover": "20220819_040829_f8a897253039aac43941b1b4ebe94680.jpg"
    },
    {
        "podcast_id": 80063,
        "title": "You're My Friend and I Miss You",
        "description": "Two friends who now live states away from each other sit down once a month to catch up and make each other laugh. Sometimes guests appear.",
        "language": "en",
        "author_name": "You're My Friend and I Miss You",
        "slug": "myfriendpodcast",
        "cover": "20210918_200107_dc54a7a7197eaf9a8f36a83ab3b59fef.jpg"
    },
    {
        "podcast_id": 80613,
        "title": "Keeping up with Figne",
        "description": "Hejsa, mit navn er Seraphine Selawry, og i denne podcast vil jeg tale om alt fra mit gymnasie liv, til mine dagligdags tanker, mine overvejelser om bestemte emner, og alt muligt andet. Personligt føler jeg selv, at jeg har en del tanker som teenager, og ved at dele dem højt, håber jeg at kunne skabe en følelse om, at man faktisk ikke er alene om ens tanker, og på den måde skabe et slags frirum. Jeg håber at du vil lytte med, og hvis du har nogen kommentar til episoderne, så endelig skriv til mig på instagram: Seraphine.selawry - Knus herfra &lt;3",
        "language": "da",
        "author_name": "Seraphine Selawry",
        "slug": "keeping-up-with-figne",
        "cover": "20221105_031155_5543f291fb74cfa24c37e3b04b159155.jpg"
    },
    {
        "podcast_id": 81570,
        "title": "Waxing Leos Podcast",
        "description": "We're bringing realness to the beauty world, whether it's ready for it or not. Follow along to hear all about how we're making changes and an impact in our local beauty communities and beyond.  ",
        "language": "en",
        "author_name": "Brianna Hess & Moriah Justin",
        "slug": "waxingleos",
        "cover": "20210926_142005_b8608954f167825555787ac4d2fdb9a6.jpg"
    },
    {
        "podcast_id": 82116,
        "title": "The Trillosophy of Milo & Sam",
        "description": "Fashion, Positivity, Clothes. A Podcast For Those Who Go Against The World And Dress. \n\n\" New Episode \" Every Thursday.\n\nMOSHPITT!!\n\nthis has been a Dopeness Outta Dexter™ production",
        "language": "en",
        "author_name": "Milo & Sam",
        "slug": "trillosophypod",
        "cover": "20210928_234415_f7df069fb3be0886b1012a0f71fdcc74.jpg"
    },
    {
        "podcast_id": 82431,
        "title": "Tea time with TopVintage ",
        "description": "Get yourself a cup, lean back and enjoy a chat with our TopVintage ladies.",
        "language": "en",
        "author_name": "TopVintage",
        "slug": "teatime-topvintage",
        "cover": "20210930_124212_a10451b2246f8040904b1f01d04bbced.jpg"
    },
    {
        "podcast_id": 83505,
        "title": "Achieve Balance podcast ",
        "description": "A New Balance based podcast about all things NB past present and future ",
        "language": "en",
        "author_name": "Mark Baldacchino",
        "slug": "achievebalance",
        "cover": "20211104_123942_838bcff6ebab95b6e4c753ab45155680.jpg"
    },
    {
        "podcast_id": 84109,
        "title": "Hosting and Growing with Ana Wolfermann",
        "description": "<p>Hosted by Ana Wolfermann, Creating Happiness Podcast is a weekly conversation about navigating life in your 20's through personal growth, accomplishing goals, cultivating relationships, living with gratitude, and taking control of your own happiness. Through a candid, positive, and genuine approach Ana shares her experiences, entertains, and encourages listeners! For business inquiries email: ariana@thedigitalbrandarchitects.com</p>",
        "language": "en",
        "author_name": "Ana Wolfermann",
        "slug": "anawolfermann",
        "cover": "20230917_020925_401c5ad5ff42140cda7f97756474d2f7.jpg"
    },
    {
        "podcast_id": 85044,
        "title": "MPG Podcast: Mindset.Purpose.Growth",
        "description": "<p>Wasup Y’all ! 💕 Welcome to M.P.G podcast. This podcast is intended to provide a safe space for my listeners, to talk about all things growth, even the topics that make us uncomfortable. I will be discussing topics on Mindset, purpose, growth, success, transformation and EVERYTHING mental health, especially for my melanated Kings and Queens!</p>",
        "language": "en",
        "author_name": "Shamicka Lisette",
        "slug": "shamickalisette",
        "cover": "20230629_050602_f94a59b8524525ef6e05642ce05a441a.jpg"
    },
    {
        "podcast_id": 86436,
        "title": "Vaulti Radio",
        "description": "You are now tuned in to Vaulti Radio. Thanks for clicking and checking us out! We are a part of a Vintage, Streetwear, and Sneaker store in San Antonio called the Vaulti and on this podcast are your hosts Carlo, Avery, and Kenyan. We will try to hit on as many topics as humanly possible but primarily we focus on fashion, music, and pop culture. If you like what you hear feel free to subscribe, it's free ;) and let us know what you want us to talk about next!\n",
        "language": "en",
        "author_name": "Giancarlo Ferruzzi",
        "slug": "keytothevault",
        "cover": "20211105_160454_38b608d65957de4283a05ee126576986.jpg"
    },
    {
        "podcast_id": 86858,
        "title": "Sin Filter",
        "description": "<p>Un espacio donde hablaremos \"sin filter\". Compartiremos experiencias sin juzgar y nos divertiremos en el proceso. Así que have a sit, relax and enjoy! Episodios nuevos todos los miércoles. No olvides de compartir con tus amigos y conmigo tus pensamientos acerca del episodio que escuches. A mi me podes encontrar en IG: @etiquetanegra__</p>",
        "language": "es",
        "author_name": "Etiqueta Negra",
        "slug": "sinfilterpodcast",
        "cover": "20230605_020629_80ff8b5dbbd6a33a1a60082eb4543dc8.jpg"
    },
    {
        "podcast_id": 87271,
        "title": "Crowning Moment",
        "description": "<p>Casey Gibson, a 24-year-old, life-long pageant queen living in North Carolina. In addition to working a full-time job, she chooses to spice life up with weekend adventures and doing hair/make-up for beauty queens and brides all over the country. The Crowning Moment podcast gives a look into the behind the scenes of what pageantry is all about.</p>",
        "language": "en",
        "author_name": "Casey Grace Gibson",
        "slug": "crowningmoment",
        "cover": "20230809_070804_9f5ce3754add2f7ff5440b55730c85dd.jpg"
    },
    {
        "podcast_id": 87525,
        "title": "Faith and Fashion 360",
        "description": "<p> Faith and Fashion 360 is a space for millenials of Christ to listen to timely topics about fashion, faith and everything in between. Come listen to wardrobe stylist and plus sized model Brieana Ofosu chat with her fashionable friends, break down the journeys Of entrepreneurship, and bless your socks off-faithful moment after faithful moment. So many times we’re told who to be as Christians-let’s change the narrative</p>",
        "language": "en",
        "author_name": "Brieana Ofosu",
        "slug": "faithandfashion360",
        "cover": "20230303_090303_d1f9124fa051136e19f79d4d998ff0e4.jpg"
    },
    {
        "podcast_id": 88386,
        "title": "We Gotta Talk",
        "description": "We Gotta Talk is a podcast that gives listeners a warm welcome as we dive deep into heavy discussions about relationships, sex, mental health, pop culture and social media. ",
        "language": "en",
        "author_name": "JAI",
        "slug": "wegottatlk",
        "cover": "20220703_080708_1f7ffda8e25279d0ba90a975e9dd4b46.jpg"
    },
    {
        "podcast_id": 88564,
        "title": "In I Kaklet",
        "description": "@inikakletpodden: två vänner i skönhetsbranschen tipsar om livets goda!",
        "language": "sv",
        "author_name": "Glowbynats & Browfelicia",
        "slug": "inikakletpodden",
        "cover": "20221218_061204_8cb4a39dff64ae170d26a8f713b99d3f.jpg"
    },
    {
        "podcast_id": 90832,
        "title": "都市夜未央",
        "description": "这个播客是生活在纽约这座大城市里的两个年轻人,讲述着在他俩身边发生过的或者正在发生的事情.🥃🚬\n固定北美时间每周二更新🤭 special release随缘不定期空降🪂",
        "language": "en",
        "author_name": "Derek Yang",
        "slug": "yangandcao",
        "cover": "20211124_011143_edb039bc69c8b1d2f61d66acf692b91d.jpg"
    },
    {
        "podcast_id": 91859,
        "title": "Le Fleur Records",
        "description": "Welcome to Le Fleur Records 💽 Hosted by Ren & Fabrizio, we love music, fashion, cars, art, etc. We’ll talk about anything related to those things.",
        "language": "en",
        "author_name": "Fabrizio & Ren ",
        "slug": "lefleurrecords",
        "cover": "20211128_101111_c009aac395e82c6495b20f9831038695.jpg"
    },
    {
        "podcast_id": 92157,
        "title": "Image Gang: The Group Chat",
        "description": "Join Isabelle and guests each week for a fun, honest and open conversations dealing with issues and topics that are usually left in the group chat.\n",
        "language": "en",
        "author_name": "isabelle white",
        "slug": "theimagegangpodcast",
        "cover": "20211123_061146_34f4f15d18e4f9671b471decf6cf3523.jpg"
    },
    {
        "podcast_id": 92430,
        "title": "Keeping Up With The Trendashians",
        "description": "<p>I talk, a lot! Listen in for a fun, chilled and basically messed up views on literally any and all topics! Let’s have some fun! Laughter and joking is a dying art so I’m bringing it back because, I got the mouth for it!</p>",
        "language": "en",
        "author_name": "Rita",
        "slug": "ritarants",
        "cover": "20230705_120738_efad358a652e4039fa72da93bdd82fb2.jpg"
    },
    {
        "podcast_id": 94336,
        "title": "MTC CAST - O PodCast da sua Transição",
        "description": "O MTCCAST É um podCast, para você que está, esteve ou estará na TRANSIÇÃO CAPILAR, é um podcast, para dicas, batePapos, conversas com Especialistas.\nTudo para lhe ajudar a passar pela Transição Capilar!!",
        "language": "pt-br",
        "author_name": "Senhora MTC , Paulo Damasceno",
        "slug": "mtc",
        "cover": "20211206_051234_54922295cd43618a51bc27bef96be7e8.jpg"
    },
    {
        "podcast_id": 94769,
        "title": "The Skin Club Podcast",
        "description": "<p>Welcome to the club! Hang out with Alida &amp; Rachel every Monday for some tips and advice about skin, life, health &amp; business! Intended to encourage, inspire, uplift, make you laugh and connect! We are happy you’re here!</p>",
        "language": "en",
        "author_name": "Alida & Rachel",
        "slug": "theskinclubpodcast",
        "cover": "20230522_040537_b7eaa5ffa6c486cea2bf863c44262b79.jpg"
    },
    {
        "podcast_id": 95203,
        "title": "MKs Archive ",
        "description": "Interviews with creatives within the technical and outdoor fashion space. ",
        "language": "en",
        "author_name": "MK",
        "slug": "mksarchive",
        "cover": "20211223_071255_a177114762acd2dc7b3354e57f29e9d2.jpg"
    },
    {
        "podcast_id": 96004,
        "title": "Hair Full Of Secrets",
        "description": "Everyone always says their hair stylist is like their therapist, and that couldn't be more accurate! But with no training on how to effectively care for another person's mental health, what impact does that have on your beauty practitioner? This podcast explores what mental health, wellness, and self care mean to a variety of beauty experts. How do they incorporate that into their daily routine? What tools do they have to make sure they are taking care of their health? And how do they make sure they are also being the best they can be to have a positive impact on their clients? All of this and so much more will be discussed in Paige Klibanoff's first season of Hair Full of Secrets! ",
        "language": "en",
        "author_name": "Paige Klibanoff",
        "slug": "hairfullofsecrets",
        "cover": "20211215_081202_6c55827e7b26f17e529e962f28dc51d2.jpg"
    },
    {
        "podcast_id": 96690,
        "title": "Thoughts I Have When I'm Driving ",
        "description": "<p>Hello! Welcome to my podcast, Thoughts I Have While I'm Driving. Whenever I am in the car, I always think and reflect about life changes and the world in general, so I figured, why not record it? This podcast is all about navigating the world as a 20-something-year-old. It covers topics from mental health, body image, college insight, and life post-grad.</p>",
        "language": "en",
        "author_name": "Natalie Scott",
        "slug": "youngadultperspective",
        "cover": "20230628_050646_4975c395e36d1be161bbb9c857c8cd56.jpg"
    },
    {
        "podcast_id": 97269,
        "title": "Context Only",
        "description": "Context Only is a conversation between Photographer Tyler Chick & his guests. Whether it be the leaders of fashion & entertainment to someone fresh off the street with a dream, Context Only is a space that combines a photo session with a conversation about the experiences that make us human.",
        "language": "en",
        "author_name": "Tyler Chick",
        "slug": "contextonly",
        "cover": "20220210_080204_007668f719457e6364df44beaacb30eb.jpg"
    },
    {
        "podcast_id": 98716,
        "title": "She Said What She Said",
        "description": "#SheSaidWhatSheSaid is a fun, honest podcast fronted by a best friend duo who are willing to talk about (almost) anything and everything. From relationships to situationships to everyday life experiences, you can expect unadulterated girl talk with no filter that’s appealing to both men and women. We hope you enjoy the show!",
        "language": "en",
        "author_name": "She Said What She Said",
        "slug": "shesaidwhatshesaid",
        "cover": "20220311_060306_c8a916264f77ac685b7c299df8b5b348.jpg"
    },
    {
        "podcast_id": 100146,
        "title": "The Dermastore® Podcast",
        "description": "All things skincare, skin health and if you're a real skin nerd, we hope you'll join the conversation. pod@dermastore.co.za",
        "language": "en",
        "author_name": "Greg (Co-Founder/MD) & Lara (Head of Content/Education)",
        "slug": "dermastore",
        "cover": "20220111_020100_807e4b24f18c3f193878667f8b6416e1.jpg"
    },
    {
        "podcast_id": 100242,
        "title": "You Can't Say That",
        "description": "A podcast created by Prickly Thistle, talking about all things in the world of fabric and fashion that often many say 'you can't say that' about.  But at Prickly Thistle, we say yes, you can say that!",
        "language": "en",
        "author_name": "Prickly Thistle",
        "slug": "pricklythistle",
        "cover": "20220115_060114_60c2f3cb2caee3f05d0c3f466cfc7cbd.jpg"
    },
    {
        "podcast_id": 100508,
        "title": "Two Broke Girls",
        "description": "Raeleigh Windham and Baylee Ockomon chat about relationships, health, fashion & everything in between on this crazy adventure they call their 20s. ",
        "language": "en",
        "author_name": "Raeleigh Windham and Baylee Ockomon",
        "slug": "twobrokegirlspodcast",
        "cover": "20220113_030127_a5694feac02145d01c6d250b3bb7ec0f.jpg"
    },
    {
        "podcast_id": 100865,
        "title": "LOVEGODESSS Podcast with Katya Melvin",
        "description": "Welcome to Lovegodesss podcast. Here we help regular women like you embrace their sexual confidence, step into their power, take charge of their own life, and become the most beautiful and sexiest versions of themselves. Lovegodesss is a woman who unapologetically accepts herself without second-guessing. She breaks people pleasing patterns and reclaims her independent power to become  the most authentic and confident version of herself.",
        "language": "en",
        "author_name": "Katya Melvin",
        "slug": "lovegodesss",
        "cover": "20220114_080106_ea2bfd4a28dbe06fe4fd0388ecded294.jpg"
    },
    {
        "podcast_id": 101211,
        "title": "Beauté Imaginée",
        "description": "Pas besoin de s’exposer pour parler ensemble de beauté !\nDans chacun de mes podcasts, j'interroge un invité sur un thème précis : comment imagine-t-il la beauté ? Puis je vous fais imaginer à vous auditeurs 3 infos sur mon invité !\nConsommateurs, professionnels des cosmétiques ou influenceurs, je mixe les profils… Avec un thème récurrent : la beauté naturelle et engagée.\nRdv sur Instagram pour la photo mystère après chaque podcast !\nPensez aux étoiles pour me soutenir ⭐️😊",
        "language": "fr",
        "author_name": "Alice ",
        "slug": "beauteimaginee",
        "cover": "20220705_090748_5cb997a84a0fbb290bcbd3691a7a441f.jpg"
    },
    {
        "podcast_id": 102334,
        "title": "Bossing it with Bell and Bennett!!",
        "description": "Bossing it with Bell and Bennett will attempt to guide you through all things uni, travel, boy, girls, business, bucket list and every intimate detail in between. We can't promise it'll make much sense, give any beneficial advice nor are we experts by any means. We can, however, vouch for our professional bullsh*t and we promise to guide you through these tricky times as best as we can. We're the big sisters you never knew you needed. Can't wait to chat x",
        "language": "en",
        "author_name": "Bossing it with Bell and Bennett",
        "slug": "bossingitwithbellnbennett",
        "cover": "20220120_080155_ae0195bedbb3963e3888ac6f8c6b109e.jpg"
    },
    {
        "podcast_id": 102530,
        "title": "Style Talk",
        "description": "Tatjana ist Fashion-Profi. Ihre Partner sind Profis auf ihrem Gebiet. \nDas verbindet und Style gehört in allen Bereichen dazu. \n\nDarüber will Tatjana sprechen: über Style von Profi zu Profi. \nDazu hat Tatjana das neue Format Style Talk mit … kreiert. In diesem unterhält sich Tatjana mit Profis über Style. Was bedeutet Style für dich? Was macht ein stilvoller Auftritt aus? Wie beeinflusst Style dein Tun und Wohlbefinden?\n\nIn einem Talk unter Profis stellt Tatjana ihren Gästen Fragen über Style in ihrem Berufsalltag und in ihrem Privatleben. Dazu gibt sie selbst immer wieder Stylingtipps. Reinhören und inspirieren lassen.\n",
        "language": "de-ch",
        "author_name": "Kotoric",
        "slug": "tatjanakotoric",
        "cover": "20220121_010138_05753894ab2d480f42893953e6cbf8f0.jpg"
    },
    {
        "podcast_id": 102927,
        "title": "BFF TALKS",
        "description": "Biri Türkiye'de biri Amerika'da iki yakın dost, ilişkiler, gündem, magazin, sosyal medya kısaca hayata dair tüm deneyimlerini, hikayelerini konuşuyor ve sizi de sohbetlerine çağırıyorlar! ",
        "language": "tr",
        "author_name": "Bff Talks",
        "slug": "bfftalkss",
        "cover": "20220122_110120_500e5104060e15b2391f73f4cd716273.jpg"
    },
    {
        "podcast_id": 104020,
        "title": "American Girl Women",
        "description": "<p>American Girl Women is a podcast where two millennial gals gather ‘round the microphone and reminisce on the cultural phenomenon that took our childhoods by storm: American Girl Dolls. Contrary to what you might think, we aren't just talking about dolls here. We're diving into the high highs and low lows of getting hooked on AG and all the childhood memories that come flooding back. Plus, we're forever discussing the iconic AG catalog—the most treasured piece of literature to ever grace our mailboxes. If you're still bitter about not getting Samantha's brass bed, if you sent Kirsten to the doll hospital for a botched hair cut after taking out her braids, or if every winter you dream of Addy's Christmas dress, join us + our guests each Tuesday. Send us your AG stories below! americangirlwomen@gmail.com IG:@americangirlwomen</p>",
        "language": "en",
        "author_name": "Laura Tretter + Lindsey Adams Franke",
        "slug": "americangirlwomen",
        "cover": "20220127_120136_9e56547d3961407e9daa7dc623330321.jpg"
    },
    {
        "podcast_id": 105184,
        "title": "Un Poquito De Todo",
        "description": "Holaaaa! Mi podcast va hacer un poco de todo. Cosas de la vida, entretenimiento etc ",
        "language": "es",
        "author_name": "Anahi Gomez",
        "slug": "consejos",
        "cover": "20220212_080208_85d8acf0a71c0cdb4eb4ea19c4caf6c2.jpg"
    },
    {
        "podcast_id": 105998,
        "title": "Feferity Inspire",
        "description": "Feferity radio supports community and educational conversations that focus on issues important to the local and our international communities. We promote artists, musicians, writers and creatives. We facilitating conversations that helps voice out opinions and experiences to our wider audience. ",
        "language": "en",
        "author_name": "Feferity Radio",
        "slug": "feferity-inspire",
        "cover": "20220203_010258_16c178c54eaaf3a19cf718dceda89fba.jpg"
    },
    {
        "podcast_id": 106441,
        "title": "Melanin at the Roundtable",
        "description": "Welcome to the Roundtable! Join us as we talk about past, current, and future events from the perspectives of black women with special guests.",
        "language": "en",
        "author_name": "Shelise Cadet",
        "slug": "matr",
        "cover": "20220205_030213_e145cf6f8d03f8d3c8be00ebb80c0772.jpg"
    },
    {
        "podcast_id": 107095,
        "title": "Grow n' Flow",
        "description": "Carly Scruggs talks all things normal developing adults struggle with. From the universal feeling of being alone to how medicine treats minorities. Including guests to talk about an array of topics that may impact listeners, or may help us have more compassion for people.\nGrowth happens when we push our boundaries. That journey is not linear and that's why we'll flow together, too!",
        "language": "en",
        "author_name": "Carly Scruggs",
        "slug": "grownflow",
        "cover": "20220207_070242_4752402db87ba528e1ed9b8bdb1dba23.jpg"
    },
    {
        "podcast_id": 107106,
        "title": "ראפ ענבים | Grape Rap",
        "description": "ראפ ענבים הוא פודקסט על היפ הופ, סניקרס, סטריטוור ומה שביניהם.\nמבטיחים להביא קצת אקטואליה, סיפורים מעניינים, נקודות מחשבה חדשות, נושאים מהעבר שמעניינים אותנו היום וגם אורחים מעניינים ועוד ועוד!!\nבבקשה אל תיקחו אותנו ברצינות, 99% מהזמן אנחנו לא עושים את זה בעצמנו.\nולמה ענבים? כי למה לא בעיקרון 🍇🍇\nPeace & Love\nSupport your local",
        "language": "he",
        "author_name": "Alon Krool and Goni Barak",
        "slug": "rapgrape",
        "cover": "20220209_020206_01610f9c2c1ecc5fe383a0f3dc15da6e.jpg"
    },
    {
        "podcast_id": 107257,
        "title": "perSPECtive",
        "description": "The students of USC have such interesting life stories. Whether it be their upbringings, side hustles, internships, or aspirations, every person has a narrative that's worth sharing. So this podcast — which is an extension of SPEC magazine, a student-run fashion, lifestyle, culture, and wellness publication at USC — was made in an effort to capture those unique perspectives and, for a minute, see the world through the eyes of USC's most innovative thinkers. Hosted by Chloe Kopsky, she sits down with an array of students and navigates their life stories through honest, engaging conversation. ",
        "language": "en",
        "author_name": "SPEC magazine ",
        "slug": "perspectivepod",
        "cover": "20220208_060244_57bfac03f1105692c37054d2c323d227.jpg"
    },
    {
        "podcast_id": 107423,
        "title": "SIERRA SPRAGUE",
        "description": "my lifes a mess lol lets talk about it",
        "language": "en",
        "author_name": "Sierra Sprague",
        "slug": "sierrasprague",
        "cover": "20220208_090206_67967996f5f48627592881aba861e643.jpg"
    },
    {
        "podcast_id": 108138,
        "title": "Heavy Smoke Podcast With Shiest Bubz",
        "description": "The Heavy Smoke Podcast  is all about  Fashion, Weed, Music and Culture . Our Host Shiest Bubz and his Co-Host Lisa B brings you an exciting platform from some of the most influential tastemakers in our culture. From the OG himself Shiest Bubz has experience his share of lifestyle and bring you the true love for why we do what we do in our culture everyday to set trends , shift culture and bring different flavors from all over .\n",
        "language": "en",
        "author_name": "Shiest Bubz",
        "slug": "theheavysmoke",
        "cover": "20220429_050403_0e4a28fd7b04c4549c90ffd33f63c3fc.jpg"
    },
    {
        "podcast_id": 108803,
        "title": "Moda por Amor",
        "description": "Diálogos irreverentes e NADA fúteis para deixar bem claro que a moda importa.",
        "language": "pt-br",
        "author_name": "Erika Gottsfritz",
        "slug": "modaporamor",
        "cover": "20220218_030244_049152b791199183881b1d0606b44650.jpg"
    },
    {
        "podcast_id": 108981,
        "title": "On The Lash With Lashes By Evia",
        "description": "Your No.1 eyelash extension podcast for fellow lash addicts. Talking about all things lash related from starting your own eyelash business to day to day life as a lash artist. I will be giving you all the tips and tricks you need as a client and an eyelash technician as well as interviews with other lash artists around the UK and clients. Its never a normal day around here so stick around and join the craziness On The Lash has to offer. Hosted by Jess Black and the owner of Lashes By Evia, Evia Childs.",
        "language": "en",
        "author_name": "Lashes By Evia",
        "slug": "onthelashwithlashesbyevia",
        "cover": "20220215_030207_59d1882a1ab6d712ab92b87d215f54fc.jpg"
    },
    {
        "podcast_id": 109508,
        "title": "The Sunday Shampoo",
        "description": "<p>Sunday -- the day of the week between Saturday and Monday. In most Western countries, considered a day of rest and a part of the weekend, whereas, in much of the rest of the world, it is considered the first day of the week. Shampoo -- a hair care product, typically in the form of a liquid used for cleaning hair. Start your Sunday off right with The Sunday Shampoo, a podcast meant to detox your soul while you detox your hair. From all things hair to industry secrets to a family of friends. The Sunday Shampoo is controlled chaos made for all Sunday routines. Sit back, cleanse that scalp, and let’s have ourselves a Sunday. STAY TUNED FOR NEW EPISODES SUNDAY, EVERY 3 WEEKS!</p>",
        "language": "en",
        "author_name": "Valor & Violet",
        "slug": "thesundayshampoo",
        "cover": "20220217_030249_84f55d304e513b08f0e462d4cad040c0.jpg"
    },
    {
        "podcast_id": 110301,
        "title": "Tonik szépségpodcast ",
        "description": "Elérhetőségeink:\nWebshop: https://solanie.hu/\nFacebook: https://www.facebook.com/SolanieProfessionalCosmetics\nInstagram: https://www.instagram.com/solaniecosmetics/\n",
        "language": "hu",
        "author_name": "Alveola",
        "slug": "tonik-szepsegpodcast",
        "cover": "20220221_070234_fafb3fe2a4b9c8d73fe2b2b1a71af029.jpg"
    },
    {
        "podcast_id": 111167,
        "title": "topics with elle ",
        "description": "Instagram: @elle.lee\nSnapchat: @ellelee55",
        "language": "en",
        "author_name": "Elle",
        "slug": "ellelee",
        "cover": "20220224_090217_20f83e981b77966f35cfdb845d63bc92.jpg"
    },
    {
        "podcast_id": 113014,
        "title": "For Love and Gossip ",
        "description": "<p>Two girls who love to talk and gossip and discuss everyday life experiences. Follow along as we talk about relationships, travel, self-care, fitness and the latest celebrity gossip!</p>",
        "language": "en",
        "author_name": "Ayana and Madeline",
        "slug": "forloveandgossip",
        "cover": "20230419_110424_26abfc9f42cdaa0a03f8d0574dbc32f4.jpg"
    },
    {
        "podcast_id": 115472,
        "title": "Art of Undress",
        "description": "The Art of Undress explores the ideas of undress by exploring through a 8 episode podcast series looking at undress in conjunction with sex, identity, society and habits. The conversations will be lead with guests from photographers that use undress in their art work, people that work within the industry of fashion, to close friends and family. Gaining a broader perspective and allowing the primary research to be guided through the eyes of those that are in conversation with. \n          ",
        "language": "en",
        "author_name": "Ethan Goodchild",
        "slug": "artofundress",
        "cover": "20220315_110307_f05faaba5472ad21186683c71b56a6ee.jpg"
    },
    {
        "podcast_id": 115857,
        "title": "The Reign Podcast",
        "description": "Welcome to the Reign Podcast..\nAs young women in business and the beauty industry we’ll be bringing you all the topics we know you’ll love! \nJoin us every Monday for a girly, inspirational catch up! ",
        "language": "en",
        "author_name": "Danae Stott, Stephanie Mallinson, Alex Doyle",
        "slug": "the-reign-podcast",
        "cover": "20220317_050313_7fa171a9e7357d5872fa5da5b3a4c285.jpg"
    },
    {
        "podcast_id": 115928,
        "title": "Confidently Uncertain",
        "description": "Confidently Uncertain focuses on the world of trend forecasting and the factors that affect it. My idea is to create a platform that will provide an audience with an opportunity to be better educated on where fashion trends are headed in the future and why.",
        "language": "en",
        "author_name": "Erica Lascala",
        "slug": "confidentlyuncertainpod",
        "cover": "20220317_080324_027a9092bfedd7cac0441b28d55e4ac7.jpg"
    },
    {
        "podcast_id": 115957,
        "title": "The Fashion Chat",
        "description": "In this podcast, I will discuss the fashion industry based on current event topics. For each podcast, there will be a new topic relating from new fashion styles to runway shows. If you like the fashion industry and would like to have an open conversation, feel free to listen.",
        "language": "en",
        "author_name": "Morgan",
        "slug": "anythingfashion",
        "cover": "20220614_080650_e881af529ac348805e0924aac8133755.jpg"
    },
    {
        "podcast_id": 116395,
        "title": "Two Twenties",
        "description": "Two best friends in their twenties, the same age but living very different lives. Talking all things business, fashion, health & fitness, mum life, being single & relationships.",
        "language": "en",
        "author_name": "Abbey Steanes and Charli McCusker",
        "slug": "twotwenties",
        "cover": "20230112_080125_4e2a77ea6e96e704ad26a3e1ea4ff036.jpg"
    },
    {
        "podcast_id": 116643,
        "title": "Tu Podcast de la mirada by Nost Cosmetics",
        "description": "En Nost Cosmetics trabajamos activamente por y para tu mirada. En tu podcast de la mirada, podrás disfrutar de varias conversaciones que hemos tenido con nuestros expertos médicos, donde nos cuentan cómo rejuvenecer la mirada, diferentes tipos de tratamientos no invasivos y cirugías, trucos y consejos de cómo prevenir imperfecciones típicas de la edad y mucho más con un solo objetivo: contarte cómo tener una mirada de 10 que transmita toda la juventud y belleza que llevas y sientes dentro. \n¡Te esperamos! ",
        "language": "es",
        "author_name": "Nost Cosmetics",
        "slug": "nostcosmetics",
        "cover": "20220321_120353_748ee86b65b8c428d110563728de27ad.jpg"
    },
    {
        "podcast_id": 117398,
        "title": "Thrifted Threads",
        "description": "Welcome to the Thrifted Threads podcast where we will be discussing the world of thrifting, sustainability, and social justice within the fashion industry.",
        "language": "en",
        "author_name": "Liz Jenkins",
        "slug": "thriftedthreads",
        "cover": "20220324_040322_bd7b31bd482b4fd48810e99f904e3d5a.jpg"
    },
    {
        "podcast_id": 118348,
        "title": "Hair Notes Podcast ",
        "description": "The HairNotes Podcast was created to motivate, inspire and educate the everyday curly girls on haircare and maintenance for their curly hair. Giving them tangible tips and products reviews as needed to assist them on their hair journey.",
        "language": "en",
        "author_name": "Maxine Green",
        "slug": "hairnotes-podcast",
        "cover": "20220517_040546_cce11c62271bee27e96411962c9c0c19.jpg"
    },
    {
        "podcast_id": 119568,
        "title": "Louder With Luu ",
        "description": "How I got started in the lash industry, my story, talking to different entrepreneurs and beauty people in the industry, giving out business tips and more.",
        "language": "en",
        "author_name": "Guadalupe Espinoza",
        "slug": "louderwithluu",
        "cover": "20220403_120410_959c56c02587e33c0fa52b8575d8e60b.jpg"
    },
    {
        "podcast_id": 120380,
        "title": "The Four Points Podcast",
        "description": "The Four Points Podcast is a podcast dedicated to highlighting titleholders within the Miss America Organization and their achievements. The four points on the Miss America crown stand for style, service, success, and scholarship, so this podcast was created to give titleholders a fun platform to talk about their experience in the organization and these ‘four points’! \n\nEvery episode will feature a special guest titleholder within the Miss America Organization, who will expand upon their experiences and their successes!",
        "language": "en",
        "author_name": "Madeline Fisher",
        "slug": "thefourpointspodcast",
        "cover": "20220406_030420_8e0d37cb48b25cb5337f2b62f9134801.jpg"
    },
    {
        "podcast_id": 121325,
        "title": "The Beauty Sleep Podcast by The Base Collective ",
        "description": "Are you one of the 48% of people who struggle to get restorative sleep? Our Podcast features sleep meditations, breathing techniques, self care and sleep sounds designed to help create a positive bedtime routine and get you sleeping soundly and waking refreshed. Our Beauty Sleep Podcasts will help you fall asleep faster, stay asleep longer and wake refreshed. Designed to complement our Award Winning Beauty Sleep Range which is available online www.thebasecollective.com.au Use Code PODCAST for 20% off at checkout. ",
        "language": "en",
        "author_name": "The Beauty Sleep Podcast by The Base Collective ",
        "slug": "beauty-sleep-by-the-base-collective",
        "cover": "20220411_030457_d580eb2a13e6f285353d4d62c7d69e2b.jpg"
    },
    {
        "podcast_id": 122616,
        "title": "AKELARRE Podcast con Didier Maldonado",
        "description": "En este podcast vamos a platicar de arte, crecimiento personal, inspiracion, talento y conocer personas con creatividad y vision unica en diferentes campos. Cada persona es un mago en su arte, vamos a conocer la receta. ",
        "language": "es",
        "author_name": "Didier Maldonado",
        "slug": "akelarremx",
        "cover": "20220614_080640_d815e1e4f8c706edcddefce03e8c1008.jpg"
    },
    {
        "podcast_id": 123136,
        "title": "Advanced Fashion Disruption",
        "description": "Advanced fashion disruption’s methodology is to recognize the roots of emerging creativity, OPENLY discuss the current fashion being shown (good, mediocre, embellished, bad, or plain copied), temper the things we see light and forward movement in with what can be improved upon. We will honestly review venues and shows to shine light on which one’s leverage the strongest return for participants. Our commitment to open civil conversation will take place in our After Care fashion series. Our intention is to be stinging with our combined critical expertise, but provide solutions to pervasive fashion business issues.",
        "language": "en",
        "author_name": "Megan Summerville and Benson Roberts III",
        "slug": "advancedfashiondisruption",
        "cover": "20220419_080459_3d99b839d6e1cc11e13fe6d86d53ab0a.jpg"
    },
    {
        "podcast_id": 123255,
        "title": "Barbers Only Magazine Presents.... The week in barbering w/ Mr. Taper",
        "description": "Mr. Taper Of BOM talks about the best and most interesting topics in the world of barbering.",
        "language": "en",
        "author_name": "Mr. Taper",
        "slug": "barbersonlymagzine",
        "cover": "20220420_070420_c09b55100840bd0aa88a08b8f6824a28.jpg"
    },
    {
        "podcast_id": 123427,
        "title": "The Oh Podcast",
        "description": "Oh…hey it’s you….Listen, this has been a long time coming and what better way to start off than discussing what Oh is?\n\nHit the play button if dating, humor, fashion, and mental health are things that interest you.\n\nIt's a new year, so that means NEW SEASON! We hope you are ready!\n\n- Rachel and Sharon",
        "language": "en",
        "author_name": "Rachel Mokarow & Sharon Anderson",
        "slug": "theohpodcast1",
        "cover": "20230111_040127_51c2b705f815a98799633eab42b72cb5.jpg"
    },
    {
        "podcast_id": 124603,
        "title": "Street Cred - the podcast for streetwear fashion brands",
        "description": "The ONLY podcast for streetwear brands wanting to sell out on their next clothing drop. \n\nI'm Elijah Delporte, founder of Wink Films, content strategist for streetwear brand, and host of the Street Cred podcast.\n\nInstagram: @elijahdelporte\nWebsite: www.winkfilms.com\nContact: elijah@winkfilms.com",
        "language": "en",
        "author_name": "Elijah Delporte",
        "slug": "streetcred",
        "cover": "20220816_120836_bbb94f74eac527b4b35979229a99518e.jpg"
    },
    {
        "podcast_id": 125385,
        "title": "Cartas Al Universo Con Nayeli Torres",
        "description": "<p>Cartas Al Universo es un espacio creativo en el cual junto con invitados especiales, hablaremos acerca de temas como la salud holística, estilo de vida, y desarrollo personal.</p>",
        "language": "es",
        "author_name": "Nayeli Torres",
        "slug": "nayelitorres",
        "cover": "20230725_110735_6b946455fe25980d5aab771a718f3a4c.jpg"
    },
    {
        "podcast_id": 126094,
        "title": "Fashion Questions...",
        "description": "<p>This fashion podcast, brought to you by Hyve Group, gives voice to a powerful network of fashion industry insiders. The group's fashion portfolio includes Moda at Spring &amp; Autumn Fair, Pure London and Source Fashion. Each episode will focus on a new question, with a different change maker expressing views on what the answer could be. A range of experts and retailers talk about everything from 'how can fashion become more inclusive' to 'should your business enter the metaverse?'</p>",
        "language": "en",
        "author_name": "Hyve Group plc",
        "slug": "hyve-fashion-questions",
        "cover": "20220803_100838_f8abd94f15a451ed41b0d7ef4dab5c7e.jpg"
    },
    {
        "podcast_id": 126365,
        "title": "ultraviolnece",
        "description": "lana ",
        "language": "en",
        "author_name": "sped up xoxo",
        "slug": "ultraviolncexoxo",
        "cover": "20220504_030512_a7205a8a07e2b18ae00ada6a62cdfd1d.jpg"
    },
    {
        "podcast_id": 126493,
        "title": "Wellness with S",
        "description": "Hellooo amiguisimxs, bienvenidos sean a esté bello podcast, en el quiero tratar muchísimos temas, pero que podamos sentir que estamos en una charla de amigxs. Aquí hablaré de todo, espiritualidad, amor propio, moda, salud mental, tips de vida, celebs, estéticas, todooo ✨. Gracias por escucharme y acompañarme, les amo 🫶🏻",
        "language": "es",
        "author_name": "Wellness with S Podcast",
        "slug": "wellnesswiths",
        "cover": "20220505_040511_98d1ca2e63bd4f72ef95067036dd2e74.jpg"
    },
    {
        "podcast_id": 126681,
        "title": "Welcome To The Empire!!",
        "description": "Welcome to the Empire!! Where we talk about real life and what it’s like to be an Entrepreneur in todays world! ",
        "language": "en",
        "author_name": "Relentless Empire ",
        "slug": "relentlessempire",
        "cover": "20220506_050518_eb0e5c43e43b84dfdb89cf8125919b05.jpg"
    },
    {
        "podcast_id": 127657,
        "title": "Everywhere With Mare Podcast",
        "description": "Come with me on this journey of self discovery & life we shouldn't take too seriously.",
        "language": "en",
        "author_name": "Mary Pritchard",
        "slug": "everywherewithmare",
        "cover": "20220511_030521_b2ed3229b6231666fd59bcfd0186d0e9.jpg"
    },
    {
        "podcast_id": 128133,
        "title": "#LBSSpodcast",
        "description": "For those who want to be up to date with news and trends from the luxury industry without keeping their eyes glued to their screens, here is the solution. #LBSSpodcast will provide you with all the latest updates on your favorite topics, brought to you by our knowledgeable members.",
        "language": "en",
        "author_name": "LBSS",
        "slug": "lbsspodcast",
        "cover": "20221219_031204_7e4272da69238e0ba1e6a308015b5af8.jpg"
    },
    {
        "podcast_id": 128330,
        "title": "Skincare Made Simple",
        "description": "As a licensed esthetician, certified acne specialist, and someone who has dealt with acne since I was 12 I know the struggle and just how crippling it can feel to not love your skin. In today's world its easy to find information but it can be so overwhelming and hard to tell which advice you should ACTUALLY listen to! That's where Skincare Made Simple comes in! in this weekly podcast we're going to cover all the basics - and more advanced - topics so you can confidently walk into a store and know exactly what your skin needs and which products will do the trick! Life is difficult, skincare shouldn't be!",
        "language": "en",
        "author_name": "Ella Elston",
        "slug": "skincaremadesimple",
        "cover": "20220514_060548_440d61e46e1db754ac7ece71358307ab.jpg"
    },
    {
        "podcast_id": 129169,
        "title": "Let Me Think",
        "description": "<p>Let Me Think is a podcast created and hosted by Takayla Anastasia. If you’re looking for a podcast that feels like an off the rails conversation with a friend then this is the podcast for you. Listen as Takayla brings you top of the mind topics from pop culture to wellness wherever you are in the world.</p>",
        "language": "en",
        "author_name": "Takayla",
        "slug": "letmethink",
        "cover": "20230404_070410_75b41d87245402a4eeb4c1cf0792d463.jpg"
    },
    {
        "podcast_id": 129203,
        "title": "Brideology",
        "description": "Sharing all things wedding and bridal related. Tips, tricks and stories from three bridal consultants to help you better navigate being a bride. Catch the show using your favorite podcast platform. Produced by Princess Bridals, Long Island's longest family owned and operated bridal salon with more than 50 years of bridal expertise and Long Island's largest selection of curvy couture wedding dresses.",
        "language": "en",
        "author_name": "Princess Bridals",
        "slug": "brideology",
        "cover": "20220519_040534_84495ccd155a0d1c31650de832f64a7f.jpg"
    },
    {
        "podcast_id": 131300,
        "title": "send the location",
        "description": "new platform, your same favourite girls (@serenaathompson) + (@yazghotb). welcome to the place where we give you the behind-the-scenes and spill all the tea on this new era of our lives, the men, influencing and most importantly, give you some questionable advice. stay tuned every friday for a new episode and don't forget to follow (@sendthelocationpod) on all platforms so you can be a part of the next one. ",
        "language": "en",
        "author_name": "send the location",
        "slug": "sendthelocation",
        "cover": "20220531_040555_43b833784141a9eff7f7c0d2b2edffbd.jpg"
    },
    {
        "podcast_id": 131644,
        "title": "How to Wear Clothes",
        "description": "Fashion talk and Outfit Inspo",
        "language": "en",
        "author_name": "Jenna",
        "slug": "howtowearclothes",
        "cover": "20220602_010615_a5e832436f8de9f6201db22db33fd979.jpg"
    },
    {
        "podcast_id": 131937,
        "title": "DramaQueen Radio&Podcast",
        "description": "Author: Ladi Lushez \nEngineered by: GBIII\nIntro Beat Produced By: Biggie Bounce music  \nCome talk and comment about my latest #podcast #friendships\ninspired by @MARTINLOUIS & @MISSBARZTV Thank you for believing in me. \n#comment #likes #share\n#linktree https://linktr.ee/dramaqueenlushez \nNow on Detroit 96.7FM Radio\nSHOW LESS\n",
        "language": "en",
        "author_name": "Drama Queen Lushez",
        "slug": "dramaqueenlushez",
        "cover": "20221128_121134_464d0aed4efee6448981e5728b93b791.jpg"
    },
    {
        "podcast_id": 132007,
        "title": "Beauty Lab Stream by Ten Image Professional",
        "description": "Beauty Lab Stream by Ten Image Professional es un espacio para profesionales del sector de la belleza donde se habla de ingredientes cosméticos y maquillaje así como nuevas tendencias y las técnicas más novedosas.",
        "language": "es",
        "author_name": "Cazcarra Image Group",
        "slug": "ten-image-professional",
        "cover": "20220603_120632_2b44ec887946f623bc97d19529ce3c6b.jpg"
    },
    {
        "podcast_id": 132749,
        "title": "Pinkfishes Podcast ",
        "description": "<p>Join us for Our \"New\" Pinkfishes Podcast - In the forever growing industry of lashes, the Pinkfishes team have a lot to say and we thought why not bring our everyday conversations to you lash lovers at home.</p>",
        "language": "en",
        "author_name": "Pinkfishes ",
        "slug": "pinkfishespodcast",
        "cover": "20220607_010655_b33f3a6be8ad29b3b24a4bb74699e3e1.jpg"
    },
    {
        "podcast_id": 135048,
        "title": "Two Bitches Talking Shit",
        "description": "Are you stressed and depressed about that no-good ass man? Do you feel like your homegirl betrayed you? Is money ever enough in these tired-ass relationships? Did Leah take yo' man? Well, find out on Two Bitches Talking Shit, a podcast hosted by best friends Leah and Gabby where they talk shit about living through today's cultural standards and society.",
        "language": "en",
        "author_name": "Two Bitches Talking Shit",
        "slug": "tbts",
        "cover": "20220618_040656_feeb03b8866e957801e61e369191d37e.jpg"
    },
    {
        "podcast_id": 135526,
        "title": "Arriaga a sorrir! 😀",
        "description": "“Arriaga a sorrir” é o novo videocast na área da medicina dentária que pretende falar sobre os temas da saúde oral. \nÉ o podcast ideal, para se manter atualizado sobre os cuidados com a higiene oral e como evitar doenças na cavidade oral. \n\n",
        "language": "pt-pt",
        "author_name": "Clínica Arriaga",
        "slug": "arriagaasorrir",
        "cover": "20220621_030647_4d3b1f7cddfbad344fcb75ebb843b879.jpg"
    },
    {
        "podcast_id": 136631,
        "title": "A FASHION MOMENT WITH TAI CHUNN",
        "description": "\nNot your ordinary radio talk show/ podcast! Tai Chunn has a unique perspective on almost everything.  With humor fun and light banter. Telling today’s stories with a twist of fashion,  black culture , social justice and informed opinions.",
        "language": "en",
        "author_name": "TAI CHUNN",
        "slug": "a-fashion-moment-witht-taichunn",
        "cover": "20220625_050657_31dec46024047470648ffc99f148b5ec.jpg"
    },
    {
        "podcast_id": 137735,
        "title": "Boss Ladies in Lace",
        "description": "Welcome to the new podcast \"Boss Ladies in Lace'\nA Place Where We Talk About All Things Women, Empowerment, Boudoir and Self-Transformation.",
        "language": "en",
        "author_name": "Kristina Dekraker",
        "slug": "bossladiesinlace",
        "cover": "20220630_040625_992d883587ea7c55d990e8755095053e.jpg"
    },
    {
        "podcast_id": 137965,
        "title": "We Should Talk",
        "description": "Kev and Ty here bringing you the latest on music, shoes, fashion, sports, & all things culture. We Should Talk!",
        "language": "en",
        "author_name": "Kev & Ty",
        "slug": "weshouldtalk",
        "cover": "20220801_100821_db85d8bd448ee244b82abce9b52ff2f9.jpg"
    },
    {
        "podcast_id": 138341,
        "title": "UrFavCreativ. ",
        "description": "Your friendly, neighborhood creative sharing her journey in hopes to relate or inspire anyone along their path. (@savagelife.tv)",
        "language": "en",
        "author_name": "Sav",
        "slug": "urfavcreativ",
        "cover": "20220725_070736_b4f9318e34c922f49662f54f20b8c021.jpg"
    },
    {
        "podcast_id": 139144,
        "title": "ASF PODCAST ",
        "description": "Hey !! This podcast is basically just me giving my unwanted/unneeded opinion on everything pop culture related. Thanks for listening !!",
        "language": "en",
        "author_name": "Parker Lesser",
        "slug": "asfpod",
        "cover": "20220707_110759_734daf16185ba2146ea45f11089f1180.jpg"
    },
    {
        "podcast_id": 139836,
        "title": "WTF Is Retail?!",
        "description": "The podcast where we speak to retail business owners about their brand. The good, the bad and the ugly! Presented by Excellent Zephyr your favourite NetSuite and Integration specialists for eCommerce. ",
        "language": "en",
        "author_name": "Excellent Zephyr",
        "slug": "excellentzephyr",
        "cover": "20220711_080721_efa05cedc09c97a658aab5c38232025a.jpg"
    },
    {
        "podcast_id": 140539,
        "title": "It Burns In A Good Way: The Podcast",
        "description": "An unfiltered look into the ups and downs of your 20s and 30s, Mikayla and Mariah talk about all things that burn in a good way (most of the time). Things like student loans, working out, and the things they do to dull the pain. Listen in every week where they cover the things that matter, the things that don’t, and everything in between. \n\nFind us on Instagram @itburnsinagoodway, @mikayla_schneider_, and @mariahlwellman. ",
        "language": "en",
        "author_name": "Mikayla and Mariah",
        "slug": "itburnsinagoodwaypodcast",
        "cover": "20220715_060740_bf9898b0ec0edf970b842f1c0cb2a3e2.jpg"
    },
    {
        "podcast_id": 140561,
        "title": "I Heart Angel Numbers By Avs",
        "description": "<p>Hello! This is the one and only Avs, short for Avanti.</p><p>I'm a spiritual baddie, with a knack for expressing myself through different forms of art, including this podcast!</p><p>Join me as I embark on a self discovery journey and journal my life through this podcast🤍</p>",
        "language": "en",
        "author_name": "Av",
        "slug": "avspodcast144",
        "cover": "20230129_120142_0b3d80c6fc874c2c0249a5499fa478b4.jpg"
    },
    {
        "podcast_id": 141157,
        "title": "HUMANS",
        "description": "Ciao a tutti ragazzi e ragazze! Ecco il Trailer di HUMANS, il podcast che racconterà come il Fitness puó essere uno strumento per crescere sia nel corpo che nella mente.\n.\nIn questo Link puoi trovare anche la nostra pagina IG e i servizi attivi: https://linktr.ee/hu.ma.ns\n",
        "language": "it",
        "author_name": "Matteo Lamorte",
        "slug": "teamhumans",
        "cover": "20220718_070755_bebb21e42d33ed14f446d883c44d808f.jpg"
    },
    {
        "podcast_id": 141323,
        "title": "Radio ITJ - Santa Mónica",
        "description": "Es un espacio donde alumnos desarrollan su creatividad haciendo programas de radio",
        "language": "es-mx",
        "author_name": "Radio ITJ Santa Mónica",
        "slug": "radioitjsantamonica",
        "cover": "20220719_030704_5cd03a08758203dcd6ece4ae4dd03516.jpg"
    },
    {
        "podcast_id": 141391,
        "title": "Grab a Drink with M.E.",
        "description": "Join Marisol and Eliana as they talk about reality t.v., family and everything in between.  ",
        "language": "en",
        "author_name": "Grab a drink with M.E.",
        "slug": "grabadrinkwithme",
        "cover": "20220719_080722_dae92132b6c14a36676944d8882c8c90.jpg"
    },
    {
        "podcast_id": 141727,
        "title": "ME GUSTA DE NOCHE PODCAST",
        "description": "El podcast \"Me gusta de noche” es el primer podcast latenight que trae consigo segmentos de todo tipo, con la libertad de verlo desde donde te encuentres. \nJhoel López es el host y productor del mismo, quien se encargará de llevar el entretenimiento al siguiente nivel.\n",
        "language": "es",
        "author_name": "Me gusta de noche ",
        "slug": "me-gusta-de-noche-podcast",
        "cover": "20221021_081050_64dc574dfb2ac7fafe1f5645fc6acb91.jpg"
    },
    {
        "podcast_id": 143155,
        "title": "BluProjects",
        "description": "BluProjects is a consultancy, community and learning platform based in Istanbul, passionate about collaborative working for a better future. \n\n",
        "language": "tr",
        "author_name": "Sinem Çelik",
        "slug": "moda-tasariminin-donusumu-asli-abbasoglu",
        "cover": "20220728_080712_7fd70c879e3cdbd320d84724cf5e94a9.jpg"
    },
    {
        "podcast_id": 143318,
        "title": "The Pink Door",
        "description": "Podcast by ✌🏼 busy moms, enjoying honest & healthy conversations, while giving you all the beauty industry tips.",
        "language": "en",
        "author_name": "Lani & Margie",
        "slug": "thepinkdoor",
        "cover": "20230110_050123_122b564bb0429afd31685a5443e4c28d.jpg"
    },
    {
        "podcast_id": 144336,
        "title": "InterActive",
        "description": "<p>Chat with host Angela Recine about all things health and lifestyle - from workout tips, to product favorites, to advice on navigating life; this is your place! Angela dives deep into these topics while also keeping it chatty and casual. Coming from a girl in her early 20s who is always “go go go,” she understands the ins and outs on balancing school, work, friends, gym, and down time. Tune in to learn how to balance your schedule, while making time to practice good-for-you habits and enjoy your best, healthiest self.</p><p>Connect with Angela on Instagram @<a href=\"http://angelar.fit\">angelar.fit</a> &amp; connect with the podcast @<a href=\"https://www.instagram.com/interactive.podcast/\">Interactive.Podcast</a> </p><p>Connected Through Activity.</p>",
        "language": "en",
        "author_name": "Angela Recine",
        "slug": "interactive",
        "cover": "20220814_110816_7f3598256783243d5207f44e9605dd79.jpg"
    },
    {
        "podcast_id": 145222,
        "title": "Laces and fashion",
        "description": "Dansk podcast om Sneakers og tøj\n\n\nVært: Mike Degnholdt",
        "language": "da",
        "author_name": "Laces and fashion",
        "slug": "lacesandfashion",
        "cover": "20220812_040827_adf448abfc1428e5664d2a6e670669e0.jpg"
    },
    {
        "podcast_id": 145384,
        "title": "Gemini Babe Podcast",
        "description": "<p>online diary of thoughts &amp; feelings &amp; rants &amp; stories &amp; rambling &amp; nonsense. xoxo @geminibabepodcast</p>",
        "language": "en",
        "author_name": "Nicole Sung",
        "slug": "geminibabepodcast",
        "cover": "20230317_100327_1728fc40b3974ed2694dea0ce81b886b.jpg"
    },
    {
        "podcast_id": 145606,
        "title": "SAMVAD - JEWELLERS TALK SHOW ",
        "description": "Delhi Jewellery and Gem Fair by Informa Markets in association with SVAR - The Voice of Jewellers is excited to present to you A REVOLUTIONARY PODCAST SERIES “SAMVAD -JEWELLERS TALK SHOW” An exclusive series wherein you learn about the success stories of the top brands, the challenges they faced and how they overcame them. Learn and explore about the latest technologies, new trends and developments in the gems and jewellery industry.",
        "language": "en",
        "author_name": "Delhi Jewellery and Gem Fair ",
        "slug": "jewellerspaathshalabyinformamarkets",
        "cover": "20220812_040826_9065f86018b5f07cbbbaa370fb94fe46.jpg"
    },
    {
        "podcast_id": 145885,
        "title": "Beyond Beauty with PBA",
        "description": "Introducing PBA's podcast! Made so you can listen and be inspired during your busy day as we go Beyond Beauty. Take a deep dive into the beauty industry, get advice on how to navigate your career, and learn what motivates the best in the biz! New episodes every other Tuesday.",
        "language": "en",
        "author_name": "Professional Beauty Association",
        "slug": "pbabeyondbeauty",
        "cover": "20220817_040858_c48eeab6b5cf4e34f08b9e3d4072df07.jpg"
    },
    {
        "podcast_id": 146206,
        "title": "Bad B*tch Therapy",
        "description": "Follow Kimmy Tan and her bff Fanny in their daily conversations about love, dating relationships and so much more. Everybody needs therapy and sometimes that comes in the form of talking to people you love. Follow their journey as they navigate life's challenges and have fun doing it.",
        "language": "en",
        "author_name": "Kimmy Tan",
        "slug": "badbitchtherapy",
        "cover": "20220913_050944_87b6acfbf6b26b43a8d1f53f6083b005.jpg"
    },
    {
        "podcast_id": 146693,
        "title": "LifeWithHeather",
        "description": "Follow along as I continue through life and my beauty career. Listen to find out where I started, how I ended up where I'm at, and reflecting on past experiences. I hope to inspire others to do what they love and get what they want most out of life! ",
        "language": "en",
        "author_name": "HeatherNicole",
        "slug": "lifewithheather111",
        "cover": "20220815_100818_d534545975789c4e7c49ec49f7b4e89e.jpg"
    },
    {
        "podcast_id": 147575,
        "title": "we don’t exist",
        "description": "deb and jan have stories and opinions that NEED TO BE HEARD!",
        "language": "en",
        "author_name": "deb n jan",
        "slug": "wedontexist",
        "cover": "20220819_070802_d72134877f59bfd79f955de08d4c488a.jpg"
    },
    {
        "podcast_id": 147607,
        "title": "The Babes' Chat",
        "description": "Conversations with your friends has always been an experience. Whether it’s figuring out what plans for the night, commenting on celebrity gossip that has nothing to do with you, navigating the dating scene or even discovering the best ways to be a better friend/partner, these are the conversations that find it’s way to the chat. \n\nJoin the babes as we openly try understand the intricacies of life and share different perspectives on relatable topics with friends of 10+ years. \n\nYou have now entered “The Babes' Chat”, will you be staying? ",
        "language": "en",
        "author_name": "The Babes' Chat",
        "slug": "thebabeschat",
        "cover": "20220819_100847_e6192acf4965708eeccd6b5a54593a16.jpg"
    },
    {
        "podcast_id": 147916,
        "title": "Made Rite Radio",
        "description": "<p>Welcome to Mad Rite Radio, The show that talks about our relationships to tattooing, and explores the constantly evolving culture that surrounds it.</p>",
        "language": "en",
        "author_name": "John Biswell",
        "slug": "maderiteradio",
        "cover": "20230429_110409_4050fc81ea2813c767027d72cbcb1257.jpg"
    },
    {
        "podcast_id": 148521,
        "title": "Two Lacquered Ladies",
        "description": "A podcast about nail art and polish by the ladies who stream it, starring DanieShout and Fanaticure!",
        "language": "en",
        "author_name": "Fanaticure",
        "slug": "twolacqueredladies",
        "cover": "20220826_010801_f37b7bfd2aa41aaacf040099f7ab7b04.jpg"
    },
    {
        "podcast_id": 150496,
        "title": "The Dermal Journal",
        "description": "Being in the industry for over 15 years, I hear the same thing in every single skin consultation from confused clients. They don’t know what products to use, skin treatments to have or have had a bad experience getting a treatment, following trends and influencers but their skin does not improve. . And the list goes on!!!\nSo I decided that I need to start a podcast to really help the consumers out there. \nI want to educate you, advise you and help you navigate this  heavily flooded, unregulated industry of Skin & Skincare. \nIt can be so overwhelming when it comes to treating your skin condition or even just looking after your skin with the right products. \nI am here to deconstruct and break it all down so you have a better understanding of it all. ",
        "language": "en",
        "author_name": "Emma Fox",
        "slug": "thedermaljournal",
        "cover": "20220901_100902_481062716adf2078c76fa331e4c0413e.jpg"
    },
    {
        "podcast_id": 151521,
        "title": "Kube",
        "description": "Kube è un podcast di lifestyle condotto dalle talent manager Ludovica Narciso e Eleonora Carosi. Kube deriva da Kube community un media digitale nato nel 2018 che rappresenta la nuova generazione italiana. Un podcast settimanale che si focalizza sul creare delle conversazioni reali e il più oneste possibili in cui ci immergeremo insieme nel “magico”, che poi..è così magico?, mondo dei content creator. Scoprirete tutto sul lavoro di talent manager e ascolterete interviste di persone di successo nell’ambito digitale.",
        "language": "it",
        "author_name": "Ludovica Narciso & Eleonora Carosi",
        "slug": "kube",
        "cover": "20220906_020945_9851de342677de7c821ca44db53fcd54.jpg"
    },
    {
        "podcast_id": 151902,
        "title": "Radio Media Producciones ",
        "description": "<p>Los alumnos de Radio Media Escuela de Locución tienen la oportunidad de ser escuchados a través de sus grabaciones de clase, ahora en Podcast</p>",
        "language": "es-mx",
        "author_name": "Daniel de la Torre",
        "slug": "radiomedia",
        "cover": "20221006_121034_bd859ead59699e3130bd78b111f1ced0.jpg"
    },
    {
        "podcast_id": 153174,
        "title": "El chat con mi almohada ",
        "description": "En realidad sería otro nombre pero lo vi inapropiado en general \n\nHe hackeado mininote, PicsArt y rss para conseguir la foto de ahorita que cucada.\nhttps://instagram.com/elchatconmialmohada?igshid=YmMyMTA2M2Y=",
        "language": "en",
        "author_name": "Adriana Domenica Lara",
        "slug": "chatconmialmohada",
        "cover": "20221009_071027_838dfb80757820deca74fdb5227085ab.jpg"
    },
    {
        "podcast_id": 154662,
        "title": "ME CASO !AYÚDENME¡ EL PODCAST DE SANDRA NOTARIO",
        "description": "Te acompañamos en el día más importante de tu vida. Aquí encontrarás tips de expertos para tu boda y también para el antes y después. Disfruta el proceso, ¡nosotros te acompañamos!",
        "language": "es-mx",
        "author_name": "Me caso !Ayúdenme¡",
        "slug": "mecasoayudenme",
        "cover": "20220920_030950_3f33baadbd739d64c5c0d8406e25ede0.jpg"
    },
    {
        "podcast_id": 155045,
        "title": "Traveling Career Girl",
        "description": "<p>My name is Taylor Snider and I am here to entertain YOU! I'm a transgender woman with 13 years life experience as an escort catering to the upper echelon- now turned fashion designer! I am an entrepreneur at heart and touch on a multitude of different hot topics from sex work, light political commentary on the moderate side of things as well as life updates and me treating this like my verbal word vomit diary, Come spiral with me! </p>",
        "language": "en",
        "author_name": "Taylor Snider",
        "slug": "travelingcareergirl",
        "cover": "20230314_090319_77a87806f48c732c06d865acff523ed8.jpg"
    },
    {
        "podcast_id": 155371,
        "title": "Living Soulo",
        "description": "Join Asya Brown, a Tech Professional who learned to find wholeness and happiness within herself through soulo experiences.\n\nIf you have not noticed yet in the title of this show, “Soulo” has a U in it - that’s exactly what this is about. Doing what is best for your Soul!  This soulo journey is for ALL who aspire to carve out time to connect deeper with yourselves so that you can pour into others. \n\nI am so excited to share this journey with you and hope that you listen to every episode feeling bold and inspired. \n\nStay tuned for inspiring stories and Living Soulo experiences!",
        "language": "en",
        "author_name": "Asya Brown",
        "slug": "livingsoulo",
        "cover": "20220923_030935_a1621400a92dcee97aab9eb45e22a7d4.jpg"
    },
    {
        "podcast_id": 156536,
        "title": "The Honest Hairdresser",
        "description": "A podcast where interview my fellow beauty industry friends and talk about all things beauty industry and everything in between.",
        "language": "en",
        "author_name": "Erin Ray",
        "slug": "thehonesthairdresser",
        "cover": "20220928_040940_c153e34ce76c04a50b53988dc6bca50a.jpg"
    },
    {
        "podcast_id": 156616,
        "title": "Podcast TCS",
        "description": "Lo mejor de TCS para escuchar.",
        "language": "es",
        "author_name": "Telecorporación Salvadoreña",
        "slug": "podcasttcs",
        "cover": "20221006_121055_a2b293d2c3541e0ea7acf10ec18b1323.jpg"
    },
    {
        "podcast_id": 157108,
        "title": "you",
        "description": "&lt;3",
        "language": "en",
        "author_name": "ate & slayed",
        "slug": "youbyari",
        "cover": "20220930_060911_220fcb639b30e65c112c016856b92782.jpg"
    },
    {
        "podcast_id": 157402,
        "title": "The Guide To Wellness",
        "description": "<p>The Guide To Wellness podcast has been born from the skin care company Honey Health And Wellness. In order to heal and reach our full potential, we need to look at our lives holistically. This podcast opens the door to expansive conversations in order to help you understand your mind, body and soul. Join me for a weekly episodes chatting with people who inspire, educate and motivate me.</p>",
        "language": "en",
        "author_name": "Marissa Otis",
        "slug": "honeyhealthandwellness",
        "cover": "20230315_040312_d91bee76d42c12c06b149617296b1021.jpg"
    },
    {
        "podcast_id": 157453,
        "title": "Moda etica e sostenibile",
        "description": "Moda Etica e Sostenibile PodCast diffonde informazioni e approfondimenti sulla moda sostenibile. A cura di Kristiana Venturini, presidente dell’associazione no-profit Moda Etica e Sostenibile, il canale ospita interviste e speciali tematici.\n\nSalotto della sostenibilità: Parliamo di moda etica e sostenibile in modo semplice, sincero e senza statistiche. Interviste con manager, imprenditori, scrittori, designer e altre persone di riferimento attive nel mondo del Sustainable Fashion in Italia e all’estero. \n\nW(A)NDERmind “Let your mind wander and discover the wonder”\nè la rubrica di riflessioni, commenti e punti di vista su moda etica e lifestyle sostenibile.",
        "language": "it",
        "author_name": "Kristiana Venturini",
        "slug": "modaeticaesostenibile",
        "cover": "20221002_081017_0981e73cd662191809ae4b3f05894d16.jpg"
    },
    {
        "podcast_id": 157773,
        "title": "Governors World",
        "description": "<p>Our pasts are what makes us the people we are today. Through trials and tribulations we adapt a survival mode. Surely there is something better than survival mode. Here at Governors World, we believe that there is something better. A life with empowerment not just in body language and appearance but with a voice of Empowerment. Welcome to Governors World, a world where Empowerment of ones self is of upmost importance.</p>",
        "language": "en",
        "author_name": "Annie Fleetwood",
        "slug": "governorssupport",
        "cover": "20230414_110455_7bcb6f87df092316822f12f9d7a26fda.jpg"
    },
    {
        "podcast_id": 157819,
        "title": "Dimescared ",
        "description": "MFA status is redacted ",
        "language": "en",
        "author_name": "Mike and Anna ",
        "slug": "dimescared",
        "cover": "20221003_101054_73b407c104c57432ca4581e316d43c9f.jpg"
    },
    {
        "podcast_id": 157842,
        "title": "Benjies of Beauty ",
        "description": "<p>Benjies of Beauty es un podcast creado para todas aquellas personas interesadas en emprender o desarrollarse en la industria de la belleza, wellness o fashion. Cada capítulo te ayudará a saber todo lo que necesitas saber, desde estrategias de marketing hasta finanzas.</p>",
        "language": "es",
        "author_name": "Floriana Ibarrola y Karen Rodarte",
        "slug": "benjiesofbeauty",
        "cover": "20230808_040858_db195bdf4113b1eb0f9c90c99c27dfc4.jpg"
    },
    {
        "podcast_id": 158010,
        "title": "BZ Podcast",
        "description": "A dermatologista Bárbara Zalcman estreia um podcast para falar sobre tudo que cerca o mundo da mulher como: beleza, saúde, moda, comportamento e lifestyle.\n",
        "language": "en",
        "author_name": "Bárbara Zalcman",
        "slug": "bzpodcast",
        "cover": "20221005_061033_cbbff9448b6a2103e7fd18506be348f6.jpg"
    },
    {
        "podcast_id": 158283,
        "title": "Wine and Makeup Wipes",
        "description": "Der Podcast mit Anni und Vani. Wir wissen auch nicht so genau um was es eigentlich geht.\n\n\nInstagram: wineandmakeupwipes_\ntiktok: wineandmakeupwipes",
        "language": "de",
        "author_name": "Anna-Lena Nöller, Vanessa Marijić",
        "slug": "wineandmakeupwipes",
        "cover": "20221005_071014_1a252b00f7a0593c1131286cd40651c0.jpg"
    },
    {
        "podcast_id": 158413,
        "title": "Magyar Menyasszony",
        "description": "Mi kell a jó házassághoz? Mióta választunk szerelemből? Hogyan változnak az esküvői szokások térben, időben, felekezetek és nemzetiségek szerint? Kik a házassági piac és -ipar legfőbb szereplői? Kit nevezhetünk magyar menyasszonynak? \nA Magyar Menyasszony podcast a Magyar Nemzeti Múzeum 2023 decemberére tervezett, azonos című, nagyszabású időszaki kiállításának előkészületeibe és a téma sokszínűségébe enged bepillantást. \nBeszélgetnek: Dr. Simonovics Ildikó divattörténész muzeológus, a kiállítás főkurátora és a munkába bevont szakértők, az esküvő szervezésben és lebonyolításban résztvevő profik, valamint magán emberek, magukkal ragadó személyes történeteikkel.\nMagyar Menyasszony a Facebookon: https://www.facebook.com/groups/355531662317733",
        "language": "hu",
        "author_name": "Magyar Nemzeti Múzeum",
        "slug": "eskuvoanepkolteszetben",
        "cover": "20221006_111023_0e916f356683835f49c5d6fefa5c7da7.jpg"
    },
    {
        "podcast_id": 158647,
        "title": "WHOISTRADI",
        "description": "<p>Whoistradi es un programa presentado por Damià Morales y realizado por Huc Garcia y Aida Atencia, un proyecto de entrevistas a tatuadores donde hablaremos de técnicas, estilos, anécdotas y novedades.</p>",
        "language": "es",
        "author_name": "Damià Morales, Huc Garcia, Aida Atencia",
        "slug": "whoistradi",
        "cover": "20221007_091035_57e884533034292e580cb924e70cac33.jpg"
    },
    {
        "podcast_id": 159284,
        "title": "Los Jueves Con Fefa",
        "description": "Cada jueves Leticia y Olivia se reúnen para hablar de temas de la industria de la moda, mundo beauty, temas de actualidad y mucho más. Contarán con invitados metidos en el mundo de la moda y redes sociales así como también con sus mejores amigas. \n",
        "language": "es",
        "author_name": "Leticia y Olivia",
        "slug": "juevesconfefa",
        "cover": "20221104_081134_12060d97058d59535015a1e908e9960c.jpg"
    },
    {
        "podcast_id": 161720,
        "title": "jus how we talk podcast",
        "description": "the jushowitis podcast is for everyday listening speaking on many different aspects of life and everyday stories from everyday people. We strive in showing that everyone is human and give them a platform to speak on life stories that should be heard for others to relate with.",
        "language": "en",
        "author_name": "Jahsai Sommerville, Diego Garcia",
        "slug": "jushowitis",
        "cover": "20221208_121220_77c1848375f86c6c9b673f8d2983395f.jpg"
    },
    {
        "podcast_id": 161821,
        "title": "Girls, Uninterrupted",
        "description": "Hosted by Kassidy Mattera and Erica Reid, two girls navigating their 20s with an abundance of opinions and stories to share. Throughout our lives we have noticed that the interest of women have been undermined and even deemed illegitimate by men. Girls, Uninterrupted will be where all of these topics that have been deemed “pointless” and “brainless” will thrive: pop-culture, fashion, beauty, dating stories, female friendships will be celebrated and not interrupted. ",
        "language": "en",
        "author_name": "Kassidy Mattera & Erica Reid",
        "slug": "girlsuninterrupted",
        "cover": "20221020_031033_b2905fdb11dce69fc310f4d4df028901.jpg"
    },
    {
        "podcast_id": 162985,
        "title": " Random Rambles",
        "description": "The reason we need to start a podcast? We have loads of conversations with deep thoughts, \nrandom thoughts, idiotic thoughts,  about everything & everybody. We're ready to share them with you! Stay tooned.",
        "language": "en",
        "author_name": "J&V",
        "slug": "jv",
        "cover": "20221025_061057_ed4f2bc48b693a7c9c7d025dda6cce71.jpg"
    },
    {
        "podcast_id": 163119,
        "title": "Dear Cosmo Babies Podcast",
        "description": "A podcast focused on dropping knowledge for all the future hairdressers and baby beauty pros out there. Annie and Russell are giving advice and support that they wish they had when entering this incredible and sometimes terrifying industry of Professional Beauty. While chatting with some of their smartest hair nerd friends, they are pulling back the curtain to success and pushing the gatekeepers aside.",
        "language": "en",
        "author_name": "Annie MacArthur & Russell Mayes",
        "slug": "dearcosmobabies",
        "cover": "20221113_021143_71c482cf28d300f4be558d6a9faa34c9.jpg"
    },
    {
        "podcast_id": 163125,
        "title": "Two Weeks From Tuesday",
        "description": "Two Weeks from Tuesday co-creators, Aliya Bloom and Erynn Wakefield have always connected through music. Most of their friendship has been long distance and paired with their busy lives, it seemed to be a recipe for disaster. But, over the years, they have shared music as a way to reach out, keep in touch, and keep tabs on each other. Whether it was through collaborative playlists, seasonal playlists, or even a quick song here and there; Two Weeks From Tuesday is unique in its approach, serving as a podcast as well as a platform for new artists. And when they can’t be live and talking to you, they’re still with you through corresponding playlists made for their listeners for every episode. \n\nThis podcast truly wraps music and life into one entity and demonstrates how essential music is to the human experience. Most of all, Two Weeks From Tuesday aims to be honest. Co-creators, Aliya Bloom and Erynn Wakefield, truly want to reach out to their listeners with a helping hand and say, “we understand.” \n",
        "language": "en",
        "author_name": "Erynn and Aliya",
        "slug": "twoweeksfromtuesday",
        "cover": "20221103_101148_2ca28377094c4878c96f0bf99916a9b3.jpg"
    },
    {
        "podcast_id": 164611,
        "title": "Titli GAgA",
        "description": "A fun loving exploring and sharing experiences as and when travelled and as and when come across incidents.  ",
        "language": "en",
        "author_name": "S USHA SINGH",
        "slug": "titligaga",
        "cover": "20221101_111105_888c8488e31f3a929cb0efe3697e4653.jpg"
    },
    {
        "podcast_id": 164674,
        "title": "Momento pitipausa ",
        "description": "Este es el podcast que se escucha tranquilamente, con un piti o no entre los labios (sin que se pierda esa costumbre) y con muchas ganas de ser felices. Si escucháis esto y os gusta y decídmelo porfi por mis redes sociales:\n-tt: susanaa_2003\n-insta: susananvillegass \nos adoro :)",
        "language": "es",
        "author_name": "Susana Nieto Villegas  ",
        "slug": "amorpropiosusananvillegass",
        "cover": "20221102_121115_4a4155a844ad3e07448381d1af667a05.jpg"
    },
    {
        "podcast_id": 165318,
        "title": "THEBEATMONKEY Presents THE HITMIX",
        "description": "<p>THEBEATMONKEY is back with a brand new episode of his popular podcast, THE HITMIX. In this latest installment,THEBEATMONKEY has gathered together some of the biggest hits from the past few months and mixed them into one high-energy mix. As always, THEBEATMONKEY’s unique style and energy are sure to get you moving and grooving. So make sure to check out the latest episode of THE HITMIX and get ready to dance your way into the weekend.</p>",
        "language": "en",
        "author_name": "THEBEATMONKEY ",
        "slug": "theb",
        "cover": "20230601_060605_998cac46879f91885355f29e97f84125.jpg"
    },
    {
        "podcast_id": 165758,
        "title": "The LLH Podcast",
        "description": "<p>In this installment of The LLH Podcast, Jessica Meshaun and DJ Peppp welcome our first ever guest to the show, super realtor, successful entrepreneur, and host of his brand new podcast dropping soon called \"One Wolf Podcast\" Mr. Aaron Lee!!!! The Meshaun Fashion moment is packed with tools to improve your self confidence and Peppp Talk delves into giving with true intentions. Levitate, liberate and hydrate your life with The LLH Podcast and be sure to like and follow the show streaming on this podcast platform. Thanks for listening!!!</p>",
        "language": "en",
        "author_name": "Solo Cup Entertainment",
        "slug": "thellhpodcast",
        "cover": "20221106_041141_619648717bba452403b0e337ae1353c2.jpg"
    },
    {
        "podcast_id": 165988,
        "title": "LoudTalk with Lavi",
        "description": "Join Content Creator and engineering and business student Lavinia Rusanda as she uncovers the secrets of the beauty industry, breaks down the walls of beauty standards, and teaches you to learn self-love and become confident in your skin while bringing awareness to acne and real unfiltered skin. ",
        "language": "en",
        "author_name": "Lavinia Rusanda",
        "slug": "loudtalkwithlavi",
        "cover": "20221107_021156_8724ac5fa67daac8093898be8a0adc2f.jpg"
    },
    {
        "podcast_id": 166571,
        "title": "Chicks Unhinged ",
        "description": "Isn't everybody a little bit Unhinged ? Join Amelia Marni and Ariella Nyssa as they speak all things life, dating, sex, embarrassing moments and all the stuff that no-one actually admits! \n\nFor a little dose of reality, Amelia and Ariella want to break the stigma around the Social Media Highlights and give you a more unfiltered insight into theirs and other guests lives. \n\nFollow @Chicksunhingedpodcast on Instagram and Tik Tok and get involved ! Send us your most unhinged stories, topics you want to hear about and guests you want to see!\n\n@AmeliaMarni\n@Ariellanyssa",
        "language": "en",
        "author_name": "Amelia Marni & Ariella Nyssa",
        "slug": "chicksunhingedpodcast",
        "cover": "20221109_041159_74fa9f7e885c7f9905682873da24c3aa.jpg"
    },
    {
        "podcast_id": 166606,
        "title": "The Pre Nup",
        "description": "Congratulations! You're getting married! Now what?\nJoin us every week as we navigate the wedding planning process with the best tips, trends, advice and inspiraton!\n",
        "language": "en",
        "author_name": "The Pre Nup",
        "slug": "the-pre-nup",
        "cover": "20230127_080143_d3a1ba0a4f89c324c7a1969f02c823fb.jpg"
    },
    {
        "podcast_id": 166619,
        "title": "The Spoons",
        "description": "Blinds",
        "language": "es",
        "author_name": "Andre Cool",
        "slug": "thespoons",
        "cover": "20221109_111122_5c4276c6292ad6488d888fc23b60d509.jpg"
    },
    {
        "podcast_id": 167267,
        "title": "Stoner Girl Tingz Potcast",
        "description": "Its hard being a young woman in todays society. With so many men dominating every industry, we find ourselves asking, \"What about the girls?\". Join 27 year old CEO Joylovette in discovering how she has broken through the cannabis industry and worked with brands such as STIIIZY, COOKIES, and many more. More importantly get ready to hear how she founded her own brand STONERGIRLTINGZ and how she has maintained it over the years. Press play and learn all the tips and advice she WISHES she wouldve known years ago. ",
        "language": "en",
        "author_name": "Joylovette Ortiz",
        "slug": "stonergirltingzpotcast",
        "cover": "20221111_081121_21466ac13cbd48d4347bad551dde739b.jpg"
    },
    {
        "podcast_id": 167352,
        "title": "La normalisa ",
        "description": "La innovación en la practica docente\n ",
        "language": "es-mx",
        "author_name": "Raul",
        "slug": "benv",
        "cover": "20221112_051120_e79d70640cf3c916af148a7b99e6f63a.jpg"
    },
    {
        "podcast_id": 168009,
        "title": "OFF THE AIR",
        "description": "Two influencers, one a social media guru the other a hairdresser. Joined together to create this podcast where they talk about everything from salon tips and tricks, relationship advice, to entertainment news topics and current life situations. ",
        "language": "en",
        "author_name": "Offtheairtv",
        "slug": "offtheairtv",
        "cover": "20221115_031133_ef31d2024a05f66b5258daa67007412d.jpg"
    },
    {
        "podcast_id": 168812,
        "title": "Third Sister",
        "description": "Good things come in threes!! Join our dynamic sister duo where we discuss all things girls talk, lifestyle, pop culture, mental health, and becoming the best version of ourselves!",
        "language": "en",
        "author_name": "Third Sister ",
        "slug": "thirdsister",
        "cover": "20221211_121212_d591ed0124bb8186cd6ac0f9f19de8da.jpg"
    },
    {
        "podcast_id": 168851,
        "title": "De Klere(n) Podcast",
        "description": "In de Klere(n) Podcast nemen studievriendinnen Carmen Perez Garcia en Lara Compagner je mee in hun pogingen om een duurzamer, maar ook modieus leven te leiden. Ze zijn absoluut geen heilige boontjes, maar hebben wel het beste voor met deze aardbol. Daarom discussiëren ze, met een knipoog, over hoe het tóch allemaal iets duurzamer kan. Om de twee weken dagen ze elkaar uit voor een duurzame challenge, bespreken ze hun vintage find van de maand en delen ze hun gedachten over duurzame mode.",
        "language": "nl",
        "author_name": "Carmen Perez Garcia & Lara Compagner",
        "slug": "deklerenpodcast",
        "cover": "20221203_091220_084255835203ca062837c9411ccc21bd.jpg"
    },
    {
        "podcast_id": 169233,
        "title": "Styled Social the Podcast",
        "description": "Styled Social the Podcast is a lifestyle podcast for female creatives and entrepreneurs. Our host, Payton, is the founder and CEO of luxury digital marketing agency, Styled Social. Payton aims to inspire women to become the best possible versions of themselves from discussions on skincare to starting your own business, & everything in between. New episodes every Thursday at 8:00 a.m. PST. ",
        "language": "en",
        "author_name": "Payton Wink",
        "slug": "styledsocial",
        "cover": "20221128_081148_bd93e5eae4fbbdd347c757f039fd989a.jpg"
    },
    {
        "podcast_id": 170258,
        "title": "Spoiled Daughters ",
        "description": "<p>This podcast is all about the girly lifestyle and to show that girls can be anything they want! Whether it be a pink pilates princess, coquette princess, rap princess, or a streetwear shawty! We should be able to do what we want and be free to be happy.</p>",
        "language": "en",
        "author_name": "Zaejahn Renee",
        "slug": "spoileddaughters",
        "cover": "20221127_101139_6a2a66f8f2d4c03d60a0746e3eaffb01.jpg"
    },
    {
        "podcast_id": 171206,
        "title": "Unfiltered with Trin",
        "description": "Trinity is someone who loves to talk about anything and everything and can finally do so with people who love to listen. Trinity talks about a whole range of things such as body image, pop culture, stories about life, and sometimes random things. These weekly episodes will be lengthy, since she has a lot to talk about with you guys. Each week is something different and that's something to look forward to. New episodes every friday.",
        "language": "en",
        "author_name": "trinity avila",
        "slug": "unfilteredwithtrin",
        "cover": "20221129_081159_5242e3301d49e08e69cf6eb7a8735493.jpg"
    },
    {
        "podcast_id": 171673,
        "title": "Brutal Bridal Babes Podcast",
        "description": "How J and A fell into the world of bridal and special occasion and why they never left.",
        "language": "en",
        "author_name": "Jordan and Ashley",
        "slug": "brutalbridalbabes",
        "cover": "20221216_091232_14b365dd167dec99d749810d56d6529d.jpg"
    },
    {
        "podcast_id": 172179,
        "title": "MINISO",
        "description": "EL MEJOR LUGAR PARA ENCONTRAR TODO LO TIERNO QUE TE PUEDAS IMAGINAR, CON TUS PERSONAJES FAVORITOS, LOS OSOS ESCANDALOSOS, MICKY MOUSE, LAS PRINCESAS DE DISNEY Y MUCHO MAS\nPELUCHES SUAVES PEQUEÑOS, MEDIANOS Y GRANDES\nJUGUETES\nTUPPERS INCREIBLES\nVASOS IRRESISTIBLES, TASAS\nARTICULOS PARA EL HOGAR\nJOYERIA\n",
        "language": "es-mx",
        "author_name": "VERONICA ANAHI MARIN HERNANDEZ",
        "slug": "miniso-bears-com",
        "cover": "20221203_051253_daa46db1717fbc0403d1bcfb8071243a.jpg"
    },
    {
        "podcast_id": 172597,
        "title": "PIGMENTATORIUM ",
        "description": "PIGMENTATORIUM to przestrzeń dla klienta, studenta, artysty, operatora dotycząca tematu makijażu permanentnego. Czas odsłonić rąbka tajemnicy i pokazać trochę kuluarów branżowych.\n\nSylwie dwie\namazINK team",
        "language": "pl",
        "author_name": "amazINKteam",
        "slug": "pigmentatorium",
        "cover": "20221205_091228_36ef5a9a1455369caa22c706811fc6e5.jpg"
    },
    {
        "podcast_id": 173364,
        "title": "Voz de Estilo",
        "description": "<p>Una mexicana y una venezolana que encontraron su pasión en el universo del estilo personal. Somos dos amigas Consultoras de Estilo y  Fashion Stylist que te transportamos a que conectes con tu <a href=\"https://instagram.com/vozdeestilo\">Voz de Estilo</a>. Reconociendo que a través del autoconocimiento se logra mostrar nuestra esencia al vestir y que las prendas que utilizamos son el reflejo de nuestra personalidad y gustos. Ya que lo más importante del estilo personal es la palabra \"personal\". </p><p>¡Únete a la conversación para conectar con tu Voz de Estilo!</p><p>Un podcast de:</p><p><a href=\"https://instagram.com/mariasofiacer\"><strong>María Sofía Cervantes</strong></a><strong> y </strong><a href=\"https://instagram.com/erasoandrea\"><strong>Andrea Eraso</strong></a></p>",
        "language": "es",
        "author_name": "María Sofía Cervantes y Andrea Eraso",
        "slug": "vozdeestilo",
        "cover": "20221208_071249_00c741b640a5c6f51c1ad1a74367867e.jpg"
    },
    {
        "podcast_id": 174595,
        "title": "HD longwave",
        "description": "<p>Coming to you from award winning Hair Development, the UK's premier and longest established Hair Replacement and Extension company, we will feature guests who are expert in their fields along with tales of the city and the occasional hairy tale of the city...</p>",
        "language": "en",
        "author_name": "Janis Levy",
        "slug": "hdlongwave",
        "cover": "20230406_010407_51bfc21b6a53d0f888dc5460743aa203.jpg"
    },
    {
        "podcast_id": 174780,
        "title": "BSwithBella",
        "description": "<p>Let's talk about some Bull****. Come listen to my crazy Jersey lifestyle with some exclusive interviews and hearing some rants.</p>",
        "language": "en",
        "author_name": "Isabella Schuh",
        "slug": "bswithbella",
        "cover": "20230822_030836_bc6087b2b17d22e237ff39f75c5f247e.jpg"
    },
    {
        "podcast_id": 177111,
        "title": "❦",
        "description": "these are not my subs!! \nall of them are from yt, credits will be in desc",
        "language": "en",
        "author_name": "stargirl🖤",
        "slug": "stargirlsubliminals",
        "cover": "20221230_111224_cfb58db5f7d4de9fc90bdcf5242c6ea3.jpg"
    },
    {
        "podcast_id": 177520,
        "title": "Open Your Own Door",
        "description": "Welcome To Open Your On Door by Mackenzye Oliphant, a podcast all about being a female business owner, mama, wife, finding yourself and living unapologetically.",
        "language": "en",
        "author_name": "Mackenzye Oliphant",
        "slug": "openyourowndoor",
        "cover": "20230101_080125_7983f172fd3d2ca48b627a73f2a3269a.jpg"
    },
    {
        "podcast_id": 178658,
        "title": "The Lash Therapist",
        "description": "A podcast made by a lash tech for other lash techs and clients. This is a platform where I want to entertain & educate from a lash tech who’s been in this industry for 4+ years. \nI have seen and heard the craziest stories over the years. I’ve experienced the craziest experiences and this is my stage to tell you all about it so you don’t have to deal with the same issues. \nThis is also entertaining so grab a snack, sit down and have a sippy sip because it’s going to get juicy, salty and sweet. A bit like a chamoy pickle kit. ",
        "language": "en",
        "author_name": "Justina zotkeviciute ",
        "slug": "thelashtherapist",
        "cover": "20230106_060152_c2a2469d902c9f771ee37d0551e4c41b.jpg"
    },
    {
        "podcast_id": 179319,
        "title": "Let’s Chat Podcast",
        "description": "Welcome to \"Let's Chat,\" a podcast where we delve into a variety of topics and have candid conversations with experts and thought leaders. Whether you're tuning in during your commute, at the gym, or just taking a break. So, sit back, relax, join us each week, and... \"Let's Chat\"!",
        "language": "en",
        "author_name": "Manuela and Marc",
        "slug": "lorem-podcast",
        "cover": "20230123_040135_8e55c48628e3160819215e067056b8a4.jpg"
    },
    {
        "podcast_id": 179361,
        "title": "White Fox After Hours",
        "description": "Taking you after hours for all the inside goss at White Fox HQ. We will be chatting all things fashion, career and pop culture with some of your faves in the industry as well as all of the After Hours and BTS content with the team. Hosted by Scarlett & Cody the socials gals at @whitefoxboutique.",
        "language": "en",
        "author_name": "White Fox Boutique ",
        "slug": "whitefoxafterhours",
        "cover": "20230109_100154_fb7f257a7bbd3dc051b1de9b622ec74a.jpg"
    },
    {
        "podcast_id": 180209,
        "title": "The Raw Collection",
        "description": "<p>The Raw Collection explores the changemakers and doers behind some of the leading fashion &amp; luxury brands globally Along with gaining insight into the brilliant minds of people we admire by having meaningful conversations about their successes, disappointments, and comebacks.</p>",
        "language": "en",
        "author_name": "Angela Pennyfeather",
        "slug": "how-i-built-this",
        "cover": "20230129_090131_c89af5d17a2c81594e1f885ccc626901.jpg"
    },
    {
        "podcast_id": 180546,
        "title": "RIVER GOD - THE BLUEPRINT",
        "description": "Luxury streetwear label RIVER GOD's founder Alexei Hamblin collaborates with some of the most exciting up-and-coming streetwear labels to understand what goes into creating a successful brand, how to find inspiration and advice for anyone looking to break into the industry themselves.\n\nRIVER GOD:\nInstagram: www.instagram.com/rvgd.clo/\nWebsite: www.rvgd.co.uk\n\nALEXEI HAMBLIN:\nInstagram: www.instagram.com/alexeihamblin/\nTiktok: https://www.tiktok.com/@alexeihamblin\n",
        "language": "en",
        "author_name": "Alexei Hamblin",
        "slug": "river-god-the-blueprint",
        "cover": "20230114_040151_58b60b4cc396031cfdba30e7957556db.jpg"
    },
    {
        "podcast_id": 181580,
        "title": "In Conversation with Wearfer ",
        "description": "<p>Welcome to Wearfer in Conversation. A space where we will uncover truths, the beauty and the curiosities of fashion and beyond. Your host, Olga, will be speaking with ordinary people doing extra-ordinary things. Olga is also the founder at Wearfer, a clothing platform built by creatives for creatives with social and environmental responsibility at its core.</p>",
        "language": "en",
        "author_name": "Olga Cieslak ",
        "slug": "wearfer-in-conversation",
        "cover": "20230905_040919_d357c4733cef5ae739d78fd34940896c.jpg"
    },
    {
        "podcast_id": 182161,
        "title": "Generación Modelos",
        "description": "¿Hola a todos como les va? \nMi nombre es Gianluca Alessi y esto es Generación modelos un Podcast para todos aquellos que quieran adentrarse en el mundo del modelaje, vamos a tener entrevistas, debates, preguntas y respuestas y mucho más, no te olvides de seguirnos en YouTube y Tiktok @generacionmodelos\n\nSiempre queremos mejorar... Dejá tu review para saber que te parece este podcast\n",
        "language": "es",
        "author_name": "gianluca alessi",
        "slug": "generacionmodelos",
        "cover": "20230121_110116_3923fd265cc37c9742cebe06a2436899.jpg"
    },
    {
        "podcast_id": 182733,
        "title": "Independent & Irrelevant",
        "description": "Two independent gals discussing all things irrelevant",
        "language": "en",
        "author_name": "Hannah & Hayley",
        "slug": "independentandirrelevant",
        "cover": "20230125_100148_c5c12be13897357196efdd1ee6acbef4.jpg"
    },
    {
        "podcast_id": 183328,
        "title": "Fashionology",
        "description": "H Alexia LeStrange περιγράφει την ιστορία μεγάλων και μικρών οίκων μόδας , την επίδραση  που είχαν και το σήμερα. Ολα αυτά με μεγάλη προσπάθεια να μην ακούγεται σαν να πουλάει εγκυκλοπαίδειες στο Αρτ ΤιΒι με τον μπουμπούκο.",
        "language": "el",
        "author_name": "Alexia_Lestrange",
        "slug": "fashionology",
        "cover": "20230124_110120_22a17a3b974665e1f3baa86bb40c31a8.jpg"
    },
    {
        "podcast_id": 184107,
        "title": "Journal Collection",
        "description": "Me llamo Mireya Romero y hacer un podcast siempre ha sido un camino por cumplir. Quiero que sea un sitio donde desahogarme, donde contar mi vida, mis anécdotas en el trabajo, con mis amigos..etc ",
        "language": "es",
        "author_name": "Mireya Romero",
        "slug": "collectiondevida",
        "cover": "20230128_020123_dfd4b25496670309748ce56a5ab09ff8.jpg"
    },
    {
        "podcast_id": 184956,
        "title": "Mi Humilde Opinión",
        "description": "<p>Mi Humilde Opinión es un podcast conducido por Ale Vintage, en el que nos comparte su (a veces no tan) humilde opinión sobre moda, tendencias, estilo y un poco de chismecito.</p>",
        "language": "es-mx",
        "author_name": "Vandi media",
        "slug": "mi-humilde-opinion",
        "cover": "20230403_050440_369ffab0db0ed1a24d5840b4993bf1e6.jpg"
    },
    {
        "podcast_id": 185097,
        "title": "It's The Little Things",
        "description": "<p>Former egirl influencer returns from hibernation to talk about the little things: cozy habits, cute clothes, and lessons learned. Exclusive eps on Patreon.</p>",
        "language": "en",
        "author_name": "doeyedolly",
        "slug": "its-the-little-things",
        "cover": "20230418_080448_12f2f5100cab4020db5fb754335bd3ca.jpg"
    },
    {
        "podcast_id": 185110,
        "title": "what's the forecast?",
        "description": "<p>Welcome to Whats the Forecast where we talk about anything BUT the weather!</p>",
        "language": "en",
        "author_name": "Darienne Rain and Summer Marie",
        "slug": "whatstheforecast",
        "cover": "20230131_020136_2d929d425eb6186b62375f8736b0f6ef.jpg"
    },
    {
        "podcast_id": 185195,
        "title": "Bryllupspuls",
        "description": "Bryllupspodcasten som tar deg gjennom hele bryllupsplanleggingen med mange tips og interessante gjester!",
        "language": "nb",
        "author_name": "Emma Sjöholm",
        "slug": "bryllupspuls",
        "cover": "20230131_090145_aef37e843d5f585ec679aaf177577deb.jpg"
    },
    {
        "podcast_id": 185562,
        "title": "DOUBLE UP ",
        "description": "In this podcast we talked about the new rising star Vale Guz. We interviewed the star and had the amazing opportunity to get and episode all to herself. Listen to find out all about Vale Guz and how, at such a young age, she became a superstar. ",
        "language": "en",
        "author_name": "Carmen",
        "slug": "doubleuppodcast",
        "cover": "20230207_070242_632cdb35b790d43a103a31ba97579b54.jpg"
    },
    {
        "podcast_id": 185563,
        "title": "Who said it?",
        "description": "In this podcast you will get to know how girls think about each other by hearing their opinions. You will also learn about the biggest trends and very interesting topics. ",
        "language": "en",
        "author_name": "Balbina Pérez and Ivanna Mireles ",
        "slug": "whosaidit",
        "cover": "20230201_030232_e89184c772c3876929c7ab192c217aa8.jpg"
    },
    {
        "podcast_id": 185583,
        "title": "Talk with us-  The Latest Trends in 2023",
        "description": "Is about the Latest Trends for this year of 2023. And we are going to tell you the perfect colors and clothes that you can wear with some characteristics of each of them and I am going to tell you my recommendations and my opinions. \nAlso, I am going to tell you about the spring and summer and my colab friend is going to tell you of autumn and winter. \nHope that you like it!!",
        "language": "en",
        "author_name": "Paulina Caballero",
        "slug": "fashionntrendswithus",
        "cover": "20230201_030206_0514da7a8fd1e4144138bf3226f5a644.jpg"
    },
    {
        "podcast_id": 185584,
        "title": "Talk with us- The Last Trends in Fashion in 2023",
        "description": "The podcast is about the perfect clothes that you can wear in this 2023 and it also talks about their characteristics, and what is recommended to wear in this 2023 and what is not recommended.",
        "language": "en",
        "author_name": "Idalia Ramones",
        "slug": "fashiontrendswithhus",
        "cover": "20230201_030210_0618429ba68ab33cef944e7fba124b63.jpg"
    },
    {
        "podcast_id": 186280,
        "title": "Flight Show",
        "description": "We discuss running a vintage/streetwear brand and store.  Also go into details of being an entrepreneur while building brand awareness and becoming your own boss. Lifestyle, fashion, music, sports are all factors and key elements of this podcast!",
        "language": "en",
        "author_name": "James Lee & Tyler Jackson",
        "slug": "flight-show",
        "cover": "20230204_060211_208696de36c3a9aff2fe74a7d2a18d3f.jpg"
    },
    {
        "podcast_id": 187235,
        "title": "Young Guidance",
        "description": "We're trying to figure our way through life while trying to help you do the same! Let's see how it goes! ",
        "language": "en",
        "author_name": "Kaleigh Lewis",
        "slug": "youngguidance",
        "cover": "20230213_070254_961c21c39b7859de0105eae0d5a8d5ef.jpg"
    },
    {
        "podcast_id": 187456,
        "title": "I Love Hot B*tches",
        "description": "Whenever I walk into a room, I always look for the Hottest B*tch in the room, because no matter how incredibly gorgeous they are, their looks are always the least interesting thing about them. Hot B*tches come in all shapes and forms and it just so happens that I am looking for YOU! Come join me, Cece, and the hottest b*tches I know as we delve into topics like politics, self discovery, fashion, pop culture, chasing your dreams and all things Hot B*tches. Grab some champagne and join us EVERY Tuesday! I can't wait to see you there! 15% of all profits from this podcast and our clothing line to Women's healthcare and healthcare research. Go to ilovehotbitches.com for more I Love Hot Bitches.",
        "language": "en",
        "author_name": "Cece M",
        "slug": "ilovehotbitches",
        "cover": "20230207_070201_f4d82fd514389ff6d07c25afa92ecb9f.jpg"
    },
    {
        "podcast_id": 187775,
        "title": "Every Hair Counts",
        "description": "<p>The <em>Every Hair Counts</em> podcast with Dr. Sujeev Bains and Susan Bentley Jernigan will teach you everything you need to know about how to keep the hair you have or replace the hair you’ve lost. This is a show for men and women suffering from thinning, balding, and medically related hair loss.</p>",
        "language": "en",
        "author_name": "Host: Jernigan's Hair Replacement Clinic",
        "slug": "every-hair-counts",
        "cover": "20230208_060247_2b5c452082e53491b16a93fe680de0ce.jpg"
    },
    {
        "podcast_id": 188322,
        "title": "Cepedastillo",
        "description": "WE share opinions, thoughts and chat about a different topic on each episode. ",
        "language": "en",
        "author_name": "Ines Castillo, Constanza Cepeda",
        "slug": "cepedastillo",
        "cover": "20230210_030228_a9d1b8949148dfbe85065d6bbe3e959c.jpg"
    },
    {
        "podcast_id": 188334,
        "title": "La ricetta del successo",
        "description": "​​Che cos'è il successo? ✨\n\nUn podcast per  ispirare e motivare a creare i propri sogni.\nLe  nostre artigiane  ( e non solo ) ci racconteranno le loro storie, le difficoltà del cammino imprenditoriale e cos’è per loro il successo.",
        "language": "it",
        "author_name": "Projekt D",
        "slug": "laricettadelsuccesso",
        "cover": "20230210_030208_cfb55a199518f9ef87614d19aa7974e2.jpg"
    },
    {
        "podcast_id": 188346,
        "title": "Recept za uspeh",
        "description": "Kaj je uspeh?\nPodcast, ki  vas bo  navdihnil in motiviral, da ustvarite svoje sanje.\nModne oblikovalke (in ne samo) nam bodo povedali svoje zgodbe, težave na podjetniški poti in kaj zanje pomeni uspeh.",
        "language": "sl",
        "author_name": "Projekt D",
        "slug": "receptzauspeh",
        "cover": "20230210_040225_4d925df3e797a560ff9d7d3fc31b9851.jpg"
    },
    {
        "podcast_id": 188384,
        "title": "2 Cents of Fashion",
        "description": "The Fashion Industry's revenue worldwide is estimated to be worth around 2 trillion dollars in 2026 (3 years from now🙃).\nWith several established and upcoming Fashion capitals across the world, and every state contributing in it own distinctive way. Would you contribute to history being made?\nOn this First season Of @2centsoffashion I brought together several focals in different fashion sphere on one platform with one common motif…… Business!\n\n\n\n",
        "language": "en",
        "author_name": "Akin Pelz",
        "slug": "2centsoffashion",
        "cover": "20230210_060240_bd0cfa74f708ca5d18cf595db7ab1bda.jpg"
    },
    {
        "podcast_id": 188831,
        "title": "Your own healer",
        "description": "Este podcast es un espacio para entender mejor a tu cuerpo y obtener el conocimiento en nutrición que te ayude a balancear bienestar y felicidad ",
        "language": "es",
        "author_name": "Ximena Cobos",
        "slug": "httpsyourownhealer",
        "cover": "20230212_010254_75a2fbdb416de85b0616b6b9cc272568.jpg"
    },
    {
        "podcast_id": 188980,
        "title": "Girl Things ",
        "description": "<p>Two millennial girls wading through life's ups and downs after 20+ years of friendship. Join us as we discuss womanhood, motherhood, friendships, relationships and everything in between.</p>",
        "language": "en",
        "author_name": "Naomi & Erin",
        "slug": "girlthings",
        "cover": "20230213_010224_8f5630102c5522bc801925a3ee2d67d0.jpg"
    },
    {
        "podcast_id": 189423,
        "title": "Po stopách krásy s LOBEY",
        "description": "<p>V podcastu se vydáváme do světa krásy, kosmetiky, péče o pleť a tělo. Zajímá nás nejen historie toho všeho, ale taky současné trendy a poznatky. Proto si k mikrofonu zveme i odborníky v daných oblastech. Po stopách krásy vás vede moderátorka Míša z LOBEY. Podcast je projekt značky české přírodní kosmetiky LOBEY. Web: www.lobey.cz Instagram: @lobeylabs  Facebook: @lobey  Tiktok: @lobeylabs</p>",
        "language": "cs",
        "author_name": "LOBEY",
        "slug": "lobey",
        "cover": "20230214_020213_49fc5b63664a82520119a4851f97d0fd.jpg"
    },
    {
        "podcast_id": 189626,
        "title": "MEKEARISA | YORKIE COFFEE",
        "description": "<p>MEKEARISAとYORKIECOFFEEのオーナー・Arisaと、愉快なスタッフたちが今週を振り返りながら、あれやこれやをお話しするコンテンツ。会話に参加しているような気分で楽しんでいただけたらうれしいです。みなさんの今週はどうでしたか〜？</p>",
        "language": "ja",
        "author_name": "Arisa Matsuo",
        "slug": "mekearisa",
        "cover": "20230215_050204_ef479d89d3931a006ca1ccf4eba187f6.jpg"
    },
    {
        "podcast_id": 189690,
        "title": "Mojitto Fitness",
        "description": "<p>Lifestyle</p>",
        "language": "es",
        "author_name": "Marta y Abdel ",
        "slug": "mojittofitness",
        "cover": "20230226_080225_a4c2e79a1561dea56b5d36f1c901641f.jpg"
    },
    {
        "podcast_id": 193379,
        "title": "Lash Pillow Talk",
        "description": "<p>Come hang out with your new lash besties; Cristal, Tiffany and Liv- lash artists, educators, friends and business partners..</p><p>We're not for everyone; we fly by the seat of our pants, we pivot often and most of the time we just go with the flow because everything is always FINE! But- for anyone Type A; we might not be your cup of tea- we might just stress you out! Come listen anyways; if anything- we're a good time! </p><p>Let's talk lashes, life and everything in between!</p><p>Don't forget to follow us on instagram: @lashpillowtalk </p>",
        "language": "en",
        "author_name": "Lash Pillow Talk",
        "slug": "lashpillowtalk",
        "cover": "20230301_040345_6fcc1568c1ec0e5d644c90526d800b40.jpg"
    },
    {
        "podcast_id": 193621,
        "title": "VINNCI - moda z myślą o przyszłości",
        "description": "<p>Czym jest Upcycling? Skąd pomysł na VINNCI? Jak stworzyłyśmy naszą markę?</p>",
        "language": "pl",
        "author_name": "Karolina Ramus & Marta Ammar",
        "slug": "vinnci",
        "cover": "20230302_120328_3a40c8307ebf7e6e18794fbf85a23c3b.jpg"
    },
    {
        "podcast_id": 193940,
        "title": "Esthetically F*CKED",
        "description": "<p><strong>✨Two mentally unstable estheticians going through life together✨</strong></p><p>Hear us talk about everything from our favorite skincare lines &amp; beauty trends to our horror stories as Estheticians!</p>",
        "language": "en",
        "author_name": "Angel Welch & Kelci Ferris",
        "slug": "estheticallyfcked",
        "cover": "20230303_030316_d4f1ff5605c4f02170c6b3665ab50c2a.jpg"
    },
    {
        "podcast_id": 194598,
        "title": "Let's Get Sewcial w/ LaShuan Michelle",
        "description": "<p>LaShuan is an executive who is also a nurse &amp; an attorney by trade, but her focus for this blog is to share her journey of achieving self care &amp; balance through sewing.</p><p>What began as an effort to explore ways to decompress doing something she loved slowly transformed into exploring ways to weave in her ability to teach all that she has learned as a beginner sewist; all while reviewing patterns, learning new sewing techniques, attending fashion shows, conducting live sew alongs, talking to other sewists about their journey &amp; much more. The goal is share knowledge, teach &amp; inspire other sewists.</p>",
        "language": "en",
        "author_name": "LaShuan Michelle of Sew Sophisticated Designs",
        "slug": "lets-get-sewcial",
        "cover": "20230311_090325_23b06607afdbf213b8579dc57a7e64f3.jpg"
    },
    {
        "podcast_id": 194922,
        "title": "Dry Clean Only",
        "description": "<p>Personal style is a form of self expression, follow me as I speak with local creatives about their influences, takes, careers, and upcoming projects. </p>",
        "language": "en",
        "author_name": "Femi A.",
        "slug": "drycleanonlypodcast",
        "cover": "20230306_090336_aec7899631f8b1ca807e33ac9a862c78.jpg"
    },
    {
        "podcast_id": 195731,
        "title": "Fausta YeP - Yoga e Pilates - Problem solving al femminile",
        "description": "<p>In questi podcast condivido con te le mie passioni legate allo Yoga, al Pilates, Ayurveda, Meditazione e tutto ciò che riguarda il problem solving al femminile. </p><p>Strumenti che mi hanno permesso di evolvere in chi sono oggi, </p><p>Una me autentica.</p><p>Ti parlerò di tutto il mio sapere e di quello che può aiutarti a riconoscerti facendoti scegliere prima TE e il tuo benessere.</p><p>Ricorda TU sei la persona più importante della tua vita.</p><p>Inizia da te e scegli il podcast che più ti incuriosisce, ovunque tu sia, in auto o facendo una passeggiata</p><p>Dai nutrimento alla tua anima!</p><p>Ti auguro un buon ascolto 🙏🏻💕</p>",
        "language": "it",
        "author_name": "FaustaYeP",
        "slug": "faustayep",
        "cover": "20230309_050323_4cf36486d99da38c84a27c3f0996e147.jpg"
    },
    {
        "podcast_id": 196277,
        "title": "Fly Girls Who Dine",
        "description": "<p>“EAT WELL, DRESS BETTER.”</p><p>A traveling food podcast for the fly foodie, where hosts Dali J &amp; Ciara Dawn, meet up with their favs to discuss dining experiences, food reviews, fashion, and everything in between.</p>",
        "language": "en",
        "author_name": "Dali J & Ciara Dawn",
        "slug": "flygirlswhodine",
        "cover": "20230312_050355_66a8e0f8938a62c3903ba30ffc8cfdb0.jpg"
    },
    {
        "podcast_id": 196338,
        "title": "Undressed",
        "description": "<p>Iris and Sofia are here to undress all the topics you could ever imagine and include all your stories and dilemmas in it too!</p><p>Just a casual coffee conversation between two besties that we hope you enjoy and have fun listening to!</p>",
        "language": "en",
        "author_name": "Iris and Sofia",
        "slug": "undressedthepodcast",
        "cover": "20230312_030358_292ddf25115f92bda61ae4f050b675d0.jpg"
    },
    {
        "podcast_id": 197150,
        "title": "Strawberry Milk POD",
        "description": "<p>The girls behind the bikini brand Strawberry Milk Mob, bring you Strawberry Milk POD. Get to know Georgia, Sydney and Sabrina better. Hear about their business journey, relationship advice and much more.</p>",
        "language": "en",
        "author_name": "Strawberry, Coconut, Blueberry ",
        "slug": "strawberrymilkmob",
        "cover": "20230628_070619_b94fd62cb371c68d7f7f515f573865e7.jpg"
    },
    {
        "podcast_id": 197544,
        "title": "Fetish Esthetics - The Podcast",
        "description": "<p>A podcast dedicated to skincare. Micro doses of information to make Skincare digestible for the average person. It’s literally spilling from our pores.</p>",
        "language": "en",
        "author_name": "Meaux",
        "slug": "fetish-esthetics",
        "cover": "20230317_080307_dd30f6c8733a07842845960a4a2e4b8b.jpg"
    },
    {
        "podcast_id": 198006,
        "title": "Injectors Uncut",
        "description": "<p>Whether you're a seasoned injector or merely curious on exploring the world of aesthetic enhancements, join Laurisa and Jacinta for trends, techniques, business and a BTS look into the industry on Injectors Uncut. </p><p> </p><p>We invite listeners to subscribe to the podcast and join the conversation on social media with #injectorsuncutpodcast </p><p> </p><p>Follow Laurisa &amp; Jacinta social media! </p><p> </p><p>@injectors_uncut </p><p> </p><p>@injxu_cosmetics </p><p> </p><p>@anti.ageme</p>",
        "language": "en",
        "author_name": "Laurisa & Jacinta",
        "slug": "injectorsuncut",
        "cover": "20230628_010634_0072241f7d0592e83d5813dc87464eec.jpg"
    },
    {
        "podcast_id": 198273,
        "title": "Vitamin F ",
        "description": "<p>On \"Vitamin F,\" Katherine discusses all things fashion, covering upcoming trends, celebrity stylist hacks, fashion week, and special guest interviews with designers, influencers, and entrepreneurs to learn how they built their iconic brands!</p><p>Each episode covers new topics, so you'll never know what you'll get, but that's what keeps it interesting! Listen for your weekly dose of fashion, with new episodes available every Friday.</p>",
        "language": "en",
        "author_name": "Katherine Patrick ",
        "slug": "vitaminfpodcast",
        "cover": "20230321_010311_3dd0b9d979ffa106346daaa3f550d0da.jpg"
    },
    {
        "podcast_id": 198711,
        "title": "TFC Connections",
        "description": "<p>TFC Connections is a show about the latest happenings in sustainable fashion brought to you by The Fashion Connection, a nonprofit based in Washington, DC empowering members of the US sustainable fashion movement.</p><p>Each month, new episodes will be hosted by members of our executive board. Through conversations with experts and friends, we’ll discuss policy, labor rights, textile innovations, circular solutions, and more.</p><p>The aim of The Fashion Connection is to make connections and create resources that advance the U.S. sustainable fashion movement. The views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of TFC.</p>",
        "language": "en",
        "author_name": "The Fashion Connection",
        "slug": "thefashionconnection",
        "cover": "20230322_080353_2b707f08fb48092007f9a7ad0ed45358.jpg"
    },
    {
        "podcast_id": 198721,
        "title": "SE-LF: Guided Self-care Experiences; fusing skincare, wellbeing and mindfulness",
        "description": "<p>SE-LF is a company that is passionate about promoting self-care and mental wellbeing through high-quality skincare experiences</p>",
        "language": "en",
        "author_name": "SE-LF ",
        "slug": "se-lf",
        "cover": "20230322_090349_a7f5c43670a42fc9341b071bec13e78c.jpg"
    },
    {
        "podcast_id": 199049,
        "title": "ARKIVE Headcast",
        "description": "<p>Discussing all things Headcare for you, yours &amp; theirs</p>",
        "language": "en",
        "author_name": "Adam Reed",
        "slug": "arkiveheadcast",
        "cover": "20230330_110342_03a63bbe36babd140c20c42b2f6b4fa8.jpg"
    },
    {
        "podcast_id": 200387,
        "title": "The Lash Table",
        "description": "<p>Two Toronto beauty service providers spilling all the tea behind the good and bad of running your own business. Is your business not flourishing or growing to the fullest extent? Let's kiss and tell the reality behind it all.</p>",
        "language": "en",
        "author_name": "The Lash Table",
        "slug": "thelashtablepodcast",
        "cover": "20230331_010321_083359ff5379441f3ef5e8526374ae95.jpg"
    },
    {
        "podcast_id": 200952,
        "title": "We Are Dyeing",
        "description": "<p>Meet Beau Dieda and Kameron Rasmussen, 2 hairstylist in the industry sharing all of the secrets into the beautiful world of hairdressing. We are here to share our knowledge with you in hopes that you will leave each episode with tips and trick that will have you constantly slayed! We're not just talking hair, we will also be discussing latest trends, hot topics and dishing on our personal experiences with celebrities and clients. We love having a cocktail and spilling the tea so grab a drink and join us as we host our first podcast!</p>",
        "language": "en",
        "author_name": "Beau and Kameron",
        "slug": "wearedyeingpodcast",
        "cover": "20230402_110455_f1fb6248efb8d7932bb18d3d455c4903.jpg"
    },
    {
        "podcast_id": 201522,
        "title": "Smart Beauty",
        "description": "<p>A beauty podcast series focused on business and branding, hosted by Viola Levy, journalist and founder of Smart Beauty Creative. We sit down with guests from some of the industry’s leading and disruptive beauty brands, as well as industry-insiders. We discuss their own industry journey, where the industry is headed as well as how to succeed in today’s market – together with any other gems of wisdom they care to share.</p>",
        "language": "en",
        "author_name": "Viola Levy",
        "slug": "smartbeauty",
        "cover": "20230405_030440_985efbbd22c94b44e3e588bc43615a33.jpg"
    },
    {
        "podcast_id": 201765,
        "title": "Sounds Like Spa",
        "description": "<p><a href=\"https://www.skininc.com/\"><em>Skin Inc.'s</em></a> Sounds Like Spa podcast is for serious spa professionals who want to hear all about the latest trends, treatments, techniques, skin science, business tips and so much more. Join the <em>Skin Inc.</em> team and as they gain exclusive insight from industry experts and give their hot takes, play fun games and provide authentic skin care chats. Become apart of our esthy bestie community and join the <em>Skin Inc.</em> squad for a refreshing new take on bringing you the latest in education with a fun twist.</p>",
        "language": "en",
        "author_name": "SKIN INC",
        "slug": "skin-inc-sounds-like-spa",
        "cover": "20230406_080452_f873cab5b0ca55114deb8efe1169645a.jpg"
    },
    {
        "podcast_id": 201963,
        "title": "Sneaks & Stats",
        "description": "<p>Join hosts EJ and Julian as they dive into Sneaker Culture, getting into the details of some legendary kicks and how players have performed in those shoes.</p>",
        "language": "en",
        "author_name": "EJ Maniquis & Julian Mitchell",
        "slug": "sneaks-and-stats",
        "cover": "20230414_060409_a3a691b34ab5259e838a6859b4b03190.jpg"
    },
    {
        "podcast_id": 201981,
        "title": "Tribe Called Jess",
        "description": "<p>She's funny. She's crazy. She's wild. She's not lazy. She's hot. She's mild. She's opinionated. She's loud. She's all of the above. Put them all together and she's a Tribe Called Jess.</p>",
        "language": "en",
        "author_name": "Wylde Style Network",
        "slug": "tribecalledjess",
        "cover": "20230415_050431_ef6010ad89f2f78555ebe30ad1a9fc01.jpg"
    },
    {
        "podcast_id": 202118,
        "title": "How to | شلون ",
        "description": "<p>\"How to\" is an exciting new podcast hosted by tech content creator Shams Talaat, who brings in a new creative guest each week to explore different topics under the umbrella of \"how to do something\". From learning to coding, fitness to fashion to cooking , Shams and her guests dive deep into the nitty-gritty of the subject at hand, offering up helpful tips and tricks along the way. With a fun, conversational style and a diverse range of guests, \"How to\" is the perfect podcast for anyone looking to learn something new and have fun while doing it.</p><p>\"شلون \" هو بودكاست جديد ومثير يتم استضافته من قبل خبيرة إنتاج المحتوى التقني شمس طلعت، والتي تستضيف كل أسبوع ضيفًا إبداعيًا جديدًا لاستكشاف مواضيع مختلفة تحت مظلة \"كيفية فعل شيء ما\". من التعلم إلى البرمجة، ومن اللياقة البدنية إلى الأزياء والطهي، تتعمق شمس وضيوفها في تفاصيل الموضوع المطروح، مقدمين نصائح وحيل مفيدة على طول الطريق. بأسلوب مرح ومحادثات ممتعة، لذالك هو البودكاست المثالي لأي شخص يرغب في تعلم شيء جديد والاستمتاع خلال القيام به</p>",
        "language": "ar",
        "author_name": "How to ",
        "slug": "how-to",
        "cover": "20230408_110448_eb8801e21f2a3bbf528109778d90755b.jpg"
    },
    {
        "podcast_id": 202343,
        "title": "Vardon",
        "description": "<p>Where We Talk About Drifting From Tradition</p>",
        "language": "en",
        "author_name": "Vardon",
        "slug": "vardon",
        "cover": "20230503_050557_f893f917cae434ce3688669d8bba31b0.jpg"
    },
    {
        "podcast_id": 202654,
        "title": "The Glow Up Guide | How to glow up your mind, body, and spirit",
        "description": "<p>Welcome to The Glow Up Guide!</p>",
        "language": "en",
        "author_name": "Hannah Lynne Siegel ",
        "slug": "theglowupguide",
        "cover": "20230814_070833_fb3d11ac0cba4c8fedb6bd80fe689849.jpg"
    },
    {
        "podcast_id": 203992,
        "title": "Higher-self talks",
        "description": "<p>It isn’t about what you are wearing, but how close to your higher self you feel by wearing it.</p><p>An invitation to live and style purposely always being your true-self.</p><p></p><p>EN subtitles: <a href=\"https://youtube.com/playlist?list=PLd57ztRu0VWOG8K4AcBG3auMEmIII7rL6\">https://youtube.com/playlist?list=PLd57ztRu0VWOG8K4AcBG3auMEmIII7rL6</a></p><p>-</p><p><a href=\"https://www.instagram.com/raquelfigueroa.borque/\">https://www.instagram.com/raquelfigueroa.borque/</a></p>",
        "language": "es",
        "author_name": "RAQUEL FIGUEROA BORQUE",
        "slug": "designedtoawaken",
        "cover": "20230619_060645_bcb387c2c4b6d95b60b07ab51006ce83.jpg"
    },
    {
        "podcast_id": 204037,
        "title": "FitNFab Podcast",
        "description": "<p>Welcome to FitnFab Podcast! I am your host Shelbi Sloan, CEO and Owner of Sloan Aesthetics and The Sloan Society. I am a pandemic business and retired COVID ICU RN. I am here to help you elevate your business, mind and self and teach you how to be Fit and Fab! xoxo</p>",
        "language": "en",
        "author_name": "Shelbi Sloan",
        "slug": "fitnfabsociety",
        "cover": "20230810_050817_4cda35ee4138ba503052199b4debbc99.jpg"
    },
    {
        "podcast_id": 204241,
        "title": "Practically Sisters",
        "description": "<p>Our hosts Erica McGee and Hannah Mize created Practically Sisters to promote being your authentic selves. Here, you can always feel safe and free to be whoever you truly are at heart. Erica and Hannah are two best friends who have been through nearly 15 years of friendship and have been through many seasons of life together. Along the way, they have made wild and crazy memories and are ready to SPILL THE TEA. If you are looking for some juicy girl chat mixed with a little bit of messiness, personal experiences and motivation.. then you've come to the right place. Grab your girls, grab your drinks &amp; let's get down to the good stuff!!</p>",
        "language": "en",
        "author_name": "Practically Sisters",
        "slug": "practicallysisters",
        "cover": "20230423_120408_dbf5d64ce7e67c5270af977e57bca9e0.jpg"
    },
    {
        "podcast_id": 204426,
        "title": "MLS Fashion Goals",
        "description": "<p>Can we get a fit check? MLS Fashion Goals is a podcast where our hosts, Kelsey and Kate not so silently judge all your MLS fashion!  </p>",
        "language": "en",
        "author_name": "HasBeenSports",
        "slug": "mlsfashiongoals",
        "cover": "20230420_020447_4dea0abdf31f7c7ce5c7e45c522dd830.jpg"
    },
    {
        "podcast_id": 205269,
        "title": "Spritz O'Clock",
        "description": "<p><strong>Guess what time is it! It's Spritz O'Clock! Grab a drink and join your new best girlfriends, Amanda DeWitt and Rives Lee. Each week, the girls sip on a few too many Aperol Spritz cocktails as they discuss all things girl-talk, navigating your twenties, and the advice you never knew you needed!</strong></p><p><strong>New episodes every Tuesday</strong></p><p><strong>For inquiries, please email: spritzoclockpodcast@gmail.com</strong></p>",
        "language": "en",
        "author_name": "Amanda DeWitt & Rives Lee",
        "slug": "spritzoclock",
        "cover": "20230424_100417_8d15e2cea59016305ad4e29ef51b3cc7.jpg"
    },
    {
        "podcast_id": 205343,
        "title": "Lash Societe - Your No BS Lash + Business Pod cast",
        "description": "<p>Lash Societe</p><p>Your no BS Lash + Business Podcast</p><p>Hosted by</p><p>Shaniya from Melbourne lash &amp; CO</p><p>Deanna from International Lash Masters</p>",
        "language": "en",
        "author_name": "Shaniya Prakash and Deanna Campese",
        "slug": "lashsociete",
        "cover": "20230425_040421_a3dffb9690c2071616c7b6ea7f475758.jpg"
    },
    {
        "podcast_id": 206087,
        "title": "Displaying Your Inner Beauty on the Outside",
        "description": "<p>Follow along as we navigate life through the lens of fashion, beauty, and self-care. From careers to motherhood, studying to travel, culture and religion to loving yourself, and everything in between, we'll look at how fashion can be incorporated into our daily lives.</p><p>Let's work together as we learn how to <em>Display our inner beauty on the Outside</em></p>",
        "language": "en",
        "author_name": "VLR Stylist",
        "slug": "vlrstylist",
        "cover": "20230521_010500_0ec2b1d6a175a9dd61ec163503714b6e.jpg"
    },
    {
        "podcast_id": 206642,
        "title": "Style my Mind",
        "description": "<p>Welcome to the Style my mind podcast. On this show we decipher the secrets, tips and guidance of fashion and psychology with the worlds most inspiring people. Our mission is to unlock the power to become the best version of yourself, by turning their wisdom and knowledge into practical advice.</p><p>Jennifer Heinen is a Fashion Designer, Fashion Stylist and Psychologist. She grew up in the fashion industry in the past decade and witnessed hands on the effects of fashion and clothes on people. She is obsessed with gaining knowledge and personal growth, while wanting to inspire the young generation to be reflective and mindful, becoming who they aspire to be.</p><p>As a closing tradition in this podcast, we challenge our listeners every episode, which facilitates growth, intentionality and awareness. Make sure to share your challenge results on social media with the hashtag <a href=\"https://www.youtube.com/hashtag/stylemymindchallenge\">#stylemymindchallenge</a></p><p>Find us:</p><p>Youtube: <a href=\"https://www.youtube.com/channel/UCbxf3hXOKjPpcay83KOGG5Q\">https://www.youtube.com/channel/UCbxf3hXOKjPpcay83KOGG5Q</a></p><p>Instagram: <a href=\"https://www.instagram.com/style.my.mind/\">https://www.instagram.com/style.my.mind/</a></p><p>Website: <a href=\"https://www.stylmynd.com\">https://www.stylmynd.com</a></p>",
        "language": "en",
        "author_name": "Jennifer Heinen",
        "slug": "stylemymindpodcast",
        "cover": "20230501_050521_b1331d028f492692e692a8926b67be16.jpg"
    },
    {
        "podcast_id": 207467,
        "title": "RE:GEN REPORTS by PUMA",
        "description": "<p><strong>OUR INSIDE TRACK ON A MORE SUSTAINABLE FASHION FUTURE.</strong></p><p>Want to know about what PUMA is doing to make fashion more sustainable? And how we can all play a part in challenging businesses to do better?</p><p>Subscribe to our 10-part podcast series RE:GEN REPORTS: 10 independent hosts. 10 PUMA insiders and industry experts. Each episode explores a different sustainability theme.</p><p>No corporate jargon. No excuses.</p><p>RE:GEN REPORTS is the direct outcome of PUMA’s Conference of the People, held in London in September 2022. Expect conversations that bring to life the progress, challenges and setbacks of working towards PUMA’s 10for25 sustainability goals, and how we’re collaborating with the wider fashion industry to build a better and more sustainable future. </p><p></p><p>Get to know our Voices of a RE:GENERATION – content creators, designers and storytellers making an impact on sustainability – and other like-minded changemakers.</p><p></p><p>Find the PUMA 2022 Sustainability Report online at <a href=\"http://about.puma.com\">about.puma.com</a></p>",
        "language": "en",
        "author_name": "PUMA SE",
        "slug": "puma-regen-reports",
        "cover": "20230531_100519_abfd2a35ef593e475da265d0c2eb5e35.jpg"
    },
    {
        "podcast_id": 207779,
        "title": "The Gen-Spec Fashion Cast",
        "description": "<p>Like it or not, we live in a constantly-evolving culture that radically reassesses itself on an ongoing basis, then represents itself through its arts, culture, and media.</p><p>New ideas emerge, and once-sacred ideals that were thought to comprise an unchanging cultural bedrock seemingly come under threat - however, not in the form of a promise of impending violence. Rather, felt through inevitable growing pains of society in constant flux where resistance against the current would be within stark contravention to the past and any of its precedents:</p><p>Change was always the constant.</p><p>Look no further than the rapid development of the popular style of dress as evidence to this effect.</p><p>No matter where someone finds themselves on the modern-day spectral analysis of gender, or sex, or the terms used interchangeably, the past was true: throughout human history there were only a handful of instances where cultures allowed their views to penetrate the established order of gender dichotomy between man or woman. A new mode of consciousness is seeping into modern culture, particularly in the West that seeks to blur the lines between the two forms, but historically the opposite was primarily the case, and this is the area in which fashion has predominated accordingly.</p><p>With that said, it doesn't matter where someone finds themselves on the gender spectrum in regards to their fashion, except where they intersect with the old ideas separating men and women by their clothing. This rift essentially forced the Gen-Spec Fashion Cast into existence, speaking solely through love and in peace.</p><p></p><p>My name is Elliott, founder, editor and lead design for Lambdog. I identify as a man, and will be using the terms \"man\" and \"woman\" in the ways they have been known colloquially.</p><p>When I entered the world of fashion, the first thing I noticed was that it was a field nearly entirely devoted to women. It was for women, by women; it was women talking to other women and there was a markedly enthusiastic and compassionate tone in regards to their communication. It was clearly a community.</p><p></p><p>I soon realized how little I knew about the subject, and you may find yourself in this camp as well, but that didn't stop me from encroaching upon the topic in any way that I found useful, including Udemy courses, other podcasts, fashion magazines, Youtube videos, fashion shows, as well as discussions with some of the amazing women in my own life.</p><p>I had no idea that something that had such a vast living and breathing culture and undercurrent would be so dramatically obscured from the mainstream point of view, outside of those who went looking for it. At best, I could merely observe from afar. My goal was not to pattern-disrupt (borrowing from my education in marketing), I simply wanted to watch the beautiful thing go.</p><p></p><p>As a man in the way that I refer to it, an interest in this subject takes on an interesting tilt. While there are clearly plenty of men who participate in this field, they tend to not fit the stereotypical bill - which nobody really cares about anyway.</p><p>Speaking personally, I certainly have no male friends that I can go to and talk about fashion with, and most of the men I know only consider their clothing choices after-the-fact. Despite the massive communicative ability a person carries with them in their clothing, there is a substantial portion of men who simply refuse to have any participation in the subject, although, happily, it seems like some of those barriers have begun to weaken for some time now.</p><p>I want to welcome you to the Gen-Spec Podcast - an ongoing analysis of everything relating to the fashion world in its current manifestations through the lens of a self-identifying man, an artist, a creator - a profiler. A scribe, my knowledge base lies primarily within language and writing, but I didn't start a clothing design company simply so I could write about it.</p>",
        "language": "en",
        "author_name": "Lambdog",
        "slug": "genspecfashioncast",
        "cover": "20230521_050528_a6df47564afc08685edc67d0045887b1.jpg"
    },
    {
        "podcast_id": 208476,
        "title": "The Poster Gworl",
        "description": "<p>Brought to you by <em>The Poster Gworl Magazine, </em>our host Jamaya Moné has been sitting down with some amazing people in fashion and entrepreneurship to get intake on fashion and how it plays a part in their daily lives. Here we're bringing all the vibes the gworlies love and all the insight the guys want to hear. Let look beyond the pictures and take a dive into the detail. Follow us on Instagram @thepostergworl. Watch episodes here: <a href=\"https://thepostergworl.com/blogs/theposterboard\">https://thepostergworl.com/blogs/theposterboard</a></p>",
        "language": "en",
        "author_name": "The Poster Gworl",
        "slug": "thepostergworl",
        "cover": "20230805_040838_8f7827e3a4df50cccf704769c5b611ae.jpg"
    },
    {
        "podcast_id": 209153,
        "title": "FüstCast - A magyar barbering és lifestyle podcast",
        "description": "<p>www.klippers.hu</p>",
        "language": "hu",
        "author_name": "FüstCast",
        "slug": "fustcast",
        "cover": "20230514_050523_6719c78a095cfca18623193d0c7daa93.jpg"
    },
    {
        "podcast_id": 209212,
        "title": "LifeWithDaDoll",
        "description": "<p>Heyyy , bringing my thoughts here lol. I question myself sometimes, why not leave a digital footprint.</p>",
        "language": "en",
        "author_name": "Kaliia Green",
        "slug": "lifewdadoll",
        "cover": "20230514_100546_6d2ab87e028678b1d2b80d5499afdc25.jpg"
    },
    {
        "podcast_id": 209388,
        "title": "Cocktails for Breakfast",
        "description": "<p>Welcome to Cocktails for Breakfast, the ultimate podcast for driven moms who are conquering the world of network marketing! Join us as we delve into the exciting and empowering world of entrepreneurship, motivation, and success.</p><p>Each episode is packed with invaluable insights, practical tips, and actionable advice on how to excel in network marketing while managing the everyday challenges of being a mom. Whether you're a seasoned network marketer or just starting your journey, our podcast is the go-to resource for inspiration, motivation, and proven strategies that will take your business to new heights.</p>",
        "language": "en",
        "author_name": "Cocktailsforbreakfast",
        "slug": "cocktailsforbreakfast",
        "cover": "20230515_090532_ecabdc4497399e00fab84fb07dd1bdb5.jpg"
    },
    {
        "podcast_id": 209666,
        "title": "Elevating The Gentlemen",
        "description": "<p>We focus on style and how young or older gentlemen can elevate their sense of style and confidence in The Real World</p>",
        "language": "en",
        "author_name": "Anthony Thambiah/Nick Azzarto",
        "slug": "elevating-the-gentlemen",
        "cover": "20230517_120520_87badc9e54ef01f1981d4641b79fcc82.jpg"
    },
    {
        "podcast_id": 210745,
        "title": "Savvy Geekz",
        "description": "<p><em>A show where Geekz links up and talks about sneaker releases, music, business tips, and more!</em></p><p><strong>Connect with #SavvyGeekz</strong></p><p><a href=\"https://linktr.ee/savvygeekz\"><em>https://linktr.ee/savvygeekz</em></a></p>",
        "language": "en",
        "author_name": "Charde & Musa Rule",
        "slug": "savvygeekz",
        "cover": "20230522_120538_5544b76953da50ba7b2f8f68fba75c94.jpg"
    },
    {
        "podcast_id": 210943,
        "title": "Local Reject",
        "description": "<p>BBBBBBBBBBBBB</p>",
        "language": "es",
        "author_name": "BBB B B B B B",
        "slug": "local-reject",
        "cover": "20230523_060545_6f80bcb4bec43ba56087e30f354a9c30.jpg"
    },
    {
        "podcast_id": 211667,
        "title": "Eli and Mike",
        "description": "<p>Eli and Mike the king's of Beverly Hills, but more important hard working parents, devoted business men, and always looking to be of value and service to the community. Stay connected with us as we share everything about life, business, finance and career. Every week new content will be uploaded and shared with you so that you can learn and follow along with in our journey.</p>",
        "language": "en",
        "author_name": "Eli and Mike",
        "slug": "eliandmike",
        "cover": "20230605_050652_c73ef27b15998543023d04861799dc15.jpg"
    },
    {
        "podcast_id": 211883,
        "title": "She's a Dreamer Podcast",
        "description": "<p>For the dreamers, goal setters and creatives.</p>",
        "language": "en",
        "author_name": "Yasmin Cutler",
        "slug": "shesadreamer",
        "cover": "20230612_020621_76cf03bd57621e823f45b7229ce459af.jpg"
    },
    {
        "podcast_id": 212572,
        "title": "UNDRESSD",
        "description": "<p>Welcome to Undressd! My name is Claudia Lamas and I am an online content creator, social media manager, and fashion enthusiast. I love sharing outfit inspirations to encourage others while elevating their style. I decided to start Undressd to talk about all my favorite things: fashion, influencing and sharing what's on my mind. I'm here ready to bare it out to you guys so make sure you follow me on social media through the podcast instagram @UndressdPodcast, or my personal instagram account @claudiarlamas. Thank you so much for listening and I can't wait to share many more episodes with you!</p>",
        "language": "en",
        "author_name": "Claudia Lamas",
        "slug": "undressdpodcast",
        "cover": "20230601_040629_771b401c2aa60f2c6426bc02f22fce06.jpg"
    },
    {
        "podcast_id": 212826,
        "title": "Suited for Good",
        "description": "<p>In 2016, Suited for Good was established.</p><p>We tailor and donate a new suit to men who could use a hand in improving their situation. These men may be unemployed, down on their luck, looking for better employment or simply just need something nice to happen for them,</p><p>This show is centered on the stories of individuals who have been nominated and  received a fully tailored suit through this program</p>",
        "language": "en",
        "author_name": "BJ Stringham",
        "slug": "suited-for-good",
        "cover": "20230602_070628_96e93054b8169f7441d383f95939a0c1.jpg"
    },
    {
        "podcast_id": 214752,
        "title": "Soleless: The Podcast About Sneakers I Don't Have",
        "description": "<p>Welcome to Soleless, the podcast where I discuss everything sneakers with my guests. We break down shoes with new drops to trends, all with my sneakerhead friends or even just my dad.</p>",
        "language": "en",
        "author_name": "Wyatt Davis",
        "slug": "soleless",
        "cover": "20230804_040830_9537b47234ca8689697de02c9875350b.jpg"
    },
    {
        "podcast_id": 215217,
        "title": "The Real Housegirlies",
        "description": "<p>Two girlies meet at work, form a forever friendship and seven years later, launch a podcast. This is that podcast. The Real Housegirlies aka Alana &amp; Brooke the chaotic internet best friends you did not know you needed. We'll get into everything from fashion, beauty, pop culture to career, finance and adult responsibilities. New episodes every Wednesday. Love ya!</p>",
        "language": "en",
        "author_name": "Alana & Brooke",
        "slug": "realhousegirlies",
        "cover": "20230628_090643_946a2e85974fe6c81d5a6a3e8d9ec74b.jpg"
    },
    {
        "podcast_id": 215290,
        "title": "Palabrita de La Uranga",
        "description": "<p>Un Podcast donde gracias a mi experiencia profesional y personal, intento acercar de manera fácil y sencilla, la importancia de la imagen personal. Cómo podemos crear una mejor versión de nosotros mismos desde casa. ¡Te espero!</p>",
        "language": "es-mx",
        "author_name": "María Uranga",
        "slug": "palabritadelauranga",
        "cover": "20230615_100605_0e84578a861307cd3f28e6487e252445.jpg"
    },
    {
        "podcast_id": 215529,
        "title": "to be f*cking honest with sam",
        "description": "<p>to be f*cking honest is a podcast about anything and everything to do with life. My name is Sam and I will have a different set of guests on each episode discussing multiple topics such as modeling, fashion, college, art, politics, controversy, lifestyle, etc. I hope my lovely listeners get to obtain some kind of inspiration from my podcast, whether it be a single episode or all of them. </p><p>The inspiration behind this is the beauty of being honest. I often find myself biting my tongue in the public eye because of the strict social construct we have grown to know today. Fortunately, I have no problem being brutally honest and it will be showcased throughout my episodes. </p>",
        "language": "en",
        "author_name": "Samantha Abreu",
        "slug": "tobefckinhonestwithsam",
        "cover": "20230616_050629_a9cf2ea6acaff60da0faf634992cb6ab.jpg"
    },
    {
        "podcast_id": 216046,
        "title": "SneakA’Head Podcast ",
        "description": "<p>Tune into the most fun unpredictable sneaker head podcast </p><p>We share stories and information on the kicks we like and the kick we love the most to look forward to getting insights and good conversations weekly from the SneakA’Head crew</p>",
        "language": "en",
        "author_name": "SneakA’Head ",
        "slug": "thesneakaheadpodcast",
        "cover": "20230620_030644_35d487ad63e3729e4f73d30370b7b6b6.jpg"
    },
    {
        "podcast_id": 216560,
        "title": "Design de Sobrancelhas",
        "description": "<p>Quem vence essa batalha? Venha ouvir mais sobre essa jornada! Iremos discutir sobre importantes fatos sobre as dificuldades que passam na jornada de uma esteticista, maquiadora ou qualquer pessoa que trabalha na area de beleza.</p>",
        "language": "pt-br",
        "author_name": "Valquíria Jourdan",
        "slug": "valspabeauty",
        "cover": "20230624_040650_38e5251b3ff60db5447351b8aa1d3411.jpg"
    },
    {
        "podcast_id": 216747,
        "title": "It's Me Leysah!",
        "description": "<p>Let's get physically fit !</p>",
        "language": "en",
        "author_name": "lizaladica26",
        "slug": "lizaladica26",
        "cover": "20230625_030649_5ec15d7b44d1c8217070afeec3f3bf12.jpg"
    },
    {
        "podcast_id": 216755,
        "title": "tunes ",
        "description": "<p>i live to be m0del th1n</p>",
        "language": "en",
        "author_name": "Sheeda ",
        "slug": "habillezmoi",
        "cover": "20230625_040620_896fc165d466666161be186aa9f76aac.jpg"
    },
    {
        "podcast_id": 216924,
        "title": "Hélida Monteiro Podcast",
        "description": "<p>Helida Monteiro é escritora, educadora, consultora empresarial, coach , palestrante e analista comportamental ela é mestre em teologia, habilidades mentais com phD em aconselhamento, pela The Christian University, em New Jersey, New York, USA. Além disso, é uma líder transformacional.</p>",
        "language": "pt-br",
        "author_name": "A MENTALIDADE INFLEXÍVEL",
        "slug": "helidamonteiro",
        "cover": "20230730_040704_3325a13e89b9f21842c75537b82014a0.jpg"
    },
    {
        "podcast_id": 216940,
        "title": "KIANA'S PODCAST MUSIC!!!",
        "description": "<p>hello girls</p><p>tiktok; oddeyegrl || ig: qsychdelic</p>",
        "language": "en-us",
        "author_name": "ate",
        "slug": "kiananana",
        "cover": "20230626_100611_2a75b985c6c0bd3491a9038d8dd698a7.jpg"
    },
    {
        "podcast_id": 218127,
        "title": "The Gloves Off Podcast",
        "description": "<p>Welcome to Gloves Off a podcast ran by Youtubers Tonyd2wild and Bull1trc. The purpose of this podcast speaks for itself the gloves come off and what's said is said...</p>",
        "language": "en",
        "author_name": "Tony DeAngelo & Christian Bright",
        "slug": "theglovesoffpodcast",
        "cover": "20230705_040721_c9960c71160cf549761cd55e86b8e296.jpg"
    },
    {
        "podcast_id": 218228,
        "title": "Podcaster show notes",
        "description": "<p>All about xyz shows and podcasts</p>",
        "language": "en",
        "author_name": "Elvis Otieno",
        "slug": "otieno",
        "cover": "20230706_070717_48093535e650c37bf88568467bf6bd73.jpg"
    },
    {
        "podcast_id": 218285,
        "title": "subliminals",
        "description": "<p>just sum subs i use</p>",
        "language": "en",
        "author_name": "chili",
        "slug": "chilisubs",
        "cover": "20230706_040738_2941155e64e7ddf38fa51c44d28eaf19.jpg"
    },
    {
        "podcast_id": 218390,
        "title": "BIVIR ",
        "description": "<p>Podcast Juvenil sobre diferentes temas de la vida cotidiana, en la que se compartirán vivencias personales, así como de expertos en el tema, Tendremos diversos invitados en las temporadas.</p>",
        "language": "es",
        "author_name": "imdark.son",
        "slug": "bivir-by-darkson",
        "cover": "20230710_110734_5ff7f2428fb023eb87f8265fa5e3fce4.jpg"
    },
    {
        "podcast_id": 218570,
        "title": "Yes, We’re Black",
        "description": "<p>Yes, We're Black Podcast is an unfiltered look through the lens of two black women navigating life in America. Join us each week for our take on trending topics, race, food, culture and whatever the hell else is on our minds!</p>",
        "language": "en",
        "author_name": "Nicole and The Mik",
        "slug": "yeswereblack1",
        "cover": "20230708_110750_d92fafddeb4838c52b500ec3bbe9d01e.jpg"
    },
    {
        "podcast_id": 218972,
        "title": "THE FETE",
        "description": "<p>Welcome to The Fete Podcast. Here we will share an exclusive inside look on fashion, beauty, health, and lifestyle. Founded by Charlotte Kessler, The Fete Podcast is a playful environment to talk about current trends, opinions, and advice. Made for you, by you! For more follow @feteblog on instagram.</p>",
        "language": "en",
        "author_name": "Charlotte Hardin Kessler",
        "slug": "thefetepodcast",
        "cover": "20230711_030754_700791397b7ece61634df27ee3bbd96f.jpg"
    },
    {
        "podcast_id": 219905,
        "title": "clean versions",
        "description": "<p>clean versions of my fav songs </p>",
        "language": "en",
        "author_name": "stargirl",
        "slug": "clean",
        "cover": "20230717_090704_543508b4a4448889305b1416f0044cfa.jpg"
    },
    {
        "podcast_id": 219921,
        "title": "The Lash Vault: Unveiling the Secrets of Lash Mastery",
        "description": "<p>Welcome to \"The Lash Vault,\" the ultimate podcast for lash enthusiasts, professionals, and anyone intrigued by the captivating world of beauty. Join me as I delve into the artistry, techniques, trends, and business aspects of the lash industry.</p>",
        "language": "en",
        "author_name": "VivaArtistry",
        "slug": "vivaartistry",
        "cover": "20230717_110737_d138aea596839db2a91559ef8b63c24a.jpg"
    },
    {
        "podcast_id": 220463,
        "title": "Podcasting Podcasr",
        "description": "<p>show notes</p>",
        "language": "en",
        "author_name": "Hector Andrade",
        "slug": "podcastingpod",
        "cover": "20230720_110723_5c9ba593117e9ba43af8728d2c6241dd.jpg"
    },
    {
        "podcast_id": 220652,
        "title": "ldr ",
        "description": "<p>yw luvs &lt;3</p>",
        "language": "en",
        "author_name": "ms rey",
        "slug": "ms-rey",
        "cover": "20230722_060715_73fc9868a5351d458dfeb47e987fb48a.jpg"
    },
    {
        "podcast_id": 220753,
        "title": "funny average podcast ",
        "description": "<p><strong>.</strong></p>",
        "language": "en",
        "author_name": "Mike",
        "slug": "lanasongys",
        "cover": "20230723_050744_a0c272fe5dd2d7f10b40474d5aaf2f24.jpg"
    },
    {
        "podcast_id": 220905,
        "title": "mc burberry - ya mum",
        "description": "<p>mc burberry - ya mum , 2010</p>",
        "language": "en",
        "author_name": "mikebobaguard",
        "slug": "songsthatarentonspottify",
        "cover": "20230724_120734_47c7bdc2de7ba1013d644ce8acfe00da.jpg"
    },
    {
        "podcast_id": 220926,
        "title": "Lash Talks: A Podcast by THE LASH SHOP",
        "description": "<p>Lash Talks is a podcast exclusively created to support the lash community and artists just like you. Join Fendi and Shannon, as they delve into the depths of the industry, uncovering the lash industry’s best-kept secrets.</p>",
        "language": "en",
        "author_name": "THE LASH SHOP",
        "slug": "thelashshop",
        "cover": "20230724_030712_c5f75eec0ae92e056172dedc73de3408.jpg"
    },
    {
        "podcast_id": 221098,
        "title": "Beauty Babble ",
        "description": "<p>Welcome to Beauty Babble, the ultimate podcast for aspiring and seasoned professionals in the beauty industry. Hosted by industry experts, we dive deep into what it truly takes to thrive in this dynamic field. Whether you're a makeup artist, hairstylist, esthetician, or beauty enthusiast, we've got you covered. Get ready to elevate your skills, knowledge, and career in the world of beauty!</p><p>Join us as we explore a wide range of topics that will expand your knowledge and skills. Discover valuable resources for continued education, the latest trends, innovative techniques and must-have products. We share insider secrets, discuss the nuances of different spa treatments, and uncover the hidden gems. And let's not forget the best part—exclusive interviews with the leaders and trailblazers of the beauty biz. Hear firsthand from industry icons, influencers, and entrepreneurs as they share their experiences, tips, and strategies for success. Their wisdom and insights will inspire and motivate you on your own beauty journey.</p><p>Have burning questions about the beauty industry? We've got answers. Our Q&amp;A sessions provide insightful solutions to your most pressing queries, helping you navigate the complexities of this ever-evolving landscape.</p><p>Hosted by Suzanne Dias, Director of Education and Training at Beauty Cult, and Darine Moukhaiber-Krysko, Communications and Marketing Strategist.</p><p>Beauty Babble podcast is brought by Beauty Cult Canada,<a href=\"https://beautycult.ca/\"> https://beautycult.ca/</a>.</p>",
        "language": "en",
        "author_name": "Beauty Cult",
        "slug": "beauty-babble",
        "cover": "20230803_040814_e77a7d3bc2e7b38fe96d1ed237c5cebd.jpg"
    },
    {
        "podcast_id": 221311,
        "title": "Puente a la belleza",
        "description": "<p>¡Bienvenidos a \"<strong>Puente a la belleza</strong>\"!</p><p>Sumérgete en el fascinante mundo de la belleza con nuestro podcast, donde descubrirás los mejores consejos, trucos y secretos para realzar tu belleza interior y exterior. En cada episodio, te brindaremos una experiencia única llena de inspiración y conocimientos que te ayudarán a destacar y resaltar tu mejor versión.</p><p>En \"<em>Puente a la belleza</em>\", te mantendremos al día con las últimas tendencias de maquillaje, cuidado de la piel y cabello. Exploraremos las técnicas más innovadoras y efectivas para lograr un look espectacular, sin importar tu nivel de habilidad o experiencia previa.</p><p>Además, te revelaremos las marcas más destacadas del mercado de instrumentos para pintarse, desde brochas y pinceles de alta calidad hasta herramientas de vanguardia que te sorprenderán por su eficacia y versatilidad.</p><p>¿Te sientes abrumado por la cantidad de productos de belleza disponibles? ¡No te preocupes! En nuestro podcast, haremos reseñas honestas y detalladas de los productos más populares, guiándote para que elijas los más adecuados para tu tipo de piel y estilo personal.</p><p>También tendremos invitados especiales, expertos en belleza, maquilladores profesionales y estilistas, que compartirán sus mejores consejos y secretos detrás de los bastidores para que puedas obtener una perspectiva privilegiada de la industria de la belleza.</p><p>Únete a nosotros en \"<em>Puente a la belleza</em>\" y descubre cómo potenciar tu belleza interior y exterior, sintiéndote seguro y empoderado en cualquier ocasión. ¡Prepárate para lucir y sentirte radiante en todo momento!</p><p>¡Suscríbete ahora y comencemos este emocionante viaje hacia una belleza deslumbrante y auténtica!</p>",
        "language": "es-mx",
        "author_name": "Marylú Valdéz",
        "slug": "bridge2beauty",
        "cover": "20230726_110749_a7dbbc81a24ccbf5dc6dc67d4c2426ad.jpg"
    },
    {
        "podcast_id": 221401,
        "title": "Glitz Glam and Gall",
        "description": "<p>This is just for fun and conversational </p>",
        "language": "en",
        "author_name": "Bambe",
        "slug": "glaglagal",
        "cover": "20230727_040725_4914f5eb67615141f6164d7508a8ab1b.jpg"
    },
    {
        "podcast_id": 221929,
        "title": "The mountains ",
        "description": "<p>\"Mountains is a place where you feel most alive\"</p>",
        "language": "en",
        "author_name": "divisha",
        "slug": "the-mountains",
        "cover": "20230731_110742_cd39cb8120023b845ec403924efd0133.jpg"
    },
    {
        "podcast_id": 222076,
        "title": "Esencia Módy",
        "description": "<p>Vitajte v podkaste Esencia Módy! Kde vás Lucia Yildiz &amp; Karolína Kováčová prenesú do fascinujúceho sveta módy, histórie módy a najnovších trendov. Doprajte si kreatívne rozhovory, v ktorých odhaľujeme tajomstvá módnej scény. Zároveň sa ponoríme do histórie módy, aby sme pochopili, ako sa móda vyvíjala a ovplyvňovala našu spoločnosť. Nechajte sa inšpirovať módnymi tipmi a nápadmi, ktoré posilnia váš osobný štýl. Ale to nie je všetko - budeme diskutovať aj o tom, ako môže móda ovplyvňovať našu energiu a manifestáciu cieľov.</p><p>Uvoľnite svoju kreativitu a objavte svoju vlastnú \"Esenciu Módy\"!</p>",
        "language": "sk",
        "author_name": "Karolína Kováčová",
        "slug": "esenciamody",
        "cover": "20230801_080803_4a4433d25d1dcfc90f461cef829692f7.jpg"
    },
    {
        "podcast_id": 222338,
        "title": "Spa'd Cast Episode #1",
        "description": "<p>Kristin Hope gives us an intro to our amazing and luxurious iLamai Spa and Wellness center, with a breakdown of our background, treatments and all we have offer for your beauty and anti-aging needs!</p>",
        "language": "en",
        "author_name": "Kristin Hope",
        "slug": "ilamaispaandwellness",
        "cover": "20230803_010857_c2381c58a73f66f5313cb8d6898014a9.jpg"
    },
    {
        "podcast_id": 222439,
        "title": "What It's Giving!? Podcast",
        "description": "<p>Welcome to the \"What It's Giving!? Podcast\" – where authenticity and surprises converge! Join our crew of close-knit friends as we dive into compelling discussions on life, love, laughter, and everything in between. Subscribe now and be part of our growing community, witnessing the podcast that never fails to deliver the unexpected every Thursday at 6:30 PM CST on Spotify, Youtube, and Apple Podcast. Get ready for \"What It's Giving!?\" – Because What You See, Is Not Always What You Get.</p>",
        "language": "en",
        "author_name": "Taz, Rara and Z",
        "slug": "whatitsgivingpodcast",
        "cover": "20230803_050843_90493831eb9af9c07b7af693fa29d682.jpg"
    },
    {
        "podcast_id": 222941,
        "title": "Abba Dream",
        "description": "<p>Mo and Elaine go to see Abba </p>",
        "language": "en",
        "author_name": "Jamal Williams",
        "slug": "1000lbssisters",
        "cover": "20230807_110801_6e89a82bcba991a62803fb7fb3d37aab.jpg"
    },
    {
        "podcast_id": 222968,
        "title": "Plotki pielęgnacyjne",
        "description": "<p>Plotki pielęgnacyjne to podcast o pielęgnacji skóry, ale w luźnej formie. Stworzony przez kosmetolożkę, Angelikę Grabowską. </p>",
        "language": "pl",
        "author_name": "Angelika Grabowska",
        "slug": "plotkipielegnacyjne",
        "cover": "20230807_040810_96f7a3a02da2b5cabcf951d50d35b1c0.jpg"
    },
    {
        "podcast_id": 223748,
        "title": "小店員網上日記 ",
        "description": "<p>同事有代溝，應該點部署？｜潮語大檢閱｜後香港小店員網上日記 20230812 主持: 小店員Alice, 康 #podcast</p>",
        "language": "zh",
        "author_name": "Alice Chan",
        "slug": "littleshop20230812",
        "cover": "20230812_030812_1778def5080d2ff633700479fea86743.jpg"
    },
    {
        "podcast_id": 223910,
        "title": "WANNABE podcast sa Ninom i Nađom",
        "description": "<p>WANNABE podcast sa Ninom i Nađom je zvanični podcast WANNABE MAGAZINE-a, najčitanijeg fashion, beauty i lifestyle web magazina u Srbiji. </p>",
        "language": "sr",
        "author_name": "WANNABE MAGAZINE",
        "slug": "wannabepodcast",
        "cover": "20230813_080848_69a1b7188fa83d330d32888b4af1e1dd.jpg"
    },
    {
        "podcast_id": 224208,
        "title": "In Vintage We Trust After Dark",
        "description": "<p>Josh Roter and Chantal Varela are co-owners of In Vintage We Trust, a premium vintage retailer located in the Parkdale neighbourhood of Toronto. This is their podcast where they talk in-depth about their experience in the vintage world and provide a behind-the-scenes look at their day-to-day lives.</p>",
        "language": "en",
        "author_name": "Josh Roter and Chantal Varela",
        "slug": "invintagewetrust",
        "cover": "20230815_050810_2637502e749d2f230b7c6d74d1282518.jpg"
    },
    {
        "podcast_id": 224533,
        "title": "What's new with Charlotte H??",
        "description": "<p>the new podcast</p>",
        "language": "en",
        "author_name": "Charlotte Higgins",
        "slug": "whatsnewwithcharh",
        "cover": "20230817_040826_a1c9cee336b06abfc803d93d9f234445.jpg"
    },
    {
        "podcast_id": 224836,
        "title": "Run Devil Run - Ke$ha's Version",
        "description": "<p>Run Devil Run - Ke$ha Unreleased Version</p>",
        "language": "en",
        "author_name": "Ke$ha",
        "slug": "rundevil",
        "cover": "20230819_040856_5e1c82fcc6f8c47b037d2e62d6782bba.jpg"
    },
    {
        "podcast_id": 225089,
        "title": "The Honey Club",
        "description": "<p>Welcome to The Honey Club Podcast! 🎙 Hosted by Angella Staples &amp; Megan Harwell! Join us on a journey through the world of beauty, business, and beyond with your favorite esti-entrepreneurs. 👯‍♀️✨ In each episode, we're spilling the tea, dishing out the latest buzz in the beauty biz, and sharing our own secrets to to running a small business! Need some skincare advice? We've got all the best tips and tricks. Curious about the ins and outs of running a beauty business? Don't worry we are here to share all we know! Craving juicy stories from behind the spa curtain? Prepare for the tea to be steeped! So, whether you're a fellow skincare enthusiast, a budding beauty boss, or just here for some laughs and light-hearted chit chat we've got your weekly dose of good vibes right here! Don't forget to subscribe, like, and hit that notification bell to stay in the loop. Join the The Honey Club and let's glow and grow together! 🍯💫 Stay fabulous and stay tuned! 🐝</p>",
        "language": "en",
        "author_name": "Angella Staples & Megan Harwell",
        "slug": "thehoneyclub",
        "cover": "20230821_030836_348ff215f9ae5a5c0b1ff3456950b346.jpg"
    },
    {
        "podcast_id": 225643,
        "title": "The Gift of Time Luxury Store Chronicles",
        "description": "<p>Welcome to \"The Gift of Time Luxury Store Chronicles,\" the podcast that takes you on an enchanting journey through the world of luxury, elegance, and the stories that timepieces tell. Join us as we delve into the history, craftsmanship, and allure of exquisite watches and luxury accessories available at the renowned <a href=\"https://giftoftimeluxurystore.com/\">https://giftoftimeluxurystore.com/</a>.</p>",
        "language": "en",
        "author_name": "Alex Shandor",
        "slug": "the-gift-of-time-luxury-store-chronicles",
        "cover": "20230824_120802_9a1f29aa1e6653f7142e73040e4440df.jpg"
    },
    {
        "podcast_id": 225776,
        "title": "Catherine Fashion House Unveiled - Wedding Dresses in Lebanon, Designer Gowns",
        "description": "<p>Welcome to \"Catherine Fashion House Unveiled,\" the podcast that invites you into the enchanting world of bridal elegance and <a href=\"https://catherinetawk.com/\">designer gowns</a>. Immerse yourself in the artistry and craftsmanship that define the exquisite wedding dresses handcrafted by Catherine Fashion House.</p>",
        "language": "en",
        "author_name": "Catherine Tawk",
        "slug": "wedding-dresses-in-lebanon-designer-gowns",
        "cover": "20230825_070816_46643adabe96d504399203d6ad5c3fc0.jpg"
    },
    {
        "podcast_id": 225838,
        "title": "Daraba1034",
        "description": "<p>Haha lol.</p>",
        "language": "en",
        "author_name": "Daraba 1034 Team",
        "slug": "daraba1034",
        "cover": "20230825_060817_37f8705396b7f08220809d66d30be906.jpg"
    },
    {
        "podcast_id": 226130,
        "title": "Girls Night Inn",
        "description": "<p>Check in for a night filled with everything you wish you could talk about but thought no one would understand! Hosts Jazmin Whitley, and Symonne Harrison have a lot in common with two very different viewpoints. It’s a big sister, little sister, tug-of-war, they will have you laughing till you cry. Symonne brings the fresh young GenZ with a lot of sass. Jazmin is the Gen-Y with a twist (definitely not your typical millennial). The convo has never been so mouthwatering.</p>",
        "language": "en",
        "author_name": "Girls Night Inn ",
        "slug": "girlsnightinnpodcast",
        "cover": "20230827_100832_615026831b73905e019251ca5d3f5914.jpg"
    },
    {
        "podcast_id": 226136,
        "title": "The Expliciest Fashion Podcast ",
        "description": "<p>¡Hola! Te invito a acompañarme en este podcast donde hablaremos de mi marca de ropa @<a href=\"http://explicit.mx\">explicit.mx</a>, mis colecciones, personas con las que he colaborado, chisme, etc... Espero y tomes un café, un vino, o tu bebida favorita y snack para escucharme, los tqm:)</p>",
        "language": "es-mx",
        "author_name": "Gustavo López",
        "slug": "theexpliciestfashionpodcast",
        "cover": "20230828_120822_251289eaccb6045875f48e8ce46eaa82.jpg"
    },
    {
        "podcast_id": 226478,
        "title": "Test",
        "description": "<p>Test</p>",
        "language": "en",
        "author_name": "Test",
        "slug": "dnagenotektest",
        "cover": "20230830_120803_024888d18edf9fe6abace7a5d6ec698b.jpg"
    },
    {
        "podcast_id": 226580,
        "title": "تخربيشات",
        "description": "<p>تخربيشات هو تجربة وخلاص</p>",
        "language": "ar",
        "author_name": "ta5rbeshat",
        "slug": "ta5rbeshat",
        "cover": "20230830_060852_3f7e8e0c46b29e765df9b2f5a8880711.jpg"
    },
    {
        "podcast_id": 227044,
        "title": "Welcome to the pod 🌞",
        "description": "<p>Welcome to the podcast that we have wanted to start for the longest time and finally decided to do it while sat in a park 🌞 Chit chat and discussing our wholesome weekend :)</p>",
        "language": "en",
        "author_name": "Ellie and Evie",
        "slug": "ellieandevie",
        "cover": "20230903_120925_acc77f887150f02060150e66aa04fd94.jpg"
    },
    {
        "podcast_id": 227173,
        "title": "My Time, My Life ",
        "description": "<p>Trinette Faint is a writer, model, actress, and creative entrepreneur. She is the author of <a href=\"https://www.amazon.com/Collettes-Caleb-Trinette-Faint/dp/1450539912\"><em>Collette's Caleb</em></a> and <a href=\"https://www.amazon.com/MidCoast-Star-Trinette-Faint-ebook/dp/B00GKA1XAK/ref=sr_1_1?qid=1693840234&amp;refinements=p_27%3ATrinette+Faint&amp;s=books&amp;sr=1-1&amp;text=Trinette+Faint\"><em>MidCoast Star</em></a>, and has written for <em>Vogue Knitting</em> and <a href=\"https://suitcasemag.com/articles/being-a-black-american-abroad\"><em>Suitcase</em></a><em> </em>magazines, and the <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/google-cloud-ux-research/\"><em>Google Cloud blog</em></a>. She's also a <em>Vogue Knitting</em> cover model. Trinette is <em>Harper's Bazaar's</em> first Fabulous At Every Age grand prize winner, and has been featured in <em>Marie Claire</em>, <em>Glamour</em>, and on the<em> Today Show</em>, among other outlets. She's also worked in the entertainment business, notably as the personal assistant to Matt Damon, and is working on her first screenplay.</p><p>On<em> My Time, My Life</em>, Trinette discusses key, transformative moments in her nonlinear creative journey, and how she's had to define her own success, usually in the face of failure. <em>My Time, My Life </em>offers an unflinching look at the real sacrifices and struggles behind chasing her dreams, in the quest for commercial success. In sharing her experiences, she hopes to empower and inspire her listeners to keep chasing their dreams and to never give up.</p><p>Trinette believes that success rarely shows up in the way we think it should, especially when we define it by society’s standards. But when we define it ourselves, we are far more successful than we think.</p><p>Read the corresponding essays at <a href=\"https://medium.com/@trinettefaint\">Medium.com</a>.</p><p>Visit Trinette at <a href=\"http://trinettefaint.com\">trinettefaint.com</a> and follow her on instagram at trinette.faint.</p><p><em>My Time, My Life</em> is a <a href=\"https://floor51productions.com/\">Floor 51 Production</a></p><p>Photo credit: <a href=\"https://studiococonyc.com/\">Coco Jourdana</a></p>",
        "language": "en",
        "author_name": "Trinette Faint",
        "slug": "mytimemylife",
        "cover": "20230906_090924_01b52645967c7544e87f1062dce34433.jpg"
    },
    {
        "podcast_id": 227262,
        "title": "share iget",
        "description": "<p>Share IGET</p><p>Email: <a href=\"mailto:0.pew.diva@icloud.com\">0.pew.diva@icloud.com</a></p>",
        "language": "en",
        "author_name": "Tina Rose",
        "slug": "igetaus",
        "cover": "20230905_050950_34cfd796caefc4a14ac25d949f0af963.jpg"
    },
    {
        "podcast_id": 227299,
        "title": "Podcast 2",
        "description": "<p>description</p>",
        "language": "en",
        "author_name": "Mohamed Ragab",
        "slug": "beke",
        "cover": "20230905_120920_7a7a671174f9deaf57491f9d32ab65df.jpg"
    },
    {
        "podcast_id": 227312,
        "title": "Ідем на Букви",
        "description": "<p>Подкаст про барберінг. Душевні та інформативні діалоги з майстрами індустрії барберінгу.</p>",
        "language": "uk",
        "author_name": "Gleb",
        "slug": "idemnabukvy",
        "cover": "20230905_020944_1946bd2ecfd9c238c24993073922450b.jpg"
    },
    {
        "podcast_id": 227989,
        "title": "ruf stuff",
        "description": "<p>baseddd</p>",
        "language": "en",
        "author_name": "will",
        "slug": "ruflif",
        "cover": "20230910_120920_63a33cb980bdc06e140564402f3f6c0f.jpg"
    },
    {
        "podcast_id": 228072,
        "title": "to whom it mae concern",
        "description": "<p>the podcast for the gen zer’s of the world. hosted by maeli (a gen zer herself), the pod is an outlet for her to ramble on about culture, fashion, social media, trends, men and more. if your a digital girl (or boy) this podcast is for you. </p>",
        "language": "en",
        "author_name": "mae ",
        "slug": "to-whom-it-mae-concern",
        "cover": "20230910_060912_1938eb7de63c47a9478249445f9f5691.jpg"
    },
    {
        "podcast_id": 228135,
        "title": "Test",
        "description": "<p>Test</p>",
        "language": "en",
        "author_name": "incrimious",
        "slug": "wickle",
        "cover": "20230911_040949_be7fc2f77f2ab579bddaefe5fa0dc1d3.jpg"
    },
    {
        "podcast_id": 228152,
        "title": "123",
        "description": "<p>123123</p>",
        "language": "pl",
        "author_name": "Rafał",
        "slug": "bobos-podcast",
        "cover": "20230911_080918_9804163b89a6575b10c2f62f60b804b1.jpg"
    },
    {
        "podcast_id": 228422,
        "title": "English in different careers - PODCAST",
        "description": "<p>Do you already know what you study and if you will need English in them? This is a little information for you.</p>",
        "language": "es-mx",
        "author_name": "Jenni Cruz",
        "slug": "english-in-different-careers-jennifercruz",
        "cover": "20230912_100907_5a9a29f3a484fa8bcd90492acd39bd39.jpg"
    },
    {
        "podcast_id": 228878,
        "title": "Undefining Beauty Podcast",
        "description": "<p>Conversations with international fashion and beauty photographer and Access Consciousness Certified Facilitator Andrea Belluso and special guests exploring what beauty is for different people and how beauty could be undefined. By removing all definitions of beauty could we finally receive everything and everyone, including ourselves, with no judgement, no projections and no expectations? And what could be created with looking at beauty this way on all levels of our lives?</p>",
        "language": "en",
        "author_name": "Andrea Belluso",
        "slug": "undefiningbeaauty",
        "cover": "20230916_120946_5042ef69b7b2f7ff81ab15c9368fd573.jpg"
    },
    {
        "podcast_id": 229041,
        "title": "A Sisters Opinion Podcast",
        "description": "<p>A Sisters Opinion Podcast is a weekly podcast hosted by your favorite sisters Ella Sokeland and Lizzie Jerden! Follow along with the sisters as they talk about college, what to do with your 20's, dating life in gen-z, and so much more! New episodes come out every Sunday so, make sure to listen wherever you get your podcasts!</p>",
        "language": "en",
        "author_name": "A Sisters Opinion Podcast",
        "slug": "asistersopinionpodcast",
        "cover": "20230917_020924_45791a0ec7adfc62ed1ded0ddaf798c5.jpg"
    },
    {
        "podcast_id": 229217,
        "title": "What In The Fashion?!",
        "description": "<p>What In The Fashion?! Is a judgement free zone discussing and questioning current sustainable developments and practices around fashion and culture, as well as all other weird and wonderful things about the world of FASHION.</p>",
        "language": "en",
        "author_name": "Millie Fullalove",
        "slug": "whatinthefashionpodcast",
        "cover": "20230918_060957_2dee524dc7f3f54c75be66f63939e6be.jpg"
    }
]