[
    {
        "podcast_id": 9562,
        "title": "Revivify",
        "description": "Want to hear how others master residential construction? Grace Mase, founder and CEO of BEYREP® talks with leaders in the residential construction community. From Architects to Interior Designers, Remodelers, and Home Builders to Green Design Innovators, you get to hear who they are, how they got started, improve their crafts, and change our world through the design of our homes. We discuss everything that goes into projects from contractor and homeowner relationships to understanding the impact architecture has on communities.",
        "language": "en",
        "author_name": "Grace Mase, BEYREP",
        "slug": "revivify",
        "cover": "20200611_171344_90e075e63ca37fe11ad800a124bb4be4.jpeg"
    },
    {
        "podcast_id": 14556,
        "title": "Addicted To The Pot",
        "description": "Ron and Christi are Alabama natives with a watchful redeye on the happenings in Gulf Shores and the surrounding area. We created this podcast as an excuse to hangout and drink coffee. We aren't trying to be anything other than what we are, a couple of beach bums who like good conversation and a caffeine buzz. ",
        "language": "en",
        "author_name": "Christi and Ron",
        "slug": "attp",
        "cover": "20201118_185318_a32e07374153965f479ad18b977f926d.jpg"
    },
    {
        "podcast_id": 27509,
        "title": "Episode 1 - Introduction to Board Meeting",
        "description": "Board Meeting is a contractor-focused podcast with the goal of connecting contractors, homeowners and anyone else who may be involved in the home restoration or renovation project. We will be talking to some of the best experts in their respective industries to help give homeowners the confidence to ask the right questions, choose the right products and hire the best people for the job. ",
        "language": "en",
        "author_name": "Courtney Stoffel",
        "slug": "boardmeeting",
        "cover": "20220203_080206_61781887ba166ddec6f59db7b97c96ef.jpg"
    },
    {
        "podcast_id": 32112,
        "title": "Stems & Stories",
        "description": "A podcast at the intersection of books and botany. Bryan, a librarian, and Hannah, an author and book publisher, are two professional book nerds and plant enthusiasts talking shop about two of the things they love most. ",
        "language": "en",
        "author_name": "H.R. Gordon and Bryan J. Sajecki",
        "slug": "stemsandstories",
        "cover": "20210212_024555_388797c519ebc16f5d12154a800134b8.jpg"
    },
    {
        "podcast_id": 35657,
        "title": "Fashion, Adventure, Beauty",
        "description": "     Welcome to the Fashion Adventure Beauty Podcast Series! We love beautiful fashion, traveling with friends and exploring, and embracing beauty in the world. In the FAB podcast series, we will shine a spotlight on everything from our favorite boutiques to the must see sites at our favorite travel destinations.                                                       \n      We are interested in what you are looking to learn more about in these three categories, so please send us your questions and suggestions and we will be sure to reply to all of them!  Website: FashionAdventureBeauty.com IG: @FashionAdventureBeauty Email: FashionAdventureBeauty at Gmail dot com.\n",
        "language": "en",
        "author_name": "Fashion, Adventure, Beauty",
        "slug": "fashion-adventure-beauty",
        "cover": "20210629_185441_3b415f761feed7cfc5058042d95626fd.jpg"
    },
    {
        "podcast_id": 45843,
        "title": "Mapei Krónika Podcast",
        "description": "A Mapei Krónika podcastja azért jött létre, hogy segítséget adjon! Lesz itt minden, ami építőipar: szó lesz hőszigetelésről, vízszigetelésről, problémákról és azok megoldásairól, nagyméretű lapokról, teraszburkolásról, fugázóról, padlófűtésről, medenceépítősről, betonjavításról és még sorolhatnánk, sosem lenne vége… ",
        "language": "hu",
        "author_name": "Mapei Kft",
        "slug": "mapei-kornika",
        "cover": "20210331_174030_4c87bf8d1600c802bc63fc88d065745f.jpg"
    },
    {
        "podcast_id": 51731,
        "title": "Comment s'aiemer",
        "description": "Un podcast queer+trans 👽👽👽 qui parle parfois de plantes, parfois de relations, mais surtout de care 👯‍♂️👯‍♂️✨✨🐌🐌",
        "language": "fr",
        "author_name": "Filix Femina",
        "slug": "commentsaiemer",
        "cover": "20210916_151846_a3eb087a6005bde8c896e13abedef252.jpg"
    },
    {
        "podcast_id": 71486,
        "title": "Cannabis Plant Therapy Live",
        "description": "Weekly live discussion covering all things cannabis related.  We talk about everything from growing/growroom setup, outdoor, equipment, and the list goes on!\n\nPlease join us each week as we explore something new all the time.  We will have a few laughs along the way as well!\n\nVisit us at our website: www.planttherapy.live\n\nWe have links to our socials, and we post updates, with pictures, and contests to come!",
        "language": "en",
        "author_name": "Ray and Pothier",
        "slug": "planttherapy",
        "cover": "20211009_232332_b0fef900f9bc5e1246b94926470829cc.jpg"
    },
    {
        "podcast_id": 83403,
        "title": "La clé du condo",
        "description": "La clé du condo est un balado où on discute de problèmes et défis rencontrés par les administrateurs de copropriétés.\n\nÀ chaque épisode, on tente d’amener des réponses, des pistes de solutions, des idées et des réflexions.\n\nLa clé du condo est une présentation de Depatie Beauchemin Consultants et de Technologies Hoodi.\n\nhttps://www.depatiebeauchemin.com/\nhttps://www.hoodi.ai/",
        "language": "fr",
        "author_name": "Depatie Beauchemin Consultants",
        "slug": "lacleducondo",
        "cover": "20220113_090156_1a98f581347fefa920df373f778a3195.jpg"
    },
    {
        "podcast_id": 90435,
        "title": "Thriving The Future Podcast",
        "description": "<p>Thriving The Future Podcast focuses on </p><p>👍- Positive solutions to help you #Thrive</p><p>🔨- Design your Intentional life.</p><p>🐓- Homestead</p><p>🍓- Garden</p><p>🤝 – Community</p><p>🧰 – #SkillsOverStuff</p><p>Podcast website: https://thrivingthefuture.com</p>",
        "language": "en",
        "author_name": "Thriving The Future",
        "slug": "thrivingthefuture",
        "cover": "20211113_145251_bfd9c10ab95a1c261febed905c8fd660.jpg"
    },
    {
        "podcast_id": 103147,
        "title": "Sarver Living Podcast ",
        "description": "Welcome to Sarver Living!\nI am your host Sylvia Maxwell and I can’t wait to practice community with you by giving you access to our local livers of this amazing town!\nHere you will get to know those that serve in our community. Local residents and businesses will get to tell their story of their why and how Sarver has changed and shaped their lives. \nThank you for listening!",
        "language": "en",
        "author_name": "Sylvia Maxwell",
        "slug": "sarverliving",
        "cover": "20220123_100115_14dfdb938cf2265cd0ea65d783b79554.jpg"
    },
    {
        "podcast_id": 110909,
        "title": "REplays",
        "description": "Learn about everything real estate through segments and short interviews with industry experts. Justin discusses timely news affecting the national real estate market and also covers trending topics such as smart home technology, buying a second home, advice for aspiring agents, and advice for first-time buyers and sellers.",
        "language": "en",
        "author_name": "Justin Core",
        "slug": "justincore",
        "cover": "20220225_010231_3e54aeee24cb8314fa2de77b714030e4.jpg"
    },
    {
        "podcast_id": 111138,
        "title": "Le Point Immo",
        "description": "LE POINT IMMO\n\n« Le Point Immo » est votre nouveau rendez-vous pour mieux comprendre le marché immobilier, ses enjeux et ses défis, et comment Pilet & Renaud évolue au sein de ce secteur dynamique. \n\nMerci à @lemanbleu, chez qui nous avons enregistré ces épisodes !\n\n#PiletRenaud #immobilier #genève #podcast #podcastimmobilier",
        "language": "fr",
        "author_name": "Pilet & Renaud",
        "slug": "lepointimmo",
        "cover": "20220224_030238_82a4c7426e91f953dbfb35480464771a.jpg"
    },
    {
        "podcast_id": 112582,
        "title": "The Rookie Realtor Reality",
        "description": "Being a Realtor looks glamorous on Instagram, but this podcast brings you back to reality. The challenges, the wins and everything in between. Even with the challenges, we wouldn't choose another career! Come hear what it's like to be a Realtor and what clients should expect when buying/selling their homes.\n\nFollow us on instagram:\nBailey - @BaileyWeaverPackardRealtor\nAmir - @AmirHunter_RealEstate",
        "language": "en",
        "author_name": "Amir Hunter & Bailey Weaver Packard",
        "slug": "rookierealtorpod",
        "cover": "20221006_061018_a6c91e2472aa871680827aa8f90205ab.jpg"
    },
    {
        "podcast_id": 116099,
        "title": "Louisiana Delta Crop Podcast",
        "description": "R.L. Frazier, Dennis Burns and Kylie Miller are Extension Agents covering the parishes along the Mississippi River.  We started this podcast to talk about all things related to agriculture in East Carroll, Madison, Tensas, Concordia and Catahoula Parishes.",
        "language": "en",
        "author_name": "Kylie Miller ",
        "slug": "louisiana-delta-crop-podcast",
        "cover": "20220414_050431_a1e6c944215fd6d1803bd0410c2945cb.jpg"
    },
    {
        "podcast_id": 121929,
        "title": "Hey Paula! Help me with my DIY Project",
        "description": "Welcome to “Hey Paula, help me with my DIY project!”\n\nThe podcast that teaches YOU how to do interior design on a budget. We’ll be teaching you easy decorating tricks, what home improvement projects can make a major impact inside and outside of your home, kitchen and bath updates, and so much more! And we’ll be doing it in an easy to digest format.\n\nThis podcast is sponsored by Heirloom Traditions ALL-IN-ONE Paint, the number one paint choice for cabinets, countertops, flooring, front doors, leather, vinyl, furniture, brick and more! No sanding, sealing or priming required! Get a free sample today at allinonepaint.com/freesample and see why over 400,000 users are loving the results. \n \nWe hope you enjoyed these tips from Paula and Melissa. Be sure to subscribe to Hey Paula! Help me with my DIY Project! wherever you listen to podcasts to get more home improvement & decorating tips. If you’re inspired by this podcast, please subscribe, leave a review & share it to your social media. That helps more than you know! We'll be choosing a winner each week from the reviews to win $25 to shop with. And don’t forget to check out www.allinonepaint.com and get yourself a free sample! Share the link with your friends!  \n\n   Follow @heirloomtraditionspaint on Facebook, Instagram, Pinterest, TikTok and Youtube for more tips & projects!",
        "language": "en",
        "author_name": "Paula Blakenship",
        "slug": "allinonepaint",
        "cover": "20220628_060613_c79026ac9551a0441cab628fdc77aa42.jpg"
    },
    {
        "podcast_id": 129416,
        "title": "Monday With The Mills Crew!",
        "description": "Join us every Monday with one of our Co-Owners Michael Woodward to discuss all you need to know about home ownership maintenance, small business tips & more! ",
        "language": "en",
        "author_name": "Michael Woodward & Mills Roofing Crew!",
        "slug": "mondaywiththemillsroofingcrew",
        "cover": "20220520_060536_fbca96d0829ec609d4953586928f46b4.jpg"
    },
    {
        "podcast_id": 130746,
        "title": "The Relentless Gardener",
        "description": "Welcome to the Relentless Gardner Podcast with Linda Langelo, a Colorado State University Extension Horticulture Agent. In this podcast, we will discuss all things gardening. From the wonderful programs CSU Extension has to specific gardening tips.",
        "language": "en",
        "author_name": "Linda Langelo",
        "slug": "the-relentless-gardener",
        "cover": "20220527_050543_b91998db79afc26be314d18456c78b39.jpg"
    },
    {
        "podcast_id": 131620,
        "title": "Soothing Noise",
        "description": "The sounds of simple nature",
        "language": "en",
        "author_name": "Sal",
        "slug": "soothingnoise",
        "cover": "20220612_010652_07ad36c675280b1947ee21547548a349.jpg"
    },
    {
        "podcast_id": 132551,
        "title": "Chat & Chill with Providence Hill",
        "description": "Join us as we interview local RVA experts in finance, home services, and other small business owners. Our goal with this podcast is to educate and entertain our community with relevant information about all things Real Estate, home, and Richmond.  \n\nProvidence Hill Real Estate is a local real estate firm from Richmond, Virginia. After launching the firm in 2021, Providence Hill has successfully closed over 250 homes for its clients and has surpassed 20 agents/staff; and is excited to keep growing its community and helping its neighbors in Richmond, Virginia. Chat & Chill is hosted by the three owners, Elliott Gravitt, Dawson Boyer, and Caleb Boyer. \n\nFor more information on Providence Hill Real Estate, check out their website at PHREhomes.com",
        "language": "en",
        "author_name": "Providence Hill Real Estate",
        "slug": "ccphre",
        "cover": "20220606_020653_21de20928dc2904890310e36bca3f98a.jpg"
    },
    {
        "podcast_id": 133818,
        "title": "Sloydcast",
        "description": "Conversations with greenwoodworkers, spoon carvers, bowl turners, tool makers and craftspeople from around the world.",
        "language": "en",
        "author_name": "Sloydcast",
        "slug": "sloydcast",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 134145,
        "title": "The Sustainability Factor",
        "description": "Weekly chats between a mother and daughter discussing Sustainability and related topics",
        "language": "en",
        "author_name": "Briana Table and Tanya Hoff",
        "slug": "thesustainabilityfactor",
        "cover": "20220614_120656_5c3730da58841e4578dabc74915e0bdb.jpg"
    },
    {
        "podcast_id": 134851,
        "title": "The Blissful Witchcast",
        "description": "Hello and Welcome Witches!\nThis is a Sacred space where we talk Spells, Rituals, Love, Pleasures & Magick. \nA place of sharing from the life of an Australian Witch while raising my young Witchlings and experiencing my own journey of Green and Kitchen Witchery.\nLet's embark on this Witch quest together to living a more happy & soulful life x \n\nFind me on Instagram at @blissful_warrior1\n\nWitchy Website shop at www.blissfulwarrior.com.au for all things candles, incense, crystals, and services.\n\nAs well as https://www.patreon.com/blissfulwarrior for just $14.99 a month you receive my Patreon Membership where I share beautifully designed worksheets for the Months Moon phases, Spells, and Mantra posters for download, Journal prompts, and Zodiac posters for your alter. Patreon bills from the 1st of each month regardless of when you sign up and you can cancel at any time.\n\nSpecial Thank you to my Husband, Witchlings, family, and close friends who have always encouraged my weird and wild lifestyle, they have never told me to dim my light and this has given me so much courage to keep living my life my way and encouraging those around me to do the same\n\nCredit Music from Uppbeat (free for Creators!):\nhttps://uppbeat.io/t/danijel-zambo/fairytales\nLicense code: QVEPMNKZSNQVB5C0\n",
        "language": "en",
        "author_name": "Shannae Morris",
        "slug": "blissfulwitchcast",
        "cover": "20220628_020657_f42cf0cc46670ee19092fdca9ba6dcfe.jpg"
    },
    {
        "podcast_id": 140150,
        "title": "Zahradnická kuchařka",
        "description": "Zahradničení je velká výzva pro začátečníky i letité zahradníky. K zahradě a rostlinám patří i jiná zajímavá témata, která vám budeme v jednotlivých dílech představovat. Uslyšíte zajímavé rady a informace a často budeme promlouvat s různými hosty. Pojďte s námi tvořit přírodu doma.\nhttps://zahradnickakucharka.cz/\nhttps://www.facebook.com/zahradnickakucharka\n",
        "language": "cs",
        "author_name": "Rašelina a.s.",
        "slug": "zahradnicka-kucharka",
        "cover": "20220713_070715_7754a3b0426e285a34168078f5b5d527.jpg"
    },
    {
        "podcast_id": 143338,
        "title": "Sikora Success",
        "description": "Brett Sikora is the founder and CEO of The Sikora Group, the #1 Top Producer in every category at eXp since 2019. With every episode, we'll bring on a new agent from our group and outside friends of Sikora to talk about all things real estate, and how you too can find success!",
        "language": "en",
        "author_name": "Brett Sikora",
        "slug": "sikorasuccess",
        "cover": "20220808_110843_0416ff89db145bd5f52d12e9db1d5e8d.jpg"
    },
    {
        "podcast_id": 149492,
        "title": "We Need Closure",
        "description": "With nearly 20 years of real estate experience combined, REALTORS Kalyn McKittrick and Heather Teems are joining forces to give the people what they want: hilarious real estate stories from the REALTORS, clients and industry experts who have lived to tell the unbelievable tales of buying and selling real estate. Come for the stories. Stay for the interviews, insights and entertainment. Have an unbelievable real estate story? Submit your stories at stories@weneedclosure.com or on Instagram at @WeNeedClosurePodcast.",
        "language": "en",
        "author_name": "Kalyn McKittrick & Heather Teems",
        "slug": "weneedclosure",
        "cover": "20220828_070833_355bb8e391d7266e6e8f59bc52006445.jpg"
    },
    {
        "podcast_id": 152113,
        "title": "A regular review of issues affecting landlords",
        "description": "A regular discussion around issues that impact on landlords in the private rented sector",
        "language": "en",
        "author_name": "Simon Bacon",
        "slug": "preferential-properties",
        "cover": "20220908_070922_644130e308c47e9b91367ecec76fec41.jpg"
    },
    {
        "podcast_id": 156403,
        "title": "Houspeek",
        "description": "Getting your own place seems like a daunting task, but here we talk about how to navigate getting that new place and making it a home. ",
        "language": "en",
        "author_name": "Alex F-W",
        "slug": "housspeak",
        "cover": "20220928_020940_8f41e8305172e85c66d56897f97dc84d.jpg"
    },
    {
        "podcast_id": 158887,
        "title": "Cardinal Corner",
        "description": "Cardinal Home Center is proud to host Cardinal Corner, a podcast series to help walk new or experienced homeowners through do-it-yourself projects.\n\nIn this podcast, we’ll talk to some of our experts to get insight into how to tackle unique home renovation challenges. Sometimes, these projects can seem intimidating – how do I pick the right color, where do I start with remodeling my kitchen, what should I stay away from with home improvement?\n\nWe hope this podcast will help guide you through some projects you’ve been looking to do, introduce you to our team of experts, and show you why you can Count on Cardinal! ",
        "language": "en",
        "author_name": "Cardinal Home Center",
        "slug": "cardinalcorner",
        "cover": "20221008_051029_c39d2345618a9825d12c756030a425e9.jpg"
    },
    {
        "podcast_id": 160567,
        "title": "The Northern Designer Podcast",
        "description": "<p>Welcome to the Northern Designer Podcast with your host Lee Bestall. Lee is an exterior stylist &amp; business owner whom has a great interest in chatting with extraordinary folk from all ends of the design spectrum - discussing everything that's design &amp; homes.</p>",
        "language": "en",
        "author_name": "Lee Bestall",
        "slug": "thenortherndesigner",
        "cover": "20230704_020752_95e90fb7ae39d799069daddeb9587233.jpg"
    },
    {
        "podcast_id": 164630,
        "title": "London Property Stories with Rigby & Marchant",
        "description": "The Podcast that opens the book on moving home. A resource for buyers, sellers, tenants and landlords, told through the eyes of our clients and colleagues from the last 26 years of Real Estate Agency experience in West London.\n\nMoving Home is a big event, it ought to feel magical but often doesn't, as it rarely happens without ups and downs. Our job is to make the stressful moments invisible and we will be with you every step of the way.",
        "language": "en",
        "author_name": "Matthew Marchant",
        "slug": "rigbyandmarchant",
        "cover": "20221101_021150_5417daf31ddad4fed9f8f6ea224984a8.jpg"
    },
    {
        "podcast_id": 165496,
        "title": "Farmer Friday",
        "description": "Farmer Friday | This interview series amplifies the voices of our farmers, agriculturists, ag organizations, and ag businesses in the Appalachian region. It gives YOU, as the consumer, the resources needed to understand what is going on in our agricultural industry and what you can do to help. Let's bridge the gap between producers and consumers! ",
        "language": "en",
        "author_name": "Elizabeth Lynch",
        "slug": "farmerfriday-elizabethlynch",
        "cover": "20221104_081151_b3c30bc485635813ff4894b58e1a46e3.jpg"
    },
    {
        "podcast_id": 166495,
        "title": "The Pain of the Claim Presents: The Rumble, Who Dis?, and Law & Policy Special Claims Unit",
        "description": "<p>Prescription Strength Claim Relief: On this podcast channel we will explore all aspects of the claims adjusting world. Show Line up: The Rumble Who Dis? Law &amp; Policy Special Claims Unit</p>",
        "language": "en",
        "author_name": "Jeromy Leavelle , Donna Leavelle, & Guest",
        "slug": "painoftheclaim",
        "cover": "20230818_030859_11cdd9d52101b99e46535e04a854061d.jpg"
    },
    {
        "podcast_id": 167305,
        "title": "Small Farm Minute",
        "description": "Small Farm Minute allows small farmers to share their stories of micro-farming amongst the microchips in Silicon Valley, keeping the culture of agriculture alive in the place formally known as the \"Valley of Hearts Delight\" due to the diverse agriculture that had covered the valley and now has been shrunk down.",
        "language": "en",
        "author_name": "Christopher Mabie",
        "slug": "smallfarmminute",
        "cover": "20221126_031103_4856efcf2e5b6d88771b11ad83aa1172.jpg"
    },
    {
        "podcast_id": 167672,
        "title": "Design. Build. Live.",
        "description": "I am your podcast Host Trent Raines, I live in Kansas City with my Wife and two amazing young kids. I own 1/3rd of a Design/Build remodeling and interior design business in Kansas City.  I handle the construction side of the business. When I asked the two other owners (both designers) what i should name my podcast they suggested the following options...\"The grumpy old contractor\", \"Stories of Scooching Things\", \"Anything is Possible...Or is it?\", \"You can't move that there\", and my personal favorite... \"I can move that there, but I don't want to\".  We kid. We have fun. \n\nI love good conversation and asking questions, I am hoping this podcast will give me the chance for both of those things!\n\nThe business is called Collected Living Design. Check out the business at collectedlivingdesign.com",
        "language": "en",
        "author_name": "Trent Raines",
        "slug": "designbuildlive",
        "cover": "20221113_061126_7e3aeb23cbf2ae6dfa44144595fb0d66.jpg"
    },
    {
        "podcast_id": 171398,
        "title": "In The Garden",
        "description": "In the Garden with Keith Ramsey is a podcast aimed at helping you grow and maintain a beautiful and healthy garden and landscape.\r\n\r\nEach podcast will focus on a new specific topic. Check back every two weeks for the latest episode!",
        "language": "en-us",
        "author_name": "Keith Ramsey",
        "slug": "in-the-garden-with-keith-ramsey",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 171548,
        "title": "Voces que acogen",
        "description": "La Fundación Márgenes y Vínculos comienza la difusión de Voces que acogen, una serie de podcasts con diálogos dramatizados sobre situaciones vividas por familias que han acogido en sus hogares a niñas y niños que lo necesitan en Andalucía. Es una serie de relatos en audio grabada por actores aficionados de la coordinadora Barrio Vivo de Algeciras y podrán escucharse en la página web de la campaña www.acogimiento.es y en este canal de la fundación en Youtube. Para más información entra en acogimiento.es o llama al 900 35 44 28.",
        "language": "es",
        "author_name": "Fundación Márgenes y Vínculos",
        "slug": "vocesqueacogen",
        "cover": "20221201_071255_f3d6e910dad3e4fc7336ab0dd13e2039.jpg"
    },
    {
        "podcast_id": 172812,
        "title": "Speaking of Sustainability",
        "description": "Hosted by composting maven Colleen Falicki (Back To Earth Compost Crew), Speaking of Sustainability shines a spotlight on leaders and change agents making a difference in the sustainability space!",
        "language": "en",
        "author_name": "Colleen Falicki",
        "slug": "speakingofsustainability",
        "cover": "20221206_061240_45f177f3b351d62cdc0db9e2ba35298d.jpg"
    },
    {
        "podcast_id": 175324,
        "title": "Uncluttered: Shaping Your Heart & Home for What Matters Most",
        "description": "On the Uncluttered podcast, we discuss the connection between faith and organizing. Our focus is not just how to be organized but why it’s important, from a Biblical standpoint, that we leave the chaos and clutter in our lives behind. ",
        "language": "en",
        "author_name": "Angie Hyche and Liana George",
        "slug": "uncluttered",
        "cover": "20230104_070121_85add9734e2cca184989b8f137390c80.jpg"
    },
    {
        "podcast_id": 176753,
        "title": "Rooted & Free",
        "description": "Join hosts Brandi White and Sharon Beedle as they share their lives as Jesus-loving mompreneurs, homesteaders and homemakers.  Rooted in the Word of God and hard work, they're building lives of freedom through self-sufficiency, low-tox living, financial independence, seeking truth and, of course, the saving grace of Jesus Christ.\nLook forward to tips, how-tos, learning experiences, commentary on current events and advice, truth and humor in each episode, dropped weekly.  Resources will be included!",
        "language": "en",
        "author_name": "Brandi White & Sharon Beedle",
        "slug": "rootedandfree",
        "cover": "20221228_051212_06c98b7a051aad00a38739671e974260.jpg"
    },
    {
        "podcast_id": 178711,
        "title": "The Deck Guys Podcast",
        "description": "Deck Builders Gio and Cade discuss all things deck building from starting your own business to dealing with difficult clients. Listen in as we reveal the truth behind running a deck-building business in the 21st century.",
        "language": "en",
        "author_name": "Gio Escalera",
        "slug": "thedeckguyspodcast",
        "cover": "20230106_100130_bee8329908db82bb1ea23d035e66a827.jpg"
    },
    {
        "podcast_id": 178876,
        "title": "Chats With Cass | The O'Donnell Homestead ",
        "description": "Here, we slow down. Here, we sit and chat about urban homesteading, homemaking, and slow living. We have the conversations that are difficult. We talk about life, we talk about our character, we talk about the people we hope and strive to be. We tell stories and listen with eager ears. Here, we turn back the clock a bit. Like sitting in front of the fire with your dearest loved ones. Taking the time to sip our coffee slow, and tuck into a conversation without the rush and propensity to move onto the next thing-fast and ferocious without any regard what we might be missing in the meantime. Let's learn to talk to one another again, and find the beauty in magic in conversation and storytelling. Let's Chat. Slainte! ",
        "language": "en",
        "author_name": "Cassidy O'Donnell",
        "slug": "chatswithcass",
        "cover": "20230107_080143_0aa6f1e316d488663c923504bdcb257d.jpg"
    },
    {
        "podcast_id": 179935,
        "title": "Solar & Storage Market Podcast",
        "description": "Learn more about solar inverters, pv modules, energy storage, and racking equipment from the manufacturers. ",
        "language": "en",
        "author_name": "RENVU, INC",
        "slug": "renvu",
        "cover": "20230112_070114_19c382cca1d87f8f8c4cc28109719c49.jpg"
    },
    {
        "podcast_id": 184153,
        "title": "The Realest AMG’s Podcast",
        "description": "Focusing on current real estate topics and trends in Toronto and the GTA. With interviews and discussion with top industry leaders. ",
        "language": "en",
        "author_name": "Brandon Hebert",
        "slug": "realestamgs",
        "cover": "20230127_070113_8332f4ad1eb927aed25edc0a8a8d7aa6.jpg"
    },
    {
        "podcast_id": 184381,
        "title": "Career Homemakers",
        "description": " Time is the gift a homemaker gives to their family. If you are listening to this podcast, that indicates you want your time at home to be productive and meaningful. The many topics discussed will be how to make our homemaking career goal-oriented, creative, and fulfilling. Some hindrances can be negative thoughts and attitudes toward work, home, and family. Listen as I share life lessons for Career Homemakers.",
        "language": "en",
        "author_name": "Kim Griffin",
        "slug": "careerhomemakers",
        "cover": "20230128_080147_bef5bda0c8a41e20606b9448d41be110.jpg"
    },
    {
        "podcast_id": 184682,
        "title": "The Blade Play Podcast",
        "description": "Three Knife and EDC nerds discuss the hard hitting topics in the EDC world. Stay up to date with new product launches, and stay up to date on the ever changing EDC landscape with The Blade Play Podcast.",
        "language": "en",
        "author_name": "Tristate_EDC",
        "slug": "bladeplay",
        "cover": "20230129_100144_60493328892b322e5a9307691028bdb0.jpg"
    },
    {
        "podcast_id": 185131,
        "title": "Sunny Mary Meadow Podcast",
        "description": "<p>The Sunny Mary Meadow podcast is hosted by Liz Fiedler, a flower farmer and nurse practitioner in central MN. After the unexpected loss of her husband in 2020, she found herself turning to her flowers to get through the grief. She didn't expect her business to explode in the next few years the way it has. Bloom &amp; Grow both flowers and personal empathy as she continues to move forward in life.</p><p><a href=\"https://sunnymarymeadow.com/\">https://sunnymarymeadow.com/</a></p><p><a href=\"https://www.instagram.com/sunnymarymeadow/\">https://www.instagram.com/sunnymarymeadow/</a></p><p><a href=\"https://www.instagram.com/bloomandgrow.llc/\">https://www.instagram.com/bloomandgrow.llc/</a></p>",
        "language": "en",
        "author_name": "Liz Fiedler",
        "slug": "sunnymarymeadow",
        "cover": "20230222_030242_e8b30b0d9bd54a490d38b3884879ba29.jpg"
    },
    {
        "podcast_id": 188035,
        "title": "MortgageStrong Insights with FirstTrust Home Loans",
        "description": "FirstTrust Home Loans is the largest independent mortgage lender in the state of Arkansas. We have locations across 8 states and will celebrate 20 years in business in November of 2023. Let's talk mortgage, the market, business tips, and bring on some really cool guests over the next 12 months. Podcasts will go live the 30th of every month! ",
        "language": "en",
        "author_name": "Camden Howard",
        "slug": "mortagestronginsightsfthl",
        "cover": "20230209_020240_43cced1556fe14edbf3f455e0364b57a.jpg"
    },
    {
        "podcast_id": 189721,
        "title": "颗颗Radio",
        "description": "<p>“回来了” 大家好，时隔8个月，我们又回来了！ 我们这一次回归，不是一般的回归，而是给自己立了flag，要保持每两周更新一次的那种回归！所以请大家接下来多多关注有营养有品味，又不乏幽默的我们！ 好了好了欢呼声可以到此为止了。 “分享” 在不更新的日子里，和大家一样，我们俩其实都有在认真地生活着。会发现生活的美好，会关注新出的电影，会对着星座解析若有所思，也会有各种烦恼...虽然敏敏老师基本上是答疑解惑的那位，真的可以去开课的了。 我们也想把这些美好也好，烦恼也好分享给大家，其实很多时候说出来了你发现自己不是一个人，而是一只狗（不是）。 也欢迎大家留言投稿说出你的故事和你想听的内容，我们会尽量满足（看着办）的。 大家也可以在小宇宙，Spotify搜索‘颗颗radio’找到我们～ 那我们，下期再见！ 聪敏 cp 敬上</p>",
        "language": "en",
        "author_name": "小聪 小敏",
        "slug": "kekeradio",
        "cover": "20230215_070219_1d34ae92296ee8d53166d34ba0514d60.jpg"
    },
    {
        "podcast_id": 190070,
        "title": "Ranch Life by Kingdom Radio",
        "description": "<p>I must admit that we're the typical \"City Slickers\" that moved out to a small farm and we're trying to figure out this life. Our company <a href=\"https://kingdomchristmaslights.com/\">Kingdom Christmas Lights</a>, keeps us busy in the Christmas business during the holiday season and then we have about 4 months to work on the land and add to our \"flock\". With this being said, we're not expert farmers or in the same breath we don't own thousands of acres of land, we're just your everyday average people who are learning how to live life on a big piece or farm land property. :)</p><p>If you would like to network with Kingdom Radio, please email us at <a href=\"mailto:ron@whykingdom.com\">ron@whykingdom.com</a> or give us a call at 346-291-3131 to support or to be featured on our show.</p>",
        "language": "en",
        "author_name": "Kingdom Radio",
        "slug": "ranchlife",
        "cover": "20230216_050203_e902e83e0499175b15db16e67203e45a.jpg"
    },
    {
        "podcast_id": 191114,
        "title": "Christmas Light Installation",
        "description": "<p>The Christmas Light Installation RSS feed podcast is a great resource for anyone who wants to learn more about installing and maintaining Christmas lights. The show is hosted by experienced professionals who provide listeners with useful tips and insights on how to create a beautiful and safe display for the holidays.</p><p>Listeners can expect to hear a wide range of topics covered in each episode of the Christmas Light Installation podcast. Some of the topics that are regularly covered on the show include:</p><ol><li><p>Best Practices for Christmas Light Installation: The show's hosts share tips and techniques for safely and efficiently installing Christmas lights, covering topics such as ladder safety, electrical safety, and best practices for mounting and securing lights.</p></li><li><p>Design and Display Ideas: The hosts provide listeners with inspiration and ideas for unique Christmas light displays that will stand out in any neighborhood. They cover everything from traditional designs to more modern and avant-garde displays, with plenty of tips on how to create a display that matches your personal style and budget.</p></li><li><p>Maintenance and Troubleshooting: The podcast offers a variety of helpful tips for maintaining your Christmas light display throughout the holiday season. The hosts cover topics such as bulb replacement, weather-proofing, and troubleshooting issues like burnt out bulbs and flickering lights.</p></li><li><p>Interviews with Experts: The Christmas Light Installation podcast frequently features interviews with experts in the field of holiday lighting, providing listeners with a wealth of knowledge and insights from professionals who have years of experience in the industry.</p></li></ol><p>Listeners can access the Christmas Light Installation podcast through various RSS feed platforms, such as Apple Podcasts or Google Podcasts, and can subscribe to the show to receive notifications of new episodes. Whether you're a seasoned pro or just getting started with Christmas light installations, the Christmas Light Installation RSS feed podcast is an excellent resource for anyone who wants to create a dazzling display for the holidays.</p><p><a href=\"https://kingdomchristmaslights.com/\">Kingdom Christmas Lights</a></p><p>346-291-4492</p><p><a href=\"https://twitter.com/KingdomXmas\">#KingdomXmas</a></p><p><a href=\"https://www.facebook.com/KingdomChristmasLights/\">Facebook </a><a href=\"https://www.youtube.com/c/KingdomChristmasLights\">Youtube </a><a href=\"https://www.instagram.com/kingdomchristmaslights/\">Instagram </a><a href=\"https://www.pinterest.com/kingdomchristmaslights\">Pinterest</a></p>",
        "language": "en",
        "author_name": "Kingdom Radio",
        "slug": "christmas-light-installation",
        "cover": "20230227_110209_bd0aa387283cc87070048bf2ccc91eea.jpg"
    },
    {
        "podcast_id": 191219,
        "title": "The Diggers Foundation Podcast - inspiration for the subversive gardener ",
        "description": "<p>Welcome to the Diggers Podcast, inspiration for the subversive gardener where we embrace controversial gardening topics, support lively debate, and promote provocative conversations that we believe help us all become better gardeners and live more sustainably.</p><p>This podcast is brought to you by The Diggers Foundation, Australia's garden charity established by gardeners for gardeners to inspire, preserve and educate passionate gardeners to dig a bit deeper on all things green and growing.</p><p>In our first series, ‘Eucalypt: Friend and Foe’, we discuss the pros and cons of the iconic Australian tree, the eucalypt, for gardeners and land managers.</p><p>Find out more about Diggers at <a href=\"http://diggers.com.au\">diggers.com.au</a></p><p>Theme music: In The Company Of Talking Machines, written and performed by Kinematic</p><p></p>",
        "language": "en",
        "author_name": "The Diggers Foundation",
        "slug": "thediggersfoundationpodcast",
        "cover": "20230221_060237_e4d548d81d41c9c8c730629fcef3d0ad.jpg"
    },
    {
        "podcast_id": 191409,
        "title": "Green Spritz   aperitivo nel mondo del verde",
        "description": "<p>Incontri informali con personaggi del mondo del giardinaggio, vivaismo, architettura del paesaggio... tutto ciò che è GREEN ( Profilo Instagram per tutti i contenuti @floriana.bulbose )</p>",
        "language": "it",
        "author_name": "Christian Shejbal",
        "slug": "florianabulbose",
        "cover": "20230221_100247_9dec2d61a28a2ed1a554d906265690d0.jpg"
    },
    {
        "podcast_id": 192772,
        "title": "Getting Real (Estate) With Josh & Kaci",
        "description": "<p>Join us as we bring you a glimpse into every facet of the real estate industry that we can think of and highlight some incredible local businesses.</p>",
        "language": "en",
        "author_name": "Kaci Spoor",
        "slug": "gettingrealestatewithjoshandkaci",
        "cover": "20230227_040238_d0471b1f675fc63e27f99d87c8b42ee5.jpg"
    },
    {
        "podcast_id": 193397,
        "title": "Evim İçin",
        "description": "<p>Evidea'nın sunduğu Evim İçin podcast serisinde, alanında uzman ünlü konuklarımız ile eve dair her şeyi konuşuyoruz!</p>",
        "language": "tr",
        "author_name": "Evidea",
        "slug": "evim-icin",
        "cover": "20230301_070338_690960672da89f72ae4ecd9506cd5db4.jpg"
    },
    {
        "podcast_id": 195312,
        "title": "Real Estate For Real",
        "description": "<p>This podcast is focused on providing practical, ready to take steps for the general public interested in home ownership and real estate investing. The podcasts mission is to provide actionable information to help the audience make sound real estate decisions, buying selling or leasing. We make real estate palatable.</p>",
        "language": "en",
        "author_name": "Triad One Realty",
        "slug": "realestateforreal",
        "cover": "20230308_030338_8a956426b00d6c7acc8a8ed0ff336cf6.jpg"
    },
    {
        "podcast_id": 198892,
        "title": "The Werks Podcast from Roofwerks",
        "description": "<p>Listen to the latest “The Werks Podcast from Roofwerks” podcast from Curtis Media Group and Roofwerks. The premiere roofer in the Triangle, Roofwerks and Executive Vice President Holly Bowers is joined by teammates to discuss the latest in the roofing industry. She’ll share advice on everything from how to choose the right contractor, information on the numerous products on the market, and what homeowners need to know before selecting a company to replace their roof. For each monthly episode, be sure to listen here and enjoy “The Werks Podcast from Roofwerks.”</p>",
        "language": "en",
        "author_name": "Executive Vice President Holly Bowers",
        "slug": "the-werks-podcast-from-roofwerks",
        "cover": "20230323_050354_830787d4c24a762bc487703b9d21715d.jpg"
    },
    {
        "podcast_id": 199916,
        "title": "Dexterous Lifestyle Podcast",
        "description": "<p><em>The Dexterous Lifestyle is for those ready to begin their journey to a more peaceful environment and dive within to find the answers. During the journey toward a more organized life, we have questions that our expert guests can provide answers to. After working with </em><a href=\"https://dexterouslifestyle.com/\"><em>The Dexterous LIfestyle Inner Circle</em></a><em>, you can use this podcast to find your next expert, coach, or course to move you forward.</em></p>",
        "language": "en",
        "author_name": "Andie Hancock & Kellie Powell",
        "slug": "dexterouslifestyle",
        "cover": "20230328_100309_6a443d1e321acf0360155f6dc9663b43.jpg"
    },
    {
        "podcast_id": 200056,
        "title": "Elements of a Garden",
        "description": "<p>The <a href=\"https://www.nativeplantgardentour.org/\"><strong>2023 Native Plant Garden Tour</strong></a> podcast celebrates the hidden meaning within our gardens — how each element is nested within something larger: a seed, a plant, a garden, an ecosystem. Join UCLA climate scientist and native plant gardener <a href=\"https://www.ioes.ucla.edu/person/alex-hall/#:~:text=Alex%20Hall%20is%20Professor%20in,both%20regional%20and%20global%20scales.\">Dr. Alex Hall</a> and TPF Executive Director Evan Meyer for an exploration of a single garden within the deeper context of environmental and cultural forces shaping our changing planet.</p><p><strong>For images and more information on Dr. Alex Hall’s garden visit:</strong></p><p><a href=\"https://www.nativeplantgardentour.org/06-carthay-rewilding-and-renewal/\">Carthay Rewilding &amp; Renewal</a></p><p>#nativeplants #theodorepaynefoundation #nativeplantgardentour</p><p> </p><p> </p><p>© 2023 Theodore Payne Foundation for Wild Flowers &amp; Native Plants</p>",
        "language": "en",
        "author_name": "Theodore Payne Foundation",
        "slug": "gardentour",
        "cover": "20230329_030340_88b0b01b3130486883b7b4b22c94ce13.jpg"
    },
    {
        "podcast_id": 201671,
        "title": "Lou’s Home Life",
        "description": "<p>Hi guys, I’m Lou from @loushomelife. Here you can listen to my ramblings about life, my home, social media, and everything in between. I hope you enjoy listening.</p><p>You can find me on instagram at @loushomelife</p>",
        "language": "en",
        "author_name": "Lou Price",
        "slug": "loushomecast",
        "cover": "20230406_080401_4aa9bbd3953ea0fa1ee01f182b7d0f6a.jpg"
    },
    {
        "podcast_id": 203041,
        "title": "California Pipe Talk | Conversations on Repiping and Home Maintenance by Integrity Repipe",
        "description": "<p>Integrity Repipe is a professional plumbing company that specializes in repiping services for residential properties. With over 20 years of experience in the industry, Integrity Repipe has become a trusted name in the Southern California area for its reliable, efficient, and cost-effective solutions for all repiping needs.</p><p>Integrity Repipe</p><p>927 Calle Negocio Suite O</p><p>San Clemente,CA 92673</p><p>Phone: 949-390-5879</p><p>Website: <a href=\"http://www.integrityrepipe.com\">www.integrityrepipe.com</a></p>",
        "language": "en",
        "author_name": "Integrity Repipe",
        "slug": "integrity-repipe",
        "cover": "20230413_060451_fb5efa8f2568a440b7dcab907e3735b8.jpg"
    },
    {
        "podcast_id": 203431,
        "title": "Adéla už večeřela",
        "description": "<p>Jsem Adéla a už nějakou dobu mi chybí na české scéně podcast o rostlinách v celé šíři, které toto téma nabízí. Chystám se rozebírat historii rostlin, jak ovlivnily a stále ovlivňují naše životy, jejich význam a přínos v umění napříč disciplínami i role v popkultuře. Občas si pozvu i někoho dalšího.</p><p>Za mikrofonem sedím já, Adéla nebo taky @tygriik.</p><p>Kde mě dál sledovat?</p><p><a href=\"https://www.instagram.com/adela_vecerela\">https://www.instagram.com/adela_vecerela</a></p><p>Newsletter a bonusový obsah na <a href=\"https://www.pickey.cz/adela_vecerela\">https://www.pickey.cz/adela_vecerela</a></p><p>DM me přes Instagram nebo <a href=\"mailto:adelavecerela@gmail.com\">adelavecerela@gmail.com</a></p>",
        "language": "cs",
        "author_name": "Adéla",
        "slug": "adelavecerela",
        "cover": "20230415_070441_f85df7169593b1a8def786b64775fb05.jpg"
    },
    {
        "podcast_id": 203653,
        "title": "The End of the World As We Know It",
        "description": "<p>Sometimes it feels like the world is ending. Yes, climate change is real, believe me I've checked. A giant doomsday clock hovers over our heads. It's scary stuff, I get it. Can we fix the climate crisis and take the batteries out of that clock? I think so. Do you?</p>",
        "language": "en",
        "author_name": "Carmen LeCluyse",
        "slug": "the-end-of-the-world-as-we-know-it",
        "cover": "20230419_020444_92cc41fdc75180d63f9bf32667370bf0.jpg"
    },
    {
        "podcast_id": 203838,
        "title": "Transforming Your Home with Expand Furniture | Innovative Solutions for Small Spaces",
        "description": "<p>Expand Furniture is a Canadian-based furniture company that specializes in space-saving and multi-functional furniture designs. Our innovative and practical furniture solutions are perfect for those living in small apartments or homes, as well as for those who want to maximize the use of their living space. Our products range from transforming tables, wall beds, modular sofas, and other space-saving furniture that can convert from one function to another.</p><p>Expand Furniture</p><p>2050 Scotia St #108</p><p>Vancouver, BC V5T-4T1, Canada</p><p>Phone: 778-580-7818</p><p><a href=\"http://www.ExpandFurniture.com\">www.ExpandFurniture.com</a></p>",
        "language": "en",
        "author_name": "Expand Furniture",
        "slug": "expand-furniture",
        "cover": "20230417_090404_d7e3f880964db6083d9483791367aab8.jpg"
    },
    {
        "podcast_id": 208065,
        "title": "Unlocking Doors for You!",
        "description": "<p><strong>Are you a first-time homebuyer looking to crack the code</strong> on mortgages, down payment assistance programs, and other essential topics? <strong>Get ready to unlock your potential and make your homeownership dreams a reality.</strong> Hosted by California real estate agent JJ Scheinwynn, each episode is packed with practical tips and valuable insights to help you navigate the complex world of homeownership. From maintaining your home to financing your dream renovation project, JJ has got you covered.</p><p>Thanks for listening!</p><p>JJ Scheinwynn</p><p>DRE 02192938</p><p>PS: Save JJ’s phone and text him anytime you have questions: +1 (858) 206-9299</p><p>📲 CONNECT WITH JJ: =================</p><p>Podcast <a href=\"https://rss.com/podcasts/unlockingdoors/\">https://rss.com/podcasts/unlockingdoors/</a></p><p>Instagram <a href=\"https://www.instagram.com/jjyourrealtor\">https://www.instagram.com/jjyourrealtor</a></p><p>Facebook <a href=\"https://www.facebook.com/jjyourrealtor\">https://www.facebook.com/jjyourrealtor</a></p><p>LinkedIn <a href=\"https://www.linkedin.com/in/jjscheinwynn\">https://www.linkedin.com/in/jjscheinwynn</a></p><p>Youtube Channel<a href=\"https://www.youtube.com/@jjyourrealtor\"> https://www.youtube.com/@jjyourrealtor</a></p><p>TikTok <a href=\"https://www.tiktok.com/@jjyourrealtor\">https://www.tiktok.com/@jjyourrealtor</a></p>",
        "language": "en",
        "author_name": "JJ Scheinwynn",
        "slug": "unlockingdoors",
        "cover": "20230607_080618_fd5baa8cdc414c9c077bf59814df2e60.jpg"
    },
    {
        "podcast_id": 209322,
        "title": "INSIDE CENTERRA",
        "description": "<p>Inside Centerra invites listeners to sit in on conversations with Centerra Co-Op employees, vendors and members. Topics will range from grain and fuel market updates, livestock and pet nutrition, and crop and harvest advice to information about safety, new products and techniques, stories about farming and more.</p>",
        "language": "en",
        "author_name": "Centerra Co-Op",
        "slug": "inside-centerra",
        "cover": "20230515_020548_d625f35d2ea6d89846532a674d2e3c5d.jpg"
    },
    {
        "podcast_id": 214716,
        "title": "The Whole Topic ",
        "description": "<p><strong><em>Real women. Real talk. Real life.</em></strong></p><p>Join three homesteading mamas as they explore health, motherhood, farm life and so much more on \"The Whole Topic\".</p>",
        "language": "en",
        "author_name": "Andrea Kissling, Ariel Beevers, Stephanie Haglund",
        "slug": "thewholetopic",
        "cover": "20230612_030634_06fd06b1e4e0f33acc3cdfad09dd695f.jpg"
    },
    {
        "podcast_id": 217652,
        "title": "The Home Inspector's Perspective",
        "description": "<p>The Home Inspector's Perspective is a podcast designed to provide home buyers, home owners and real estate professionals useful information as it pertains to home inspections.</p>",
        "language": "en",
        "author_name": "Ditanyan Sye",
        "slug": "dsinspects",
        "cover": "20230702_010709_256fcb2f5df2c2b5970e3dbba1f9445e.jpg"
    },
    {
        "podcast_id": 218087,
        "title": "CATCH IT PODCAST",
        "description": "<p><em>Welcome to Catch It Podcast, where we celebrate the vibrant spirit, boundless creativity, and incredible resilience of today's youth. Join us as we dive into inspiring stories, explore pressing issues, and empower the next generation to unleash their potential and make a positive impact on the world. Get ready for engaging conversations, valuable insights, and a dose of motivation that will leave you inspired to embrace your own journey of growth and change. It's time to amplify the voices of the youth and ignite a movement of unstoppable progress!</em></p>",
        "language": "en",
        "author_name": "Edgar Ghansah",
        "slug": "catch-it-podcast",
        "cover": "20230705_110730_0bb2bb6d5a575a77f2a2dfafca8c08c2.jpg"
    },
    {
        "podcast_id": 221221,
        "title": "مع شمس البوادي",
        "description": "<p>بوابة شمس البوادي</p>",
        "language": "ar",
        "author_name": "شمس البوادي",
        "slug": "sabgate",
        "cover": "20230726_110744_438a8f9e6766801e390a8b8c2ff7cd21.jpg"
    },
    {
        "podcast_id": 222350,
        "title": "Little Acts of Decluttering",
        "description": "<p>Discussing decluttering and minimalism through interviews and stories. </p>",
        "language": "en",
        "author_name": "Rachel Noakes",
        "slug": "little-acts-of-decluttering",
        "cover": "20230802_090831_9955845c2daad61efc7f22df54bb3ebd.jpg"
    },
    {
        "podcast_id": 222550,
        "title": "Podcast on benefits of LED lights in Industrial and Commercial use",
        "description": "<p>Welcome to \"Illuminate Your World\" the podcast where we shed light on the fascinating world of <a href=\"https://www.krutled.com/\">LED lights</a> and their impact on our lives. I'm your host, Emma, and I'm thrilled to explore the latest advancements, applications, and benefits of LED lighting with you. In today's episode, we'll be discussing the recent developments in LED technology and how it's revolutionizing the way we illuminate our surroundings.</p>",
        "language": "en",
        "author_name": "Krutled",
        "slug": "benefits-of-led-lights",
        "cover": "20230804_090846_3e9928264e3ac81440b56a707906e18a.jpg"
    },
    {
        "podcast_id": 222692,
        "title": "LG 20 L Solo Microwave Oven (MS2043BP, Black",
        "description": "<p>&lt;a target=\"_blank\" href=\"<a href=\"https://www.amazon.in/deal/d7662eb9?_encoding=UTF8&amp;linkCode=r02&amp;tag=suhaana223-21&amp;linkId=6a7e5aab75756e49cd1df3e4bc72a21c&amp;ref_=ihub_rc_td_c_deals-promotions_d7662eb9&quot;&gt;Top\">https://www.amazon.in/deal/d7662eb9?_encoding=UTF8&amp;linkCode=r02&amp;tag=suhaana223-21&amp;linkId=6a7e5aab75756e49cd1df3e4bc72a21c&amp;ref_=ihub_rc_td_c_deals-promotions_d7662eb9\"&gt;Top</a> Deals on Microwaves&lt;/a&gt;</p>",
        "language": "en",
        "author_name": "cj creation",
        "slug": "cjmarkets",
        "cover": "20230805_060822_2c5431920664c3411978da55954c5ed2.jpg"
    },
    {
        "podcast_id": 225461,
        "title": "Las mejores sillas de oficina para personas Altas",
        "description": "<p>Las personas altas a menudo encuentran que su silla de escritorio no ha sido comprada específicamente para ellos. Céntrate en que la nueva silla de oficina tenga ajuste de altura de asiento acorde a tu estatura.</p><p>Las <a href=\"https://spacio.es/productos/sillas/sillas-de-oficina/\">silla de escritorio</a> con un inadecuado ajuste de altura de asiento obligan a flexionar las rodillas o a extender las piernas para sentirse más cómodo. Esta posición de asiento, supone un esfuerzo para la parte baja de tu espalda, los muslos y las caderas, y por último, molestias y dolor durante largos periodos de tiempo. Si compras una silla ergonómica para personas altas, permitirás que tus rodillas estén sentadas en un ángulo de 90 grados. Si mides desde las rodillas hasta la planta de los pies tendrás una idea del ajuste de altura que debes buscar en una silla de oficina para altos.</p>",
        "language": "es",
        "author_name": "Spaciova",
        "slug": "las-mejores-sillas-de-oficina-para-personas-altas",
        "cover": "20230823_120830_3f9b7213fcbe7540d2deb7ce0e65c25a.jpg"
    },
    {
        "podcast_id": 227311,
        "title": "Creatures and Characters",
        "description": "<p>Farming and education has always been in my blood. Most people don't think about the food they eat. Creatures and Characters includes stories from my life combining the two, as well as information about critical issues that many people misunderstand. </p>",
        "language": "en",
        "author_name": "Pat Garland Stewart",
        "slug": "creatures-and-characters",
        "cover": "20230905_010920_30f4c93aec0a3859697953efcbd0de10.jpg"
    },
    {
        "podcast_id": 228187,
        "title": "Talking Tampa",
        "description": "<p>Hosted by Dean Diakonis, a multi-million dollar producing real estate agent specializing in residential sales in the Tampa Bay area. Covering what is happening in the market, upcoming projects/developments, and bringing on guests to help you better navigate and dominate the real estate world. </p>",
        "language": "en",
        "author_name": "Dean Diakonis",
        "slug": "talkingtampa",
        "cover": "20230911_020903_1448a342896e207bf1b887dc3d52f54a.jpg"
    },
    {
        "podcast_id": 228594,
        "title": "LÁ EM CASA PODCAST",
        "description": "<p>Podcast Oficial da Clareira Arquitetura comentando sobre o dia a dia, amenidades e coisinhas da vida dos Criativos.</p>",
        "language": "pt-br",
        "author_name": "Felipe Lourenço da Silva",
        "slug": "laemcasa",
        "cover": "20230914_030930_f984b712889b1bd352497f24d7e7950c.jpg"
    }
]