[
    {
        "podcast_id": 13417,
        "title": "Harvard Islamica Podcast",
        "description": "Harvard Islamica, the podcast of the Prince Alwaleed Bin Talal Islamic Studies Program at Harvard University, explores topics related to the scholarly study of Islam and Muslim societies at Harvard and beyond. ",
        "language": "en",
        "author_name": "Harvard Islamic Studies",
        "slug": "harvardislamicstudies",
        "cover": "20201028_173901_c22cb3ced53afba2c7c2d1f7254fdc56.jpg"
    },
    {
        "podcast_id": 14615,
        "title": "Sariyah Podcast | بودكاست سارية",
        "description": "بودكاست سارية هو طاولة بحث تسلط الضوء على القضايا التي تشغل بال الشباب اليوم.\n\nالسارية هي محرك السفينة فهي تنقل قوة الريح الى جسم السفينة فتحركها، وعليها ترفع الراية ومنها يستشرف الأفق. والريح هي قوى الأمة المبعثرة، وأمّا السفينة فهي جسم الأمة الإسلامية، وعليه فالسارية هي المشروع الذي يصل الأمة بقوتها.",
        "language": "ar",
        "author_name": "Osama, Omar, Mostafa, and Hisham",
        "slug": "sariyah-podcast",
        "cover": "20201116_181129_0beeb499f1651f226bd1f8000cb5735b.jpg"
    },
    {
        "podcast_id": 15795,
        "title": "Dr. Nasser Karimian",
        "description": "The Dr. Nasser Karimian Podcast features audio recordings of Dr. Nasser Karimian's speeches on a wide range of Islamic subjects.\n\nDr. Nasser Karimian holds a Bachelor's degree from Concordia University, where he majored in Religion and minored in Classical Arabic Language. He then earned a Master's degree in History and Philosophy of Religion from the same university. Additionally, he is a graduate of the Bayyinah Dream Program and the Qalam Seminary. Dr. Nasser completed his Ph.D. at the International Islamic University of Malaysia (IIUM).\n\nhttps://linktr.ee/dr.nasserk",
        "language": "en",
        "author_name": "Dr. Nasser Karimian",
        "slug": "drnasserkarimian",
        "cover": "20230203_010209_f62425f413dbea2aa5f476acc24d3c4f.jpg"
    },
    {
        "podcast_id": 21803,
        "title": "Ustaz Wadi Annuar Official",
        "description": "Official Podcast Ustaz Wadi Annuar\n\nCopyright © 2022 by Ustaz Wadi Annuar · Property of MediaUWA. All rights reserved. No part of this production may be reproduced, distributed, or transmitted in any form or by any means, including recording, photocopying, or other electronic or mechanical methods, without the prior written permission of the production.",
        "language": "en",
        "author_name": "Ustaz Wadi Annuar",
        "slug": "ustazwadiannuar",
        "cover": "20220731_030713_eddf1466886861dc950b8145c5930432.jpg"
    },
    {
        "podcast_id": 30646,
        "title": "1 key success",
        "description": "This channel is an Islamic Radio Channel.",
        "language": "en",
        "author_name": "Islamic Radio Channel",
        "slug": "1keysuccesss",
        "cover": "20210305_181854_5e932a4f55becf24577e667f604e6b97.jpg"
    },
    {
        "podcast_id": 44892,
        "title": "Dear Muslim",
        "description": "Capturing stories & speaking on controversially compelling matters through the lives and experiences of strangers.",
        "language": "en",
        "author_name": "Faisal Latif",
        "slug": "fridayfeels",
        "cover": "20210327_202339_95ccc7b70722f1aa70987efe33c3d2fc.jpg"
    },
    {
        "podcast_id": 48830,
        "title": "Colton Corner",
        "description": "Lisa Green '24 interviews different students and faculty from the Lafayette College community and discuss faith, spirituality, and their thoughts about religion. ",
        "language": "en",
        "author_name": "Colton Corner",
        "slug": "coltoncorner",
        "cover": "20230128_020131_6dc05c3f4594e1dd7db4bdd74c7711c3.jpg"
    },
    {
        "podcast_id": 50682,
        "title": "MIFF Unscripted",
        "description": "MIFF Unscripted brought to you by the Muslim International Film Festival is a podcast bringing together Muslim filmmakers, artists, creators, and more to discuss some serious and fun conversations alike. ",
        "language": "en",
        "author_name": "Muslim International Film Festival",
        "slug": "miffunscripted",
        "cover": "20210419_212323_2ed89a58276ddbba605ae1abf57c5c09.jpg"
    },
    {
        "podcast_id": 60150,
        "title": "Shaherald Night Live!",
        "description": "Weekly Sunday night podcasts on topics related to Islam",
        "language": "en",
        "author_name": "Shaherald",
        "slug": "shaherald",
        "cover": "20220120_090140_1f882d7605d252987e349e78225a7683.jpg"
    },
    {
        "podcast_id": 64188,
        "title": "backfromfajr",
        "description": "<p>A philosophical podcast that dismantles cultural misconceptions about Islam and approaches various topics from an academic lens while weaving in our life experiences. Join us as we discuss areas we all interact with or have encountered in passing!</p><p>Let us sit down and believe for a while.</p>",
        "language": "en",
        "author_name": "Alaa and Hala",
        "slug": "backfromfajr",
        "cover": "20210625_142355_cd6413865d97b5e04de1b0673db4216d.jpg"
    },
    {
        "podcast_id": 76516,
        "title": "FarTaha Theory",
        "description": "🎥Video Podcast\n🤯💭Exceed beyond closed minds\n🌏❗️A modern Muslim view of this DEEP world\n🗣🎙Join our discussions on YouTube & Instagram\nhttps://linktr.ee/FarTaha_Theory",
        "language": "en",
        "author_name": "FarTaha Theory",
        "slug": "fartahatheory",
        "cover": "20211008_064329_ac99b92bffedf4299e5663fbf37153d6.jpg"
    },
    {
        "podcast_id": 80147,
        "title": "Dialog Suwung",
        "description": "Renungan puisi-puisi sakral untuk para perindu Tuhan.\n\nSelamat datang para sahabat Suluk Suwung. Selamat datang di podcast Dialog Suwung ini bersama Pardamean Harahap dan Denny Turner.\n\nPodcast ini lahir dari rekaman sesi-sesi mingguan instagram live di akun IG @suluksuwung. \n\nKami berdua adalah sahabat spiritual yang bertemu awal tahun 2000an, dan bersahabat hingga sekarang. Berawal dari berguru kepada mursyid tariqah masing-masing, kami terus menjelajahi kedalaman kasih Ilahi dalam hidup keseharian.\n\nDalam konteks tasawuf, suwung mengandung makna kekosongan, makna kesadaran berketuhanan. Sering juga dimaknai dengan kata ma’rifat.\n \nKami melakukan dialog, renungan spontan di setiap sesinya. Tema pokok di setiap sesi adalah puisi sakral, ataupun sistematika inspiratif, yang kami gali dari berbagai tradisi.\n\nMelalui dialog spontan ini, kami berkomunikasi dari hati ke hati dengan anda semua. Energi kita semua, adalah doa agar kita dihantarkan oleh Tuhan, menuju Tuhan.\n\nDialog ini dihadiahkan kepada sesama pejalan yang senantiasa rindu akan Tuhan.",
        "language": "id",
        "author_name": "Denny Turner & Pardamean Harahap",
        "slug": "suwung",
        "cover": "20220805_050816_ce182d1d5aaa2337722d7b30cf8abcaa.jpg"
    },
    {
        "podcast_id": 81482,
        "title": "The Middlepath Podcast (TMP)",
        "description": "#1 Podcast for American Muslims",
        "language": "en",
        "author_name": "Rashid & Co",
        "slug": "themiddlepathpodcast",
        "cover": "20210926_000806_8a02a27344b1300320ab52cd3cf378a5.jpg"
    },
    {
        "podcast_id": 100892,
        "title": "MacMSA Podcasts ",
        "description": "McMaster's MSA brings you \"The Voices of the Unheard\". It is a podcast that aims to bring stories of marginalization and isolation faced by our community members and how their adversities can shape a stronger a stronger society.\n\nGrab yourself a cup of tea and sit down to hear your hosts and speakers of the \"Voices of the Unheard\" unravel their stories. ",
        "language": "en",
        "author_name": "MacMSA",
        "slug": "macmsavoicesoftheunheard",
        "cover": "20220226_060208_9ed63b8cf4d5420df9b5a9b820350a80.jpg"
    },
    {
        "podcast_id": 102903,
        "title": "The Abwaan Chronicles",
        "description": "ab·waan ⇌ storyteller\n\nWe focus on topics related to our life experiences and identity as Muslim/Black/Western third culture kids",
        "language": "en",
        "author_name": "The Abwaan Chronicles",
        "slug": "abwaan-podcast",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 108969,
        "title": "islamitische luisterboeken",
        "description": "Nederlandstalige luisterboeken van de Ahmadiyya Moslim Gemeenschap",
        "language": "nl",
        "author_name": "Ahmadiyya Moslim Gemeenschap Nederland",
        "slug": "moslims",
        "cover": "20220215_060225_5db1173fc4b7f8ac63d4298cb2aa2d00.jpg"
    },
    {
        "podcast_id": 112588,
        "title": "Muslim Birthwork with Doula Alqabalia",
        "description": "A series of unique interviews and recounts providing inspirational insight into pregnancy, birth and beyond within the Muslim community. \n\nHosted by Amy, the face behind Doula Alqabalia; a Muslimah Birthworker currently based in the East Midlands, UK. \n\nThe series sets out to shed light upon the misconstrued conceptions, assumptions and discrimination that Muslim women and their families face in everyday life. \n\nThe trials and struggles that Muslim people face during the antenatal, birth and postnatal period are highlighted, whether they opt in for access to the maternity services, or not, as the case may be! \n\nIn a time when physiological birth and traditional practices and values around birth are being dissolved, we have a duty to stand up and reclaim our birth rights for both our women and children. \n\nProviding first-hand information and experiences as an actively involved Birth and Postpartum Doula and Holistic Birthkeeper, Amy brings a raw, real and radical Muslim perspective to the scene.",
        "language": "en",
        "author_name": "Doula Alqabalia ",
        "slug": "muslim-birthworld-with-doula-alqabalia",
        "cover": "20220303_120324_46c4cdea438c13c786906a48f1562cec.jpg"
    },
    {
        "podcast_id": 115789,
        "title": "Gençlik Fakültesi",
        "description": "Çok kıymetli genç!\n\nHayat bir şekilde akıp geçiyor. Günler önüne kendi dertleri ve yeni konularla geliyorlar. Her gün içini sıkıştıran yeni bir sorun oluyor, bazı sorularıysa her gün yeniden ve yeniden soruyorsun.\n\nSenin iki dünyada huzurlu, tatmin olmuş bir gönül sahibi olmanı önemsiyoruz. Nureddin hocamız bu nedenle sorularına ışık tutuyor.",
        "language": "tr",
        "author_name": "Nureddin Yıldız",
        "slug": "genclik-fakultesi",
        "cover": "20220317_090330_fcc1f548ae19c6d399c16f383e20c0fd.jpg"
    },
    {
        "podcast_id": 120179,
        "title": "The Sound of Seerah",
        "description": "Experience the story of the Prophet Muhammad like never before. This audio adventure is complete with sound effects, actors, and ambiances to make the story of the Islamic prophet come to life. Hear his message, meet his friends, face his enemies, and know the man named Muhammad",
        "language": "en",
        "author_name": "Ibrahim Salman",
        "slug": "thesoundofseerah",
        "cover": "20220405_040444_6d9ffb8ff36bfc6892aef104e174a02e.jpg"
    },
    {
        "podcast_id": 121652,
        "title": "MYWA Lectures",
        "description": "<p>Lecture topic on The Purpose of Evil &amp; Suffering by Sheikh Mohammed Shakeeb</p>",
        "language": "en",
        "author_name": "Muslim Youth WA",
        "slug": "muslimyouthwa",
        "cover": "20220413_100439_b169a0a4460c7fca5e711da3020612af.jpg"
    },
    {
        "podcast_id": 123633,
        "title": " The Beginning of Guidance",
        "description": "A recorded discussion on the book ”The Beginning of Guidance” by Abu Hamid Al-Ghazali.",
        "language": "en",
        "author_name": "Sheikh Imam Huzaifa Nadeem",
        "slug": "tbogd",
        "cover": "20220421_070444_981902f31ebb0ea10c1dcadcf71c1022.jpg"
    },
    {
        "podcast_id": 124292,
        "title": "The Hereafter",
        "description": "In this series, the Imam vividly portrays the different phases the human soul passes through during its lifetime up to its death as well as the process of judgment of souls and the resulting eternal life in Heaven or Hell in the Hereafter. In breathtaking style the listener hears of the events that occur just before death and the events that come after it. The Imam gives a clear description about life in the grave, the horrors of the last day, the major and minor signs leading to the last hour and the day of resurrection. The Imam crowns this eloquently narrated lecture with the process of accountability and recompense. On the Day of Judgment those who pass the test will be rewarded with Paradise and those who fail will be rewarded with Hellfire.",
        "language": "en",
        "author_name": "Anwar al-Awlaki",
        "slug": "the-hereafter",
        "cover": "20220425_120432_a0c5365a167b81c86e912732b79d66ea.jpg"
    },
    {
        "podcast_id": 129377,
        "title": "AYC Lectures",
        "description": "<p>The Afghan Youth Committee (AYC), established in 2003, is a volunteer-led group of Afghan youth whose mission is to provide programming that infuses the Shia, Afghan and Canadian parts of the youth identity to create community and belonging. These recording are from some of the events that were organized by the committee and feature world-renowned speakers. Check out their instagram @ayconline for upcoming programs and events!</p>",
        "language": "en",
        "author_name": "Afghan Canadian Islamic Community",
        "slug": "afghancanada",
        "cover": "20230727_020721_4ebfa0935c74dd0382815a85d3bfbec9.jpg"
    },
    {
        "podcast_id": 135714,
        "title": "La vie du Prophète Muhammad ﷺ - Mustafa Kastit",
        "description": "Podcasts de Rawda.tv",
        "language": "fr",
        "author_name": "Rawda.tv",
        "slug": "rawda",
        "cover": "20230116_100118_2d26854d756e02289d45953dfb9586b8.jpg"
    },
    {
        "podcast_id": 136032,
        "title": "DeenTalk",
        "description": "Inspiration and motivation through powerful and engaging discussions.\nWeekly podcasts on everything Islam with scholars, business leaders and community members ",
        "language": "en",
        "author_name": "Deen Talk Official",
        "slug": "deentalk",
        "cover": "20220622_070635_46142590d555dd8ef4742a50cc28c231.jpg"
    },
    {
        "podcast_id": 147268,
        "title": " Tafsir Of Juz Amma By Shaykh Mohammad Akram Nadwi",
        "description": "Welcome to CIC's podcast! \n\nWe will be sharing lectures from a wide range of subjects within the Islamic sciences, each of them filled with pearls of wisdom from Sheikh Dr. Mohammad Akram Nadwi. \n\nWe are launching our channel with Sheikh's tafsir of some of the most recited surah's from the Qur'an. The Tafsir of Juz Amma.\n\nImagine how it would feel to have a deep understanding of the surahs contained in the last part of the Qur'an - the surahs that are often recited in our prayers, the surahs that are short in length but very weighty in meaning, carrying the core essential message of the Qur'an. It is a rare opportunity to study these surah's with an extraordinary scholar and thinker who is an expert in both tafsir and hadith.\n\nCambridge Islamic College is a registered educational charity.(Charity Number 1163646) Please support CIC to carry on its mission. Please visit https://www.cambridgeislamiccollege.org/donate to see how you can support.",
        "language": "en",
        "author_name": "Cambridge Islamic College",
        "slug": "cambridge-islamic-college",
        "cover": "20221001_061040_1aa38651e3231968c0b3fcbcb60886fa.jpg"
    },
    {
        "podcast_id": 147542,
        "title": "podkastero kinkii",
        "description": "chupapimuñañimuniunmuninumu",
        "language": "es",
        "author_name": "Max",
        "slug": "elalfaeljefe",
        "cover": "20220819_040807_60f1006c5aea96a58b2cf41f5b327c2e.jpg"
    },
    {
        "podcast_id": 151487,
        "title": "The MSA Take",
        "description": "🗣 From experiences of Muslim students studying various degrees, to marriage advice - each of our guest speakers have unique stories to share.\n\n👀 So stay tuned on our social media pages as we announce the release of each episode on Apple Podcasts and Spotify.",
        "language": "en",
        "author_name": "UNSWMSA",
        "slug": "themsatake",
        "cover": "20220906_100922_05092926da339c6f13422bf3ce749e2d.jpg"
    },
    {
        "podcast_id": 158379,
        "title": "بودكاست البر",
        "description": "<p>منصة تثقيفية تعنى بنشر مجموعة متنوعة من المحاضرات والدورات الثقافية والشرعية لتتعلم شيئاً جديداً كل يوم، ومن أي مكان.</p>",
        "language": "ar",
        "author_name": "Alber Podcast by Dar AlBer Society",
        "slug": "alber-cultureactivities",
        "cover": "20221006_051045_278de491f1133787f675a2b65ce8c83c.jpg"
    },
    {
        "podcast_id": 159236,
        "title": "DESVERDAD",
        "description": "Un programa para desverdar la realidad.",
        "language": "es",
        "author_name": "Desvelando la verdad",
        "slug": "desverdad",
        "cover": "20221010_081045_d47bd6e86f7b3e93498bcce0c787ac81.jpg"
    },
    {
        "podcast_id": 159717,
        "title": "DEENTOUR",
        "description": "An unapologetically real podcast hosted by 3 muslim brothers. We dive into topics that range all over from life and the deen to all that’s in between, while keeping Islam the center point. Our goal is to allow anyone regardless of religion to be engaged in the conversation and be able to take the lessons and knowledge we hope to provide and be able to use it in their lives to help them. Life is like a DETOUR, we just use the DEEN (Way of life in Islam) to navigate it. :)",
        "language": "en",
        "author_name": "Hussien, Osman, Osman",
        "slug": "deentour",
        "cover": "20221012_021019_fd9654acf96f888e4add1db766a6a16d.jpg"
    },
    {
        "podcast_id": 160192,
        "title": "Semua tentang Islam",
        "description": "Podcast ini akan berisi beberap episode dari buku buku yang akan aku baca, tentunya bernafaskan Islam. Mulai dari tentang sejarah Islam,fiqih islam, dan Al Qur'an hadits yang berkaitan dengannya. Mengingat menimnya mereka membaca dan belajar tentang islam, diharapkan podcast ini menjadi audiobook favorit untuk mereka pada pendengar dan berkah untuk semuanya. ",
        "language": "id",
        "author_name": "Nurul Qomariyah",
        "slug": "islamkaffah",
        "cover": "20221013_091036_ea768902b36b679183cca51a078af760.jpg"
    },
    {
        "podcast_id": 171300,
        "title": "The Arab Wor(l)d",
        "description": "A verbal journey in the Arab lands.",
        "language": "en",
        "author_name": "Valeria Rando",
        "slug": "thearabworld",
        "cover": "20221129_061149_834b82f0daa4eb0e75a6b5df1aad5499.jpg"
    },
    {
        "podcast_id": 175461,
        "title": "Rumah Dakwah UK",
        "description": "Podcast yang kami ambil dari kajian-kajian kami, untuk video lengkapnya bisa mengunjungi youtube : rumahdakwahuk\n\n",
        "language": "id",
        "author_name": "Rumah Dakwah UK",
        "slug": "rumahdakwahuk",
        "cover": "20221220_011222_68c32439a817245fd843b85fdf869865.jpg"
    },
    {
        "podcast_id": 184548,
        "title": "Hawa Unscripted",
        "description": "Hawa Unscripted is me having conversations, reflections and sharing lessons and experiences with myself and inviting others to tell their own, while keeping Islam the center point. I hope that this platform can become a form of Sadaqah Jariyah and that regardless of religion and personal practices, many people can resonate, learn, and benefit from this podcast. So join me as I share the different parts and people in my life and Khair Insha’Allah we can accompany each other on our journey to The Almighty. Jazakallah Khair, As Salamualaykum! ",
        "language": "en",
        "author_name": "Hawa Arbow",
        "slug": "hawaunscripted",
        "cover": "20230129_070152_135464a1a99d6bb29f71425f487e7397.jpg"
    },
    {
        "podcast_id": 187729,
        "title": "أسئلة عن الإيمان المسيحي",
        "description": "<p>مكان للتفكير في الله، في الإيمان والمنطق وفي معنى الحياة</p>",
        "language": "ar",
        "author_name": "Sawt Online",
        "slug": "sawtonline",
        "cover": "20230208_020245_f9b4c462b531c7bd4291be59060fb7b2.jpg"
    },
    {
        "podcast_id": 191840,
        "title": "Al-Ansaar Podcast ",
        "description": "<p>Al-Ansaar Community Centre presents to you a podcast tackling various topics in Islam. This podcast will provide you a free listening experience of our lecture series, cover conversation on trending topics, and answer questions that are on the minds of our listeners.</p>",
        "language": "en",
        "author_name": "Al-Ansaar",
        "slug": "alansaar",
        "cover": "20230224_040202_cbb2e8d86aae34c1a3288b11825895bb.jpg"
    },
    {
        "podcast_id": 198819,
        "title": "Tafsir of Surah Al-Kahf by Sheikh Mohammad Akram Nadwi",
        "description": "<p><em>\"Whoever preserves the first ten verses of Surah Al-Kahf will be protected from the Dajjal\"</em> <strong>Prophet Mohammad (SAW)</strong></p><p>This surah was revealed in Makkah at a time when the hostility of the Quraysh, and their fear and hatred of Islam and of the Prophet, were at their height. They adopted every measure to stop the Prophet from preaching and the people from listening to him; soon they would plot to kill him: there are hints in the surah that the command to emigrate to Madinah is imminent.</p><p>Listen in as Sheikh Akram Nadwi delves into the key concepts and themes present in the stories of Musa (AS) and Khidr, Dhul Qarnain, the Companions of the Cave, the Owner of the Two Gardens, and the Last Day. Each of these stories holds significant lessons and messages that are still applicable to our lives today.</p>",
        "language": "en",
        "author_name": "Cambridge Islamic College",
        "slug": "cictafsir",
        "cover": "20230323_100300_930bfe00983750c4e4e910dbce73f718.jpg"
    },
    {
        "podcast_id": 199546,
        "title": "Malaikah Refresh",
        "description": "<p>Embark on this exciting journey of self-improvement and spiritual growth with Malaikah Refresh. Together, we'll explore ways to refine our character, enhance our connection with Allah (SWT), and become better Muslims in our daily lives. Don't miss out on this valuable discussion—be sure to like, share, and subscribe for more insightful and inspiring episodes! Let's learn and grow together, one step at a time. 🙏💫</p>",
        "language": "en",
        "author_name": "Malaikah Foundation",
        "slug": "malaikahrefresh",
        "cover": "20230327_120308_28cd5d83c6f88ec8c70b50b6e87c4bb4.jpg"
    },
    {
        "podcast_id": 199631,
        "title": "Le Idee dello Strong Believer",
        "description": "<p>Strong Believer è un progetto di potenziamento personale e di crescita spirituale fondato da Abed Elbakki Rtaib, dedicato a tutti i musulmani che vogliono diventare dei credenti forti, in grado di fare la differenza nella propria comunità.</p><p>Il nostro obiettivo è forgiare una generazione di musulmani capaci di contribuire alla rinascita della Umma.</p><p>Il profeta Muhammad (s) disse: “Il credente forte è migliore e più amato da Allah rispetto al credente debole…e vi è del bene in entrambi”.</p><p>Questo è il detto che ispira il lavoro che sta dietro al progetto STRONG BELIEVER.</p><p>Il progetto mira a contribuire alla rinascita della Umma, della comunità musulmana, puntando sulla divulgazione di un pensiero islamico autentico potenziante e attraverso la formazione di credenti forti.</p><p></p><p>Il ragionamento che vi è dietro è complesso, ma si può sintetizzare così: - credenti deboli compongono una Umma debole. - credenti forti compongono una Umma forte.</p>",
        "language": "it",
        "author_name": "Strong Believer Academy",
        "slug": "strongbelieveracademy",
        "cover": "20230327_120319_f7390921a3ff0b41799a43e4d3950c8d.jpg"
    },
    {
        "podcast_id": 203179,
        "title": "Garabug Tuubaa",
        "description": "<p>Njàngalem Sëriñ Tuubaa yi Sëriñ El Hajj Mbàkke dajale ci téereem bi mu tudde Garabug Tuubaa.</p><p>Enseignements de Serigne Touba, Cheikh Ahmadou Bamba, collectés par Serigne El Hadji Mbacké dans son livre Garabouk Touba.</p><p>Twitter: <a href=\"https://twitter.com/garabugtuuba\">@garabugtuuba</a></p>",
        "language": "fr",
        "author_name": "Garabug Tuubaa",
        "slug": "garabug-tuubaa",
        "cover": "20230414_120452_8e1877d8ba3ea21c1641ca0e60f75a59.jpg"
    },
    {
        "podcast_id": 205258,
        "title": "Journey to my deen ",
        "description": "<p>May Allah guide us all to the best path for us. </p><p>\"dear diary\". in this podcast, I aim to share my input on life my own experiences, and how growing up being a black Nigerian Muslim girl has affected every decision I have made in life. I will be sharing detailed stories and advice on some personal parts of my life from high school till now and how I battled my demons and found peace and self-love in my religion and understanding the importance of self-love and hope. </p><p>The big sister you didn't need but got.</p>",
        "language": "en",
        "author_name": "Fatima HASSAN MAHE ",
        "slug": "journeytomydeen",
        "cover": "20230424_090425_21f94058d510936e2537c1d5e3ca8aef.jpg"
    },
    {
        "podcast_id": 205980,
        "title": "Hassan Patel Islamic Show ",
        "description": "<p>Hassan Patel Islamic Show Is A Show Where We Discuss Various Islamic Topics </p>",
        "language": "en",
        "author_name": "Hassan Patel ",
        "slug": "hpshowep1",
        "cover": "20230427_110442_5e1115781e13f6e16fca84ca4726161b.jpg"
    },
    {
        "podcast_id": 211231,
        "title": "MASCULINE MUSLIM MINDSET",
        "description": "<p>Improving people's lifes mentally and physically.</p>",
        "language": "en",
        "author_name": "Masculine Muslim Mindset",
        "slug": "masculinemuslimmindset",
        "cover": "20230524_040549_d6f021f30a8122e7fbcf947980ab9ff6.jpg"
    },
    {
        "podcast_id": 211903,
        "title": "القصة المسيحية",
        "description": "<p>قصة الخلق نجدها في أديان وأساطير مختلفة من العالم القديم، ولكن هناك اختلاف جوهري بين كل القصص المطروحة والقصة اليهودية المسيحية. في هذه الحلقة نستعرض قصص وأساطير قديمة وحديثة مختلفة عن خلق الإنسان ونحاول فهم هدف الله من خلق الإنسان. الحلقة من إعداد وتقديم: أندرو أشرف. يوسف يعقوب. إنتاج: صوت أونلاين | Sawt Online كريدولوجوس | Credologos</p>",
        "language": "ar",
        "author_name": "Sawt Online",
        "slug": "the-story-of-christianity",
        "cover": "20230528_020558_09474cba4ff4d125adefaccd16e9fc3f.jpg"
    },
    {
        "podcast_id": 212829,
        "title": "پادکست فارسی پیامبران و پادشاهان",
        "description": "<p><a href><strong>پیامبران و پادشاهان | داستان و حقایق جالب تاریخ</strong></a></p><p>تاریخ فقط وقایع را ثبت میکند اما داستان ها حقایق را</p><p>داستان های جالب از پیامبران و حقایق عجیب تاریخ اسلام</p><p><a href=\"https://www.youtube.com/channel/UCKfRga0bG3l8L8-JzXj7fgA\"><strong>پیامبران و پادشاهان</strong></a></p>",
        "language": "fa",
        "author_name": "Prophets_Kings",
        "slug": "prophets-kings",
        "cover": "20230807_070808_c4cdeb95ae074e116a11da5ebc32ce55.jpg"
    },
    {
        "podcast_id": 213352,
        "title": "The Misadventures of a Plant Based Hijabi Hoodrat",
        "description": "<p>The Misadventures of A Plant Based Hijabi Hoodrat is a podcast about nothing. Seriously it's about nothing, this podcast isn't boxed into a particular realm or category because it can fit into multiple categories. I talk about faith, family, food, travel, and everything in between.</p><p>Business Inquiries get at me : plantbasedhijabihoodrat1@outlook.com</p>",
        "language": "en",
        "author_name": "Petty Shabazz",
        "slug": "plantbasedhijabihoodrat",
        "cover": "20230723_010756_5554966e4bad0f728768225c5334cbfc.jpg"
    },
    {
        "podcast_id": 214061,
        "title": "The Safi Bros Podcast",
        "description": "<p>The aim of The Safi Bros podcast is to motivate and inspire Muslim youth and young professionals who are seeking inspiration and guidance on their own path to success. </p><p>We hope to achieve this by launching <strong>Success Stories</strong>, a series of insightful interviews with accomplished Muslims from all walks of life. Our audience will be taken on a journey through the experiences of our guests, where they will gain valuable insight into what it takes to achieve success. </p><p><em>“The best of us are the ones who are most beneficial to others”</em></p><p>To follow the path of our beloved Prophet Muhammad (عَلَيْهِ ٱلسَّلَامُ) projecting his beacon of light &amp; hope. projecting his ever- beaming smile that would exude optimism. Relay his words, whether of warning or of good news, to inspire positive action. </p>",
        "language": "en",
        "author_name": "Ahmed & Ibrahim Safi",
        "slug": "safibros",
        "cover": "20230609_120651_4b334c513f5fb352133b06c0618816f5.jpg"
    },
    {
        "podcast_id": 215440,
        "title": "PINARIN KAYNAĞINDAN",
        "description": "<p>Bu yayın Hakkı Yılmaz'ın Pınarın Kaynağından programının sesli versiyonudur.</p><p>Pınarın Kaynağından programının yeni bölümleri her Pazar saat 18:00'de Hakkı Yılmaz'ın Youtube kanalından izlenebilir.</p><p><a href=\"https://www.youtube.com/c/HakkıYILMAZ\">https://www.youtube.com/c/HakkıYILMAZ</a></p>",
        "language": "tr",
        "author_name": "Hakkı Yılmaz",
        "slug": "pinarinkaynagindan",
        "cover": "20230616_040635_f5331f3b2109bb7e8541ce1beb39616d.jpg"
    },
    {
        "podcast_id": 215903,
        "title": "The Companions ",
        "description": "<p>This is a weekly Islamic podcast covering Prophet Muhammad (PBUH) companions and their life story. We hope you enjoy InShaAllah.  If you would like to get in contact please email me at sajid.asawar@gmail.com.</p>",
        "language": "en",
        "author_name": "Asawar Sajid",
        "slug": "thecompanions",
        "cover": "20230626_030625_a2efb49642132f8e3aebf70b868cc0c3.jpg"
    },
    {
        "podcast_id": 216337,
        "title": "Danbalii",
        "description": "<p>Danbalii seenaa</p>",
        "language": "ar",
        "author_name": "Danbalii",
        "slug": "danbalii",
        "cover": "20230622_030606_51ada67585963ea186b971c62f00de1e.jpg"
    },
    {
        "podcast_id": 216459,
        "title": "القرآن",
        "description": "<p>القرآن بتلاوة أبو بكر الشاطرى</p>",
        "language": "ar",
        "author_name": "أبو بكر الشاطرى",
        "slug": "kulufifalak",
        "cover": "20230623_090604_d47d7bfbdf555b3ea1258566d7a342a4.jpg"
    },
    {
        "podcast_id": 216715,
        "title": "ISRA Academy Podcast",
        "description": "<p>This podcast covers issues related to Islam and Muslims living in the West.</p>",
        "language": "en",
        "author_name": "ISRA Academy",
        "slug": "israacademy",
        "cover": "20230625_040600_2c8f7c18b06730125e29b0f40e20baba.jpg"
    },
    {
        "podcast_id": 216763,
        "title": "Al-Bukhari Seminary",
        "description": "<p>Maktabatu Imaam Shawkaanee Institue Is A Online Islamic Institute Created By Our Brother Our Teacher Abu Abdillah Naeem Al-Amreekee , May Allah Raise Him. Who Hopes In The Reward Of His Lord The Most High. @ Imaam Shawkaanee Institute Our Brothers Teaches Various Disciplines And Sciences In Al-Islaam Upon Methodology Of The People Of Hadeeth. Our Brother Was Blessed With The Honor Of Learning From Africa To Yemen. From Amonst His Teachers &amp; Mashaykh Are Shaik Al-Masnaee , Al-Muhadeeth Yahyaa Al-Hujooree , Shaik Al-Faqeeh Abdul Hameed Al-Hujooree , Shaik Majdee Sultaan , Shaik Ma'mar Al-Qadasee, Shaik Al-Faqeeh Muhamad Ibn Hizaam Al-Ba’danee , Shaik Al-Faqeeh Abdur Rahman Al-Adanee May Allah Have Mercy Upon Him Shaik Abdul Azeez Al-Buree &amp; Shaik Al-Faqeeh Muhammad Al-Imaam.</p>",
        "language": "en",
        "author_name": "Al-Bukhari Seminary",
        "slug": "masjid-al-salaam-kc",
        "cover": "20230625_060656_c875748d5767aee6daaa45f1b5db221e.jpg"
    },
    {
        "podcast_id": 217455,
        "title": "Daily Quran Recitation",
        "description": "<p>Daily one page of Holy Quran with Urdu translation &amp; short audio explanation by Maulana Muhammad Raza Dawoodani.</p>",
        "language": "ur",
        "author_name": "Muhammad Raza Dawoodani",
        "slug": "dailyquranrecitation",
        "cover": "20230630_110637_60f225309186f13613ee9116fe9ae0ca.jpg"
    },
    {
        "podcast_id": 217699,
        "title": "Dear, sweet sisters",
        "description": "<p>Dear, sweet sisters, this podcast celebrates the incredible stories of Muslim sisters from all walks of life. We believe in the power of sisterhood, and our goal is to create a safe space where we can share experiences, triumphs, and challenges together. Join us on this journey as we explore topics like self-care, entrepreneurship, spirituality, and more. Let's uplift each other and empower ourselves through these inspiring conversations. Because together, we are stronger.</p>",
        "language": "en",
        "author_name": "Dear, sweet sisters",
        "slug": "dss-embracing-modesty-part-1",
        "cover": "20230702_120730_a8d8e63b0b3cef468444b9d5cd5c3ab3.jpg"
    },
    {
        "podcast_id": 218623,
        "title": "DaDeen",
        "description": "<p>✧*̥˚ Hello *̥˚✧</p><p>Muslimah only server: <a href=\"https://discord.gg/SQDGdD4nnE\">https://discord.gg/SQDGdD4nnE</a></p><p>tiktok: @dadeendeen</p><p>youtube: DaDeen</p><p>instagram: da_deendeen</p><p>email: dadeendeen1@gmail.com</p>",
        "language": "en",
        "author_name": "Amina",
        "slug": "dadeen",
        "cover": "20230709_110730_6c25bed7287da6989db37e1ee5565aec.jpg"
    },
    {
        "podcast_id": 218631,
        "title": "Hidayah Podcast",
        "description": "<p><strong>Asalam Alaykum! Welcome to the Hidayah Podcast.</strong></p><p><strong>This is a space where we reflect and spread reminders in order for us to seek guidance (hidayah) and to keep steadfast! Join me on discussions on deen, life lessons and common struggles in our current society!</strong></p><p><strong>InshAllah this Podcast benefits everyone. May Allah accept it from us all . I hope this is of great benefit for us all.</strong></p>",
        "language": "en",
        "author_name": "Arafat",
        "slug": "hidayahpodcast",
        "cover": "20230910_040921_a6d595c3be22fe31e3d24730afd57e21.jpg"
    },
    {
        "podcast_id": 218768,
        "title": "Friday Foughts",
        "description": "<p><strong>Full of food for thought to fuel the fulfilling feeling of fighting them WASWASA fights.</strong></p>",
        "language": "en",
        "author_name": "Inaam",
        "slug": "friday-foughts",
        "cover": "20230710_120726_b5a4f6799efbdd4baec05d323f48a642.jpg"
    },
    {
        "podcast_id": 220076,
        "title": "Islamicpods",
        "description": "<p><strong>Islamic talks</strong></p>",
        "language": "en",
        "author_name": "Humzah yusuf. ",
        "slug": "islamiicpods",
        "cover": "20230718_080753_b9d8115152debaaf6d0f5d629f531605.jpg"
    },
    {
        "podcast_id": 221166,
        "title": "Ipswich Quran Class",
        "description": "<p>Elevate your Iman through Quran</p>",
        "language": "en",
        "author_name": "Ipswich Quran Class",
        "slug": "ipswich-quran-class",
        "cover": "20230914_010926_34060cde2dd45a50a81057050b059f37.jpg"
    },
    {
        "podcast_id": 221222,
        "title": "SOF&ZAH",
        "description": "<p>Salams from Sof and Zah everyone!! We decided since we like talking so much...why not make a podcast out of it?</p>",
        "language": "en",
        "author_name": "Sofeeya and Zahra",
        "slug": "sofandzah",
        "cover": "20230726_110738_cc4f4103032ba9d94b58f60f8b65f90d.jpg"
    },
    {
        "podcast_id": 222567,
        "title": "Beautiful Quran Recitations",
        "description": "<p>Sharing with you beautiful Quran recitations.</p>",
        "language": "en",
        "author_name": "Malik Haleem",
        "slug": "quranrecitations",
        "cover": "20230804_010831_d7fb16de6fb4c63d22c14aa7ef144fb0.jpg"
    },
    {
        "podcast_id": 222842,
        "title": "صحيح البخاري",
        "description": "<p>للدعم الرجاء مراسلتنا على</p><p>o5oo7oo948@gmail.com</p>",
        "language": "ar",
        "author_name": "صحيح البخاري",
        "slug": "o5oo7oo948",
        "cover": "20230806_070826_b084a51c86de61930a60a5d96cfc7bef.jpg"
    },
    {
        "podcast_id": 223763,
        "title": "Life’N’Deen Podcast ",
        "description": "<p><strong>A podcast that connects life including thoughts, actions, character and life situations with islam.</strong></p>",
        "language": "en",
        "author_name": "Mueena Farouq",
        "slug": "life-n-deen",
        "cover": "20230812_060831_c29569793debb49c78f1273e98caabf0.jpg"
    },
    {
        "podcast_id": 224902,
        "title": "Belal Assaad",
        "description": "<p>Belal Assaad was born in Williamstown, Melbourne, Australia. He started his Islamic studies at a very early age and acquired his Shariah knowledge in Lebanon; and continued tertiary education in Biomedical Science in Australia. Belal has been offering his service to the community for many years and has been working with the Islamic Society of Victoria for over ten years. This is his official podcast page.</p>",
        "language": "en",
        "author_name": "Belal Assaad",
        "slug": "belalassaad",
        "cover": "20230820_030832_3c6671cb702c3a1713431eaf8ee3ebad.jpg"
    },
    {
        "podcast_id": 225007,
        "title": "alquranalkareem القران الكريم",
        "description": "<p>alquranalkareem القران الكريم بودكاست تلاوات وأصوات خاشعة من القران الكريم</p>",
        "language": "ar",
        "author_name": "alquranalkareem",
        "slug": "alquranalkareem",
        "cover": "20230820_100810_28cef36efbf302b51abf8f223a5d5f82.jpg"
    },
    {
        "podcast_id": 225683,
        "title": "Risale-i Nur Audio Books",
        "description": "<p>Chapters of Risale-i Nur Collection</p>",
        "language": "en",
        "author_name": "Said Nursi",
        "slug": "risale-inur",
        "cover": "20230824_040818_cae6f49f49c02a2aff825e9b81196e6c.jpg"
    },
    {
        "podcast_id": 226344,
        "title": "MM Akbar",
        "description": "<p>M. Mohammed Akbar, popularly known as MM Akbar, a renowned orator and comparative religion scholar, has been serving as director of Niche of Truth since 1992. The Cochin-based islamic missionary organization's objective is to present Islam as a comprehensive religion in front of India's pluralist society. Niche of Truth use all modern facilities for Dawa work and these include correspondence courses, websites, dialogues, debates, and periodicals. They try to focus on the culture of dialogue and dispelling hatred of Islam.</p>",
        "language": "ml",
        "author_name": "MM Akbar",
        "slug": "mmakbarofficial",
        "cover": "20230829_080855_4d4b3da0b241940681724152ee953cab.jpg"
    },
    {
        "podcast_id": 226691,
        "title": "جمعية التجديد الثقافية الاجتماعية",
        "description": "<p>جمعية التجديد الثقافية الاجتماعية نحو منهاج إصلاحي جديد</p><p>▬ للتواصل معنا ▬▬▬▬▬▬▬▬▬▬</p><p>| YouTube<a href=\"https://www.youtube.com/@TajdeedSociety\">https://www.youtube.com/@TajdeedSociety</a></p><p>| Instagram | <a href=\"https://instagram.com/altajdeed_bh\">https://instagram.com/altajdeed_bh</a></p><p>| Facebook | <a href=\"https://m.facebook.com/Tajdeed-society-104497884373066/?ref=bookmarks\">https://m.facebook.com/Tajdeed-society</a></p><p>| Twitter | <a href=\"https://mobile.twitter.com/Altajdeed_bh\">https://mobile.twitter.com/Altajdeed_bh</a></p><p>| Website | <a href=\"http://tajdeed.org\">http://tajdeed.org</a></p>",
        "language": "ar",
        "author_name": "Tajdeed Society",
        "slug": "tajdeedsociety",
        "cover": "20230831_100828_02d8d265a5bc8af4a0b559cd47c6e178.jpg"
    },
    {
        "podcast_id": 226978,
        "title": "Poets Of The Household",
        "description": "<p>In this series of podcasts, we will discuss a variety of topics connected to what poetry means to us and how it relates to the love we have for our Holy Prophet Muhammad (saw) and his Holy Household (as).</p>",
        "language": "en",
        "author_name": "Abbas Jafri & Naqi Rizvi",
        "slug": "poetsofthehousehold",
        "cover": "20230902_090916_a1094756bc986cbfaf93a7f13bef83bb.jpg"
    },
    {
        "podcast_id": 227008,
        "title": "Da'wat Al-Mu'mineen",
        "description": "<p>The call of the Believers.</p><p>Islamic topics understood with ease.</p><p>Share this to as many people as possible so they can benefit as well.</p><p>May Allah keep you all steadfast on His Deen and bless you all.</p>",
        "language": "en",
        "author_name": "Ahmad",
        "slug": "dawatalmumineen",
        "cover": "20230912_010910_5a8767ba7ef87f9352b61f39f79407d8.jpg"
    },
    {
        "podcast_id": 228806,
        "title": "Quran Tafseer  | Shuja Uddin Sheikh",
        "description": "<p>Quran Tafseer in Urdu</p>",
        "language": "en",
        "author_name": "Shujauddin Sheikh",
        "slug": "qurantafseerurdu",
        "cover": "20230915_120931_9bd4604b81ed2f5c7055ba99bfba01a7.jpg"
    }
]