[
    {
        "podcast_id": 3295,
        "title": "Intermediate Spanish Podcast - Español Intermedio",
        "description": "<p>With more than 5 million downloads, this podcast uses comprehensible and engaging content in Spanish for Intermediate Students - Free Transcript &amp; Vocabulary Flashcards - Learn Spanish with Cesar | www.spanishlanguagecoach.com</p>",
        "language": "es",
        "author_name": "Spanish Language Coach",
        "slug": "spanishwithcesar",
        "cover": "20201206_165233_78068787eafa0cfeeb203eb2d3620753.jpg"
    },
    {
        "podcast_id": 5122,
        "title": "spoken german",
        "description": "a conversation podcast for upper intermediate and advanced learners of german",
        "language": "de",
        "author_name": "Lisa T",
        "slug": "spokengerman",
        "cover": "20200213_003734_2a0999084ef1ac6d0c98c8c2dc835ac5.jpeg"
    },
    {
        "podcast_id": 13094,
        "title": "Mujeres de(l) Mundo ",
        "description": "La inserción de la mujer como profesional de la diplomacia y las relaciones internacionales ha ido de la mano de los cambios sociales con respecto a los roles de género y el rompimiento de sus estereotipos. Sin embargo, el papel de la mujer en el mundo internacionales se ve cada vez más fortalecido. En todo el mundo existe un número creciente de mujeres que sirven de gran inspiración. Mi nombre es Julia Czutta Muñoz y en este espacio voy a hablar sobre los avances, las barreras y las reflexiones de mujeres trabajadoras activas en el ámbito de la negociación internacional y diplomático a la nueva generación. \n\nVisita nuestra página web www.mujeresdelmundo.org y síguenos en las redes sociales @mujeres.delmundo_",
        "language": "es",
        "author_name": "Julia Czutta Muñoz",
        "slug": "mujeresdelmundo",
        "cover": "20220421_020451_929aa79c764373612627a9f0bd6b91d7.jpg"
    },
    {
        "podcast_id": 18856,
        "title": "Cultivating & Integrating Literacy Across the Curriculum  ",
        "description": "Literacy and its cultivation is the key to education in the 21st Century.  We say that THOSE WHO READ, SUCCEED and that has never been more important than it is today.  From the earliest grades, we need to encourage literacy which today means more than just being able to read and write. It means being able to understand and apply what we read to our own lives and the world around us.  We live in an increasingly global, technologically driven world and our young people need to be able to make sense of that world through all variety of reading, online and off.  I hope to contribute to your successful literacy program and to the advancement of literacy not just in the classroom but out of it as well, in the homes of our students.  Therefore, there will the oral reading of books for children to listen to and think about.  There will be ideas for how parents and teachers can use the books I read as well as many other, to advance knowledge of the world.  Plus there will be ideas on how to enrich your literacy program and help your students indeed make applicable, those who read, will succeed.",
        "language": "en",
        "author_name": "Howard Slepkov",
        "slug": "hes",
        "cover": "20201217_160709_ab5c475500ccd4a0ab200578f515b627.jpg"
    },
    {
        "podcast_id": 26045,
        "title": "Bridge Beyond English",
        "description": "クリエイティブに考える力。国際的な視野。異文化コミュニケーションのスキル。英語を使って、世界と繋がりたい人へおすすめのポッドキャストです。\n\n英語力が深まるのはもちろん、疑問を持ってしっかり考える力がつき、生き方、文化、社会についての様々な考え方に触れるきっかけとなります。リスナーの皆さんが新しい視点を培い、より自信を持って国際社会と対話できるように、日本在住の永井デイビッドがガイド役を勤めます。\n\n上級者と中級者向けのディスカッションクラスに実際に参加したい方は、横浜元町で対面クラス、あるいはオンラインでも可能です。詳細は www.bridgebeyondenglish.com をご覧ください。\n\nDo you want to use English to expand your creative thinking, global awareness, and cross-cultural communication skills to connect with the world?\n\nThis podcast will not only help your English, but also help you ask better questions and connect with diverse ideas about life, culture, and society. \n\nDavid Nagai, the Japan-based host, will help you see the world in new ways and become a more confident global communicator. \n\nTo join our high-level in-person and online classes based in Yokohama-Motomachi, Japan, please visit www.bridgebeyondenglish.com.",
        "language": "en",
        "author_name": "David Nagai",
        "slug": "bridgebeyondenglish",
        "cover": "20210429_052607_cd9505da0d240dbc70260ea930e60b45.jpg"
    },
    {
        "podcast_id": 26700,
        "title": "Language 180",
        "description": "Integrating the twin Great Commission tasks of language learning and gospel communication, Language 180 gets to the heart of gospel fluency across cultures. \n\nLanguage 180 is a reorientation, a complete pivot in perspective: We're reminded that language learning is something we don’t have to do before we share the gospel, rather something we get to do while we share the gospel.\n\nLanguage 180 is a reminder to persevere when we're tempted to plateau. Language 180 also refers to the minutes we spend every day in ongoing learning toward a sustained lifestyle of evangelism and discipleship in the language. In other words, through Language 180 we practice learning the language to communicate the gospel 3 hours per day, 60 minutes in each of three activities - personal preparation (1st hour), deliberate practice (2nd hour), and fluent proclamation (3rd hour) - for a total of 180 minutes each day. Want to learn more? Start with the first episode, \"What is Language 180?\"\n\nIn the Language 180 podcast, we explore core concepts that sync with articles and resources found on the language180.com website where we learn to: 1) Understand the basics of gospel fluency across cultures 2) Align our perspective with God’s perspective on gospel fluency 3) Evangelize our lost neighbors as we learn their language 4) Comprehend and tell simple familiar gospel stories in our new language 5) Engage our neighbors through the limitless radius of the gospel in all life encounters 6) Learn to listen and respond as an integral part of the fluency needed to reach neighbors with the gospel 7) Know what it means to intelligently learn a language 8) Invest in life-long language learning 9) Practice Language 180 for fruitful ongoing learning and in-language ministry 10) Converse the gospel in our new language 11) Share our testimony; pray for our neighbors, and 12) Identify as Kingdom pilgrims, with an unwavering assurance in our destination and an insatiable desire to invite others to join us from the “nations of every language” (Zechariah 8:23). ",
        "language": "en",
        "author_name": "Preston Fidler",
        "slug": "language180",
        "cover": "20210123_070507_75ec8560951ffa8dea86a7da13f59e1b.jpg"
    },
    {
        "podcast_id": 29166,
        "title": "Tudo sobre a Rússia",
        "description": "O podcast oficial do Instituto Rússia Brasil, uma das maiores escolas de russo no Brasil. Neste podcast vamos semanalmente compartilhar com vocês muitas curiosidades sobre a Rússia e sua história, língua e cultura. Добро пожаловать!",
        "language": "pt-br",
        "author_name": "Instituto Rússia Brasil",
        "slug": "tudosobrearussia",
        "cover": "20210201_155711_7e263ab410f202c32261d3990f320b13.jpg"
    },
    {
        "podcast_id": 30896,
        "title": "Learn Chinese while sleeping - The Little Prince - Slow Audiobook",
        "description": "Slow audiobook in chinese mandarin for passive listening.\nThe Little Prince - 小王子 - El Principito \n#chino #chinese  #HSK #audiobooks #learnchinese #bedtimestory ",
        "language": "zh",
        "author_name": "Jing Lin",
        "slug": "jinglin",
        "cover": "20210314_110644_e376065459b629d401f6ec1e29a0d2a3.jpg"
    },
    {
        "podcast_id": 36734,
        "title": "The Overseas Teacher Podcast",
        "description": "The Overseas Teacher Podcast provides an in-depth perspective on the day-to-day lives of Online and Physical TEFL teachers from The Overseas Teacher. We work to provide our teachers with the support and training they need to fully embrace their new working environments and this podcast tells their stories.",
        "language": "en",
        "author_name": "The Overseas Teacher",
        "slug": "tot-podcast",
        "cover": "20210301_162546_50397e192b93c8be8a409312e20bf44c.jpg"
    },
    {
        "podcast_id": 43410,
        "title": "Language Arts Workshop's Communication Arts Podcast (LAW's CAP)",
        "description": "Welcome to LAW's CAP! Each episode brings inspirational, educational, entertaining, heartwarming, and kid-friendly talk shows and podcasts. LAW's CAP covers topics that concern EVERYONE, from parenting to education and everything in between.  Stay tuned to find out how we inspire each other and bring great ideas to life!",
        "language": "en",
        "author_name": "Sue Sudarak",
        "slug": "law-communication-arts-podcast",
        "cover": "20210322_100142_43ac330ca6b25db2646032e3e933c253.jpg"
    },
    {
        "podcast_id": 44257,
        "title": "Ich verstehe nur Bahnhof",
        "description": "From students for students, Ich verstehe nur Bahnhof is a German podcast where three high school students from three different countries, Julia, Fedra and Christine who are learning German as a foreign language, share their perspectives on current events and explore German culture. Ich verstehe nur Bahnhof aims to act as a fun, alternative resource for students learning German.\n",
        "language": "de",
        "author_name": "Julia, Fedra, and Christine",
        "slug": "ich-verstehe-nur-bahnhof",
        "cover": "20210325_142839_bc8d0d71e0a60424037566212de94719.jpg"
    },
    {
        "podcast_id": 65242,
        "title": "Stammtisch",
        "description": "4 Dudes\n4 Bier\n1 Tisch\nU gnue Zit",
        "language": "de-ch",
        "author_name": "Maritz, Noah, Boder u em Jaynis",
        "slug": "echarreuesbier",
        "cover": "20210711_182238_3c3ff9e221fe4363bdb5cc081abe8878.jpg"
    },
    {
        "podcast_id": 81033,
        "title": "Academic Writing in 3 Minutes",
        "description": "Tips and ideas on how to improve your university writing, whether you are an undergraduate or a postgraduate student - all in 3 minutes.",
        "language": "en",
        "author_name": "Neil from Academic English Skills",
        "slug": "academicwritinginthree",
        "cover": "20211001_163911_e3b82c4caa93efd0d309209124b4f747.jpg"
    },
    {
        "podcast_id": 88998,
        "title": "The Big Reset: UDL Podcast",
        "description": "Staff from Coppell High School and Coppell ISD administration discuss the use of Universal Design for Learning.",
        "language": "en",
        "author_name": "Juli Springer",
        "slug": "julispringerpodcast",
        "cover": "20211115_160248_606a9c710c0e8a2680977894b75c7353.jpg"
    },
    {
        "podcast_id": 94860,
        "title": "Speakaru PodCast",
        "description": "English & Portuguese Listening practice!",
        "language": "en",
        "author_name": "Speakaru LLC",
        "slug": "speakaru",
        "cover": "20220319_030302_8c7c39fb623a72d6a667856679d98874.jpg"
    },
    {
        "podcast_id": 102258,
        "title": "Trenerzy Umysłu - Best Brain",
        "description": "Trenerzy Umysłu - Bracia Boral. Kim jesteśmy?\n\t\t\tCzy marzysz o tym, aby realnie pomóc Twojemu dziecku w nauce? Jeśli jesteś rodzicem zaangażowanym w rozwój swoich dzieci, to zapewne odpowiedź brzmi “tak”. Od wielu lat pomagamy dzieciom i dorosłym szybciej przyswajać wiedzę. Po sukcesach w Mistrzostwach Polski, pojechaliśmy jako pierwsi Polacy w historii na Mistrzostwa Świata Pamięci🏆, przywożąc stamtąd dwa medale i szóste miejsce drużynowo. Po powrocie ktoś poprosił o zrobienie pierwszego w życiu szkolenia i zobaczyliśmy że jest to nasze powołanie, które daje nam Pan Bóg. Dzielić się naszą pasją i umiejętnościami tak, aby innym było łatwiej. Dziś wiemy, że techniki efektywnej nauki i zapamiętywania wcale nie są kluczem do sukcesu. Najważniejszy jest dobry trening. To, co nas dziś wyróżnia to dbałość o szczegóły, które w treningu pamięci są najistotniejsze. W kursie pamięci głównym celem jest rozwój wyobraźni, giętkości umysłu, koncentracji uwagi i szybkości kojarzenia informacji.\n\t\t",
        "language": "pl",
        "author_name": "Bartłomiej Boral, Tobiasz Boral",
        "slug": "trenerzyumyslu",
        "cover": "20220124_030124_ebcd6fe2f7a43b08b154689625c8ff27.jpg"
    },
    {
        "podcast_id": 106628,
        "title": "HRD",
        "description": "The purpose of this podcast is to enhance the public's level of English across all age groups.",
        "language": "en",
        "author_name": "Hamid Reza Dousti",
        "slug": "hamidrezadousti1",
        "cover": "20220321_040326_199f58c272f8e0c23deda64ad57e12da.jpg"
    },
    {
        "podcast_id": 112756,
        "title": "Aprende 21 idiomas simultáneamente ",
        "description": "Hippo es una organización de origen japonés donde los afiliados adquirimos simultáneamente 21 idiomas sin clases, sin maestros y sin exámenes. \nEn Hippo, el Multilingüismo es nuestro proyecto de vida.",
        "language": "es",
        "author_name": "Club Familiar Hippo",
        "slug": "aprende-21-idiomas",
        "cover": "20220303_060312_0a143867cae56a7565a5019935d12a90.jpg"
    },
    {
        "podcast_id": 113035,
        "title": "Demystifying Latin and Greek: Undead Languages for Living Brains",
        "description": "Dr. Kirsten Jaqua and PhD candidate Anne Phillips, share a passion for teaching Latin and Greek at all levels. This collaborative podcast aims to making learning and teaching ancient languages accessible and fun for all, whether you are a teacher, a parent or a casual learner. In this podcast we explore language-learning approaches and strategies, we review and discuss curricula and resources, and bring in our combined experience to help YOU be the best teacher or learner you can be. ",
        "language": "en",
        "author_name": "Anne Phillips and Kirsten Jaqua",
        "slug": "demystifyinglatinandgreek",
        "cover": "20220811_030831_9108faf222e824e7d8a01c0b11901ea6.jpg"
    },
    {
        "podcast_id": 113578,
        "title": "Broken English",
        "description": "The 'Broken English Podcast' is hosted by Mila Panic and optional take-over hosts. In addition to various topics related to language, one of the goals of this podcast is comfort in listening to broken English.\n\nIn different episodes, we explore topics such as: What is 'broken' in the way we speak and for whom is 'broken', second language, native languages, \"pollution\" of English as an act of protest, class-related aspects of language, purity in language, writing, proofreading, and to what extent we should correct ourselves. We allow ourselves to go in different directions, such as humor, work, immigration, displacement or deal with topics from different regions of the world. \nAnd last but not least: we do not apologize for our broken English. \n\nEmail: podcast.brokenenglish@gmail.com\nInstgram: @brokenenglish_podcast\nCover design by Uroš Pajović\nSound: Nikola Kekerovic\n",
        "language": "en",
        "author_name": "Mila Panic",
        "slug": "brokenenglishpod",
        "cover": "20220321_090323_343c3a75467c7676b7006042e00d5234.jpg"
    },
    {
        "podcast_id": 114322,
        "title": "AL TIRO con la Grauri",
        "description": "Actriz, conductora, emprendedora, chihuahuita y ahora...¿podcaster? así es, bienvenidos a su podcast donde de una manera amable, calmada y condescendiente te dirá en que la estas cagando en la vida.\n\nSíguela en sus redes y recuerda ponerte al tiro...\n\n@pamelagrauri",
        "language": "es",
        "author_name": "Podbox Studios",
        "slug": "altiroconlagrauri",
        "cover": "20220601_100636_45e3c6f6be07afcbbcf0373f01610a89.jpg"
    },
    {
        "podcast_id": 115083,
        "title": "CLIL Voices",
        "description": "CLIL Voices is a podcast designed to be an accessible resource for CLIL practitioners and researchers. Episodes formats will include: Interviews with CLIL experts, discussions between peers about CLIL teaching and/or research, and discussions between language teachers of CLIL and content specialists.\n",
        "language": "en",
        "author_name": "TECLIL",
        "slug": "clilvoices",
        "cover": "20220628_010621_db910107ae390fb50948af821926c071.jpg"
    },
    {
        "podcast_id": 119911,
        "title": "Up Your English: Transforming ELT & Learning Beyond Labels - Podcast",
        "description": "<p>Welcome to \"Up Your English\"! Get ready to embark on an exciting podcast journey that combines the world of English language learning with a deep dive into the fascinating realm of Dyslexia and ADHD. I'm your host, Ania Karwowska, and I'm thrilled to be your guide in exploring the science behind dyslexia and debunking its myths.</p><p>Join me as I uncover the latest scientific research, educational approaches, and innovative technologies that can empower dyslexic students to excel in their English language journey. We'll explore evidence-based teaching methods, adaptive learning techniques, and inclusive classroom practices that cater to diverse learners.</p><p>Join me as I uncover the latest scientific research, educational approaches, and innovative technologies that can empower neurodiverse students to excel in their English language journey.</p><p>🚀 <a href=\"https://polcalanguages.kartra.com/page/KZa214\">https://polcalanguages.kartra.com/page/KZa214</a></p>",
        "language": "en",
        "author_name": "Ania Karwowska PolCa Languages",
        "slug": "neurodivergent-language-learners",
        "cover": "20230719_090701_3df55224b15149e4c8553a4d124253c4.jpg"
    },
    {
        "podcast_id": 120422,
        "title": "Wiggle with Words ",
        "description": "Welcome parents! This podcast was created by four educators to help your child move their body and mind to reading readiness. \n\n",
        "language": "en",
        "author_name": "Marissa Argus, Maggie Deer, Sara Panek, and Haley Van Matre",
        "slug": "wigglewithwords",
        "cover": "20220408_120437_6d6c3ae7f8835552510c4af49f15e3bc.jpg"
    },
    {
        "podcast_id": 122411,
        "title": "Teach me how to: pero en español",
        "description": "Spanish language learning tips for the cultured learner. Come listen and learn together to expand our use of the beautiful Spanish language through a culturally relevant context. ",
        "language": "en",
        "author_name": "Shannon M. Finley",
        "slug": "peroenespanol",
        "cover": "20220416_030421_0bc6f7aafb8068d36e1290acef34626f.jpg"
    },
    {
        "podcast_id": 128590,
        "title": "The Gringa Spanglish Podcast ",
        "description": "<p>Looking for a fun way to practice Spanish and English vocabulary through Spanglish story telling? These short and sweet episodes feature a blend of English and Spanish, told first in Spanglish with a varied percentage of Spanish content (10-90%) and then in all Spanish for different learning levels to make practicing Spanish or English easy, engaging, and fun!</p><p>Go to <a href=\"http://www.gringaconsulting.com\">www.gringaconsulting.com</a> for more information about Gringa Consulting products and services.</p><p>Go to <a href=\"http://rss.com/podcasts/thegringaspanglishpodcast/\">rss.com/podcasts/thegringaspanglishpodcast/</a> for free transcripts</p>",
        "language": "es",
        "author_name": "Alyssa Bonelli",
        "slug": "thegringaspanglishpodcast",
        "cover": "20220516_020533_e348081a7909f4e812cd3e7c7aff573c.jpg"
    },
    {
        "podcast_id": 129939,
        "title": "ilo irregular podcast",
        "description": "podkast gazetki ilo irregular",
        "language": "pl",
        "author_name": "the ilo irregular team",
        "slug": "iloirregular",
        "cover": "20220523_070542_a199f77960df4c031e25c015b3c5c487.jpg"
    },
    {
        "podcast_id": 131417,
        "title": "Mujeres en el Doporte ",
        "description": "proyecto de antropología",
        "language": "es",
        "author_name": "jennifer",
        "slug": "platicaconjenny",
        "cover": "20220607_070653_2c74feff8c0082d72bfc9a215d910519.jpg"
    },
    {
        "podcast_id": 131425,
        "title": "Grow Your English",
        "description": "<p>Hosted by language trainer and engaged interviewer Tree Blackmore, the Grow Your English podcast provides opportunities for you to deepen your listening skills and enrich your vocabulary. </p><p>Tree shares language learning tips and insights from the world of English Language Teaching. You'll hear from English speakers from across the world with passions to share and stories to tell.</p><p>If you would like a listening activity sheet to guide your ears through an episode, then please get in touch:</p><p><a href=\"http://www.eltree.co.uk/contact\">www.eltree.co.uk/contact</a> </p><p><a href=\"https://www.instagram.com/eltreeonline/\">https://www.instagram.com/eltreeonline/</a></p>",
        "language": "en",
        "author_name": "Tree Blackmore",
        "slug": "grow-your-english-podcast",
        "cover": "20230624_040650_0ca8d48c8c68ddd467d6441c48394abf.jpg"
    },
    {
        "podcast_id": 131661,
        "title": "Linguapodden",
        "description": "Från forskning till klassrummet! I Linguapodden samtalar Språklärarnas riksförbund med forskare kring aktuella teman för oss språklärare. ",
        "language": "sv",
        "author_name": "Sara Forster",
        "slug": "linguapodden",
        "cover": "20220601_080646_6e606817217106e5e6afbca98d6ca638.jpg"
    },
    {
        "podcast_id": 131807,
        "title": "IngleseVero Podcast",
        "description": "<p>In questo podcast ti racconterò alcune mie storie personali sull‘inglese e farò delle conversazioni in inglese con i miei amici (madrelingua inglese e non) da tutto il mondo che parlano inglese vero.</p>",
        "language": "it",
        "author_name": "Stefano Roganti ",
        "slug": "podcast-inglesevero",
        "cover": "20230228_040249_d8b633405e58cf755374aa7dd3cb0c9a.jpg"
    },
    {
        "podcast_id": 131847,
        "title": "Spanish On the Go! by EasyEspañol · Enjoy your Spanish learning experience with authentic material.",
        "description": "Learn spanish in a smart way with authentic material. \n\n✅  Learning by talking with native spanish coaches.\n✅  Culture and artistic latin environment.\n✅  Talk Sessions to practice Spanish.\n✅  Free activities, like tours, guides or grammar sessions, to enjoy learning spanish with people like you.\n\nTake a tour: https://www.easyespanol.org/\n",
        "language": "en-us",
        "author_name": "EasyEspañol",
        "slug": "easyespanol",
        "cover": "20220602_060601_ce7b8f306f201b8477915506594c4c32.jpg"
    },
    {
        "podcast_id": 134584,
        "title": "Comedy with an Accent",
        "description": "Comedy with an accent - comedy with a different point of view! Join Taiwanese comedian Kuan-wen as he finds out the amusing tales, obstacles and strategies of other non-native speakers who perform English stand up comedy on the UK circuit. We also peek into the comedians' foreign upbringings and cultures, how they approach the English language, how they switch between languages and any random anecdotes that get caught in the chitchats. \n\nLeave your comments on the podcast's Instagram page https://www.instagram.com/comedywithanaccent/  \n(@comedywithanaccent).  You can also email your comments, questions to comedywithanaccent@gmail.com\n\nFollow Kuan-wen on Instagram \nhttps://www.instagram.com/kuanwencomedy/\n@kuanwencomedy",
        "language": "en",
        "author_name": "Kuan-wen Huang",
        "slug": "comedywithanaccent",
        "cover": "20220615_080600_649ff95ef359249b1179265b5bc13c13.jpg"
    },
    {
        "podcast_id": 135791,
        "title": "Random Thoughts",
        "description": "Your daily random thoughts that have come to life. Daily questions answered and asked.",
        "language": "en",
        "author_name": "William Beston",
        "slug": "capt-hancho-randomthoughts",
        "cover": "20220727_080709_7dfbec78978b4a00df933d861c62f7de.jpg"
    },
    {
        "podcast_id": 137166,
        "title": "RUSSIAN WITH DIANA",
        "description": "Hello and welcome!\n\nMy name's Diana, and I've created this podcast to help the students of Russian practice their listening skills. \n\nIf we're not acquainted, here're several facts about me: I was born and raised in Russia, and I hold several Master’s degrees in linguistics and education from both Russia and USA. I studied how to teach Russian to foreigners at Moscow State University, which has the oldest and best Russian Program in the country. I have been teaching Russian and English at US colleges and universities for 20 years now and currently manage a Russian program at a Las Vegas college. I LOVE languages and helping others improve their language skills in a fun and easy way, and am SO HAPPY to help you advance your skills!\n\nHere you will find quick listening episodes with scripts on various topics. All episodes are clearly marked by level: Beginning, Intermediate or Advanced.\n\nFor more, please go to my channels on YouTube, Instagram or TikTok - simply look for \"Russian with Diana.\"\n\nIf you decide to take a formal class (credit-bearing & transferrable to US institutions), please feel free to contact me at russianwithdiana@gmail.com\n\nHappy studying!\n\nLove,\nDiana",
        "language": "en-us",
        "author_name": "Diana K",
        "slug": "russianwithdiana",
        "cover": "20220630_100646_93141cba2a0086331dfa2c77584fdede.jpg"
    },
    {
        "podcast_id": 137597,
        "title": "WeRead@CityU 2022: Book-A-Minute Podcast",
        "description": "Book-A-Minute Podcast is a channel where we share our thoughts on the books we read from WeRead@CityU 2022, the summer reading programme jointly launched by the EN Department and the Language Centre of City University of Hong Kong. It is hoped that through this reading programme, we would be able to promote a reading culture and cultivate a love of reading in our students.",
        "language": "en",
        "author_name": "CityU Students",
        "slug": "cityu-book-a-minute",
        "cover": "20220630_020642_97ac51f4838ddf41aa3735d78d808504.jpg"
    },
    {
        "podcast_id": 145091,
        "title": "The Research Podcast with Sir Jeffrey Canlas",
        "description": "In this podcast series, we aim to provide you, research learners, a more straightforward understanding of the subjects: Practical Research 1, Practical Research 2, and Inquiries, Investigations, and Immersion for Senior High School.\n\n",
        "language": "en",
        "author_name": "Jeffrey Canlas",
        "slug": "theresearchpodcastwithsirjeffreycanlas",
        "cover": "20220807_080806_489ae76f1c1538c884f03ee3ffb73a81.jpg"
    },
    {
        "podcast_id": 147055,
        "title": "Rikspodden",
        "description": "En podkast om språk fra Riksmålsforbundet.",
        "language": "nb",
        "author_name": "Riksmålsforbundet",
        "slug": "rikspodden",
        "cover": "20221201_051245_06ef55790cf80759260cd34baa1cd2a9.jpg"
    },
    {
        "podcast_id": 151027,
        "title": "The British Whisperer",
        "description": "The right weekly news for your English learning. A weekly newspapers' wrap-up from Britain and beyond for English learners in Italy with audio storytelling on news you care about, trends you should know, stories that don’t tell you at school, to listen at home or on the go. Stay informed about the world, while practicing your listening skills and learning new vocabulary.",
        "language": "en-gb",
        "author_name": "Clara Thea Vento Cappellina",
        "slug": "thebritishwhisperer",
        "cover": "20220904_030954_9c24aa5c68b0cf717b06aaac6d04959c.jpg"
    },
    {
        "podcast_id": 151426,
        "title": "Te Māturu",
        "description": "An insight into the work we do at Te Mātāwai, to restore the Māori Language as a nurturing first language.",
        "language": "en",
        "author_name": "Te Mātāwai",
        "slug": "tematawai",
        "cover": "20220906_020931_d11313328d66b4c87722245b3dd07d2e.jpg"
    },
    {
        "podcast_id": 155326,
        "title": "The Retired IT Guy and Musician",
        "description": "Thoughts and ideas for the day",
        "language": "en",
        "author_name": "Phil Melius",
        "slug": "philsplace",
        "cover": "20220923_120901_c5f6ccc9740c48a3d58cc4535ba9b81c.jpg"
    },
    {
        "podcast_id": 155704,
        "title": "Text to Task: Simplifying Education",
        "description": "<p>My name is Gargi, and my goal is to simplify everyday education and make it real with TEXT to TASK. I am a Fulbright Scholar, a member of the US Department of State alumni community, an educator, and a humanitarian. I am passionate about strengthening the capacities of educators and empowering them to create a better, more equitable education system. I am committed to working towards a more just and peaceful world through education, activism, and collaboration. In this podcast, I welcome guests from all over the world for inspiring and fascinating conversations about education.</p>",
        "language": "en",
        "author_name": "Gargi Sarkar",
        "slug": "texttotasksimplifyingeducation",
        "cover": "20220924_110913_ed0258f3e3c8788981a2daa62615a0e4.jpg"
    },
    {
        "podcast_id": 159081,
        "title": "TAYONI's Korean Podcast 타요니의 한국어 팟캐스트",
        "description": "안녕하세요, 타요니입니다! Hello, this is Tayoni! I hope these episodes can help your Korean learning journey. You can find pdf versions of the scripts on my youtube channel '타요니 TAYONI'. \n\n🎧 https://www.youtube.com/@tayoni\n👀 Instagram: https://www.instagram.com/tayoni_hi/\n☕ Buymeacoffee: https://www.buymeacoffee.com/tayoni",
        "language": "en",
        "author_name": "Tayoni",
        "slug": "tayoni",
        "cover": "20221009_071053_d599941c502f8ffd909f24b1a0ea04a0.jpg"
    },
    {
        "podcast_id": 159790,
        "title": "VirtuAule English Language System",
        "description": "VirtuAule English Language System helps you to learn the English language. These live video broadcasts are recorded lessons from the method of study from the VirtuAule LISTEN Course. You can find other links here:\nMain site: https://virtuaule.com\nFacebook: https://www.facebook.com/virtuaule/\nTwitter: https://twitter.com/VirtuAule\nLinked In: https://www.linkedin.com/company/virtuaule-english-language-system/\nInstagram: VirtuAule English Language Sys (@virtuauleenglishlanguagesystem)\nSelf Study (Moodle) https://virtuaule.com/SelfStudy/",
        "language": "en",
        "author_name": "Anthony Lombardi",
        "slug": "virtuaule",
        "cover": "20221012_091011_c0eb48698e20281820993d189842e8a4.jpg"
    },
    {
        "podcast_id": 162751,
        "title": "English to go ",
        "description": "English to go by English Life with Benjamin is a podcast that shares interesting topics, opinions and observations with the chance to learn expressions, vocabulary and grammar at the same time.",
        "language": "en",
        "author_name": "Benjamin Robson",
        "slug": "englishtogo",
        "cover": "20221024_071009_ed1f54b9b45d3216261275a101ba2996.jpg"
    },
    {
        "podcast_id": 162876,
        "title": "Talking Owls 86",
        "description": "Talking owls 86 is a nonprofit open group of high school teachers and students who talk about different topics to practice the speaking skill and have fun while learning.",
        "language": "en",
        "author_name": "Ricardo Quinteros & Cynthia Alvidrez",
        "slug": "talkingowls86",
        "cover": "20221024_101044_2c1e7eadc3868c64db9ca086970cad14.jpg"
    },
    {
        "podcast_id": 164059,
        "title": "Menstrual Cyclic Nature ",
        "description": "These podcasts we’ll take you on a journey of menstrual cycle knowledge. In the series of episodes we’ll learn the basics. I'll share with you some elementary alphabet of the menstrual cycle and briefly we’ll take a peek into the world of hormones and biochemistry of  menstrual cycle. I will try to give a bigger picture which shows why it is so important to understand menstrual cyclic nature and how you can benefit from having this kind of knowledge. ",
        "language": "en",
        "author_name": "Nadja Tobias",
        "slug": "mcn-basics",
        "cover": "20221029_051029_d782f056f117ea1b26576f04e5ce7ec4.jpg"
    },
    {
        "podcast_id": 165198,
        "title": "Jet Lag: Travel Comedy Stories",
        "description": "I membri dello staff di EF Education First, per la prima volta, si metteranno in gioco in prima persona affrontando diverse tematiche legate ai viaggi in maniera esilarante. \n\nAvvertenze: Parleranno delle loro esperienze personali, episodi assurdi e tante altre situazioni degne di un film fantasy, insieme a diversi ospiti.\n\nGarantiamo contenuti ad alto tasso di imprevedibilità.\n\nEffetti collaterali: può creare dipendenza.",
        "language": "it",
        "author_name": "EF Education First",
        "slug": "jetlag-ef-education",
        "cover": "20221103_051130_c9f0ac741605948a076ac50ae66724aa.jpg"
    },
    {
        "podcast_id": 166182,
        "title": "Teach Unplugged",
        "description": "<p><strong>A podcast for language teachers who want to adopt a more learner-centred approach that is conversation-driven, materials-light, and focuses on emergent language.</strong></p><p><strong>Teach Unplugged - Move away from the coursebook, challenge the grammar syllabus, and put your learners at the heart of the learning process.</strong></p>",
        "language": "en",
        "author_name": "Dylan Gates",
        "slug": "teachunplugged",
        "cover": "20230814_070820_42a5d02849760f1cf38032cceb6d9457.jpg"
    },
    {
        "podcast_id": 167399,
        "title": "Easy to speak Haitian Creole",
        "description": "Welcome to Easy to speak Haitian Creole, to speak a different language is not easy; but with my platform Easy to speak Haitian Creole will make it easy for you to speak Haitian Creole.",
        "language": "en",
        "author_name": "Miguel Paul",
        "slug": "speakhaitiancreole",
        "cover": "20221112_041110_aff50a3482e39dffee223702f315432c.jpg"
    },
    {
        "podcast_id": 168365,
        "title": "The EaglesBeak Podcast",
        "description": "A podcast created by the students in Eagle News, the media class at Hyatts Middle School.",
        "language": "en",
        "author_name": "James Meta",
        "slug": "eaglesbeakpodcast",
        "cover": "20221118_111119_3737fbba905316b3ba37a20c2ab17f3b.jpg"
    },
    {
        "podcast_id": 168680,
        "title": "Kwu Sneqsilxw",
        "description": "Qwayqwayaqn and Skukalaqw listen to stories from local elders, family, and knowledge keepers and talk about the Nsyilxcen language used and the lessons they've learned from listening.",
        "language": "en",
        "author_name": "Kwu Sneqsilxw",
        "slug": "kwusneqsilxw",
        "cover": "20221117_101137_4084cf552e3b120d0a0102b0392d246d.jpg"
    },
    {
        "podcast_id": 171924,
        "title": "Wordsmitty",
        "description": "Learning about old words by making new ones.",
        "language": "en",
        "author_name": "Cooper Gentles",
        "slug": "wordsmitty",
        "cover": "20221202_121206_6500683c11c5370aa8cf99dc1b0e58fc.jpg"
    },
    {
        "podcast_id": 175946,
        "title": "小耳朵電台  Radio for Little Ears ",
        "description": "專為廣東話小朋友製作的電台，希望向全球廣東話小聽眾分享故事及有趣百科小知識，為兒童提供健康、有意義的內容，適合學齡前兒童到小學高年級的兒童。",
        "language": "zh",
        "author_name": "Radio for Little Ears",
        "slug": "radioforlittleears",
        "cover": "20221223_051215_5cccd02e958d7eaa19c58b93463c70e5.jpg"
    },
    {
        "podcast_id": 177045,
        "title": "Shitamachi Underground: The Casual Japanese Podcast",
        "description": "Ever Wanted to Learn Casual Japanese? You know, like the stuff that they speak at your local Japanese bars or in your favorite Japanese games? Then this is the podcast for YOU!",
        "language": "en",
        "author_name": "Tarik Tannir, Jordan Ring-Sakabe",
        "slug": "shitamachiunderground",
        "cover": "20221230_021221_2afb7ef1f4ca63ecc32f2e3b528e25d9.jpg"
    },
    {
        "podcast_id": 177480,
        "title": " Chinese with Lily 中文电波",
        "description": "Chinese chitchat - language/culture/music chat\nLearn Chinese in 5 min\nContact: chinesewithlily@gmail.com\n\n",
        "language": "en",
        "author_name": "Lily",
        "slug": "chinesewithlily",
        "cover": "20230109_070118_c38759a811479cec6867776f7b909319.jpg"
    },
    {
        "podcast_id": 180026,
        "title": "Home for Hebrew Pod",
        "description": "<p>Learning Hebrew with human beings.</p><p>Music by Atar Brosh.</p>",
        "language": "en",
        "author_name": "Maayan Sharet",
        "slug": "homeforhebrew",
        "cover": "20230112_010109_9610598b2185bd7ee5251a1384b29897.jpg"
    },
    {
        "podcast_id": 181152,
        "title": "English Round Table Podcast | Kanda Gaigo Career College",
        "description": "<p>Listen to natural English conversation with English Round Table Podcast presented by Kanda Gaigo Career College.</p><p>For more English practice follow us:</p><ul><li><p>Twitter: <a href=\"http://twitter.com/kanda_kgcc\">twitter.com/kanda_kgcc</a></p></li><li><p>YouTube: <a href=\"https://bit.ly/3FbOJqI\">https://bit.ly/3FbOJqI</a></p></li><li><p>Instagram: <a href=\"http://instagram.com/kanda_kgcc\">instagram.com/kanda_kgcc</a></p></li><li><p>Official Site: <a href=\"http://kandagaigo.ac.jp/kgcc/\">kandagaigo.ac.jp/kgcc/</a></p></li></ul><p>English Round Table podcast provides short discussions from native English speakers from around the world. The podcast is for English learners to hear natural conversations on a wide variety of topics while practicing listening skills.</p><p>ポッドキャスト「English Round Table」は、世界各地からの英語ネイティブスピーカーとの短いディスカッションにより、英語学習者がリスニングの練習をしながら様々なトピックにより自然な会話を楽しむことを目的としています。 KGCC English Round Tableは、神田外語大学の直属機関、神田外語キャリアカレッジ（KCCC）により、開発された教。</p><p>KGCC English Round Table is an affiliate of Kanda Gaigo Career College based in Tokyo, Japan, with decades of experience teaching English to some of Japan's top leading companies. If you or your company wants to get ahead of the rapidly expanding English business world, check out our website for opportunities.</p>",
        "language": "en",
        "author_name": "English Round Table Podcast",
        "slug": "kgccenglishroundtable",
        "cover": "20230222_050211_1bf1ca1a1dfdfe0d96d88a78afdd1739.jpg"
    },
    {
        "podcast_id": 181194,
        "title": "Accent Coach Bianca",
        "description": "Master an American Accent! Where accent enthusiasts come for the strategies... and stay for the fun!  You get 4 kinds of episodes: 2 minute accent TIPS, 5 minute DRILLS and exercises,10 minute TEACHING about an accent topic, 30 minute real 1:1 COACHING, and 45 minute MAGIC conversations with English Teachers, Learners, other Accent Coaches... and more!\n\nSubscribe and follow me to Master an American Accent",
        "language": "en",
        "author_name": "Bianca Aubin",
        "slug": "accentcoachbianca",
        "cover": "20230117_030106_62211a96e22156ca7453d504f78f1f7d.jpg"
    },
    {
        "podcast_id": 181385,
        "title": "Cultural Connections Lab",
        "description": "<p>Welcome to Cultural Connections Lab, a podcast that explores the intersections of culture, travel, education, and language learning. We believe that learning about other cultures can be a transformative experience that broadens our understanding of the world, breaks down barriers, and promotes empathy and respect for diverse perspectives. Each episode, we take a deep dive into a different cultural topic, sharing stories and insights from experts and everyday people who have experienced it firsthand. Our hosts, Dr. J. Taylor Tribble, Dr. Kelly Forbes, and Mike Overholt come from diverse backgrounds and bring their own unique perspectives to the table. From seasoned travelers to language enthusiasts, our team is passionate about exploring new cultures and sharing their knowledge with others. Whether you're a seasoned traveler or just starting out on your cultural jouney, Cultural Connections Lab (CCL) has something for you. Join us as we explore the world and make meaningful connections across cultures.</p><p>Connect with us on Social Media:</p><ul><li><p><a href=\"https://www.linkedin.com/company/cultural-connections-lab\">LinkedIn</a></p></li><li><p><a href=\"https://twitter.com/CCL_Podcast\">Twitter</a></p></li><li><p><a href=\"https://www.facebook.com/CulturalConnectionsLab\">Facebook</a></p></li></ul>",
        "language": "en",
        "author_name": "Taylor Tribble, Kelly Forbes, Chris Culver, and Mike Overholt",
        "slug": "culturalconnectionslab",
        "cover": "20230821_020829_f03aefe13d12b95012f942022473d0ca.jpg"
    },
    {
        "podcast_id": 181791,
        "title": "Short Histories",
        "description": "<p>Part of the world History section. How Countries developed and major historical events. Check out our youtube channel for other historical videos podcasts. https://www.youtube.com/@englishthroughhistory</p>",
        "language": "en",
        "author_name": "Englishthroughhistory",
        "slug": "englishthroughhistory",
        "cover": "20230119_070120_4df741c7d5d5bfa9c3f65cee71464486.jpg"
    },
    {
        "podcast_id": 185046,
        "title": "Home in a Tea Cup",
        "description": "The podcast on which we're trying to understand what 'home' means to each individual by interviewing people on their sense of belonging and identity through nationality, languages and culture.",
        "language": "en",
        "author_name": "Louan CG",
        "slug": "home-in-a-tea-cup",
        "cover": "20230130_100102_eafc01b7473a9fb50c9e8e61b49e71f4.jpg"
    },
    {
        "podcast_id": 187062,
        "title": "The Language Worker",
        "description": "<p>Welcome to The Language Worker - a space to talk about the Language Business focusing on the stories of people who work in this magical field. Translators, Content Creators, Writers, Vocal Coaches, Teachers are all invited to talk about their love for languages and how their language knowledge has shaped their lives and careers.</p>",
        "language": "en",
        "author_name": "Rita Prazeres Gonçalves",
        "slug": "thelanguageworker",
        "cover": "20230605_100649_d15bac4521ccffe9a059febd00a09d0e.jpg"
    },
    {
        "podcast_id": 189081,
        "title": "لسان العرب ولهجاتهم",
        "description": "اللسان العربيّ من أهم الأدوات لتدبّر القرءان بشكل أدقّ وأوسع وأعمق، وهو الّذي يحدّد ويرتبط مباشرة بقوميّة كل عرق، فأقول الإنجليز يتكلمون الإنجليزيّة والفرنسيين الفرنسيّة... والعرب العربيّة، ولذلك فلا يمكن اندثار قوميّة إلا واندثر لسانها، ومن هنا وللحفاظ على قوميتنا ولساننا العربيّ والّذي حفظه الله أساسًا بحفظ الذّكر... كان هذا المشروع والّذي نسأل الله فيه التّوفيق.\nحينما نقرأ القرءان العظيم فإنّنا جميعًا نشعر بأنّ الكثير من المفردات غريبة علينا وذلك ليس بأنّ القرءان صعب الفهم ولكن ببساطة أنّنا بعدنا عن اللسان العربيّ بشكل كبير واتجهنا للعاميّة لتسهيل التّكلم والتّواصل بيننا، ولكن... هل العاميّة شيء مذموم؟\nلا يمكن أن تكون العاميّة نشأت من فراغ، فكلّ كلمة وإن تغيّرت بعض حروفها فقلبت أو حذفت فلا بدّ وأن يكون أصلها لسان عربيّ، ولقد وجدنا في رحلتنا هذه أنّه وفي كل بلد عربيّ وفي كل منطقة وكل لهجة يتكلّمها النّاس في أرجاء معمورتنا العربيّة... فهنالك كنز من المعلومات حول مفردات قرءانيّة تستخدم بدقّة لوصف ما أطلقت عليه ممّا سيساعدنا في فهم السّياق القرءانيّ بشكل أفضل.\nبإذن الله سننطلق معًا في هذه الرحلة الماتعة للتّعرف على لهجات وعادات وتقاليد والمناطق العربيّة المختلفة ريف وباديّة وحضر ونحاول أن نوثّق كلّ ذلك بهدف المحافظة على قوميتنا.",
        "language": "ar",
        "author_name": "Mouaffaq Al Baghdadi",
        "slug": "lisanalarab",
        "cover": "20230213_100217_2a29187bd8513722f2e4a5a8febb0b79.jpg"
    },
    {
        "podcast_id": 189345,
        "title": "英語リスニング-FluenDay ",
        "description": "英語アプリFluenDayのPodcastチャンネルです。\n日常生活でよく使われる英語表現を紹介します。\n毎日４０分で確実に英語力が身につくから頑張ってね！\n公式サイト：https://fluenday.com/",
        "language": "ja",
        "author_name": "FluenDay",
        "slug": "fluenday-podcast",
        "cover": "20230214_090223_f0eec1d94543370e6d5bc164741dad81.jpg"
    },
    {
        "podcast_id": 189505,
        "title": "News in Simple German - Nachrichten in einfachem Deutsch",
        "description": "<p>Short daily news in easy and slow-spoken German. Improve your language skills and learn new vocabulary.</p><p>---</p><p>Kurze Nachrichten in einfachem und langsam gesprochenem Deutsch. Verbessere Deine Sprachfähigkeiten und lerne neue Vokabeln.</p><p>---</p><p>More Content:</p><p><a href=\"https://www.instagram.com/simple_german_network\">https://www.instagram.com/simple_german_network</a></p><p>---</p><p>Contact:</p><p>simplegermannetwork@gmail.com</p>",
        "language": "de",
        "author_name": "Sven Sebastian",
        "slug": "newsineasygerman",
        "cover": "20230221_020220_f52c2cee91dd7491d7d891d81b82cde0.jpg"
    },
    {
        "podcast_id": 189645,
        "title": "the HAVAGO show ",
        "description": "A show all about adventure, motivation, inspiration and education. ",
        "language": "en",
        "author_name": "Willie Gevertz",
        "slug": "havago",
        "cover": "20230215_060250_f5ce5e41176e0cab442f35965db15cf5.jpg"
    },
    {
        "podcast_id": 190394,
        "title": "Hernán's English Classroom",
        "description": "<p>¡Bienvenidos a Hernán's English Classroom! Aquí encontrarás un espacio de aprendizaje de inglés divertido, moderno y personalizado, liderado por el profesor Hernán. Cada episodio ofrece lecciones prácticas y dinámicas sobre gramática, pronunciación, vocabulario y más. Además, Hernán compartirá con sus estudiantes consejos útiles para mejorar su aprendizaje de inglés, así como experiencias interesantes sobre la cultura angloparlante. ¡Sintoniza nuestro podcast y prepárate para mejorar tus habilidades en inglés en una clase virtual única y emocionante!</p>",
        "language": "en",
        "author_name": "Hernán Tena Cortés",
        "slug": "elprofesorhernan",
        "cover": "20230217_100248_739ac9c53e0b665c76de4cf2a1d1ca98.jpg"
    },
    {
        "podcast_id": 190880,
        "title": "A English Conversation ",
        "description": "<p>Welcome to our first podcasts</p>",
        "language": "es-mx",
        "author_name": "Darío & Ángel ",
        "slug": "4binformatica",
        "cover": "20230225_020205_98e2c251f7b5d700f44e5240669f7301.jpg"
    },
    {
        "podcast_id": 191124,
        "title": "Nos Bastidores do Inglês ",
        "description": "<p>Nos Bastidores do Inglês: Onde descobrimos o que está por trás da aprendizagem do Inglês nos Estados Unidos com a participação de pessoas reais, assim como eu e você.</p>",
        "language": "pt-br",
        "author_name": "Claudia Gurtner",
        "slug": "nosbastidoresdoingles",
        "cover": "20230220_110217_d0345c130d269b8bddafc51d70a5e1a2.jpg"
    },
    {
        "podcast_id": 194314,
        "title": "Love poems",
        "description": "<p>Love<a href=\"https://www.locutortv.com/\"> poems</a> and love <a href=\"https://www.locutortv.es/\">music</a>. Love <a href=\"https://www.amorypoesia.es/\">poetry </a></p>",
        "language": "es",
        "author_name": "Jesús Angel Morato",
        "slug": "voiceover63",
        "cover": "20230304_010329_80cca47a3a1d2050a61a55427a812186.jpg"
    },
    {
        "podcast_id": 194315,
        "title": "URALLRIGHT #えいごのじかん",
        "description": "<p>英語と文化とアメリカの話を題材に英語を学ぶポッドキャストです</p><p>世界中の人と対等に話せる英語を身につけましょう！：）</p>",
        "language": "ja",
        "author_name": "SAKI",
        "slug": "urallright",
        "cover": "20230304_010328_2bf821a1f661d0a3e4dbb9f0ed0a595e.jpg"
    },
    {
        "podcast_id": 194712,
        "title": "Listening Supplement",
        "description": "<p>We'll be using original texts and conversations with ChatGPT to provide English- listening-practice supplements. The sentences are created with consideration to various fields, including word choices and sentence structures, and are tailored to each level. Hope these supplements help you improve your listening skills!</p>",
        "language": "en",
        "author_name": "Shioda Study Room",
        "slug": "shiodastudyroom-listeningsupplement-podcast",
        "cover": "20230307_120337_cae0c090249e2a5311aae60ae86014b9.jpg"
    },
    {
        "podcast_id": 197362,
        "title": "Language in the Wild Podcast",
        "description": "<p>各位听众朋友大家好！欢迎收听野外中文播客！</p><p>Welcome to the Mandarin Institute Language in the Wild STARTALK program podcast!</p>",
        "language": "en",
        "author_name": "Language in the Wild",
        "slug": "languageinthewild",
        "cover": "20230316_100351_2a5746b3f20280e36aeca77cfe34a1dd.jpg"
    },
    {
        "podcast_id": 199415,
        "title": "L2+",
        "description": "<p>This podcast series is comprised of 100 practical podcasts for English language learners.</p>",
        "language": "en",
        "author_name": "Dr Mohammad Javad Ahmadian",
        "slug": "l2plus",
        "cover": "20230326_090356_cb438e034803efb1d63b5e23116451fa.jpg"
    },
    {
        "podcast_id": 199687,
        "title": "Noticias, relatos y entretenimiento",
        "description": "<p>Noticias de actualidad, San Pedro Peralta y alrededores.</p>",
        "language": "es-mx",
        "author_name": "EMSaD San Pedro Peralta",
        "slug": "brujulamundial-equipo2",
        "cover": "20230329_030354_1ed243736c9077cc085fd3d8042e6b07.jpg"
    },
    {
        "podcast_id": 200265,
        "title": "PTE Confidence Builder ",
        "description": "<p>This podcast designed to help PTE test takers</p>",
        "language": "en",
        "author_name": "R.Pradeep",
        "slug": "pteconfidencebuilder",
        "cover": "20230424_050456_d2738cea316b5453cf1bd7e57f665301.jpg"
    },
    {
        "podcast_id": 202182,
        "title": "French in Progress",
        "description": "<p>French in Progress is a French language learning podcast hosted by Gbenga and Wuraola, focusing on improving spoken French by making conversation more natural and free flowing. We also talk about French culture, language, and lifestyle.</p><p>New episodes on Sunday!</p>",
        "language": "fr",
        "author_name": "Gbenga and Wuraola",
        "slug": "frenchinprogress",
        "cover": "20230409_010451_a49fae62cdb7f7837d964398df8da0e9.jpg"
    },
    {
        "podcast_id": 202383,
        "title": "מה זאת אומרת",
        "description": "<p>בוני, קלינאית תקשורת ואורנה, שחקנית בעלת נגיעה אישית, דנות בהתפתחות השפה מזווית מדעית, אישית ומקצועית</p>",
        "language": "he",
        "author_name": "ד\"ר בוני לוין-אשר ואורנה כץ",
        "slug": "mazotomeret",
        "cover": "20230411_050401_031d723d7facbd51398d1a7e01ea73d4.jpg"
    },
    {
        "podcast_id": 203514,
        "title": "Interslavic podcast - Medžuslovjanske novosti",
        "description": "<p>Short news in the Interslavic language as an addition to the server <a href=\"https://interslavic.news\">https://interslavic.news</a> - Kratke věsti v medžuslovjanskom jezyku kako dopolnjenje servera <a href=\"https://interslavic.news\">https://interslavic.news</a> - Medžuslovjansky jezyk jest kolaborativny projekt upravjany od dobrovoljcev naměrjeny do budučnosti. Medžuslovjansky jezyk ne služi instrumentom nostalgije po mitičnoj historiji, i ne izražaje političny panslavizm ni sentiment protiv modernoj civilizaciji, ale pomagaje vyše dobromu znanju i razuměnju slovjanskyh narodov medžu soboju, i da by slovjanske narody takože i v budučem ostavali na prvoj liniji vozhoda člověčstva. Prizyvajemo Vas rabotati zajedno s nami, kontaktujte nas na adresě <a href=\"mailto:redakcija@interslavic.news\">redakcija@interslavic.news</a>, i pomagajte razvoju i praktičnomu širjenju medžuslovjanskogo jezyka. </p>",
        "language": "en",
        "author_name": "Interslavic news",
        "slug": "interslavic-news",
        "cover": "20230507_090549_1cafc298a5d81c422562836a2c0b1007.jpg"
    },
    {
        "podcast_id": 204656,
        "title": "Un tamal, por favor",
        "description": "<p><em>Un tamal, por favor</em> es un podcast donde yo Evgeny, un rusohablante, que vive en la Ciudad de México, exploro varios aspectos de la vida mexicana junto con mi esposa mexicana y diferentes invitados. Espero que además de aprender algo sobre México, este podcast le pueda servir a la gente que esté aprendiendo español.</p>",
        "language": "es",
        "author_name": "Evgeny Kan",
        "slug": "untamalxfa",
        "cover": "20230421_060418_2662541a05430489e27438f2d1e5da6d.jpg"
    },
    {
        "podcast_id": 207623,
        "title": "if the PHRASE fits",
        "description": "<p>An entertaining podcast about the meanings and origins of famous English idioms, proverbs, and other phrases. It's a show for both native English speakers who love the language and upper-intermediate to advanced ESL learners who want to build their vocabulary.</p><p> Hope you like it! If you do, please consider following. Episodes released weekly. Also, downloading episodes is convenient for future listenings, especially if you're a language learner. To suggest a phrase or make a comment, please contact me at ifthephrasefits@gmail.com.</p>",
        "language": "en",
        "author_name": "Brian Foden",
        "slug": "ifthephrasefits",
        "cover": "20230506_100505_1ed7507b77842d2d74cad55f941b0f8a.jpg"
    },
    {
        "podcast_id": 210981,
        "title": "Terminal (URBAN FM)",
        "description": "<p>Terminal Podcast eshte prodhim i Radio Urban FM dhe Innovation Centre Kosovo me qellim te promovimit te sektorit te Teknologjisë se Informacionit dhe Komunikimit (TIK), bizneseve startup, ndërmarrësisë, rolit te diasporës, profesionet ne sektorin e TIK, promovimi i tregimeve te suksesshme te kompanive dhe individeve, orientim ne karriere dhe tema sepecifike nga fusha e STEM (Science, Technology, Engineering and Mathematics).</p><p>Ky podcast transmetohet live çdo të mërkurë nga ora 11:00 deri në 12:00 në Urban FM 103.5 dhe 105.5 FM. Gjithashtu, mund ta gjeni në të gjitha platformat e Urban FM online.</p>",
        "language": "en",
        "author_name": "URBAN FM",
        "slug": "urbanfmterminal",
        "cover": "20230529_060503_b081c8f7cded00459465a74f8c719f14.jpg"
    },
    {
        "podcast_id": 211030,
        "title": "Norse Mythology",
        "description": "<p>Podcast sui dei della Mitologia Norrena</p><p>Podcast on the gods of Norse mythology</p>",
        "language": "en",
        "author_name": "Arianna Giordano",
        "slug": "98e88y99",
        "cover": "20230523_060551_5449f1ba4213f1a551753e71ddcf4b1c.jpg"
    },
    {
        "podcast_id": 211980,
        "title": "Honto Eigo",
        "description": "<p>Welcome to Honto Eigo, Japan's only 99.9% English podcast (hosted at my dinner table).</p><p>Honto Eigo is a podcast for intermediate to advanced level English learners who want to practice their listening ability. We will talk about books, various conversation topics, and common questions that appear on English tests like EIKEN and TOEFL, as well as hold interviews with learners and teachers of English.</p><p>Please follow the show on Instagram @hontoeigopod</p><p>If you have a question or a topic suggestion for the show, please contact us at <a href=\"mailto:hontoeigo@gmail.com\">hontoeigo@gmail.com</a>.</p>",
        "language": "en",
        "author_name": "Matthew Wardell",
        "slug": "hontoeigo",
        "cover": "20230529_120504_d0cfc8d3c4efebfc30963f9f3380d3f6.jpg"
    },
    {
        "podcast_id": 213991,
        "title": "Mandarwin - Mandarin with Edwin (跟Edwin一起学汉语)",
        "description": "<p>Belajar Bahasa Mandarin untuk keseharian</p>",
        "language": "id",
        "author_name": "Edwin Kurnia Reswara",
        "slug": "mandarwin",
        "cover": "20230608_060608_6d5348730ff67a8f4a4735d9b38000f0.jpg"
    },
    {
        "podcast_id": 215027,
        "title": "SM's SU PODCAST",
        "description": "<p>A podcast created by the students of SMK Subang Utama. Our first-ever English Language Podcast. Hope you all enjoy it.</p>",
        "language": "en",
        "author_name": "SMK Subang Utama",
        "slug": "srimurugan",
        "cover": "20230620_020610_47cd19a0e2a868a83d4548ec341dbe10.jpg"
    },
    {
        "podcast_id": 216633,
        "title": "Mace",
        "description": "<p>Field mice tend to fly </p>",
        "language": "en",
        "author_name": "Carlos Q",
        "slug": "mace",
        "cover": "20230624_120608_f0d3989b5fcc827e65bbe126ed9bf0a2.jpg"
    },
    {
        "podcast_id": 217915,
        "title": "Speaking Khmer",
        "description": "<p>SOK SOK YOUTUBE CHANNEL</p>",
        "language": "en",
        "author_name": "THEAM ROMCHONG",
        "slug": "speakingkhmer",
        "cover": "20230704_120721_06c84aca13f2eb53bf1a87bd849327a3.jpg"
    },
    {
        "podcast_id": 218256,
        "title": "PolyGlow Up Podcast",
        "description": "<p>Welcome to the PolyGlow Up Podcast, where we transform monolinguals into polyglots. Hosted by Renée Arinzé, a passionate language coach and fellow language teacher, this podcast combines neuroscience and psychology to provide actionable strategies, inspiring stories, and insightful interviews that unlock your full linguistic potential. Join Renée on this transformative language learning journey as she explores building confidence, resilience, and motivation. From interviews with language experts to conversations with successful polyglots, gain valuable insights into language learning strategies and experiences. Subscribe today and embark on an exciting adventure to become a confident, resilient, and motivated polyglot. Let's unlock your linguistic potential together!</p>",
        "language": "en",
        "author_name": "Renee Arinze",
        "slug": "polyglowup",
        "cover": "20230706_120737_31963f8f99876df825ccf1a02678e2e9.jpg"
    },
    {
        "podcast_id": 218425,
        "title": "Cuentos de Un Gringo",
        "description": "<p>Stories by a gringo traveling the world in order to practice his Espanol</p>",
        "language": "es",
        "author_name": "Tony",
        "slug": "cuentosdeungringo",
        "cover": "20230725_030728_91dbfb70e2140ab1e298352e45464ad0.jpg"
    },
    {
        "podcast_id": 218624,
        "title": "Regan Radio",
        "description": "<p>Hey.. these podcasts are bilingual conversations with people in English and Chinese about language, culture, and entertainment for bilinguals and language learners.</p><p>(Spanish coming soon)</p>",
        "language": "en",
        "author_name": "Regan and Friends",
        "slug": "regan-radio",
        "cover": "20230709_120716_d6e98b3d8e0ef3be0ddf77822159fc20.jpg"
    },
    {
        "podcast_id": 218932,
        "title": "Arian stark show ",
        "description": "<p>Hello and welcome to the show 🦄</p>",
        "language": "en",
        "author_name": "Arian ",
        "slug": "arianstark",
        "cover": "20230713_100730_e4cb500032790230ccfb6601d0787391.jpg"
    },
    {
        "podcast_id": 219467,
        "title": "Forget About English! for Beginners (Learn English Naturally)",
        "description": "<p>Comprehensible English podcast for beginners.</p><p>Want to speak English like a native speaker? Don't learn about English! Listen to funny short stories and forget about English!</p><p>Your host Sasha, a native English speaker from Canada, doesn't know what the past perfect tense is. But he does know how to tell you humorous short stories that help you forget about all tenses. You might even forget to do your boring grammar exercises.</p><p>To help you understand his stories, he asks and answers very easy questions. You can use these questions to help you practice speaking. But only if you want to! (This is method is known as TPRS.)</p><p>If you want to speak English as effortlessly as a native speaker, all you need to do is listen to something interesting! (This is called comprehensible input.)</p><p>Just don't tell your English grammar teacher that Sasha said that. He doesn't want to get any angry emails.</p>",
        "language": "en",
        "author_name": "Sasha Konotopetz",
        "slug": "forgetaboutenglishbeginners",
        "cover": "20230714_030717_062cbd046486304dd7465226c95cab6b.jpg"
    },
    {
        "podcast_id": 219627,
        "title": "مناظرات و إمتحانات التعليم الأساسي و الباكلوريا",
        "description": "<p><strong>مدونة تعليمية هدفها الأساسي الإرتقاء بمستوى التلميذ وتحسين نتائجه و تنمية مهاراته في جميع المواد المدرسة إضافة إلى إمتحانات و مناظرات ووفقاا للمناهج الدراسية</strong></p><p><a href=\"https://educationexamens.blogspot.com/\"><strong>https://educationexamens.blogspot.com/</strong></a></p>",
        "language": "ar",
        "author_name": "Rhouma",
        "slug": "educationexamens",
        "cover": "20230715_090737_966999b3a33d847473eea13d0da10e0b.jpg"
    },
    {
        "podcast_id": 219902,
        "title": "English Fluency Journey Podcast",
        "description": "<p>Hello everyone! Thank you for choosing our podcast! </p><p>These episodes were created based on our videos on our English Fluency Journey YouTube channel for those who'd rather listen than watch. So, happy listening! </p><p>However, just a reminder,-  you can also enjoy watching  these episodes on our YouTube channel following the Link in the below. </p><p><a href=\"https://www.youtube.com/channel/UC9eIq7PwD0WA-2B_Sp7xGdw\">https://www.youtube.com/channel/UC9eIq7PwD0WA-2B_Sp7xGdw</a></p>",
        "language": "en",
        "author_name": "Hanna Khoma",
        "slug": "englishfluencyjourney",
        "cover": "20230717_090732_b6673e299c271da21c830d455725cd83.jpg"
    },
    {
        "podcast_id": 221299,
        "title": "Inglês para Iniciantes | Aprenda com uma Fluente | Aula 1",
        "description": "<p>Venha aprender nessa aula a destravar seu inglês com uma fluente que mora nos Estados Unidos! </p><p>Nessa nossa primeira aula iremos aprender a fazer apresentações, saudações em inglês! E também várias dicas de pronúncia! </p><p>No final da aula você ouvirá seu primeiro diálogo SOMENTE EM INGLÊS pra testar os seus conhecimentos! </p><p></p><ul><li>Escute várias vezes para testar seu listening (escuta)</li><li>Pause a aula QUANTAS VEZES FOR POSSÍVEL e REPITA EM VOZ ALTA cada frase ou palavra para você testar a sua pronúncia </li></ul>",
        "language": "pt-br",
        "author_name": "Thalita Harriman ",
        "slug": "inglesparainiciantes",
        "cover": "20230726_090743_935f45c00f624618efff425631bf03bf.jpg"
    },
    {
        "podcast_id": 222374,
        "title": "The Meta Shtetl",
        "description": "<p>Interviewing today's Yiddishists at the frontier of using technology to proliferate the Yiddish language and culture worldwide.</p><p>Follow along with the English translation at <a href=\"http://www.themetashtetl.com\">www.themetashtetl.com</a> </p>",
        "language": "en",
        "author_name": "Eitan Binstock",
        "slug": "themetashtetl",
        "cover": "20230803_010810_992f0b6fa5a236ce5a068247195d04f7.jpg"
    },
    {
        "podcast_id": 222530,
        "title": "Ed Talk",
        "description": "<p>Teacher educators have conversations about education in the 21 Century.</p>",
        "language": "en",
        "author_name": "Kirsteen Donaghy",
        "slug": "edtalk-21century",
        "cover": "20230804_050819_36ba4f833ca8c71dbc3b529e7c0a0684.jpg"
    },
    {
        "podcast_id": 222824,
        "title": "Vocabulary & Pronunciation",
        "description": "<p>Let your mind retain it !</p>",
        "language": "en",
        "author_name": "Tarunpreet singh",
        "slug": "vocabulary-and-pronunciation",
        "cover": "20230806_050815_44768d7ae57185c7bf8ad4f0dfbb02fd.jpg"
    },
    {
        "podcast_id": 223210,
        "title": "French Dialogues episode 1",
        "description": "<p>The transcription is availlable on my website</p><p><a href=\"http://willytz.com\">willytz.com</a></p>",
        "language": "en",
        "author_name": "Willy tz",
        "slug": "willy-tz",
        "cover": "20230809_010832_f6f5b2b1bf732535cc87714ba134db5d.jpg"
    },
    {
        "podcast_id": 223433,
        "title": "日本瞎槓",
        "description": "<p>進來聽我們用日文瞎聊，邊聽邊學。</p>",
        "language": "zh",
        "author_name": "vivian liu",
        "slug": "vivian-and-winston",
        "cover": "20230810_010809_1dd22e57877dc72558438d6f15ba3bfb.jpg"
    },
    {
        "podcast_id": 223477,
        "title": "Voilá! ",
        "description": "<p>Un podcast où nous donnons des conseils concernant la grammaire française pour devenir chaque jour un peu plus expert en français !</p>",
        "language": "fr",
        "author_name": "Sthefani Uzcategui, Astrid Ramirez",
        "slug": "voila-sthefani-et-astrid",
        "cover": "20230810_060829_1afb970d584911e42cbc27b8255ee76d.jpg"
    },
    {
        "podcast_id": 223708,
        "title": "Noticias",
        "description": "<p>aña</p>",
        "language": "es-mx",
        "author_name": "Mateo Calvo Tobias",
        "slug": "20142123210314nt",
        "cover": "20230812_070842_69ca8ee97652d0e257134ab50aa5b353.jpg"
    },
    {
        "podcast_id": 224300,
        "title": "Digital Technologies for Education",
        "description": "<p>When it comes to using technology in classroom, it is vital for every educator to be aware of the students' privacy as it is important to keep the students and we as teachers safe from cybercrime. There are many advantages when it comes to using digital technology in classrooms and also many disadvantages related to it. A few advantages are: students get very excited and become very active, students become more innovative and students become more knowledgeable which help them to prepare themselves for the future. However, there are also disadvantages associated to it for example, cyber bullying which is a common case, students become anti social even being in classrooms and the plagiarism is a common issue. Hence, it is vital to create a safe environment for both teachers and students when it comes to using digital technologies in classrooms. Moreover, every student must be treated fairly and equally regardless to their ethnicity. Everyone should be given adequate access to using technological tools. Teachers must be well trained to be able to cater for a holistic approach to teaching. </p><p>Hobbs, Renee. <em>Create to Learn : Introduction to Digital Literacy</em>, John Wiley &amp; Sons, Incorporated, 2017.<em> ProQuest Ebook Central</em>, <a href=\"https://ebookcentral.proquest.com/lib/qmu/detail.action?docID=7104295\">https://ebookcentral.proquest.com/lib/qmu/detail.action?docID=7104295</a>.</p><p> </p><p>BBC Scotland Selkirk, David Knox, (2022) <em>Apple targets Scottish Borders for teaching revolution. </em><a href=\"https://www.bbc.com/news/uk-scotland-south-scotland-63545718\">https://www.bbc.com/news/uk-scotland-south-scotland-63545718</a>. (Accessed 16th August 2023)</p>",
        "language": "en",
        "author_name": "Trishini Mathura",
        "slug": "trishini-mathura",
        "cover": "20230816_070805_bf52e1081d6cc5430e1a5f6b4dd35f39.jpg"
    },
    {
        "podcast_id": 224512,
        "title": "Daily English Podcasts",
        "description": "<p>İngilizce cümleler, deyimler, yeni kelimeler ve çok daha fazlası...</p>",
        "language": "tr",
        "author_name": "Büşra Altıntaş",
        "slug": "dailyenglishpodcasts",
        "cover": "20230817_010827_e2dc6a791053b6cecb8b339e2e0bb562.jpg"
    },
    {
        "podcast_id": 226259,
        "title": "\"Sembrando saberes - Namaa̰ na to̰é kurü küa\"",
        "description": "<p><strong>Estudio de caso: Sembrando transformaciones didácticas</strong></p><p><strong>“Fortalecimiento en la enseñanza y aprendizaje de la lengua materna Tikuna, en la sede educativa Santa Luisa de Marillac”</strong></p>",
        "language": "es",
        "author_name": "Claudia Gamboa",
        "slug": "conociendolalenguatikuna",
        "cover": "20230828_080818_384f91ebb261dcc6f2a46738a032ec54.jpg"
    },
    {
        "podcast_id": 226949,
        "title": "Mnemozine",
        "description": "<p>Привет, это передача Мнемозина! Я буду рассказывать о происхождении и истории слов, терминов, названий в русском языке и их связи с другими языками. А еще просто об интересных фактах и совпадениях.</p>",
        "language": "ru",
        "author_name": "Alexandr Shirshov",
        "slug": "mnemozine",
        "cover": "20230902_040929_5c8e676742590fe984ac07393bc744ac.jpg"
    },
    {
        "podcast_id": 227135,
        "title": "Learn English Podcast",
        "description": "<p>Welcome to the Learn English podcast, the podcast teaching English in context so you can learn naturally. Each episodes presents comprehensible and engaging content in English so you can improve your listening comprehension, vocabulary, and knowledge about American culture. Ideal resource for intermediate or lower-advanced learners on their English journey. Let's learn English!</p><p><a href=\"https://linktr.ee/learnenglishpod\">https://linktr.ee/learnenglishpod</a></p>",
        "language": "en",
        "author_name": "Learn English Podcast ",
        "slug": "learnenglishpodcast",
        "cover": "20230910_070959_c83f45dac31d0fe61d35e1464a86fb25.jpg"
    },
    {
        "podcast_id": 227285,
        "title": "GSL-English ",
        "description": "<p>Test your vocabulary with me! Let me know how many you got right!</p>",
        "language": "en",
        "author_name": "Gideon Lumb",
        "slug": "vocabularytest",
        "cover": "20230905_090952_852e874d3f65b0b3bd1fc91829ef8f84.jpg"
    },
    {
        "podcast_id": 227411,
        "title": "ItariaGo - イタリア語を学びたい人のためのポッドキャスト - The podcast for those who want to learn Italian",
        "description": "<p>Parlare e studiare italiano può essere difficile ed è meglio farlo nel modo giusto. Se stai cercando di farlo divertendoti e bene sei nel posto giusto!</p><p>イタリア語を話したり勉強したりするのは難しい場合がありますが、正しく行うことが最善です。 楽しく上手にやりたいと思っているなら、あなたは正しい場所にいます！</p><p>Speaking and studying Italian can be difficult and it's best to do it right. If you are looking to do it having fun and well you are in the right place!</p><p>Il mio sito: <a href=\"https://eserciziitaliano.it\">https://eserciziitaliano.it</a></p><p>Il sito del podcast: <a href=\"https://eserciziitaliano.it/?page_id=501\">https://eserciziitaliano.it/?page_id=501</a></p><p>Il mio Instagram: <a href=\"https://www.instagram.com/itariagonosensei/\">https://www.instagram.com/itariagonosensei/</a></p>",
        "language": "it",
        "author_name": "Simone M.",
        "slug": "itariago",
        "cover": "20230906_020915_090a4ad35767c82a164e7a5a9f1b3c76.jpg"
    },
    {
        "podcast_id": 228024,
        "title": "K-Learning Adventures: Asia & Karolina’s Language Diary",
        "description": "<p>From the United States to Poland, join Asia (@DefinitelyNotKorean_) and Karolina (@Pocketsizedpolyglot) on their adventures on learning the Korean Language!</p>",
        "language": "ko",
        "author_name": "Asia Thompson & Karolina Balde",
        "slug": "klearningadventureswithasiaandkarolina",
        "cover": "20230910_080907_c7c95016a072cb9108a8180959682967.jpg"
    },
    {
        "podcast_id": 228065,
        "title": "Chatting English! A Smashing English Podcast!",
        "description": "<p>English comprehension practice for English learners! Try and listen along and understand our conversation!</p>",
        "language": "en",
        "author_name": "Smashing English",
        "slug": "smashingenglish",
        "cover": "20230910_040914_bfab6548a25847423b2b7c52e64c4c68.jpg"
    },
    {
        "podcast_id": 228400,
        "title": "KNOWING COLOMBIA AND ITS MAGIC REALISM!",
        "description": "<p>🇨🇴 Are you LEARNING SPANISH and would like to learn more about Latin culture? Get ready for a mind-blowing journey through Colombia! 🌎 🤯</p><p>⭐ Welcome to the podcast \"Knowing Colombia and its magic realism\" a podcast designed for Spanish students who are in love with Latin culture but especially with Colombian culture.</p>",
        "language": "es",
        "author_name": "Fernando Diaz",
        "slug": "knowingcolombiaanditsmagicrealism",
        "cover": "20230912_080930_cfe44feddafd0dcb0422843627c1aeae.jpg"
    },
    {
        "podcast_id": 228422,
        "title": "English in different careers - PODCAST",
        "description": "<p>Do you already know what you study and if you will need English in them? This is a little information for you.</p>",
        "language": "es-mx",
        "author_name": "Jenni Cruz",
        "slug": "english-in-different-careers-jennifercruz",
        "cover": "20230912_100907_5a9a29f3a484fa8bcd90492acd39bd39.jpg"
    },
    {
        "podcast_id": 228694,
        "title": "Truth Behind",
        "description": "<p>Truth Behind</p>",
        "language": "hi",
        "author_name": "Rahul Sharma",
        "slug": "truthbehind",
        "cover": "20230914_070935_f3dff896d50411f760106b9a8b7a2cba.jpg"
    },
    {
        "podcast_id": 229271,
        "title": "Aprender un nuevo idioma-derribando mitos",
        "description": "<p>Mitos populares que interfieren con el aprendizaje de un idioma.</p>",
        "language": "es",
        "author_name": "Adriana Hernández",
        "slug": "contenido-interesante",
        "cover": "20230919_120959_d98fbec1b8425fa6a04e0fcb171522ef.jpg"
    }
]