[
    {
        "podcast_id": 3144,
        "title": "Riffs N Rants",
        "description": "The official podcast of Big Boom Radio - Both barrels from both sides, and a lot of good music too.",
        "language": "en",
        "author_name": "Johnny Teflon & Michael Sean Lee",
        "slug": "riffsnrants",
        "cover": "5da7a33c2b835.jpg"
    },
    {
        "podcast_id": 4647,
        "title": "The Tommy and Adam Hard To Name Podcast",
        "description": "<p>El Gran Tommy Martinez without Adam Tate discussing the music of the artists he loves. Also covering rock history (according to him) and a wide range of topics like historic and popular culture, rock tours, albums, current events other than music. You'll either love or extremely hate some of his unique segments like the \"This Week in KISS-Story\", \"Lyrics That Will Blow Your Mind\", \"What the Frijoles, \"Sound of the Week\", \"Good Times/Bad Times\", \"The Historic Hip Hop Rappizzle Moment\" and whatever else he can squeeze in. It behooves you to never take anything he says as factual nor seriously. What he's saying can either be bullshit, no bullshit at all or a combination of both. Remember to always to \"Play it often, play it loud, but play it.\"</p>",
        "language": "en",
        "author_name": "Datecoba Promotions",
        "slug": "thetommyandadamhardtonamepodcast",
        "cover": "20230424_020457_b83cfd2b2cfe2c279b2c1f9a49a95cc2.jpg"
    },
    {
        "podcast_id": 5380,
        "title": "CarlsVinylConnection",
        "description": "Classic rock and blues songs from my vinyl collection along with commentary about the artists and their connections between bands",
        "language": "en-us",
        "author_name": "Carl Anderson",
        "slug": "carlsvinylconnection",
        "cover": "5e100a029e05d.jpg"
    },
    {
        "podcast_id": 6500,
        "title": "dMbOnDemand Podcast",
        "description": "This is THE podcast for dmb fans & lovers. I have put together a beautiful platform to showcase our commonality with one another. Take a deep dive into intimate conversations among friends, who have never met, about Dave Matthews Band and how their music is sewn into each one of our lives and how that links all of us together.",
        "language": "en",
        "author_name": "dMbOnDemand",
        "slug": "dmbondemand",
        "cover": "20220120_030152_abc984e8cf713216abc7beb4462f9252.jpg"
    },
    {
        "podcast_id": 6520,
        "title": "Flowing Backwards",
        "description": "This is a podcast about the Manchester music and arts scene through the eyes of poet, writer and music historian/musician, Mr Ian Four Candles Moss. Ian will be talking about his memories, experiences and his influences. Over future episodes he will be calling on some of his friends and cohorts to reminisce on what has been a very colourful and sometimes odd life.",
        "language": "en",
        "author_name": "Philip Peak and Ian Moss",
        "slug": "flowingbackwards",
        "cover": "20200301_013543_9858d79fb624556dfdf6a1040c3e3588.jpeg"
    },
    {
        "podcast_id": 6557,
        "title": "Blush Cameron's New Podcast ",
        "description": "Blush Cameron is a musician and artist living in Philadelphia, PA. This is his podcast where he talks to other artists and musicians about their history playing music and whatever else comes up. ",
        "language": "en",
        "author_name": "Blush Cameron",
        "slug": "blushcameron",
        "cover": "20200303_084841_0cdc4993f4bdbffca6459e57a5c146b5.jpeg"
    },
    {
        "podcast_id": 6939,
        "title": "Metalheads and Maniacs ",
        "description": "The place for Metalheads and Maniacs to listen, talk and discover metal music",
        "language": "en",
        "author_name": "JP",
        "slug": "metalheadsandmaniacs",
        "cover": "20200325_025600_704f1a6e2b6513d7b9e819f517ac0cc6.jpeg"
    },
    {
        "podcast_id": 7117,
        "title": "Self-isolation in music",
        "description": "Mixes of curated electronic music for those who decided to go for self-isolation. In music of course",
        "language": "en",
        "author_name": "Vitaly",
        "slug": "vitaly",
        "cover": "20200326_215018_eea53d1a64c01d4d4d30a1443c23eca1.jpeg"
    },
    {
        "podcast_id": 8939,
        "title": "Behind The Sounds",
        "description": "Join Leah Sherlock as she chats to Artists and Songwriters all over the world, and delves into the human stories behind some of our most beloved songs!\n-\nGet in touch!\nleah@behindthesoundsuk.com\n@behindthesounds_",
        "language": "en",
        "author_name": "Leah Sherlock",
        "slug": "behindthesounds",
        "cover": "20220227_020217_e09155bc4dacb950c88fbcf88cad1e89.jpg"
    },
    {
        "podcast_id": 9341,
        "title": "DESCUBRIENDO LA MÚSICA",
        "description": ".",
        "language": "es",
        "author_name": "Guillermo Samudio",
        "slug": "quevivalamusica",
        "cover": "20200603_195137_36a33a1078c7c167dcb8f6ae283f3af1.jpeg"
    },
    {
        "podcast_id": 10607,
        "title": "TBD with Yvette and Yeyo",
        "description": "A podcast by two friends, Yvette and Yeyo. Join them as they talk all things music and just about everything in between.",
        "language": "en",
        "author_name": "Yvette and Yeyo",
        "slug": "tbdwithyandy",
        "cover": "20200716_063633_f65d2d810e472884118119feab9c4531.jpg"
    },
    {
        "podcast_id": 12035,
        "title": "The More Fuzz Podcast",
        "description": "Heavy Rock / Metal / Stoner / Psychedelic / Doom / Sludge addict ? Get Your Dose Of Fuzz !\n\nThis podcast has been proudly supporting and promoting the Heavy Music scene since 2016. New episodes are released on a regular basis, bringing you the best new sounds from the Heavy Underground, classic tracks and more !\n\nCheck out our blog at morefuzz.net for album reviews, interviews, gig and festival reports, plus links to all our social media pages.\n\nKeep fuzzin' !",
        "language": "en",
        "author_name": "Mr. Weirdbeard",
        "slug": "more-fuzz",
        "cover": "20200903_210800_9a3255d873aa617ec55339f6c4555312.jpg"
    },
    {
        "podcast_id": 12799,
        "title": "Reelin' In The Years (RITY)",
        "description": "<p>RITY is a weekly two hour time machine featuring some of the greatest music ever recorded! Each program is centered on a specific theme. For more information on the show, visit reelinwithryan.com</p>",
        "language": "en",
        "author_name": "Ryan Janson",
        "slug": "reelinwithryan",
        "cover": "20230421_110458_ddb17e893d25ed87deb3d777d48e6ebc.jpg"
    },
    {
        "podcast_id": 13337,
        "title": "This is The Moment Podcast ",
        "description": "This is the Moment. Is the place where musicians discuss, when they found their love for music..... how that moment has changed their lives, and how that moment is shaping their future.  \n\nThe guests we will have come from different walks of life and they perform various genres of music from classical, gospel, r&b, hip hop, trap, funk, composers, directors, singers, drummers, and producers,\nThis is the Moment is the platform where musicians speak freely about their love for music \n\nThis musical journey will literally be like going into a Record Store. Or going on iTunes \n\nMusic and musicians have different flavors, colors, textures, facets, and approaches. ",
        "language": "en",
        "author_name": "Steve Jones Jr.",
        "slug": "061796",
        "cover": "20201012_005405_e5e0d50e579f6a74745aef54ed77cea0.jpg"
    },
    {
        "podcast_id": 13584,
        "title": "Stank! with DJ Tequesta",
        "description": "A music history podcast that explores the 1970s funk scenes across different cities. Each episode is accompanied by playlists on Spotify and YouTube full of 70s funk. \n\nSpotify playlist: https://open.spotify.com/playlist/50Wm7m8FozWg8EPriv8qKj\n\nYouTube Playlist: https://music.youtube.com/playlist?list=PLh4juLq0lBQAGsoGxe9LRJQmeaj88i7Fw ",
        "language": "en",
        "author_name": "DJ Tequesta",
        "slug": "stankwithdjtequesta",
        "cover": "20201017_183723_555b2b949f56712ca41b63b3c2a1b44e.jpg"
    },
    {
        "podcast_id": 14112,
        "title": "Get into the Groove",
        "description": "Four music lovers find a groove, and they get into it. Each episode Melissa, Brandon, Jeannie & Colton tear into seminal albums with great stories, track by track. From production history to diving deep into lyrics, these nerds leave no record unturned.",
        "language": "en",
        "author_name": "Brandon J.",
        "slug": "getn2thegroove",
        "cover": "20201101_084218_1404c9a5f259c450d0f6cde3f518db94.jpg"
    },
    {
        "podcast_id": 14364,
        "title": "Hardcore Time",
        "description": "René Thepass, Sander de Vet, Jos Lokhorst en Daan Veen beslaan 3 generaties hardcore liefhebbers en presenteren 2 keer per maand Hardcore Time. \nDeze podcast wordt tevens uitgezonden op Radio Beverwijk elke zaterdag van 22:00-0:00.\n",
        "language": "nl",
        "author_name": "Rene Thepass, Sander de Vet, Jos Lokhorst, Daan Veen",
        "slug": "hardcoretime",
        "cover": "20201108_145245_39067fd1c6f967ce939b960a50bb5af7.jpg"
    },
    {
        "podcast_id": 14658,
        "title": "Music Mythology ",
        "description": "Is music the air you breathe?\nJoin the conversations I have with artists, musicians, producers, and more as we dive into the deep and vibrant history of music.  This podcast is here to showcase interviews that give personal insight and real experiences from our guests and hopefully myself to provide the audience a chance to see and hear how everyone uses music in their life.\n\nFor more content visit our website musicmythpodcast.com",
        "language": "en",
        "author_name": "Sam Romo",
        "slug": "musicmythology",
        "cover": "20220516_090548_17a7ff6de1cb8af9f91ee5e010ab16dd.jpg"
    },
    {
        "podcast_id": 15842,
        "title": "L FILES PUBCAST",
        "description": "L Files Pubcast is brought to you from Lulie Tavern Abbotsford. \nThis local music news pubcast will keep you up to date with all of the latest Melbourne music as well as checking out international classics.  ",
        "language": "en",
        "author_name": "Lulie Files ",
        "slug": "lfiles",
        "cover": "20201127_231559_d4e048e5b65add0ec6e91ea1d5fec4bc.jpg"
    },
    {
        "podcast_id": 18767,
        "title": "Bounce FM",
        "description": "Bounce FM is a podcast that is striving to help us all in lockdown with the power of music to bring us together, together apart, and generally keep us sane during isolation!\nThe beauty of a podcast is that you can listen to it anytime anywhere, a new episode is released every Friday but will remain available for the forseable.",
        "language": "en",
        "author_name": "Mark Chapman",
        "slug": "bouncefm",
        "cover": "20210326_154321_684fbb0906a45aed15f417ef512219f1.jpg"
    },
    {
        "podcast_id": 20920,
        "title": "The Britpop Show",
        "description": "Every week, David Marsden hosts The Britpop Show, live on various radio stations. A mix of classic Britpop tracks, Britpop songs you thought you’d forgotten, and some you ought to know but don’t yet - with the odd interview with Britpop royalty thrown in!  This is your chance to relive the show at your leisure. ",
        "language": "en",
        "author_name": "David Marsden",
        "slug": "thebritpopshow",
        "cover": "20210101_091914_49e5d3427ee170ba72ecbd77ca2ed19f.jpg"
    },
    {
        "podcast_id": 21527,
        "title": "Capital City PodCast",
        "description": "<p>With over 30 years in the music industry, Hip-Hop historian Jerome \"Capital J\" Dickens and DL Glass talk lyrics, beats, and music. In-depth conversations that discuss the music business and the business of music. To be apart of the conversation email us at info@overheretv.com.</p>",
        "language": "en",
        "author_name": "Capital J and DL Glass",
        "slug": "capitalcitypodcast",
        "cover": "20230720_010755_41a9bd0ccf54654f00a4c166fc5b3d90.jpg"
    },
    {
        "podcast_id": 21709,
        "title": "Viikonloppusoturit - Iron Maiden -podcast",
        "description": "<p>Ensimmäinen suomenkielinen Iron Maiden -podcast. Analyysiä, uutta tutkittua tietoa, historiaa ja harvinaisuuksia bändin uran varrelta. Fakta- ja fiilispohjalta. Mikkien äärellä ovat Tero Ikäheimonen ja Henri Seger. Uusi jakso joka toinen perjantai. Palautetta ja toiveita voi lähettää sähköpostiin: viikonloppusoturit@gmail.com Instagram: @viikonloppusoturit Facebook: facebook.com/viikonloppusoturit</p>",
        "language": "fi",
        "author_name": "Tero Ikäheimonen & Henri Seger",
        "slug": "viikonloppusoturit",
        "cover": "20210818_174631_355a968a0ffb1d3612cbbbad82188bca.jpg"
    },
    {
        "podcast_id": 22307,
        "title": "The Vinyl Approach",
        "description": "Short bursts of insight about artists and their albums -- Rock, Jazz, and Beyond . . . \nPresented by Tom Wilmeth, Collector of Popular (and unpopular) Music.  ",
        "language": "en",
        "author_name": "Tom Wilmeth",
        "slug": "thevinylapproach",
        "cover": "20210105_211912_bc3941cd18a7bc74a95cceb489770b63.jpg"
    },
    {
        "podcast_id": 24171,
        "title": "丘瑙底河生鲜计划",
        "description": "这里是丘瑙底河乐队的一个即兴音乐项目：生鲜计划。这是一个由未经排练的即兴录音组成的项目。\n",
        "language": "zh",
        "author_name": "丘瑙底河 Khunathi",
        "slug": "khunathi-raw",
        "cover": "20210113_070015_d1f211765c86f9984219c1f4af9c0ef8.jpg"
    },
    {
        "podcast_id": 25125,
        "title": "Keepers Of The Flame - Classic Metal Podcast",
        "description": "Discussions of all things classic metal\n\nEach week one deep dive into a new release by a band with a classic metal sound\n\nReviews, interviews, and discussions on pertinent topics related to all things heavy metal",
        "language": "en",
        "author_name": "Darin Wall",
        "slug": "keepersoftheflame",
        "cover": "20210116_203519_08a1f66a22772ec0c9f7894c1408ad10.jpg"
    },
    {
        "podcast_id": 25131,
        "title": "The Album of the Day Show",
        "description": "The AOTD Show is a weekly round-up about the albums I was forced to listen to each week, M-F, by a random generator website. 50% experiment, 50% challenge, but 100% stupid. ",
        "language": "en",
        "author_name": "Ian Hooper",
        "slug": "albumofthedayshow",
        "cover": "20210119_203449_37b01da4ec4a033f7c841b1af3def25d.jpg"
    },
    {
        "podcast_id": 30968,
        "title": "Whack or Slaps",
        "description": "Welcome to Whack or Slaps, where we look back into the annals of 2000s indie music to determine if an album, or band, or even entire musical movement was actually good or just a product of the hype machine of its time. \n\nLike all great podcasts this is a direct spinoff of an unhinged and sketchy group text, that simply refuses to die. ",
        "language": "en",
        "author_name": "Caleb Ontiveros, Noah Ontiveros, and Adrian Ochoa",
        "slug": "whackorslaps",
        "cover": "20210208_051402_39aa26d0a6d55a9dfa3517c85655a19e.jpg"
    },
    {
        "podcast_id": 31169,
        "title": "We Sing the BASS Electric",
        "description": "Welcome to We Sing the BASS Electric, a podcast for bass lovers and music enthusiasts of all genres!  Join us as we revisit some of the most iconic recordings from different bassists, past and present, and discuss behind-the-scenes insights and stories about the most revered albums of our time - all from a bass player's point-of-view.  Hosted by bassist, composer and international recording artist Christian de Mesones, also known as Big New York.",
        "language": "en",
        "author_name": "Christian de Mesones",
        "slug": "wesingthebasselectric",
        "cover": "20210208_234907_968524dba60274b3aae334dbb0f2d9b2.jpg"
    },
    {
        "podcast_id": 32012,
        "title": "The Lost Podcast ",
        "description": "6 Young English lads discussing various Music based topics.\n\nHow could you go wrong?",
        "language": "en",
        "author_name": "The Lost Podcast",
        "slug": "thelostpodcast462",
        "cover": "20210211_200622_566a14136223e6b1f10f94e94d450777.jpg"
    },
    {
        "podcast_id": 32344,
        "title": "Shut The Funk Up Podcast",
        "description": "Nothing is off limits with the gruesome twosome. WellFed Boy and J Litt talk shop and sprinkle in music knowledge at the same time. The menu may change from each episode but the recipe will always stay the same…conversations with no compass. All aboard the giggle train, next stop is high five mountain!",
        "language": "en",
        "author_name": "WellFed Boy & J Litt The Kid",
        "slug": "shutthefunkuppodcastepisode1",
        "cover": "20211206_121217_debbd68f4fc6632d72f2ecb5f76b4a97.jpg"
    },
    {
        "podcast_id": 32710,
        "title": "Dad Educates Daughter",
        "description": "A Podcast where a Dad educates his Daughter on 80s music now that she's old enough to appreciate the songs and videos that she used to associate as outdated, rubbish music when being subjected to it in the car on the way to school.\nEach week Rebekah will listen to some 80s musicians her Dad, Russell, recommends and will then discuss on the Podcast what she thought of the songs, videos and image of the musicians. Russell will share information on chart placing and overall success of the singer/band.\nWe will find out if Rebekah thinks the music has stood the test of time as she gives her verdict as to whether it's a hit or a miss!",
        "language": "en",
        "author_name": "Russell and Rebekah",
        "slug": "dadeducatesdaughter",
        "cover": "20210214_140616_1d670828747fd4b3a225f06f3de62e9d.jpg"
    },
    {
        "podcast_id": 35413,
        "title": "Musicians' Teatime",
        "description": "Hosted by Gabi Chesnet and Cyd Levine, Musicians’ Teatime is a short interview-style podcast about the music industry past, present and future.\nGuests are welcomed to talk about their experience and relationship to music, but this can encompass their history, anecdotes, philosophy, life lessons or even casual talk relating to their life’s work. We raise topics relevant within today’s music industry and how they may relate to the state of things 20, 30, 40 years ago- or, you know, maybe not, if the mood’s rather up to ranking which modes sound the best.\n\nLie back in your seat, kick your feet up, grab a hot drink and tune in!\n\nAll episodes come with a full transcript and translation into French.",
        "language": "en",
        "author_name": "Acid Airplane Records",
        "slug": "musiciansteatime",
        "cover": "20211208_091230_bbe022705eb89e0def288def6f874bba.jpg"
    },
    {
        "podcast_id": 35611,
        "title": "Alteriior the Show",
        "description": "I don't know why I made a social media-based platform for music reviews, but I did and it's called Alteriior. I also don't know why I made a podcast that is derived from said platform, but I did and it's called Alteriior the Show (FKA Alteriior: But Make It a Podcast). This show looks at current releases from alternative scene genres such as metalcore, post-hardcore, pop punk, deathcore and anything else that falls under our weird little branch. Graphic designs with review scores for these releases can be found on the Alteriior Twitter and Instagram, while TikTok has retro reviews for past releases. Thanks for tapping in, and for the love of the game, let's make a scene.",
        "language": "en",
        "author_name": "Carlos Aguilar",
        "slug": "alteriiorpodcast",
        "cover": "20230102_010110_495fddd7171783c91b12025d98ff8780.jpg"
    },
    {
        "podcast_id": 38440,
        "title": "Johnny I. Presents: TKO - The Official Podcast",
        "description": "You are in the ring with DJ/Producer Johnny I.!  TKO is your go-to monthly podcast for the best in house, tech house, tribal, and techno ... and it's a total knockout!  ",
        "language": "en",
        "author_name": "Johnny I. ",
        "slug": "tko",
        "cover": "20210303_181630_94acbb07798b3848e9d5465a4737648c.jpg"
    },
    {
        "podcast_id": 44169,
        "title": "La Station ",
        "description": "La gang de métalleux de la province de Québec vous offrent son contenue en audio pour votre plaisir sonore ",
        "language": "fr",
        "author_name": "GMPQ Média",
        "slug": "gmpq",
        "cover": "20210325_040648_8dcff1c14d4ced0b3347ea8e88b502b7.jpg"
    },
    {
        "podcast_id": 44622,
        "title": "Ramblins Del Rey",
        "description": "A dude and his ramblings.",
        "language": "en",
        "author_name": "Rey",
        "slug": "elramblinrey",
        "cover": "20210402_154654_abcc1e539074ce29f15597a331ae4d42.jpg"
    },
    {
        "podcast_id": 48385,
        "title": "Travel Notes",
        "description": "Travel Notes is a show that uses music as a medium to explore the world and ways in which we are all connected. Hosted by Grace McNally, listeners will travel to the far corners of the globe - listening to people & musicians who illustrate the richness of the culture, music and similarities between seemingly different parts of the world. Pack your bags because our next trip is just around the corner!\n\n",
        "language": "en",
        "author_name": "Grace McNally",
        "slug": "travelnotes",
        "cover": "20210710_142736_829f4c97e50388bb763064a1146d5796.jpg"
    },
    {
        "podcast_id": 49199,
        "title": "Titanic Reaction with Tony Mengis",
        "description": "\"I was born and raised in Portland, Oregon, one of the best underground music scenes in the world. I got into the underground metal scene in the early eighties and found punk a few years later. Sometimes for better, sometimes for worse, punk has been one of the biggest influences of my life ever since. I've been in a few bands and toured every chance I got. I've been a booker at a few clubs and even owned a couple. With my background, I was excited to see my niece and nephew get into punk. I was also a little worried, but they are smarter than me so have avoided making the same mistakes. It made me wonder what, after almost 50 years, still attracts people to the subculture. Also, what keeps people involved into their 30’s, 40’s, 50’s and beyond. Charlie Harper is in his 70’s and has been touring since 1976. I’ll be talking to bands from around the world, and also people who keep punk alive behind the scenes. I’ll be asking them what attracted them to punk in the first place and what keeps them around for decades. I’m looking forward to the conversations, because sometimes I can't even answer it for myself. Beware, there will be a lot of talk about Portland. I moved to Amsterdam a few years ago and miss Portland every day, so I love to hear stories about it. Also, as much as I hate some things about it, it is one of the best cities on earth. Also beware, these are real stories- well, most of them are. They will contain tales of alcohol, drugs, sex and extreme violence and language that Mary Whitehouse would not approve of. Take caution and thank you listening, I appreciate each and every one of you.\"\nWritten and Hosted by Tony Mengis Produced & Edited by Chelsea Clyde Mixed and Mastered by Joe Mengis",
        "language": "en",
        "author_name": "Tony Mengis ",
        "slug": "titanic-reaction-with-tony-mengis",
        "cover": "20210425_003711_f69e9d711b6e4faa78d0164ffd18431a.jpg"
    },
    {
        "podcast_id": 50319,
        "title": "Radio Alegre Canada",
        "description": "Radio Alegre 24 hours la mejor musica Latina ",
        "language": "en",
        "author_name": "Radio Alegre Canada",
        "slug": "radioalegrecanada",
        "cover": "20220205_010246_b42328a9ac01fdae45da8379d5cadad7.jpg"
    },
    {
        "podcast_id": 52292,
        "title": "Flamenco Attitude",
        "description": "This is the podcast that explores all things flamenco- from playing and dancing to lifestyle and the great artists of the genre. Dive into this fascinating culture with the curious host and her expert co-host!\n\n\nOn Spotify you can hear not only the podcast but our music choices too: https://open.spotify.com/show/1Iy6Fivcc1tyqTHrTA3v8Z?si=_enDVRYvQ3-b2y9YzY5yyg&utm_source=copy-link\n\n\nTweet us @flamencopod",
        "language": "en",
        "author_name": "Flamenco Attitude",
        "slug": "flamencoattitude",
        "cover": "20210426_131254_8ce03272b5597d514c1fea2241a6cadd.jpg"
    },
    {
        "podcast_id": 53492,
        "title": "Get Off The Fence",
        "description": "\"Get Off The Fence\" is the premier music debate podcast, hosted by award-winning music journalist and television producer Matthew Allen. Each episode, Matthew debates with a new guest which album is the best, using five categories as criteria:\n\nBest Opening/Closing Track, \nBest Single Releases, \nWeakest Song, \nLyrical Content, \nX-Factor",
        "language": "en",
        "author_name": "Matthew Allen",
        "slug": "getoffthefence",
        "cover": "20210506_040334_55b27a327410d3d59124688e960ba23d.jpg"
    },
    {
        "podcast_id": 53878,
        "title": "San Marino 12 Points - een Vlaamse Eurovisie Songfestival Podcast",
        "description": "In San Marino 12 Points bespreken Jens & Pieter hun passie voor Eurovision. We bespreken de huidige en vorige edities, vertellen over deelnemers, achter de schermen-info, performances, en meer!",
        "language": "nl",
        "author_name": "Jens Vanneste & Pieter Verhoyen",
        "slug": "sanmarino12points",
        "cover": "20210504_154712_bfaabcf5b0cc91c459178fe813fb840f.jpg"
    },
    {
        "podcast_id": 55948,
        "title": "The Full Nelson Podcast",
        "description": "Hosted by Copywrite & D1",
        "language": "en",
        "author_name": "D1 Productions Ltd.",
        "slug": "thefullnelson",
        "cover": "20220405_080430_ebe8f944f70afbb14dfab3acac6e82e8.jpg"
    },
    {
        "podcast_id": 56381,
        "title": "The Goose Brothers Podcast",
        "description": "We talk about music. Our favorites, our hot takes, our unfiltered opinions about the rap game.",
        "language": "en",
        "author_name": "The Goose Brothers",
        "slug": "thegoosebrothers",
        "cover": "20210517_200650_7635d37edba7ec329a8b6be6773021c8.jpg"
    },
    {
        "podcast_id": 56950,
        "title": "The Aux Cord Chronicles",
        "description": "Each week we will take a deep dive into a certain genre or theme of music and outline the history and key elements of the given genre. Episodes include disco, neo-soul, ambient electronic, and many more!",
        "language": "en",
        "author_name": "Nate Price",
        "slug": "auxcordchronicles",
        "cover": "20211118_234812_746630f3e0a06c059e8fefac05cb5426.jpg"
    },
    {
        "podcast_id": 64579,
        "title": "How The Fuck Did We Get Here?",
        "description": "This podcast takes a deep dive into the backstory of any number of cultural phenomena that shock, appall or captivate modern audiences. On each episode you can expect the hosts, Mason, Nader and Chuck to ask the question \"how the fuck did we get here?\" of topics like Trap Metal, Drill Rap, or Pop Punk Revival music. Join us, as we strap into our rickety time machine and try to explain things that we only learned about a week in advance!",
        "language": "en",
        "author_name": "Mason, Nader and Chuck",
        "slug": "howthefpod",
        "cover": "20210714_190241_a5d0573423643fd28e4333adf62576cb.jpg"
    },
    {
        "podcast_id": 65404,
        "title": "Rising Music Distribution ",
        "description": "This podcast is for the distribution of my newly released album called \"Pain Without A Cause\" @ https://open.spotify.com/artist/75rcoZN43VsmGiFeqewZnK",
        "language": "en",
        "author_name": "Daniel Joseph Chiasson",
        "slug": "new-releases",
        "cover": "20211220_091237_a03905fb24c42e0a11c2ae42725533cb.jpg"
    },
    {
        "podcast_id": 66871,
        "title": "Link In The Chain",
        "description": "Link In The Chain is a bi-weekly podcast that aims to reveal the depth and vastness of Hip Hop one episode at a time.",
        "language": "en",
        "author_name": "Jillian Grace",
        "slug": "linkinthechain",
        "cover": "20210707_124959_5b0e8c516581410943f19ba6daafd0ac.jpg"
    },
    {
        "podcast_id": 68906,
        "title": "Bitter Sweet & Twisted Records Podcast",
        "description": "Hosted by lifelong music fans Vince and Bobbie, the Bitter Sweet & Twisted Records Podcast delves into albums, ranging from obscure to well-loved, that they've deemed Treasures from the Bargain Bin.",
        "language": "en",
        "author_name": "Bitter Sweet & Twisted Records",
        "slug": "bittersweetandtwistedrecords",
        "cover": "20210719_023243_5997cb6e69cf0058ad808c7b94f936bc.jpg"
    },
    {
        "podcast_id": 70151,
        "title": "Het Kollektief Podcast ",
        "description": "Ben je net als de leden van Het Kollektief ook zo'n muziekfanaat of wil je iets meer te weten komen over het onderwerp? Dan ben je zeker op de juiste plek. Hier praten Isaak, Miel en Pepijn in een informele setting over een verscheidenheid aan interessante, muzikale thema's; ook wordt er gezorgd voor een zee aan boeiende onderwerpen en ongeweten feiten. ",
        "language": "nl",
        "author_name": "Het Kollektief ",
        "slug": "het-kollektief-podcast",
        "cover": "20210726_161511_f8e95a4774d82ef79eda509e5848dc11.jpg"
    },
    {
        "podcast_id": 72517,
        "title": "The Scheme Team Podcast",
        "description": "Join the Scheme Team every week as they host the Scheme Team Podcast! Following a different theme each week, the team often go on to talk about their own personal stories growing up in Scotland and enjoy reminiscing. Each week follows different themes from gaming to movies to music. Primarily a YouTube group you can also watch their podcast on their YouTube channel!",
        "language": "en",
        "author_name": "The Scheme Team",
        "slug": "schemeteampodcast",
        "cover": "20210808_212824_f9e4d262114cb696d1854b9a5ebf969f.jpg"
    },
    {
        "podcast_id": 74469,
        "title": "Crazy Radio Stories",
        "description": "Radio didn't used to be all about corporate consolidation and out-of-market voicetrackers.  There was a time when we had full staffs! And with that many dysfunctional people in one building, some pretty wild stuff used to happen - both on and off the air. Chances are, if you worked in this business, you've got some crazy stories to tell. Crazy Radio Stories is the podcast that tells the world how radio USED to be.  Few rules, and in some cases, even fewer morals.  If you've got a crazy radio story to tell, email us - crazyradiostories@gmail.com.",
        "language": "en",
        "author_name": "Crazy Radio Stories",
        "slug": "crazyradiostories",
        "cover": "20210819_170223_d341821c8a6f346a97581115cd77d46d.jpg"
    },
    {
        "podcast_id": 78394,
        "title": "Música Chisme y Cubitas",
        "description": "Porque la buena música tiene un chismecito atrás. \n\nPodcast de todo música y más, para los fanáticos de lo que es bueno en la vida. \n\nCon tus hosts favoritos: Fernando Del Conte, Jesús Iturralde & Javi De La Vega",
        "language": "es",
        "author_name": "Música Chisme y Cubitas",
        "slug": "musicachismeycubitas",
        "cover": "20210909_225048_60df8cf344e689af234561acf5d9da61.jpg"
    },
    {
        "podcast_id": 79481,
        "title": "Country On Me Podcast",
        "description": "Country On Me Podcast is about all things country music. We are hopefully going to do lots of interviews with people from the country music world. I hope y'all enjoy the podcast.",
        "language": "en",
        "author_name": "Max Scheriff",
        "slug": "countryonme",
        "cover": "20210916_010905_5dedf00981c84505cdd77288da6045dd.jpg"
    },
    {
        "podcast_id": 81118,
        "title": "Caropop",
        "description": "There may be nothing more inspiring and entertaining than relaxed, candid conversations among creative people. Mark Caro, a relentlessly curious journalist and on-stage interviewer, loves digging into the creative process with artists and drawing out surprising stories that illuminate the work that has become part of our lives. The Caropopcast is for anyone who wants to dig deeper into the music, movies, food and culture that they love.",
        "language": "en",
        "author_name": "Mark Caro",
        "slug": "thecaropopcast",
        "cover": "20210923_222107_f86600be468f0a94861a761a0e383d24.jpg"
    },
    {
        "podcast_id": 83176,
        "title": "Babblin' Bangers",
        "description": "<p>I mostly babble about some bangers, but in a good way.</p>",
        "language": "en",
        "author_name": "Felipe Beraldi",
        "slug": "berastunes",
        "cover": "20230918_070948_bbd22202b2010f616e4bd400dd6636ad.jpg"
    },
    {
        "podcast_id": 83946,
        "title": "Toons With Goons",
        "description": "Anna and Brynne are two best friends that are exploring different artists, albums, songs, and genres of music. They will be doing several deep dives into artists' backgrounds and music history. Along with this, they will explore the concert settings and share experiences and tips on how to go about concerts. Come with Anna and Brynne as they widen their music taste and explore new music!\n",
        "language": "en",
        "author_name": "Anna Hadzinski and Brynne Stewart",
        "slug": "toonswithgoons",
        "cover": "20211008_022528_393134989bad30ad465be7bae42be788.jpg"
    },
    {
        "podcast_id": 86444,
        "title": "Chant School",
        "description": "Love Gregorian Chant but can't sing it? The Chant School podcast is designed to help you sing the ancient chants of the Church with ease. \n\nIn the Chant School, you will learn the most ancient melodies and texts in the Christian tradition.  St. Hugh of Cluny once spoke of how the learning, practicing, and singing of Gregorian chant is a sure way to grow in holiness, in closeness to the Word, and in submission to the discipline of singing God’s praises. Floriani has taken these words to heart, and it is our intent to inspire and educate the next generation of Catholic musicians in the spirit of this beautiful inheritance.  We hope you enjoy learning how to sing Gregorian Chant -- the greatest artistic treasure of the Catholic Church!",
        "language": "en",
        "author_name": "Floriani",
        "slug": "chantschool",
        "cover": "20211022_004123_85dd8871bf86541ffa4e5c3600eced74.jpg"
    },
    {
        "podcast_id": 88630,
        "title": "KULTÚRA, ÖKOLÓGIA, BOTANIKA - KERT A KÖBÖN",
        "description": "Kert a köbön - avagy a tudományos-kulturális szórakoztatás az ökológiai szemléletformálás oltárán.\nAz Ökológiai Kutatóközpont egyedülálló projektje 2021 nyarán izgalmas estekkel, valamint egy háromnapos fesztivállal várta a látogatókat Vácrátóton, a Nemzeti Botanikus Kertben.\nAz ország legjelentősebb ökológiával foglalkozó intézeteit tömörítő Ökológiai Kutatóközpont útjára indította a Kert a köbön eseménysorozatát, amely tényleg köbre emelte hazánk első számú botanikus kertjét: egymás mellé állította a kultúrát, az ökológiát és botanikát. \nA multidiszciplináris és multikulturális programsorozat fő célja volt olyan témák boncolgatása ‒ közérthetően és nyári könnyedséggel ‒, amelyek fontosak az ökológiai szemléletformálás szempontjából. A projekt hidat teremtett a tudományos és művészeti megközelítés között, hogy a valóság megértéséhez egy átfogóbb képet kapjon a társadalom.\nA programsorozat beszélgetésekkel összekötött koncertélményekkel várta a közönséget. A borkóstolós, nyár esti társalgások sajátja volt, hogy különböző területről érkeztek szakemberek: többféle tudományterületről, a gyakorlati életből, a művészetből és a médiából egyaránt. \nA nyár végén háromnapos Kert a Köbön Fesztivállal zárult a különleges és hagyományteremtő kezdeményezés, amelynek középpontjában az ökológia, az irodalom és a zene állt. \nMindez egy kétszáz éves történeti kertben, amely kiemelkedő természeti és kulturális gazdagságával fogadta be az eseményeket.",
        "language": "hu",
        "author_name": "Ökológiai Kutatóközpont",
        "slug": "kert-a-kobon",
        "cover": "20211103_164629_d5cfcfd45bcf8e5661db502f2bace758.jpg"
    },
    {
        "podcast_id": 90867,
        "title": "The Sound of Cinema",
        "description": "Zonder muziek blijft er weinig over van een film. Want hoe eng is Jaws zonder geluid, hoe episch Star Wars zonder aanzwellend orkest? En hoe verliefd zijn Olivia Newton John en John Travolta zonder discobeat? Film schuurt, film knalt, film zucht, film klikt. En Filmhuis Den Haag laat het allemaal horen. In deze podcast reis je door de geschiedenis van de filmmuziek. Open je oren voor intiem pianospel, melancholische strijkers, opzwepende discobeats... of juist helemaal niets. Luister mee en je ziet meer!\n\nThe Sound of... is een klinkend programma dat schuurt, knalt, zucht en klikt. Met talks, podcasts, playlists, expo’s en meer, open je je ogen voor alles wat film te bieden heeft. Nieuwe geluiden, vertrouwde geluiden, tegengeluiden – Filmhuis Den Haag laat ze weerklinken. Luister mee en je ziet meer!\n\nMeer weten? Ga naar https://filmhuisdenhaag.nl/the-sound-of-cinema",
        "language": "nl",
        "author_name": "Filmhuis Den Haag",
        "slug": "fhdhthesoundofcinema",
        "cover": "20211116_180414_ed8c0e56dbb73a7d65fb3bb839ec31f2.jpg"
    },
    {
        "podcast_id": 96843,
        "title": "12 Notes",
        "description": "Music, like people, is a journey. Through time and space, reaching all four corners of the globe. Throughout history, both music and social justice have been so deeply intertwined because, ultimately, both depend on the way we feel and the way we interact with each other. Music, like us, is always finding new ways to be unique. But ultimately, it's all made up of the same 12 Notes.",
        "language": "en",
        "author_name": "Andrea Crisp",
        "slug": "12notes",
        "cover": "20211223_101206_95ec6647445ef73c666ae238570f3bdd.jpg"
    },
    {
        "podcast_id": 96967,
        "title": "Far Off Sounds Podcast",
        "description": "Far Off Sounds is a webseries of documentaries about the infinite story of music on Earth. From harsh industrial noise performed for fish in an aquarium, to a heavy metal cruise ship in the Caribbean, Far Off Sounds has been filming the ways that humans use and engage with music for a decade. \n\nThe Far Off Sounds Podcast expands on this project. The show's creators, Jacob Hurwitz-Goodman and Nick George, interview ethnomusicologists, experimental musical meme pedagogues, musicians, label artists, journalists and others in long-form conversations about music, as well as providing a behind-the-scene glimpse at the doc series' production.",
        "language": "en",
        "author_name": "Nick George and Jacob Hurwitz-Goodman",
        "slug": "faroffsounds",
        "cover": "20211222_071228_cd4e746347617b04f8d01970bfd65242.jpg"
    },
    {
        "podcast_id": 97808,
        "title": "Safe House Radio - House | Techhouse | EDM | Dance",
        "description": "<p>Monthly new Music</p>",
        "language": "en",
        "author_name": "Patrick Wiemer",
        "slug": "patrickwiemer",
        "cover": "20230125_020104_9eb3149dd1107eb9ca8eb4f94ea7381e.jpg"
    },
    {
        "podcast_id": 98523,
        "title": "Junior Appalachian Musicians Presents",
        "description": "Junior Appalachian Musicians (J.A.M.) presents a podcast relating to traditional Appalachian Music. Interviews, histories, biographies with current and historic figures within the genres of Appalachian bluegrass, old-time, and traditional music. ",
        "language": "en",
        "author_name": "Jim Lloyd",
        "slug": "jampresents",
        "cover": "20220103_030112_1fc76c60f678d6354b0dcfc6f6a82c82.jpg"
    },
    {
        "podcast_id": 101467,
        "title": "Que Viva La Musica - Vicki Sola's Legacy",
        "description": "LISTEN to Vicki Solá's legacy, QUE VIVA LA MÚSICA on 89.1FM or WFDU. FM -- this and every SATURDAY at 1PM - 6PM EST! Join the crew: Marysol Cerdeira Rodriguez, Jose Calderon, and King Louis Vazquez as QVLM balances our musical selections between recordings of well-known tunes and classics we've enjoyed throughout the decades as well as new songs from different artists.\n\nListen in Saturday afternoons from 1-6pm on 89.1fm, online at wfdu.fm #quevivalamusica\nTUNE IN on WFDU 89.1 FM on your radio dial. Stream it live around the globe at www.wfdu.fm, or via your mobile device/tablet on the free WFDU app. Live streams are also available on IHeart and TuneIn websites and mobile apps.\n#QueVivaLaMusica #WFDU #VickiSola #VickisLegacy #MarysolCRodriguez #DJJose #JoseCalderon #DJKingLouie #LouisVazquez #QVLM #NYC #Salsa #FM #Radio #Charanga #SonMontuno #Fania #quadsquad",
        "language": "en-us",
        "author_name": "Jose Calderon",
        "slug": "djjosecalderon",
        "cover": "20220117_070146_cfd1a439a4ce1b301a41e3a3d588611b.jpg"
    },
    {
        "podcast_id": 102906,
        "title": "Black Infamous Radio Show ",
        "description": "Black Infamous Radio Show on First Social Radio in Israel Hosted By Me , Idan Naftali.\n\nEverything That's Hot ,New & Interesting On Black Music. 🎶📻💯🎶🎶🎶🎶",
        "language": "en",
        "author_name": "Idan Naftali",
        "slug": "blackinfamousradio",
        "cover": "20220212_070219_0bd22cafc43749c9b122891f9ccf6b05.jpg"
    },
    {
        "podcast_id": 103184,
        "title": "The Mambo Machine with Los Compadres DJ Frankie Tambora & DJ Jose Calderon",
        "description": "The Mambo Machine with Los Compadres DJ Frankie Tambora & DJ Jose Calderon are on the air every Friday (unless otherwise indicated) from 11pm-2am honoring the greats playing music of yesterday, today, and always, whipping out Salsa Dura with new material and stellar classics!\n\nWe hope to have everyone tune in and enjoy the music with us as we feature the best of Salsa Dura of yesterday, today and always!\n\nThats WKCR.ORG online evenings (EST)!\nWww.wkcr.org on the web and for smart devices download TuneIn radio and search for: WKCR 89.9FM\n",
        "language": "en",
        "author_name": "Jose Calderon",
        "slug": "djjosecalderon2",
        "cover": "20220124_010113_a7243d181cf6ac512c72a55a84077c15.jpg"
    },
    {
        "podcast_id": 104451,
        "title": "Queers in the Club",
        "description": "A new music podcast with an LGBTQ+ focus. Host George showcases new drops from queer artists, producers, DJs and songwriters, spanning a variety of pop, hip-hop, indie and alternative genres.",
        "language": "en",
        "author_name": "George Baxter",
        "slug": "queersintheclub",
        "cover": "20220128_040127_064e9b6484f93ff4eeaad809b788dcd8.jpg"
    },
    {
        "podcast_id": 105197,
        "title": "Workingman's Pod",
        "description": "Join Dead Heads Alex and Dave in conversation about the Grateful Dead. Each episode, the Heads listen to the a different show from the Grateful Dead's legendary touring career. In addition to concert reviews, you'll get a dose of history, stats, facts, and surprises along the way. Get on the bus for Workingman's Pod: Talkin' Dead with Alex and Dave!",
        "language": "en",
        "author_name": "Alex & Dave",
        "slug": "workingmans-pod",
        "cover": "20220204_020249_e9b76f63eaaf2761bb1bf9c118e858e2.jpg"
    },
    {
        "podcast_id": 108645,
        "title": "The Back Lounge Podcast",
        "description": "Touring Guitar Tech and YouTube personality TankTheTech hosts musicians, artists, roadies, content creators, and anyone else to have conversations music, music news, touring, and anything else that comes up.",
        "language": "en",
        "author_name": "TankTheTech",
        "slug": "tankthetech",
        "cover": "20221109_021135_477000d4a2dd9a0f745b661c6a682257.jpg"
    },
    {
        "podcast_id": 108686,
        "title": "Groove Train Radio",
        "description": "Step aboard the GROOVE TRAIN and take a sonic journey transcending time, tastes and genres to seek out and explore an ongoing program of R&B, Roots & Soul, Blues, Folk & Jazz & Rock \"n\" Roll, some Country & Funk and before we stop we're not afraid to play some Pop. Any sound that makes you move and broadcasts a deep and definitive groove.... So pop those fingers, tap those toes, shimmy those shoulders, shake your hips to and fro..... \nEvery Wednesday afternoon 4:00pm to 6:00pm \nALL ABOOAAARRRD... The GROOVE TRAIN...\n",
        "language": "en",
        "author_name": "Jamie",
        "slug": "groove-train",
        "cover": "20220218_060201_f384b879dd08ddba17af3f60603e3e06.jpg"
    },
    {
        "podcast_id": 109584,
        "title": "Stefan och Ulfs podcast",
        "description": "Välkommen till denna podcast där två reliker från en svunnen tid dammar av minnen från förr. Du får äran att i varje avsnitt följa Stefan och Ulf på deras resa från att de först gjorde sin bekantskap i lumpen år 1983, till idag nästan 40 år senare. Resan är fylld med anekdoter och musik från det glamorösa 80-talet, poppande 90-talet hela vägen till idag. Tillsammans skissar Stefan och Ulf ett vackert om än sällsamt porträtt av en vänskap som bestått tidens prövningar. Häng med!",
        "language": "sv",
        "author_name": "Truls Herlin",
        "slug": "stefanochulfettsamtal",
        "cover": "20220702_040725_ad4b0f423df0e399674c95876398bc58.jpg"
    },
    {
        "podcast_id": 110660,
        "title": "streetRAPisHistory",
        "description": "Los Angeles history through rap.\n\nLA is full of history and culture. Many of the major streets were named after people who were influential in California settlement and development. In this podcast, we dive into the non-fiction stories of California settlement, presenting each as a rap. Prepare to laugh, learn, and be entertained. ",
        "language": "en",
        "author_name": "Eric Hecht",
        "slug": "streetrapishistory",
        "cover": "20220222_060220_7239a61d7682fd32fd4dc1dc1ef7698f.jpg"
    },
    {
        "podcast_id": 112085,
        "title": "52 The Podcast",
        "description": "\"52 – The Podcast\" with Kristian Bush and Cindy Watts celebrates the stories behind Bush's new and award-winning songs. Original episodes will be released for free every week for 52 weeks. \n\nBush, half of the Grammy-winning duo Sugarland, half of the critically acclaimed Americana folk-rock duo Billy Pilgrim and a founding member of rock group Dark Water, is releasing 52 songs over the next year in honor of his 52nd birthday on March 14, 2022.  \n\nThe album project, also called \"52,\" will come out in four volumes over the next 12-to-18 months. \n\nEach episode of \"52 – The Podcast\" will explore the relationship between one of the popular songs from Bush's back catalog and one of the new songs from \"52.\" Bush and Watts give insight into the songwriting process, the singer/songwriter's day-to-day life, and the musical journey that took him from his hometown of Sevierville, Tenn., to Atlanta, Nashville, and around the world as part of his various bands. \n\nFun fact: Bush and Watts, a CMA Award-winning country music journalist, are from the same hometown. They share poignant moments, hilarity and plenty of dad jokes as they wind their way through their middle-age in the music business experience and Bush's life of songs. ",
        "language": "en",
        "author_name": "Kristian Bush and Cindy Watts",
        "slug": "52thepodcast",
        "cover": "20220301_120311_7c163ffa75c319615ea781e489ce2f21.jpg"
    },
    {
        "podcast_id": 112844,
        "title": "Gulab Gang ",
        "description": "A sonic experience for world music, interviews, perspectives, and cultural resurgence. Digging deep into diasporic heritages & bringing it back to the soul roots. Interviewing primarily QTBIPOC at the forefront of grassroots and underground art scenes whether it be music, design, performance, art etc. ",
        "language": "en",
        "author_name": "GULAB GANG",
        "slug": "gulabgang",
        "cover": "20220304_020320_af523db13e3c3a899c89c94a8cde3f99.jpg"
    },
    {
        "podcast_id": 112879,
        "title": "Big Persona",
        "description": "We talk about music. We talk about rap. We talk about sounds. We talk about experiences. We talk about the culture. WE LIVE FOR THE MUSIC, FOR THE CULTURE.\n",
        "language": "en",
        "author_name": "Landon Roberts",
        "slug": "bigpersonapod",
        "cover": "20220304_060320_5acb8de659f371e5ecea598aa3b83f7a.jpg"
    },
    {
        "podcast_id": 114079,
        "title": "Rock & Roll Nightmares",
        "description": "<p>Hosted by Staci Layne Wilson and based on the Rock &amp; Roll Nightmares horror and true crime book series, this irreverent podcast on rock, punk, grunge, etc., features interviews with musicians, writers, photographers, artists, and filmmakers. It's only rock &amp; roll, but we like it!</p>",
        "language": "en",
        "author_name": "Staci Layne Wilson",
        "slug": "rockandrollnightmares",
        "cover": "20230308_020326_c6a0dfdadf2d67d0452cf655c0f010e9.jpg"
    },
    {
        "podcast_id": 114180,
        "title": "Latin American & Iberian Song",
        "description": "</p> Hosted by soprano and musicologist Patricia Caicedo, the 𝗟𝗮𝘁𝗶𝗻 𝗔𝗺𝗲𝗿𝗶𝗰𝗮𝗻 𝗮𝗻𝗱 𝗜𝗯𝗲𝗿𝗶𝗮𝗻 𝗔𝗿𝘁 𝗦𝗼𝗻𝗴 𝗣𝗼𝗱𝗰𝗮𝘀𝘁 is a program to discover composers, poets, songs, and everything about the world of Latin American and Spanish songs. 𝗠𝘂𝗹𝘁𝗶𝗹𝗶𝗻𝗴𝘂𝗮𝗹 𝗣𝗿𝗼𝗴𝗿𝗮𝗺 𝘄𝗶𝘁𝗵 𝗘𝗽𝗶𝘀𝗼𝗱𝗲𝘀 𝗶𝗻 𝗘𝗻𝗴𝗹𝗶𝘀𝗵, 𝗦𝗽𝗮𝗻𝗶𝘀𝗵, 𝗣𝗼𝗿𝘁𝘂𝗴𝘂𝗲𝘀𝗲, 𝗮𝗻𝗱 𝗖𝗮𝘁𝗮𝗹𝗮𝗻.</p>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       </p>  🔴Conducido por la soprano y musicóloga Patricia Caicedo, el 𝗟𝗮𝘁𝗶𝗻 𝗔𝗺𝗲𝗿𝗶𝗰𝗮𝗻 𝗮𝗻𝗱 𝗜𝗯𝗲𝗿𝗶𝗮𝗻 𝗔𝗿𝘁 𝗦𝗼𝗻𝗴 𝗣𝗼𝗱𝗰𝗮𝘀𝘁 es un programa semanal para descubrir compositores, poetas, canciones y todo sobre el mundo de la canción artística latinoamericana e ibérica. El programa es multilingüe con episodios en inglés, español, portugués y catalán. ",
        "language": "en-us",
        "author_name": "Patricia Caicedo",
        "slug": "latin-american-and-iberian-song",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 114536,
        "title": "Aye Man Say Man Podcast",
        "description": "<p>“Where Life Lessons Meet Hip Hop Sessions” P, Steph and Nick G get into life lesson growing up and how those life lessons made them who they are today. They will also bring “Hip Hop Sessions” to you in the form of going back and reviewing classic 90’s hip hop albums as they dive into that time period in their personal lives!</p>",
        "language": "en",
        "author_name": "Aye Man Say Man Podcast ",
        "slug": "ayemansaymanpodcast",
        "cover": "20230823_120858_f902c2ff0fd8345c6c589e62fda6ce11.jpg"
    },
    {
        "podcast_id": 115831,
        "title": "More Than A Playlist ",
        "description": "More Than a Playlist is a podcast where Carol and Jake create uniquely curated themed playlists. In this episode Jake and Carol discuss their playlist, Hee Bee Bee Gees, which analyzes songs that are great but on further listen, give off you the Heebee Jeebees. Peppered with pop culture trivia and anecdotes, as well as unique takes and opinions, this podcast will make you laugh but also, may make you cringe.",
        "language": "en",
        "author_name": "More Than A Playlist",
        "slug": "morethanaplaylist",
        "cover": "20220317_020308_3bc6fda9f9fc6d16d610a947719a229e.jpg"
    },
    {
        "podcast_id": 116405,
        "title": "The D&M - Deep House Made from Jazz, Soul and Love",
        "description": "Self-titled dance music programme, broadcast weekly from Orbital Radio in Sydney, AUS.\nGenres played: \nHouse: Deep, Soulful, Jazz-infused, lo-fi, Chicago, classic, afro, funky, jackin, disco. Nu-disco, techno, breakbeat, electronic... @deepnmeaningfuldjs",
        "language": "en",
        "author_name": "Darcy Doogan and Megan X",
        "slug": "thedandm",
        "cover": "20220917_050930_33543fb44e87ca477d359f0501b175a8.jpg"
    },
    {
        "podcast_id": 117414,
        "title": "outline radio promos & podcasts",
        "description": "Algunos promos de outline radio la casa de las canciones buenas.\nwww.outlineradio.com",
        "language": "es",
        "author_name": "Jaime Kurt",
        "slug": "outlineradio",
        "cover": "20220710_010759_c64d2f0eeca4122e1462fd987c2d2200.jpg"
    },
    {
        "podcast_id": 124030,
        "title": "Tuesday Night Talk",
        "description": "Conversations with musician, sound engineers, artists and technicians of the music industry, mainstream or experimental.\nTuesday Night Talk is a part of Real Sound Reviews YouTube Channel.",
        "language": "en",
        "author_name": "Gilles DELES-VELINS",
        "slug": "tuesdaynighttalk",
        "cover": "20220423_060416_957f2af7f418e3015682b0a18cf53d0b.jpg"
    },
    {
        "podcast_id": 124470,
        "title": "Lord Byng Music Podcast",
        "description": "The Lord Byng Music Podcast is a student-made music podcast, featuring a variety of recorded musical performances from Lord Byng Secondary School’s student ensembles. Founded by the Lord Byng Podcast Club, it arose in response to the Covid-19 pandemic crisis to make sure that listeners can enjoy Byng’s music anytime, anywhere!",
        "language": "en",
        "author_name": "Lord Byng Podcast Club",
        "slug": "lbsspodcastclub",
        "cover": "20220525_040517_b25006b763fcf94b17aadc471d61664a.jpg"
    },
    {
        "podcast_id": 125284,
        "title": "Enzo Jannacci: l'importante è esagerare",
        "description": "Lo scrittore e giornalista piacentino Nando Mainardi, autore tra gli altri de \"L'importante è esagerare: storia di Enzo Jannacci, edito da Vololibero, racconta i momenti salienti della mirabolante ed estrema vita artistica di Jannacci davanti al pubblico di Spaziomusica (PV), con interventi musicali di Nadir Scartabelli (chitarra/voce) e Antonio Curedda (piano/fisarmonica). Tre episodi per altrettanti momenti importanti, legati a tre sue indimenticabili canzoni.",
        "language": "it",
        "author_name": "Nando Mainardi",
        "slug": "importanteesagerare",
        "cover": "20220707_050715_279ef7334acb6fa5a3a92860497a7340.jpg"
    },
    {
        "podcast_id": 126299,
        "title": "Disney Latino",
        "description": "Versiones en español de canciones de Disney",
        "language": "es",
        "author_name": "Disney LA",
        "slug": "disneylatino",
        "cover": "20220504_030546_5f6a4096d7d3a58da4692cd4f05b2345.jpg"
    },
    {
        "podcast_id": 126595,
        "title": "Siendo Acordes",
        "description": "Este podcast surge del sueño de Emilio González Martín, profesor de guitarra desde hace unos años y consumidor de música durante toda la vida. Quiso que la música, ese arte tan difícil de entender, pudiera ser algo de lo que hablar en la vida cotidiana. Por eso, este podcast versará sobre canciones, discos, historias de músicos y anécdotas que os van a hacer disfrutar, sin ninguna duda.\n\n¿Cuándo? Todos los jueves a las 13:00 tendrás un nuevo episodio de tu nuevo podcast favorito, \"Siendo Acordes\". No lo dudes y dale al play. Gracias por tu confianza y nos escuchamos todos los jueves. No te arrepentirás, el único requisito es que te guste la música. Adelante.",
        "language": "es",
        "author_name": "EMILIO GONZÁLEZ MARTIN",
        "slug": "siendo-acordes",
        "cover": "20220505_070519_0440a9e4aaaf6dc936bc88fe959e4c0a.jpg"
    },
    {
        "podcast_id": 126724,
        "title": "Nawet lubię musicale - podcast Teatru Syrena",
        "description": "<p>\"Nawet lubię musicale\" to podcast, który prowadzi dyrektor artystyczny Teatru Syrena Jacek Mikołajczyk. O teatrze, w którym jednocześnie się gra, śpiewa i tańczy, wie całkiem dużo. Pisze o nim książki, artykuły, uczy o nim, tłumaczy dla niego piosenki, reżyseruje jego spektakle. Maniakalnie ogląda wszystko, co w tym teatrze wyprodukuje się w Polsce i na świecie. I ciągle nie przestaje go lubić. Mikołajczyk w swoim podcaście opowiada o wszystkim, co w musicalu jest naj – największe, najciekawsze, najdziwniejsze, najbardziej przebojowe. O Broadwayu i okolicach. O twórcach i widzach. O producentach. O musicalowych skandalach i sensacjach. O musicalach.</p>",
        "language": "pl",
        "author_name": "Jacek Mikołajczyk",
        "slug": "nawetlubiemusicale",
        "cover": "20220506_110520_04638b646b9bb5bd3e66fb7eb4edd04f.jpg"
    },
    {
        "podcast_id": 126796,
        "title": "Songs & Stories: Supplemental Jazz Edition",
        "description": "<p>The ongoing series, taking a deep dive in to Jazz; talking about the musician's, their music, and the lives they led. Photography by Laura Collins</p>",
        "language": "en",
        "author_name": "Paul Atkinson",
        "slug": "songs-and-stories-supplemental-jazz-edition",
        "cover": "20230501_060505_4bc9e5a21ce94caa8dec7f0667f2b986.jpg"
    },
    {
        "podcast_id": 126804,
        "title": "Hotel Blues. Ràdio Ciutat de Badalona",
        "description": "Des de 1998, Hotel Blues ofereix setmanalment, el bo i millor del rock, el blues i la música d'arrel americana. Des dels clàssics del rock als nous valors de l'escena blues, passant per les millors bandes i solistes de l'americana music.\nViu dues hores com si fossis en un Juke Joint del Mississippi, una cafeteria enmig de la nit americana o una sala plena fins a dalt saltant al ritme de les guitarres més contundents del rock.",
        "language": "ca-es",
        "author_name": "Radio Ciutat de Badalona",
        "slug": "hotelblues",
        "cover": "20220506_070555_76e93336cf8c0aaf97931e8c884508b2.jpg"
    },
    {
        "podcast_id": 128376,
        "title": "The Unmade Bed",
        "description": "One man and his wife from Hobart Tasmania, musing on random topics from their week that was. Special focus on music and current events.",
        "language": "en",
        "author_name": "Adrian & Bree Charlesworth",
        "slug": "unmadebed22",
        "cover": "20220515_010507_faa9a1ce109f4c81cb4b64480624964a.jpg"
    },
    {
        "podcast_id": 129501,
        "title": "Onna Come Up Radio",
        "description": "Steam your favourite DJ's and listen on demand.",
        "language": "en",
        "author_name": "On Demand",
        "slug": "onnacomeupradio",
        "cover": "20221107_041128_b89d3cce91deb2e16de449bc95ad5ca3.jpg"
    },
    {
        "podcast_id": 130551,
        "title": "Peace Love and Ketchup",
        "description": "Current topics, album review, and a little bit of The Word.",
        "language": "en",
        "author_name": "Philip Crowder",
        "slug": "peaceloveandketchup",
        "cover": "20220526_060505_078325db798d1c106e03f1845bd04560.jpg"
    },
    {
        "podcast_id": 132597,
        "title": "The Music List",
        "description": "The Music List Podcast takes a recipe for entertainment- a hotly debated musical topic, three siblings who love to argue, and open mics, and then tosses them into a mixing bowl. Shake up the bowl, and fireworks happen. The goal is to take a musical question such as greatest voice in a genre, best album during a decade, or best song by a group and create a master list to answer that question. The real battle begins when the siblings have to agree on the top five. Join Heather, Ben, and Beth, as they tackle the topics, the facts, and each other to make the definitive Music Lists.",
        "language": "en",
        "author_name": "The Music List",
        "slug": "themusiclist",
        "cover": "20220606_060621_8c68238926909ace22b251ecd6805706.jpg"
    },
    {
        "podcast_id": 132872,
        "title": "428M 78K",
        "description": "yt play",
        "language": "en-us",
        "author_name": "Fer",
        "slug": "pug",
        "cover": "20220608_020618_3ea9d8a2a2d43dee88de97ccaf37bd60.jpg"
    },
    {
        "podcast_id": 136907,
        "title": "Cosas educativas.",
        "description": "<p>En este canal, comparto algunas actividades académicas realizadas en esta travesía llamada <strong><em>licenciatura. </em></strong>Espero lo disfruten ( :</p>",
        "language": "es",
        "author_name": "Karla Abigaíl Trejo Veyna",
        "slug": "benmacpodcastetd",
        "cover": "20230510_090524_9783b6c3770b63962dc31f51e2846ed2.jpg"
    },
    {
        "podcast_id": 137528,
        "title": "Jazz Backstory",
        "description": "The podcast series, Jazz Backstory, is based on the holdings of the Fillius Jazz Archive (https://www.hamilton.edu/campuslife/arts-at-hamilton/jazzarchive) located at Hamilton College (https://www.hamilton.edu/), in Clinton, New York. Established in 1995, and dedicated in 2013 in honor of Milton F. Fillius, Jr. ’44 and Nelma “Nikki” Nenneau Fillius, the Fillius Jazz Archive holds a collection of over 440 videotaped interviews with jazz musicians, arrangers, writers and producers. The wide-ranging collection includes interviews with sidemen, soloists and band leaders who have performed from the 1920s through the present. \n\nJazz Backstory podcast episodes will feature interview excerpts focused on topics inherent to the creative life. Artists, both famous and unsung, relate these tales in their own jazz inflected vocabulary. Original music and commentary from the host help set the tone, both educational and swinging.\n\nMonk Rowe (https://www.monkrowe.com/), creator of the podcast series, Jazz Backstory, and the Joe Williams Director of the Fillius Jazz Archive, conducted the majority of  the interviews and has presented programs about the resource at conferences for the Jazz Education Network, the Music Library Association, and the International Society of Music Educators. Monk co-authored with Romy Britell  the book Jazz Tales From Jazz Legends on Hamilton’s Couper Press and created the edX online course, “Jazz: The Music, The Stories, The Players” in collaboration with members of the Library and Instructional Technology Services at Hamilton College. He is an active performer on saxophone and piano and has composed numerous works for both jazz and classical ensembles.",
        "language": "en",
        "author_name": "Monk Rowe",
        "slug": "jazz-backstory",
        "cover": "20230118_030134_d35dba98ded84ef4f6f671c72d39cb9d.jpg"
    },
    {
        "podcast_id": 139179,
        "title": "Toxic Twins",
        "description": "Historias, leyendas, anécdotas y más del mundo del Rock y la música.\n\nUn episodio cada 15 días",
        "language": "es",
        "author_name": "Angie | Kriss",
        "slug": "toxictwins",
        "cover": "20220708_030752_134897fb56e40eb04bb243700c70a9dd.jpg"
    },
    {
        "podcast_id": 139259,
        "title": "Dropni bejsku",
        "description": "Veronika je teoretik, Venda je praktik. Společně vytvořili nový podcast o hudbě. Jdeme na to!",
        "language": "cs",
        "author_name": "Veronika & Venda",
        "slug": "dropnibejsku",
        "cover": "20221019_061019_16ed5ea87232dbca646064dabdc6fc2e.jpg"
    },
    {
        "podcast_id": 139839,
        "title": "sped up songs",
        "description": "cant hold anymore...",
        "language": "en",
        "author_name": "Balenciaga",
        "slug": "balenciaga",
        "cover": "20220711_090712_5596b63f075ab8e0c6e7b387cf0aa391.jpg"
    },
    {
        "podcast_id": 140459,
        "title": "Badass Records",
        "description": "a podcast about people and music",
        "language": "en",
        "author_name": "Blair Johnson",
        "slug": "badass-records",
        "cover": "20220714_100706_e92582c1a25bf1c98ef1c07560ba844a.jpg"
    },
    {
        "podcast_id": 140501,
        "title": "Amigos amantes de la música",
        "description": "Música y orígenes de diversos géneros, autores y cantores",
        "language": "es",
        "author_name": "Ricardo Noriega",
        "slug": "ricardonoriegapodcaster",
        "cover": "20220715_020745_f70ccfb17f3854943c151d50cf1d2800.jpg"
    },
    {
        "podcast_id": 140997,
        "title": "DUSTIES AFTER  DARK",
        "description": "A look  back at classic R&B (Dusties) music and other genres while growing up in Chicago from the 60's thru the 90's",
        "language": "en",
        "author_name": "DELORA",
        "slug": "dustiesafterdarkepisode1",
        "cover": "20220804_100817_0d2e16170e74a8ebb178b421e4de59c5.jpg"
    },
    {
        "podcast_id": 142613,
        "title": "Bangers & Mash : A Podcast About Music",
        "description": "Bangers & Mash - a music podcast with your host, Bonya. This podcast explores any music-related topics, but specifically aims to analyze music trends from the 20th and 21st centuries.",
        "language": "en",
        "author_name": "Bonya Kleyman",
        "slug": "bangersandmash",
        "cover": "20220726_080702_6b3feb0753d0dfd84ff9df233647163c.jpg"
    },
    {
        "podcast_id": 143979,
        "title": "The Around the Ladder Podcast",
        "description": "Welcome to the \"Around the Ladder\" podcast, the official podcast of the University of Tennessee Pride of the Southland Marching Band. \"Around the Ladder\" is a collaboration of the UT Knoxville Advancement Office, the UT Band Alumni Council, and the Pride of the Southland. The podcast is hosted by UTK Alum and former trumpet player for the Pride, Ronnie Boling. Ronnie is joined by co-host Brian Hardy, Director of Campus Wide Advancement at the University of Tennessee, Knoxville.\n\"Around the Ladder\"  hopes to spark memories of past members while giving all UT alumni and fans an insiders perspective of the rich history and tradition of the Pride of the Southland as well as insight on the current edition of the Pride.",
        "language": "en",
        "author_name": "Ronnie Boling",
        "slug": "aroundtheladder",
        "cover": "20220802_040845_37b96df6047f8373140a9d667af4fd9e.jpg"
    },
    {
        "podcast_id": 144535,
        "title": "Hello TV",
        "description": "Hello TV is hosted by San Francisco Bay Area Artists Yin and Casa of The Jealous Guys aka #TJG. This media production is brought to you by ART OF HIP-HOP! Their podcast is about music, fashion, and economics! They also feature native Bay Area guests to talk about how growing in the San Francisco Bay Area has effected their lives !\nEnjoy !\n\nTo learn more visit:\nMusic Website - https://www.wastrelsociety.com/tjg \nYouTube - https://www.youtube.com/c/TheJealousGuys\nSpotify - https://open.spotify.com/artist/5SKWSaWfjWEP3ziVB5GQuE?si=IyupRUnQTQakmsck9_VG6w\nApple Music - https://music.apple.com/us/artist/the-jealous-guys/415558614",
        "language": "en",
        "author_name": "The Jealous Guys",
        "slug": "hellotv",
        "cover": "20220804_070812_28f383c4f4bae5c434177ecb6680c98b.jpg"
    },
    {
        "podcast_id": 145002,
        "title": "Spinners of Yarns",
        "description": "Spinners of Yarns is a new series of Podcasts rooted within the subcultures of the 1970s and 1980s.  ",
        "language": "en",
        "author_name": "Roual Galloway",
        "slug": "spinner-of-yarns",
        "cover": "20220807_070814_51327271eed5337d81c5f8b861496858.jpg"
    },
    {
        "podcast_id": 145062,
        "title": "Stalwarts Of Music with Aditya Veera",
        "description": "<p>Through this podcast Aditya Veera, engages in insightful interviews with Grammy-winning/nominated &amp; highly accomplished upcoming musical prodigies from across the globe. Through his unique interviewing style, Aditya aims to share the musical journeys of these maestros with people of India and beyond. With a growing listener base on Instagram and radio (Big FM Shillong &amp; Aizawl), Aditya is emerging as one of India's pioneering music podcasters, focusing exclusively on interacting with internationally acclaimed musicians. In just a year, he has interviewed renowned legends like Joe Satriani, Cindy Blackman Santana, Phil Perry, Bob James, Lee Ritenour, Doyle Bramhall II, Eric Martin, Nathan East, Richard Bona, Paul Carrack, Victoria Canal, and many others. </p><p>Season 1 comprised over 50 remarkable episodes, and Season 2 promises even more by featuring international legends and music industry experts from India. This season also introduces a new dimension with festival edition podcasts in the country. Get ready for an extraordinary journey into the world of music!</p>",
        "language": "en",
        "author_name": "Aditya Veera",
        "slug": "stalwartsofmusicwithadityaveera",
        "cover": "20220807_060807_4d9216a3885dc0baf120f248cfe0a655.jpg"
    },
    {
        "podcast_id": 145544,
        "title": "Mael Living Space",
        "description": " I’m Gib Christensen and I love the band Sparks. And I’m Jamie Ogihara, and I don’t know one single thing about the band Sparks! And together, we’re dissecting this seminal brotherly band’s complete body of work, one album at a time. Hop on the slow boat of Sparks today!\n",
        "language": "en",
        "author_name": "Gib Christensen",
        "slug": "maellivingspace",
        "cover": "20220810_010802_a383b72efcc4baa6d1cf9be3499df811.jpg"
    },
    {
        "podcast_id": 145558,
        "title": "Frequency Sounds: The Series",
        "description": "Frequency Sounds: The Series was here about Showcase, Mvrdered's sounds like the frequency, distortion, so sucked the part each part, the ideas about scary and scaries sounds to the moments of Mvrdered's tracks.",
        "language": "en-us",
        "author_name": "Mvrdered",
        "slug": "frequencysoundsshowcase",
        "cover": "20220810_020830_ead694dbc08b50b995b3f52aef86744c.jpg"
    },
    {
        "podcast_id": 145777,
        "title": "#ONETAKE",
        "description": "IT:\n#ONETAKE è un progetto nato per migliorare la mia tecnica come disk-jockey, portando alla comunità dei brevi mixati di circa 15min ciascuno, dove provo a raccontarmi attraverso la musica. Ogni mixato fa parte della mia #DAILYROUTINE di allenamento, registrata una sola volta e pubblicata così come la potete sentire nelle varie piattaforme (https://linktr.ee/c.cros), per rendere il tutto più realistico e simile a come sarebbe se fossimo in discoteca. \n~ \nENG:\n#ONETAKE is a project born to improve my technique as a disk-jockey, bringing to the community some short mixes of about 15min each, where I try to tell myself through music. Each mix is ​​part of my training #DAILYROUTINE, recorded only once and published as you can hear it in the various platforms (https://linktr.ee/c.cros), to make it more realistic and similar to what it would be like if we were in the disco. \n~\n#pioneer #onetake #reggaeton #dailyroutine",
        "language": "it",
        "author_name": "Christian Crosato",
        "slug": "ccros",
        "cover": "20220811_040821_af349c89a411390270dfa159418c1ccd.jpg"
    },
    {
        "podcast_id": 147109,
        "title": "Behind the Notes",
        "description": "Behind the Notes podcast is produced by Neranenah, a concert and cultural event series based in Atlanta with roots in Jewish culture and musical traditions. The conversations and music featured in our episodes will explore Jewish contributions to American arts and culture. ",
        "language": "en",
        "author_name": "Neranenah Concert & Culture Series",
        "slug": "behindthenotes",
        "cover": "20220817_060845_d9683d047f7b1462e6bcc64300cfb14b.jpg"
    },
    {
        "podcast_id": 147542,
        "title": "podkastero kinkii",
        "description": "chupapimuñañimuniunmuninumu",
        "language": "es",
        "author_name": "Max",
        "slug": "elalfaeljefe",
        "cover": "20220819_040807_60f1006c5aea96a58b2cf41f5b327c2e.jpg"
    },
    {
        "podcast_id": 147724,
        "title": "Robust Worlds",
        "description": "The Music of artist Robust Worlds",
        "language": "en",
        "author_name": "Robust Worlds",
        "slug": "robustworlds",
        "cover": "20220826_010838_e139ac7f2fa34bf5cf9f399ce37c845f.jpg"
    },
    {
        "podcast_id": 148034,
        "title": "إشارة صفراء",
        "description": ".لنتمهل قليلاً..ونستمتع بالفنون والثقافة والأدب",
        "language": "ar",
        "author_name": "Shatha & Rehab",
        "slug": "yellowlight",
        "cover": "20220822_030811_ea880b6e3ddba839129c605ad83739c9.jpg"
    },
    {
        "podcast_id": 149053,
        "title": "MBO - der Podcast",
        "description": "Der Podcast des Main-Barockorchesters. \n\nMusikjournalistin Gabriela Kägi im Gespräch mit den Orchestermitgliedern. Biographisches, geplante Programme und besondere Beziehungen zu den aufgeführten Werken. Keine klassische Einführung, sondern persönliche Bekenntnisse!",
        "language": "de",
        "author_name": "Main-Barockorchester",
        "slug": "main-barockorchester",
        "cover": "20220826_040824_fdaf6d7bd380d7d7244979dc3d081fe2.jpg"
    },
    {
        "podcast_id": 149873,
        "title": "80s en 90s Podcast met Kooistra en De Graaf",
        "description": "Muziekmak(k)ers Martin Kooistra (geb. 1974) en Wilfred de Graaf halen herinneringen op aan de jaren '80 en '90 aan de hand van het Top 40 Hitdossier. ",
        "language": "nl",
        "author_name": "Kooistra en De Graaf",
        "slug": "kooistraendegraaf-1980",
        "cover": "20230204_100259_94edcb22f02262068f413ee499eea4af.jpg"
    },
    {
        "podcast_id": 150314,
        "title": "SMEM Docs",
        "description": "Les SMEM Docs sont des mini-documentaires explorant les aspects les plus intéressants et obscurs de la musique électronique en Suisse.",
        "language": "fr",
        "author_name": "smem",
        "slug": "smemdocs",
        "cover": "20220901_080906_c4e19d76ebb0c45529f18fc9cc29135c.jpg"
    },
    {
        "podcast_id": 150364,
        "title": "The Tonic",
        "description": "Launched in Autumn 2018, The Tonic is an ongoing show on Threads Radio, presented by Luke Fraser and featuring a mix of modern / contemporary instrumental and electronic classical music from the 20th Century up to now.\n\nExploring both classic and lesser-known works and record releases from a range of composers across genders and borders, each show features a mix of music, informal commentary and personal reflection.\n\nCurrently releasing each Monday at 1200 GMT.\n\nthetonic.online\n@the_tonic_",
        "language": "en",
        "author_name": "Luke Fraser",
        "slug": "thetonic",
        "cover": "20220901_010917_f7be82b58bf7460f2bd1ce312d5d0c26.jpg"
    },
    {
        "podcast_id": 151514,
        "title": "La Dosis Radio",
        "description": "La Dosis is a Spanglish weekly metal/rock radio show al aire at 8pm Tico Time cada Monday night on Planet 107.5 FM en Costa Rica.  El show esta conducido by Nelson Agressor, Axl Metal, y El Primo Lou.",
        "language": "en",
        "author_name": "Nelson Agressor, Axl Metal, and El Primo Lou",
        "slug": "ladosisradio",
        "cover": "20221010_071054_18e93657d4959d004aa8890b5867b3f7.jpg"
    },
    {
        "podcast_id": 151813,
        "title": "Caravan of Pain: The True Story of the Tattoo the Earth Tour",
        "description": "<p>Brace yourself for a roller coaster thrill ride as you join the Tattoo the Earth 2000 summer tour of America, the most insane tour ever inflicted on a continent. Featuring twenty of metal’s biggest bands, including Metallica, Slipknot, and Slayer, plus Filip Leu, Sean Vasquez, and the world’s best tattoo artists, these renegade outsiders pissed off all the wrong music business heavyweights but left delirious inked fans in their wake. \"Caravan of Pain\" is a rip-roaring music business underdog tale: compelling, hysterical, and cautionary. Its unique peek inside the world of music festivals, metal, and tattooing gives the reader a front row seat to a watershed time in our culture at the turn of the millennium. \"Caravan of Pain\" is a story of inspiration, persistence, and the dark side of following a dream. Narrated by Khristian Lee</p>",
        "language": "en",
        "author_name": "Scott Alderman",
        "slug": "caravanofpain",
        "cover": "20220907_040932_f155f7ad9cac83f4a83f1d57b10e7b1b.jpg"
    },
    {
        "podcast_id": 152782,
        "title": "The Register",
        "description": "On the register, we listen to an album in its entirety and discuss it. We talk about possible lyric meaning, our likes and dislikes, and our overall feeling about the album. This podcast is opinion based and meant to be fun. We are in no way, shape, or form music critiques or experts. Our goal is to discover new music, revisit albums from our past, and albums we may have missed along the way. In the future we will invite friends and other guests to give their perception. ",
        "language": "en",
        "author_name": "Kaleb & Blake ",
        "slug": "theregister",
        "cover": "20220912_120936_09305c8db7b528b52ed762cd376760f2.jpg"
    },
    {
        "podcast_id": 154262,
        "title": "Mashup & Mixes By Dj Dalega",
        "description": "Mezclas infinitas",
        "language": "es",
        "author_name": "David Leon Garcia",
        "slug": "djdalega",
        "cover": "20220918_110906_3a7d2d66a66eedc2dbd3bc3a161dde02.jpg"
    },
    {
        "podcast_id": 154322,
        "title": "The Podcast at Live Edge",
        "description": "Create. Capture. Captivate",
        "language": "en",
        "author_name": "Live Edge Studio",
        "slug": "liveedgestudio",
        "cover": "20220918_070933_e6b6643935f25c16f08d670565df23e0.jpg"
    },
    {
        "podcast_id": 154645,
        "title": "TRUST THE VIBE RADIO",
        "description": "IG: trustthevibe_                                                                                                              TikTok: trustthevibe_",
        "language": "en",
        "author_name": "TRUST THE VIBE",
        "slug": "trustthevibe",
        "cover": "20220920_020948_7022f7ff081c052cb47a074003d50832.jpg"
    },
    {
        "podcast_id": 155120,
        "title": "Sock Hop Saturday Night",
        "description": "It's easier to say what the show ISN'T! This show ISN'T your typical, consultant-driven oldies show that only plays the same 300 songs over and over until you are sick of hearing them. It ISN'T robot-radio with a personality-less host and lots of liner cards. It ISN'T a show that tells listeners they can't request a song they want to hear instead of the consultants choice.\n\nWhat it IS is a unique, weekly oldies radio program that caters to its base of dedicated fans and regular listeners. It's different every week with the ability to draw from a playlist of over 17,000 titles! Its host, Mark Edwards, brings life, personality and interaction to the show. It's fans are loyal followers with many listening from the opening intro to the close.\n\nThe mission statement could be summed up as: \"At least once each broadcast, you'll roll your eyes back, place your hand on your forehead and say wow, I haven't heard this song in years!'\nIt began with uncertainty in 1994 but eventually turned into a ratings success story.  Mark Edwards brought his creativity, charm and music collection to the airwaves of Connecticut to bring listeners on a trip back in time.  So successful that it achieved the highest ratings of any show on the station’s lineup during its last Arbitron entry.  His unmistakable ability to give the audience what they wanted paved the way for success for over 28 years! The key to that success was, and still is, the diverse playlist. Thousands of songs from not only the “Hit Makers” of the time, but lesser known, but equally important groups.  Groups like The Academics, Accents, Admirations, Lee Andrews & The Hearts, Angels, Barons, Bell Notes, Blenders, Blossoms, Blue Notes, Bop Chords, Boss Tones, Cadets, Cadillacs, Calvanes, Cameos, Capris, Cardinals, Carnations, Cavaliers, Cellos, Earl Lewis & The Channels, Chaperones, Charms, Chimes, Chords, Cleftones, Clovers, Crests, Crows, Danleers, Darts, Defenders, Del Vikings, Dells, Demensions, Desires, Dominos, Dootones, Dreamlovers, Dubs, Duprees, Earls, Edsels, Emeralds, Eternals, Falcons, Fantastics, Fascinators, Five Keys, Five Royales, Five Satins, Flamingos, G-Clefs, Genies, Harptones, Heartbeats, Impalas, Inspirators, Jacks, Jaguars, Jewels, Jesters, Jive Bombers, Keytones, Bob Knight Four, Kodaks, Legends, Little Joe & The Thrillers, Love Notes, Frankie Lymon & The Teenagers, Lewis Lymon & The Teenchords, Magnificents, Marcels, Medallions, Mellows, Midnighters, Monarchs, Moonglows, J Neons, Nino & The Ebb Tides, Nobles, Nutmegs, Orchids, Orioles, Paragons, Paradons, Pearls, Penguins, Pentagons, Platters, Pyramids, Queens, Quin Tones, Ravens, Rays, Revlons, Rivieras, Rob Roys, Royal Jesters, Royal Teens, Scarlets, Schoolboys, Sensations, Shells, Shep & The Limelites, Sheppards, Solitaires, Spaniels, Starlites, Titans, Tokens, Top Notes, Treniers, Turbans, Universals, Uniques, Untouchables, Valentines, Valiants, Van Dykes, Velours, Videls, Videos, Vito & The Salutations, Wanderers, Wheels, Willows, LITERALLY TO NAME JUST A CHOSEN FEW!!!\n\nALL THAT IN ADDITION TO CHART TOPPERS LIKE ... Paul Anka, Frankie Avalon, Jesse Belvin, Chuck Berry, Gary US Bonds, Pat Boone, James Brown, Jerry Butler, Freddy Cannon, Ray Charles, Chubby Checker, Eddie Cochran, Sam Cooke, The Crystals, Danny & The Juniors, Bobby Darin, Dion, Fats Domino, The Dovells, The Drifters, Tommy Edwards, The Everly Brothers, The Fleetwoods, Connie Francis, Bill Haley & His Comets, Bobby Helms, Clarence \"Frogman\" Henry, Buddy Holly, Etta James, Jan & Dean, Brenda Lee, Bobby Lewis, Jerry Lee Lewis, Little Richard, Johnny Mathis, Ricky Nelson, Roy Orbison, Gene Pitney, Elvis Presley, Cliff Richard, The Ronettes, Bobby Rydell, Sam & Dave, Santo & Johnny, Jack Scott, Neil Sedaka, Del Shannon, Dee Dee Sharp, The Shirelles, The Skyliners, Jimmy Soul, Connie Stevens, Ed Townsend, Ritchie Valens, Bobby Vee, Bobby Vinton, The Ventures, Gene Vincent, Jackie Wilson, AGAIN, ONLY A FRACTION IN OUR COLLECTION.",
        "language": "en",
        "author_name": "Mark Edwards",
        "slug": "sockhopsaturdaynight",
        "cover": "20220922_020926_f7b4b9f6f8099a7250d40985a8c399ec.jpg"
    },
    {
        "podcast_id": 155477,
        "title": "WTGO Pod cast",
        "description": "<p>Old school R&amp;B, smooth Jazz ( Aretha Franklin , Curtis Mayfield ,Paul Taylor</p>",
        "language": "en",
        "author_name": "Jerome George",
        "slug": "wtgo",
        "cover": "20220923_040921_1bacb4f72cf381fb21c6d570ef1ff457.jpg"
    },
    {
        "podcast_id": 158638,
        "title": "Friendly Shadows ",
        "description": "<p>Interviews with the shadows In entertainment every Thursday. </p>",
        "language": "en",
        "author_name": "Kelly Kintner",
        "slug": "friendly",
        "cover": "20230309_110327_00a3540c5dd7d669922692f3e2f8f5a6.jpg"
    },
    {
        "podcast_id": 159859,
        "title": "IDEAL_ON Radio La Radio de Pablo",
        "description": "Radioblog de Pablo Ayala Lopez, compuesto a su vez de cuatro podcasts o secciones :\nPRIMERISIMO PRIMER PABLO\nEL PRIMER CAFE DEL DIA\nRELATOS CON VOZ\nMUSICA Y VIDA",
        "language": "es",
        "author_name": "Pablo Ayala Lopez",
        "slug": "idealonlaradiodepablo",
        "cover": "20221012_041005_4ad4c457801cfb61f13a2086330ac1c6.jpg"
    },
    {
        "podcast_id": 159874,
        "title": "UNRELEASED",
        "description": "Because no one else has them all",
        "language": "en",
        "author_name": "Giulia Antoniazzi",
        "slug": "boyzzunreleased",
        "cover": "20221012_041035_7f58941f1f5475a2ac3951b75e725566.jpg"
    },
    {
        "podcast_id": 160267,
        "title": "Spillin' the Tea",
        "description": "Just a couple of gals spillin the tea on country music stars, death, what it's really like living in Nashville, working at the Grand Ole Opry and everything in between! Come on in, the tea is hot. ",
        "language": "en",
        "author_name": "Spillin' the Tea",
        "slug": "spillinthetea",
        "cover": "20221031_011019_0701b697efc8f80597b284b2c6d2c58a.jpg"
    },
    {
        "podcast_id": 160415,
        "title": "Music Explained for Teens",
        "description": "Flo and Isabel look into the past eras and decades of music with the intent of explaining music for teens, by teens. In this podcast, they combine their last two brain cells to help you understand the past of music.",
        "language": "en",
        "author_name": "Flo and Isabel",
        "slug": "musicexplainedforteens",
        "cover": "20221014_071016_030d29e6aaf45917f3671f24fe532ee7.jpg"
    },
    {
        "podcast_id": 160855,
        "title": "B74 RADIO MUSIC IN THE  ENJOYMENT",
        "description": "B74 RADIO MUSIC IN THE ENJOYMENT podcast curated by the Italian Label B74 Records where every month the dj / producer Tommy Boccuto (Boss Label) will carefully select and mix the best music coming out of his Label and other labels in the world of the Deep House genre.",
        "language": "it",
        "author_name": "Tommy Boccuto",
        "slug": "mixcloud-com-b74recordsradio-playlists-podcast-b74-radio",
        "cover": "20221016_051044_a519c26ac446b60694e656de36679fa8.jpg"
    },
    {
        "podcast_id": 161401,
        "title": "Insomnia Mixed by: DJ Lujano",
        "description": "<p>Lo mejor del Trance Progressive del momento, mezclado por Cesar Lujano.</p>",
        "language": "es",
        "author_name": "CESAR LUJANO",
        "slug": "insomnia-episode-001",
        "cover": "20221018_071029_d17de759b7de22517f7430af0463adc9.jpg"
    },
    {
        "podcast_id": 161771,
        "title": "Six String Hayride",
        "description": "<p>Welcome to Six String Hayride, a journey through the world of classic country music. Each episode is hosted by Chris Wainscott and Jim O’ Malley. Join us in the cart as we ride through topics such as murder, prison, mama, your favorite artists, the songs they gave us, and the stories that made them. Each episode will focus on a unique topic, presented in an interesting and informative way. Think of it as history meets yarn spinning. Season One will feature discussions on topics as wide-ranging as murder ballads, what is wrong with Rolling Stone’s Top 20 Country Album list, Western music, artists of color, and why Delia shouldn’t be gone. Whether you’re a diehard country music fan, a casual fan, or someone who isn’t yet aware that you like country, we’ll have something to entertain you, as well as educate you. Each episode will contain a featured recipe straight from the kitchen of those who gave us this music. Join us on our Facebook page for discussions, the recipes, songs, and more. So come along for the ride and let’s get cooking. Follow us on Facebook at Six String Hayride. Contact Us at Sixstringhayride@yahoo.com. Six String Hayride is Researched, Written, and Narrated by Chris Wainscott and Jim O'Malley. Script Editor and Business Manager, Chris Wainscott. Audio Recording and Production, Jim O'Malley. Inspiration from Heidi Kehler, Johnny, and Willie</p>",
        "language": "en",
        "author_name": "Six String Hayride",
        "slug": "sixstringhayride",
        "cover": "20230514_010555_6ade6a6b8eb444e095e2b9495e539777.jpg"
    },
    {
        "podcast_id": 161833,
        "title": "Tupelo Tom & Big Lew: Talkin'",
        "description": "<p>An Elvis podcast by 2 best friends and lifelong Elvis fans! As veterans of the \"Elvis world\", Tupelo Tom and Big Lew offer unique viewpoints on some of the Elvis stories you already know and even share ones you've never heard before from the people who were with \"The King\" when it happened!</p>",
        "language": "en",
        "author_name": "an Elvis podcast w/ Tom Brown & Jeff Lewis",
        "slug": "tupelotomandbiglewtalkin",
        "cover": "20230424_050447_a5600cc7e338c496b148e6742b2cda2b.jpg"
    },
    {
        "podcast_id": 161836,
        "title": "The Shiesty Show Podcast ",
        "description": "Music Sports Entertainment basketball football baseball boxing all for the love of the game.",
        "language": "en",
        "author_name": "Matthew Lucero",
        "slug": "theshiestyshow",
        "cover": "20221020_061050_3a4b6fda1ede2283c79cc81111e5c3f0.jpg"
    },
    {
        "podcast_id": 162199,
        "title": "SELECT & MIXED WHITH LOVE PODCAST",
        "description": "<p>MUSICA HOUSE Y MAS</p>",
        "language": "es",
        "author_name": "Rick Gutierrez",
        "slug": "riccardocaballero",
        "cover": "20230803_040824_9ff59294bc20beb66730620a2b6c1090.jpg"
    },
    {
        "podcast_id": 162823,
        "title": "Easy Jazz Spotlight",
        "description": "Easy Jazz Spotlight is produced by the popular soft jazz Internet radio station, Easy Jazz FM, featuring conversations with today's jazz music creators. We talk with jazz musicians, composers and historians about jazz music and its role in this chaotic world. Listeners will gain an appreciation for the genre and how it can contribute to their sense of well-being. ",
        "language": "en",
        "author_name": "Easy Jazz FM",
        "slug": "easyjazzfm",
        "cover": "20221030_051043_222cae61f4e726f793aa4c04d183948e.jpg"
    },
    {
        "podcast_id": 162961,
        "title": "Triplesetradio",
        "description": "TRIPLE SET RADIO\nA SKATEBOARDING CULTURE PODCAST\nFRIDAYS AT 2:57 CENTRAL",
        "language": "en",
        "author_name": "Jamison Green Logan Arrington",
        "slug": "triplesetradio",
        "cover": "20221028_051038_c1b901773fe41ba0eb91037e959411be.jpg"
    },
    {
        "podcast_id": 164647,
        "title": "Mūsika",
        "description": "Para spotifi",
        "language": "es",
        "author_name": "Marco Crespo",
        "slug": "spotifimarco",
        "cover": "20221101_031125_26486fd9984e4dd1fa15e5fbb53315c4.jpg"
    },
    {
        "podcast_id": 165169,
        "title": "Rey Vinyl",
        "description": "Rey Vinyl Podcast es un espacio donde se habla de música, conciertos, artistas, bandas y experiencias.",
        "language": "es-mx",
        "author_name": "Rey Vinyl",
        "slug": "reyvinyl",
        "cover": "20221103_031152_ff9a0cb620f3c264c8c3b4ec93342dfb.jpg"
    },
    {
        "podcast_id": 165753,
        "title": "Nest-Cast ",
        "description": "Welcome to My PODCAST THE NESTCAST \n\nThis is something ive wanted to do for a while so here it is I HOPE YOU ENJOY AND CONSIDER FOLLOWING OR SUBCRIBING !!!",
        "language": "en",
        "author_name": "Nestor Perez",
        "slug": "nest-cast",
        "cover": "20221106_031112_5efb8bc33c51c6640f2d57b34e014785.jpg"
    },
    {
        "podcast_id": 167459,
        "title": "The WeOutside Show ",
        "description": "About The We Outside Show: \nThe We Outside Show is a weekly podcast and radio show hosted by DJ Big X, DJ Filthy Rich and DJ Smooth. The show was started in 2021 by DJ Big X as a way to hear and connect with new artists and their music but grew into a podcast. Today, The We Outside Show focuses on breaking new music, paying homage to the OGs and generating conversation that informs and drives culture. #WeOutside",
        "language": "en",
        "author_name": "The WeOutside Show",
        "slug": "theweoutsideshow",
        "cover": "20221112_071150_569735aec2e7c4dd1f27e513e1cb3dbb.jpg"
    },
    {
        "podcast_id": 167512,
        "title": "La Maison",
        "description": "이달의 소녀 (LOOΠΔ) “La Maison LOONA”",
        "language": "en",
        "author_name": "xabier.",
        "slug": "la-maison",
        "cover": "20221113_121103_5fb1deb37a4ac5cf536a5b656d3de6fd.jpg"
    },
    {
        "podcast_id": 168050,
        "title": "Hardcore Troubadour",
        "description": "Two hardcore kids nerding out about Steve Earle and all things country, folk, rock, and Americana. Join Tyler Short (Inclination, Constraint, LDB) and Brian Wallace (Perfect World, Halfacre Gunroom) as they journey through every Steve Earle album, with several twists, turns, and adjacent records along the way. If you like your music with a heavy dose of class consciousness, this is the podcast for you.",
        "language": "en",
        "author_name": "Tyler Short and Brian Wallace",
        "slug": "hardcoretroubadourpod",
        "cover": "20221115_031114_125cc960a0435a6bb508521d749e89dc.jpg"
    },
    {
        "podcast_id": 170425,
        "title": "Tommy & Kira NoisePark Radio Show",
        "description": "Tommy & Kira Noisepark is a radio show dedicated to all the Rock’n’Roll , Hard and Heavy Metal maniacs alla round the world!\nWe (Tommy & Kira of course) still believe into the revolutionary power of Rock music, we will select for you only the best tunes from the old and new scene: Music, interviews, fun facts and anecdotes and much mure will wait for you every Thursday at 9 pm (GMT+1) on www.metalmaximumradio.net",
        "language": "en",
        "author_name": "Tommaso Dettori",
        "slug": "noisepark",
        "cover": "20221125_041111_56b3a53f84161d564afadacc904bb1b5.jpg"
    },
    {
        "podcast_id": 174094,
        "title": "The Underplayed Serenade",
        "description": "<p>We break down songs that deserve more air time! Come discover, or rediscover some of the best songs in the world!</p>",
        "language": "en",
        "author_name": "Tim, Traci & Keatin",
        "slug": "theunderplayed",
        "cover": "20230919_010905_8c23f78f06c8d9d4f8863ebc6f271422.jpg"
    },
    {
        "podcast_id": 174118,
        "title": "Burns Envy, only Hits! aka Brucia di invidia, solo grandi successi! ",
        "description": "<p>\"Join us for a captivating live radio show where we delve into the realm of international music releases and provide song previews from across the globe! Are you eager to discover the latest music releases and get a sneak peek of songs from around the world? Tune in to the \"Burns Envy, only Hits!\" show, also known as \"Brucia di invidia, solo grandi successi!\" hosted by Raffaella Piccirillo. Raffaella is an accomplished international artist and producer, who has been actively listening to and reviewing songs from all corners of the world since 2012. Catch up on previous episodes before December 1st, 2022, at <a href=\"https://www.mixcloud.com/RaffaellaPiccirillo/\"><strong>https://www.mixcloud.com/RaffaellaPiccirillo/</strong></a>.\"</p>",
        "language": "it",
        "author_name": "Raffaella Piccirillo",
        "slug": "burnsenvyonlyhits",
        "cover": "20221213_121247_63894b1c6d1b3b885a6193c659cd3d3f.jpg"
    },
    {
        "podcast_id": 177826,
        "title": "Musique Trax",
        "description": "En este vasto e infinito universo de la música, Musique Trax pretende ser una especie de \"guía\" acerca de los distintos géneros, artistas, álbumes y diversos componentes que conforman este hermoso arte. Desde lo más clásico, pesado, virtuoso, electrónico, urbano y hasta lo más extraño, atípico y oscuro, aquí exploraremos las distintas caras de la música.\n\nNarrado y producido por: Ozz Villar",
        "language": "es-mx",
        "author_name": "Ozz Villar",
        "slug": "musiquetrax",
        "cover": "20230103_030122_20ec99e5932af55cf68b6b6bde99e210.jpg"
    },
    {
        "podcast_id": 177921,
        "title": "The Two Ugly Bastards Podcast",
        "description": "Two ugly dudes talking about life, their favorite artists and bands from different genres and time periods, plus beautiful buttholes and who knows what else. ",
        "language": "en",
        "author_name": "Brett Harris Don Beebe",
        "slug": "twouglybastardspodcast",
        "cover": "20230103_040129_b898be17e7f395488c01ba597a1a8814.jpg"
    },
    {
        "podcast_id": 179226,
        "title": "WEEKEND DANCE su PROXIMA RADIO",
        "description": "Una nuova puntata in arrivo su Proxima Radio\n🎧 WEEKEND DANCE 2022/2023 🎧\nVi aspetto su @proximaradio dalle 17 alle 18 con un nuovo programma ricco di musica e news dal mondo della Dance.\n➡️ NOSTALGIA DANCE: la rubrica di musica anni 90-2000 in collaborazione con il profilo instagram Nostalgia Dance\n➡️ DISCO FIGO : Il disco \"pettinato\" della settimana!\n➡️ HARMONY DROP: I 2 migliori Mash up/Remix/Rework/Bootleg in collaborazione con il sito www.harmonydrop.com/\n➡️ ATW - Around The World: Alla scoperta di nuove HIT dance dalle Chart internazionali.\n#weekend #weekendmood #weekendvibes #radioshow #dance #mashup #bootleg #premiere #hits #weekendtime #weekendfun #weekendstyle #nostagliadance #dance90s #2000s",
        "language": "it",
        "author_name": "ALEX BERTI",
        "slug": "weekend-dance",
        "cover": "20230109_110134_644798737928a60ffd4e0fcfd4ef3eb8.jpg"
    },
    {
        "podcast_id": 180735,
        "title": "LO QUE TODOS QUERIAMOS (Quevedo Filtradas)",
        "description": "Canciones de Quevedo filtradas",
        "language": "es",
        "author_name": "Diego Ruiz de la Torre Garbisu",
        "slug": "ruizeto",
        "cover": "20230115_120118_c509fab35085697ff54c534c33dbad82.jpg"
    },
    {
        "podcast_id": 181603,
        "title": "VERSIONES",
        "description": "Mauricio Silva, reconocido músico venezolano en el mundo, compositor, arreglista y productor ha participado en la grabación de mas de 200 producciones.\n\nEn su carrera musical ha acompañado a grandes figuras de la música latina entre los que podemos destacar a Celia Cruz, Héctor Lavoe, Oscar D´Leon, Arabella, Lalo Rodríguez, Eddie Santiago, Daniel Santos, Paquito Guzmán, Emilita Dago, Vity Ruiz, Jerry Rivera, Roberto Lugo, Nino Segarra, Ismael Miranda, Cheo Feliciano, Andy Montañéz, Justo Betancourt, Maelo Ruiz, Yuri Buenaventura, Alberto Beltrán, Celio González y Rolando La Serie.\n\nMauricio Silva en su Podcast VERSIONES , nos ofrece un interesante recorrido hacia la historia de temas musicales que se quedaron en el gusto del publico para siempre. ",
        "language": "es-mx",
        "author_name": "MAURICIO SILVA",
        "slug": "mauricio-silva",
        "cover": "20230118_030153_8a3065e8a83495028ec9172e346a1c3b.jpg"
    },
    {
        "podcast_id": 181805,
        "title": "Mixtape",
        "description": "Reggae Mixtape",
        "language": "pt-br",
        "author_name": "Matheus",
        "slug": "ctrl",
        "cover": "20230119_100103_a2b9ce9230813169d4211871bb8daa51.jpg"
    },
    {
        "podcast_id": 182069,
        "title": "Silum Soundz",
        "description": "<p>Exploraciones sónicas por el espectro multicolor. Hogar de XSS (Xperimental Sound System). Curated by DJ Cubo.</p>",
        "language": "es",
        "author_name": "Silum Soundz",
        "slug": "silumsoundz",
        "cover": "20230120_100111_d42387bc737796bd5ed87e296ce7be76.jpg"
    },
    {
        "podcast_id": 182396,
        "title": "Crashradio",
        "description": "<p>Hip hop</p>",
        "language": "en",
        "author_name": "BGL, Reggie Reg,Bobby Milk & Man-Mann",
        "slug": "crashradio",
        "cover": "20230124_060129_344ed2e1621e0b80598a2a0183785be5.jpg"
    },
    {
        "podcast_id": 184027,
        "title": "Jazz Lab",
        "description": "<p>Jazz Lab is an hour show that seeks to immerse the listener in jazz music, culture and history. In this show, we explore the lore of jazz history and dive into the best of America’s art form. Each episode features a different set of tracks and stories from a collection of artists as we follow the careers of these greats through the albums that defined them and connected them to other innovators of the day. In Jazz Lab, we develop a love and appreciation for America’s music through incredible stories and iconic records.</p>",
        "language": "en",
        "author_name": "Alison Rhoads",
        "slug": "jazzlab",
        "cover": "20230803_080801_c8feb8cf39deb70c1531f5e5e0c6e01d.jpg"
    },
    {
        "podcast_id": 184072,
        "title": "Solo Cose Belle",
        "description": "Musica, musica, musica e ancora musica. Se fondi la passione per qualunque genere musicale al piacere e alla voglia di comunicare qualunque cosa alla gente, allora devi metterti dietro un microfono e sarà magia.\nQuesta magia, Claudio l’ha scoperta nel 1988 e non riesce proprio a farne a meno.\n\nAgli ascoltatori di Rsc- Radio Studio Centrale, offre Solo Cose Belle, dalle 12:00 alle 14:00, da Lunedì a Venerdì, ma state in campana perchè arriveranno Solo Cose Belle, anche quando meno ve l’aspettate.\n\nGli History Hit, le canzoni del passato, proposte da Solo Cose Belle, sono sempre delle chicche per veri intenditori.\n\nE non dimenticate di scaldare le corde vocali, perché ogni giorno con ‘Canta che ti passa’, chiunque può cantare e dimostrare le proprie doti canore.",
        "language": "it",
        "author_name": "Solo Cose Belle-Claudio Fallica",
        "slug": "solocosebelle",
        "cover": "20230127_120150_14bce21aa22d2990a57f6aaad3eccb8f.jpg"
    },
    {
        "podcast_id": 186237,
        "title": "La Satanoteca",
        "description": "<p>Te doy la bienvenida a La Satanoteca, el podcast donde se revelan los secretos de la música oscura, desde el metal infernal hasta el darkwave maldito, pasando por el gótico, el industrial y el ambient. Aquí te mostraré mis perversiones musicales, mis hallazgos, mis sugerencias y mis críticas sobre las bandas y los géneros que me obsesionan. Si te gusta la música que te sacude, que te lleva a otros planos, que te reta y te asombra, este es tu podcast. Únete y sígueme en esta aventura sonora por La Satanoteca. </p>",
        "language": "es",
        "author_name": "Miauco Media",
        "slug": "elsoundtrackdetuvida",
        "cover": "20230803_100834_bbceb9a6b005a7a26f40e065098a4c79.jpg"
    },
    {
        "podcast_id": 186447,
        "title": "Pod Is Killing Me",
        "description": "<p>Join Jesse and Jeff, two absolute nobodies, as they discuss the career of goth-metal titans Type O Negative, and whatever else they feel like.</p><p>Follow us on Instagram and Twitter @podiskillingme</p>",
        "language": "en",
        "author_name": "Pod Is Killing Me",
        "slug": "podiskillingme",
        "cover": "20230720_030746_966395a5b33be9240914f0ea37850704.jpg"
    },
    {
        "podcast_id": 186811,
        "title": "ProdPod",
        "description": "A podcast about music producers.",
        "language": "en",
        "author_name": "James Lindsay, Brandon Stables, and Corey Hart",
        "slug": "producerpod",
        "cover": "20230205_070208_2f91ada6b40fb6862523a53c6bf198b3.jpg"
    },
    {
        "podcast_id": 188277,
        "title": "Kaboom storie di musica e di bravi ragazzi",
        "description": ".... e che nome ci mettiamo ? Chiamiamoci come il gatto Harum .... Si ma mettiamoci un pò di cultura .....",
        "language": "it",
        "author_name": "Giovanni Amara ",
        "slug": "cibariafood",
        "cover": "20230210_120253_a38df5618a1bdd335fdd386d8d0ec90d.jpg"
    },
    {
        "podcast_id": 188899,
        "title": "NO Daddy Podcast",
        "description": "No daddy podcast je pořad zabývající se hudebním a kulturním životem mladých lidí. Kombinace talentovaného a nadějného Zdeňka s cílevědomou a netolerantní Kateřinou vytváří projekt mapující kulturní a hudební svět od dob vládnutí krále Klacka do současnosti.",
        "language": "cs",
        "author_name": "NO Daddy music",
        "slug": "nodaddypodcast",
        "cover": "20230212_070222_0a8086f93c7f0ce186fe0db9532bb57e.jpg"
    },
    {
        "podcast_id": 189200,
        "title": "QUEVEDO-LEAK",
        "description": "Las filtradas del Quevedo.",
        "language": "es",
        "author_name": "raul",
        "slug": "quevedo-leak",
        "cover": "20230213_060227_a4217aa0b96022731b34bbd40ba251f0.jpg"
    },
    {
        "podcast_id": 190256,
        "title": "The Syncopated Sisters podcast",
        "description": "<p>Welcome to the Syncopated Sisters Podcast hosted by Nina Thaler from the <a href>Syncopation Society</a>. Here, we highlight and discuss the work of female musicians, composers and producers and their impact in the early days of jazz music. Also there will be interviews with contemporary musicians, DJs, or researchers.</p><p>Besides the podcast, the Syncopated Sisters also translates into action with a music residency (First edition Berlin, 9-12 March 2023).</p><p>For suggestions and inquiries, please get in touch at <a href=\"mailto:nina@syncopation.de\">nina@syncopation.de</a>.</p><p>This Podcast series is part of the project <a href=\"https://www.facebook.com/swingingeuropenetwork\">Swinging Europe</a>. Co-funded by the <a href=\"https://www.facebook.com/CreativeEuropeEU\">Creative Europe Programme</a> of the European Commission.</p>",
        "language": "en",
        "author_name": "the Syncopation Society",
        "slug": "syncopatedsisters",
        "cover": "20230222_090232_c7ceb2f6e627e868fe03b5bbcbe7908b.jpg"
    },
    {
        "podcast_id": 190957,
        "title": "Lotan ja Vienan musiikkipäiväkirja",
        "description": "<p>Kahden ystävyksen puhetta klassisesta musiikista ja siihen liittyvistä ilmiöistä.</p>",
        "language": "fi",
        "author_name": "Lotta & Viena",
        "slug": "musiikkipaivakirja",
        "cover": "20230302_050357_dc23e62b83005bd189d91a01813ce0d1.jpg"
    },
    {
        "podcast_id": 192093,
        "title": "Top Chart",
        "description": "<p>Gianpaolo Salmeri vi conduce nel mondo della classifica dei più suonati.</p><p>Le 40 hit più forti di Rsc-Radio Studio Centrale, la family station siciliana.</p><p>Quale sarà la numero 1 di questa settimana?</p>",
        "language": "it",
        "author_name": "Giampaolo Salmieri",
        "slug": "topchart",
        "cover": "20230224_100237_dfbcafd38cac3784e221a8a5f5b63273.jpg"
    },
    {
        "podcast_id": 192166,
        "title": "Η ΠΙΣΩ ΠΛΕΥΡΑ ΤΗΣ ΚΑΣΕΤΑΣ - Μουσικές Ιστορίες Κοινωνικού Περιεχομένου",
        "description": "<p>Podcast με επαναστατικές μουσικές ιστορίες κοινωνικής πραγματικότητας. Πότε και πως η μουσική έχει συνομιλήσει με την ιστορία; Πότε και πως έχει επιδράσει στην διαμόρφωση της ιστορίας; Πότε και πως η μουσική έγινε η φωνή της ιστορίας κι ο ήχος της; Μια σειρά από αφηγήσεις όπου η ιστορία της μουσικής, και η πίσω πλευρά της, η λιγοτέρο γνωστή, φανερώνεται συνδεόμενη με την ευρύτερη ιστορία και την κοινωνική πραγματικότητα της κάθε εποχής. </p><p>Παραγωγή: YELLOWBOX Magazine</p><p>Κείμενο, έρευνα, σκηνοθεσία: Βάσια Παρασκευοπούλου </p><p>Αφήγηση: Βάσια Παρασκευοπούλου και Γιώργος Σύρμας </p>",
        "language": "el",
        "author_name": "Βάσια Παρασκευοπούλου",
        "slug": "yellowbox-music-stories",
        "cover": "20230224_070236_56561e949d8d52f6bb758202621912de.jpg"
    },
    {
        "podcast_id": 192427,
        "title": "Sugar, We're Going In",
        "description": "<p>THE PODCAST ABOUT FALL OUT BOY &amp; HIP HOP.</p><p>Each episode of \"Sugar We're Going In\" delves deep into the evolution of and symbiotic relationship between Fall Out Boy, the iconic pop-punk powerhouse, and the dynamic realm of Hip Hop.</p><p>Scarlet Estelle, an experienced music aficionado and a trusted voice in the industry, leads listeners on an immersive journey, uncovering fascinating anecdotes, untold stories, and unexpected collaborations that have shaped the musical landscape.</p>",
        "language": "en",
        "author_name": "Scarlet Estelle",
        "slug": "sugarweregoingin",
        "cover": "20230625_070616_0e83a11d3a1d379efbfc761427d8e821.jpg"
    },
    {
        "podcast_id": 192449,
        "title": "KICK PUSH Presents!",
        "description": "<p>Check out our website for more interviews and videos</p>",
        "language": "en",
        "author_name": "Adrian Aragon",
        "slug": "kick-push-interviews-alison-halo",
        "cover": "20230225_110255_9c1ffad256681e238faa17b799f4ad72.jpg"
    },
    {
        "podcast_id": 192994,
        "title": "Casa Luna Records",
        "description": "<p>Exclusive Live sets from your favorite artists playing at Casa Luna.</p>",
        "language": "en",
        "author_name": "Casa Luna Records",
        "slug": "casalunamzo",
        "cover": "20230227_100227_0437a2bc7e0787fdfd7806e8216f336e.jpg"
    },
    {
        "podcast_id": 193046,
        "title": "DadBodPod",
        "description": "<p>Brian and Andrew Discuss all things DadBod!!!</p>",
        "language": "en",
        "author_name": "Dadbod",
        "slug": "dadbodpod",
        "cover": "20230228_020212_16da131dc43aa2ffae04ee95b2930e68.jpg"
    },
    {
        "podcast_id": 193668,
        "title": "Joni Jams",
        "description": "<p><strong>Welcome to Joni Jams, a podcast going album by album through Joni Mitchell's entire discography.</strong></p><p>In each episode, Ryan goes track by track discussing the album at hand while also giving bits of commentary, stories, and other anecdotes along the way.</p><p><em>Thank you for Listening!</em></p><p><strong>Contact the host by email: jonijamspodcast@gmail.com</strong></p>",
        "language": "en",
        "author_name": "Ryan",
        "slug": "jonijams",
        "cover": "20230905_040946_8994a53267d0064721633040d07d9560.jpg"
    },
    {
        "podcast_id": 193681,
        "title": "Songs that ain't on spotify that should've been",
        "description": "<p>Ermmm what the flip</p>",
        "language": "en",
        "author_name": "Rooss",
        "slug": "rooss",
        "cover": "20230302_040334_224dd8016a0feb121218769b4a3cf740.jpg"
    },
    {
        "podcast_id": 194816,
        "title": "Radici",
        "description": "<p>un semplice podcast dove parlo e discuto di musica</p>",
        "language": "it",
        "author_name": "bateconic",
        "slug": "bateconic",
        "cover": "20230306_050304_ebba2c31dcfe11114d607d6d65d0456d.jpg"
    },
    {
        "podcast_id": 195570,
        "title": "Sound Judgment",
        "description": "<p>Two dudes get together to discuss music topics, review albums, and generally get sidetracked</p><p>Find more content, additional episodes, and uncut episodes on our YouTube channel: </p><p><a href=\"https://www.youtube.com/@SoundJudgmentPodcast\">https://www.youtube.com/@SoundJudgmentPodcast</a></p>",
        "language": "en",
        "author_name": "Sound Judgment",
        "slug": "soundjudgement",
        "cover": "20230309_040320_df0aaf575131da05f6adca7a3e9ab8f7.jpg"
    },
    {
        "podcast_id": 196602,
        "title": "The Discursive Power of Rock en español and the Desire for Democracy",
        "description": "<p>This podcast examines the perennial quest of Latin Americans and Latinx peoples to create more just and equitable societies. The series focuses on the political project of Latin American <em>rock en español</em>, a musical genre that challenged the hegemony of English rock and began in the 1970s.</p><p>During the 1970s, a number of Latin American countries were faced with dictatorships and military coups that led to the “dirty wars” in which citizens were traumatized, tortured, and murdered. This project will be examining the lyrics for main themes of social justice that circulated during the dirty wars of Mexico, Chile, and Argentina in particular.</p><p>We will also feature intergenerational conversations to examine the legacies of this music in our present moment and how Rock en Español was employed by LA Latinas and Latinos to fight against anti-immigrant rhetoric and politics in 1990s California.</p><p><em>This project is supported in part by the University of California Office of the President MRPI funding M21PR3286.</em></p>",
        "language": "en",
        "author_name": "Jorge N. Leal",
        "slug": "thediscursivepowerofrockenespanol",
        "cover": "20230626_070641_c05c1f88f7c10bf5b7a79265414dc806.jpg"
    },
    {
        "podcast_id": 196924,
        "title": "Noticiero para las Generaciones Futuras",
        "description": "<p>En caso de que alguna moda o teoría de conspiración resurja, creamos el <strong>\"Noticiero para las Generaciones Futuras\"</strong>, el noticiero de lo irracional, de lo que nunca debió ser noticia y que seguirá siéndolo.</p><p><strong>¿Nuestro objetivo?</strong> ¡Salvar a los fetos del futuro!</p><p>Escúchanos bimensual.</p><p><strong>Prepárate para el futuro, siguiéndonos por Instagram....</strong></p><p><a href=\"https://www.instagram.com/napoleonbravooficial/?hl=en\">@napoleonbravooficial</a></p><p><a href=\"https://www.instagram.com/noticierodeloirracional/?hl=en\">@noticierodeloirracional</a></p><p><a href=\"https://www.instagram.com/nataliazbravo/?hl=en\">@nataliazbravo</a></p><p><strong>Suscríbete a nuestro newsletter </strong>enviando tu nombre y el código secreto \"banana autografiada\" a <a href=\"mailto:bravo@tramology.com\">bravo@tramology.com</a>.</p>",
        "language": "es",
        "author_name": "Natalia Bravo y Napoleón Bravo",
        "slug": "noticiero-para-las-generaciones-futuras",
        "cover": "20230315_120318_b0768f018be37197fe3a62801b5a3687.jpg"
    },
    {
        "podcast_id": 199136,
        "title": "Weezer (And One More Thing)",
        "description": "<p>Hosted by Justin Hoenke (Weezer Fan Club Member #1255), each episode of \"Weezer (And One More Thing)\" focuses on a different part of the rock band Weezer's career plus one random topic that's in Justin's brain that week.</p>",
        "language": "en",
        "author_name": "Justin Hoenke",
        "slug": "weezer1",
        "cover": "20230324_060328_12228f187eda635197faefe6e22d9d8d.jpg"
    },
    {
        "podcast_id": 199549,
        "title": "Flip the Record",
        "description": "<p>Each week Joey &amp; Joe discuss the entire discography of one artist, debate the best and worst albums and songs, and talk all things music.</p>",
        "language": "en",
        "author_name": "Flip the Record",
        "slug": "fliptherecord",
        "cover": "20230327_120314_a5441063389862fce733ae543793a426.jpg"
    },
    {
        "podcast_id": 200156,
        "title": "Sgt. Pepper's Lonely Hearts Club Band Good Time Podcast",
        "description": "<p>The only show that identifies, biographies and signifies all the figures on the cover of The Beatles' 1967 album 'Sgt. Pepper's Lonely Hearts Club Band\".</p><p><a href=\"https://linktr.ee/sgtpepperpodcast\">https://linktr.ee/sgtpepperpodcast</a></p>",
        "language": "en",
        "author_name": "Joseph Lindberg",
        "slug": "sgtpepperpod",
        "cover": "20230511_040518_44b4856b9de6c9b3f72b03fd9b44c1db.jpg"
    },
    {
        "podcast_id": 201073,
        "title": "The Legend By Dj. Claudio Stella",
        "description": "<p>Claudio Stella, nato a Vicenza nel 1952 e fino al 1996 “figlio del Mondo” avendo cambiato 7 residenze, compresa nel 1977 a Teheran (Iran). Ora vive a Vicenza. Dire che la Musica è stata parte integrante della sua vita è poco dato che grazie al padre, pilota di Aviazione con servizi anche per la Base…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "podcast-202",
        "cover": "20230403_030409_b92ef6da897ffcca336aa2f394d5d2e6.jpg"
    },
    {
        "podcast_id": 201240,
        "title": "Balearic Lounge By Papa Dj.",
        "description": "<p>Con quarant’anni di consolle alle spalle, Papa Dj appartiene di diritto ai pionieri del djing italiano. Specializzato in musica lounge, ethnic-house, slow deep, oriental and world, è sempre in viaggio alla ricerca di sonorità tipiche di varie regioni del mondo. Ha trascorso metà della sua carriera in oltre 300 club in Italia e passa attraverso…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "balearic-lounge",
        "cover": "20230918_050944_0ba3edf3cf889542bd29ef860acb6f89.jpg"
    },
    {
        "podcast_id": 201320,
        "title": "Two Dudes and Killer Tunes",
        "description": "<p>In this podcast, Two Dudes invite guests to discuss shows we have seen and to catch up on what has been going on. What are the most memorable moments, favorite venues, upcoming shows, and bands on the horizon</p>",
        "language": "en",
        "author_name": "KAL E KALISZEWSKI and NEIL A WILLIAMS",
        "slug": "twodudesandkillertunes",
        "cover": "20230821_020841_7617049a3510b8643b945261b30371d1.jpg"
    },
    {
        "podcast_id": 201436,
        "title": "Cocktail Chant By Simon J.",
        "description": "<p>Simone, meglio conosciuto come Simon J, è nel mondo delle radio dall’estate del 2001, ma la sua passione ha origini più lontane, quando da piccolino andava in giro col microfono per intervistare i suoi parenti durante i pranzi o le cene. Ha iniziato come fonico e regista, ma la sua vera passione era stare davanti…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "cocktai-chant",
        "cover": "20230918_050907_7e2671db43bb618bf008db817a8377aa.jpg"
    },
    {
        "podcast_id": 201437,
        "title": "Cosmic Sound By Dj. Daniele Baldelli",
        "description": "<p>Daniele Baldelli ha iniziato come dj nel 1969 al Tana Club di Cattolica (RN, Riviera Adriatica, Italia) e successivamente è entrato a far parte del Tabù Club nel 1970. Quella volta non c’erano mixer, auricolari e display! Il lavoro del disc jockey era semplicemente quello di alzare e abbassare i due giradischi a disposizione, non…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "cosmic-sound",
        "cover": "20230918_050933_8906651cf810b6249eee719cbf12d0c7.jpg"
    },
    {
        "podcast_id": 201439,
        "title": "Day Dream By Dj. Nicola Grassetto ",
        "description": "<p>Nicola Grassetto, dopo alcuni anni di esperienze come speaker nelle radio, inizia come DJ nel 1978. L’elenco dei Club dove ha lavorato è molto numeroso, proprio a caratterizzare la sua attività: MURETTO (JESOLO LIDO), AREA (CORTINA), SOTTOVENTO (PORTO CERVO), PAPAGAIO’ (SAINT TROPEZ), PITER PAN (RICCIONE), KARISMA (PREGANZIOL), BSC8 (TREVISO), AREA (VENEZIA), MOLO 5 (VENEZIA), VILLA…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "day-dream",
        "cover": "20230405_060414_4139158e94851bce28f6236c534c29b3.jpg"
    },
    {
        "podcast_id": 201440,
        "title": "Esoticool By Dj. Johnny Snack",
        "description": "<p>Gianni Merenda, alias Johnny Snack, nasce a Milano e vive la adolescenza alternando alla scuola l’hockey su ghiaccio. A vent’anni cambia tutto, entra nello staff di Radio Studio 105 (oggi Rete 105) e apre la sua prima agenzia di promozione x prodotti rivolti ai giovani … da allora sono passati 40 anni con più…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "esoticool",
        "cover": "20230405_060408_75c86342f70e6d52e228a544669ee453.jpg"
    },
    {
        "podcast_id": 201443,
        "title": "GMND By Dj. Marco Ossanna",
        "description": "<p>Marco Ossanna evidenzia la sua passione per la musica fin da piccolissimo, quando già alle elementari studia pianoforte e, per la sua grande curiosità, si cimenta anche alla batteria finché nel 1975 inizia la sua carriera di Dj. Nel 1984 è tra i primi Djs italiani a fare una tournée all’estero e la sua prima…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "gmnd",
        "cover": "20230405_060406_d2bedb515b9487e3fff70ff26018ef97.jpg"
    },
    {
        "podcast_id": 201445,
        "title": "It's Only Music By Dj. Beppe Spatten",
        "description": "<p>Storia del rock, punk &amp; new wave.</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "its-only-music",
        "cover": "20230405_060432_36e368f0983abd4f6a4fc67d3af39024.jpg"
    },
    {
        "podcast_id": 201446,
        "title": "Jazzy By Roby Bellini",
        "description": "<p>Roby Bellini ha sempre avuto, sin dalla giovane età un amore per il Jazz. Nel 1988 si trasferisce ad Hong Kong dove frequenta il “Felix” noto locale di sola musica Jazz e approfondisce la cultura per questo affascinante genere musicale. Dal 2005 per otto anni collabora con Jazz FM.</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "jazy",
        "cover": "20230405_060453_d67703ab086fbb087532a274cd20e428.jpg"
    },
    {
        "podcast_id": 201447,
        "title": "Klass By Dj. Roberto Stoppa",
        "description": "<p>Grande passione per la musica fin da bambino. Comincia a 13 anni a cantare e suonare con svariate band … A 19 anni il primo ingaggio da professionista per serate come cantante in tutto il Veneto … Nel 1977 comincia a fare il DJ nei più grandi e famosi club del Nord Italia: BOOM, ANGELO…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "klass",
        "cover": "20230405_060414_ea7a6f9cde12abecfbc9b4f1f0cf85de.jpg"
    },
    {
        "podcast_id": 201448,
        "title": "MusicAlma By Dj. Otto Casagrande",
        "description": "<p>Musicista , Disc Jockey, Produttore e Remixer. Vive da sempre di musica. Ha lavorato in tutta Italia e in moltissimi paesi all’estero (tra cui: Spagna, Messico, Svizzera, Germania, Austria, Francia, Portogallo). La sua principale caratteristica e prerogativa è la scelta di proporre solo esclusivamente prodotti di qualità sia nei suoi Dj Set sia a livello…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "music-alma",
        "cover": "20230405_060435_bf5ab217a78502b3d075bd7e1395e63e.jpg"
    },
    {
        "podcast_id": 201449,
        "title": "My World By Papa Dj.",
        "description": "<p>Con quarant’anni di consolle alle spalle, Papa Dj appartiene di diritto ai pionieri del djing italiano. Specializzato in musica lounge, ethnic-house, slow deep, oriental and world, è sempre in viaggio alla ricerca di sonorità tipiche di varie regioni del mondo. Ha trascorso metà della sua carriera in oltre 300 club in Italia e passa attraverso…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "my-world",
        "cover": "20230405_060456_b17b25f3cc899235ac3887c42a98295e.jpg"
    },
    {
        "podcast_id": 201450,
        "title": "Other Rumors By Dj. Marco Gally",
        "description": "<p>Marco Gally comincia presto e non ha ancora finito. Nella seconda metà degli anni 70, la sua voce si fa spazio nell’ambiente radiofonico delle regioni Veneto /Emilia Romagna. T. R. P. /Rete Alfa /Radio Veneto /Radio Padova International /Radio Abano Network. Contemporaneamente inizia la sua avventura di Dj in locali di quasi tutte le regioni…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "other-rumors",
        "cover": "20230918_050957_e27f34079e4acceaed780d3f2713277d.jpg"
    },
    {
        "podcast_id": 201451,
        "title": "Sound System By Dj. Pino Mappa",
        "description": "<p>Pino Mappa non ha resistito al primordiale richiamo della musica che, con tutti gli altri membri del Team, si è radunato in MUSIC MASTERCLASS RADIO. Una data precisa del suo primo approccio alla musica sarebbe ormai impossibile da stabilire, ma a cavallo tra gli anni ’60 e ’70 con il fratello Paolo calcava già le…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "sound-system",
        "cover": "20230918_050934_0cda996732b2efadf9575e03d730fb85.jpg"
    },
    {
        "podcast_id": 201452,
        "title": "Sunset Emotions By Marco Celloni Dj.",
        "description": "<p>Marco Celloni è nel mondo della musica e della radio da oltre 40 anni. Nella sua vita professionale, ha iniziato molto giovane ad occuparsi di programmi radiofonici, collaborando con emittenti locali, fino ad arrivare a network nazionali e internazionali. Inoltre è apparso come ospite con suoi djset in alcune stazioni radio (FM &amp; Web) dislocate…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "sunset-emotions",
        "cover": "20230405_060422_8c49cfe4010578b0d5865e040b6e229e.jpg"
    },
    {
        "podcast_id": 201454,
        "title": "The Soul Club By Dj. Nicola Grassetto",
        "description": "<p>Nicola Grassetto, dopo alcuni anni di esperienze come speaker nelle radio, inizia come DJ nel 1978. L’elenco dei Club dove ha lavorato è molto numeroso, proprio a caratterizzare la sua attività: MURETTO (JESOLO LIDO), AREA (CORTINA), SOTTOVENTO (PORTO CERVO), PAPAGAIO’ (SAINT TROPEZ), PITER PAN (RICCIONE), KARISMA (PREGANZIOL), BSC8 (TREVISO), AREA (VENEZIA), MOLO 5 (VENEZIA), VILLA…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "the-soul-club",
        "cover": "20230405_060452_7fa25442f961e42d1d2e77c5c5ef12e4.jpg"
    },
    {
        "podcast_id": 201455,
        "title": "The White Fly By Dj. Francesco Giacomelli",
        "description": "<p>Francesco Giacomelli è un dj dal 1975. Ha cominciato nelle primissime radio private e contemporaneamente ha iniziato a seguire un amico dj che lavorava nelle discoteche. Passare, a sua volta, dietro alla consolle è stato un passo breve, logico e scontato. Nato musicalmente col rock ed il funky, è passato negli anni attraverso i generi…</p>",
        "language": "it",
        "author_name": "MusicMasterClassRadio",
        "slug": "the-white-fly",
        "cover": "20230918_050918_e02d77331a32d1d4a2745f027d93e35b.jpg"
    },
    {
        "podcast_id": 201856,
        "title": "Cocktail Chant By Simon J. On Radio Pocket ",
        "description": "<p>Simone, meglio conosciuto come Simon J, è nel mondo delle radio dall’estate del 2001, ma la sua passione ha origini più lontane, quando da piccolino andava in giro col microfono per intervistare i suoi parenti durante i pranzi o le cene. Ha iniziato come fonico e regista, ma la sua vera passione era stare davanti…</p>",
        "language": "it",
        "author_name": "Simon J.",
        "slug": "cocktail-chant-rp",
        "cover": "20230407_090439_bcee840e1218c7a516c5072787d7d45f.jpg"
    },
    {
        "podcast_id": 202027,
        "title": "Jazzy On Radio Pocket Music Designer Roby Bellini",
        "description": "<p>Roby Bellini ha sempre avuto, sin dalla giovane età un amore per il Jazz. Nel 1988 si trasferisce ad Hong Kong dove frequenta il “Felix” noto locale di sola musica Jazz e approfondisce la cultura per questo affascinante genere musicale. Dal 2005 per otto anni collabora con Jazz FM.</p>",
        "language": "it",
        "author_name": "Jazzy",
        "slug": "jazzy-radio-pocke",
        "cover": "20230408_090400_3769e1e09523cac7485651f733bcfcd0.jpg"
    },
    {
        "podcast_id": 202163,
        "title": "Sex In The Pocket By Radio Pocket",
        "description": "<p>Musica Lenta Internazionale Ed Italiana, International And Italian Slow Music From Radio Pocket La Piu' Bella.</p>",
        "language": "it",
        "author_name": "Radio Pocket Team",
        "slug": "sex-in-the-pocket",
        "cover": "20230409_070403_0b95fab0c1afd2d03b56fbefcd8fa426.jpg"
    },
    {
        "podcast_id": 202197,
        "title": "Come Fly With Me By Radio Pocket",
        "description": "<p>Tutta music Sinatra's style, American sogbook.</p>",
        "language": "it",
        "author_name": "Radio Pocket Team",
        "slug": "come-fly-with-me",
        "cover": "20230409_030439_7c5a8cb5c1f44f7a0646d6788d049607.jpg"
    },
    {
        "podcast_id": 202198,
        "title": "Gourmet By Radio Pocket",
        "description": "<p>Soul, Pop, Dance 70s ai giorni nostri brani selezionati dal Team di Radio Pocket \"La Più Bella\"</p>",
        "language": "it",
        "author_name": "Radio Pocket Team",
        "slug": "gourmet",
        "cover": "20230409_030445_5aa5d42fbb98f288e52705aced6a9c82.jpg"
    },
    {
        "podcast_id": 202312,
        "title": "Lovely Day By Radio Pocket Team.",
        "description": "<p>Happy radio (soul &amp; rhythm&amp;blues).</p><p>Soul  70s. ai giorni nostri.</p>",
        "language": "it",
        "author_name": "Lovely Day",
        "slug": "lovely-da",
        "cover": "20230410_080458_14d199e7fb5ed21351a09edec30e602d.jpg"
    },
    {
        "podcast_id": 202315,
        "title": "Luxury By Radio Pocket Team.",
        "description": "<p>Happy radio con aggiunta di un po’ di Soul &amp; Pop 80s ed inserimenti vocali di pillole di lusso.</p>",
        "language": "it",
        "author_name": "Luxury",
        "slug": "luxury",
        "cover": "20230410_090415_8cf0b518ac779ebe38aca697db3324ba.jpg"
    },
    {
        "podcast_id": 202359,
        "title": "P.P.M. Eterea Edition By Roby Sartarelli",
        "description": "<p>La migliore e nuova musica house, novità e classifiche.</p>",
        "language": "it",
        "author_name": "Roby Sartarelli",
        "slug": "ppm-eterea",
        "cover": "20230410_030430_8fcec6f2003a6e2a69b7fc159cf25ae0.jpg"
    },
    {
        "podcast_id": 202362,
        "title": "Slowdown By Radio Pocket Team.",
        "description": "<p>Ritmi mezzo tempo con acid jazz, indie e nu disco.</p>",
        "language": "it",
        "author_name": "Slowdown",
        "slug": "slowdown",
        "cover": "20230410_030448_d1db370f8e6815cf33fde7e86f3520a5.jpg"
    },
    {
        "podcast_id": 202366,
        "title": "Vinile By Radio Pocket Team.",
        "description": "<p>Disco 70/80 rigorosamente vinile</p>",
        "language": "it",
        "author_name": "Vinile",
        "slug": "vinile",
        "cover": "20230410_030458_a90259ce47783f0a3dec771f71f2ed22.jpg"
    },
    {
        "podcast_id": 202540,
        "title": "The MC  Nerd Jock Show",
        "description": "<p>The only show where you can get Music, Sports, and Nerd/Geek Culture all in one place! That’s right three in one!!</p>",
        "language": "en",
        "author_name": "GameCubeDatDude",
        "slug": "themcnerdjockshow",
        "cover": "20230418_050442_4bc4b213f1c7bcb1d17c1b041f5435e5.jpg"
    },
    {
        "podcast_id": 202559,
        "title": " Deano Digital Popcast",
        "description": "<p>All My Shows from 2021 to latest</p>",
        "language": "en",
        "author_name": "DJ Deano Digital",
        "slug": "allsortsdigitalhitsradio",
        "cover": "20230513_080538_2a62bd170529cdd329d2d2d5d4fd5163.jpg"
    },
    {
        "podcast_id": 202565,
        "title": "Pocket For You By Radio Pocket Team.",
        "description": "<p>Il meglio della programmazione giornaliera \"Soul, Disco &amp; Pop\"</p>",
        "language": "it",
        "author_name": "Pocket For You",
        "slug": "pocket-for-you",
        "cover": "20230411_090424_4299143f277af882669f735aa94616e3.jpg"
    },
    {
        "podcast_id": 202568,
        "title": "Sunset Emotions \"Radio Pocket By Marco Celloni Dj.",
        "description": "<p>Ritmi raffinati, ambient chillout e deep.</p>",
        "language": "it",
        "author_name": "Sunset Emotions",
        "slug": "sunset-emotions-rp",
        "cover": "20230411_090453_6ed265d4dc89c34360d363d375cf34d2.jpg"
    },
    {
        "podcast_id": 202571,
        "title": "Visioni \"Radio Pocket\" By Radio Pocket Team.",
        "description": "<p>Soulful, balearic house &amp; Nu disco.</p>",
        "language": "it",
        "author_name": "Visioni",
        "slug": "visioni",
        "cover": "20230411_090413_f21e6155a273e35e77c7ccc891b29222.jpg"
    },
    {
        "podcast_id": 205147,
        "title": "MusicAlma On Radio Pocket By Dj. Otto Casgrande",
        "description": "<p>Musicista , Disc Jockey, Produttore e Remixer. Vive da sempre di musica. Ha lavorato in tutta Italia e in moltissimi paesi all’estero (tra cui: Spagna, Messico, Svizzera, Germania, Austria, Francia, Portogallo). La sua principale caratteristica e prerogativa è la scelta di proporre solo esclusivamente prodotti di qualità sia nei suoi Dj Set sia a livello…</p>",
        "language": "it",
        "author_name": "MusicAlma",
        "slug": "musi-alma-rp",
        "cover": "20230424_110444_b1dcde4087469e67a1d955f5127909cd.jpg"
    },
    {
        "podcast_id": 206548,
        "title": "Construcción Radio CDMX",
        "description": "<p>Programas de Radio On Line</p><p>Programas sin fines de lucro</p><p>No tenemos derechos de autor de las canciones, estas son para fines de entretenimiento exclusivamente.</p><p>Programas tem<strong>á</strong>ticos</p>",
        "language": "es",
        "author_name": "Francisco Alcántar",
        "slug": "const",
        "cover": "20230501_020545_1171f3e23749a34cf7533f720a1db264.jpg"
    },
    {
        "podcast_id": 207985,
        "title": "Music by D Godfrey",
        "description": "<p>N/A</p>",
        "language": "en",
        "author_name": "Audio Master",
        "slug": "periodbellchange",
        "cover": "20230728_090701_76413f14faf688bf8079b6a3f33d95d9.jpg"
    },
    {
        "podcast_id": 208006,
        "title": "ADeriva.IndieRock",
        "description": "<p>Mosica Indie Rock y Alternativa.</p>",
        "language": "gu",
        "author_name": "Richar ADeriva",
        "slug": "aderiva",
        "cover": "20230508_080551_9463f565dbbec0741f9075c8c3e8d88f.jpg"
    },
    {
        "podcast_id": 208388,
        "title": "THE ALL THINGS METAL SHOW",
        "description": "<p>Interviews and music from back in the day when spandex, leather and hair spray ruled the Sunset Strip! </p>",
        "language": "en",
        "author_name": "All Things Metal Show",
        "slug": "allthingsmetalshow",
        "cover": "20230510_030502_0ee19756f09d00c9c976b631ff6ac2a0.jpg"
    },
    {
        "podcast_id": 209959,
        "title": "Caleidoscopio Sonoro",
        "description": "<p>Somos un programa de radio de la Universidad de Guadalajara en Colotlan, Nos dedicamos a hablar de rock, pero no de cualquier Rock, Hablamos de aquel que pocos hablan, vamos desde lo mas clasico hasta lo que acaba de salir, esas mezclas raras, esos covers que parecen no tener sentido. Somos un portal caleidoscopico que te lleva a vistar el multiverso del Rock. </p>",
        "language": "es",
        "author_name": "Jose Armando Rojas Orozco",
        "slug": "caleidoscopio-sonoro",
        "cover": "20230518_050551_8a6d082dff85844b114e84e80aa59ba0.jpg"
    },
    {
        "podcast_id": 210005,
        "title": "Kaboom Storie di Musica e di Bravi Ragazzi",
        "description": "<p>Terza  Stagione, alla voce Giovanni Amara-</p>",
        "language": "it",
        "author_name": "Giovanni Amara-",
        "slug": "giovanni-amara",
        "cover": "20230518_010526_35914e1b25f8c3edd2d01486b9c88fc9.jpg"
    },
    {
        "podcast_id": 210162,
        "title": "Denver Rock Scene",
        "description": "<p>Michael Zucker (Scientist, Musician and Record Producer) interviews various rock musicians, production engineers, and artists in the Denver rock scene. All interviews are done in person and no agenda is planned ahead of time.</p>",
        "language": "en",
        "author_name": "Michael Zucker",
        "slug": "drs",
        "cover": "20230519_020556_9376ced7cb19fe3ee21e489c2bcc2855.jpg"
    },
    {
        "podcast_id": 210551,
        "title": "SUPERBIA Jonathan Larson",
        "description": "<p>ummm</p>",
        "language": "en",
        "author_name": "Jonathan larson",
        "slug": "yeahhhhhiloveit",
        "cover": "20230521_110540_054d6e3a69f65a9d364b5505865655c3.jpg"
    },
    {
        "podcast_id": 210798,
        "title": "The Moose Review",
        "description": "<p>Welcome, audiophiles and vinyl enthusiasts, to The Moose Review by Moose Vinyl (<a href=\"http://www.moosevinyl.com/blog\">www.moosevinyl.com/blog</a>), your sanctuary for the deep exploration of the vinyl universe. Prepare to embark on an extraordinary auditory odyssey, meticulously curated for your listening pleasure. We illuminate hidden corners and traverse familiar terrains of the vinyl landscape, bringing you intriguing narratives and insights wrapped in a warm analog embrace.</p>",
        "language": "en",
        "author_name": "Moose Vinyl",
        "slug": "moosevinyl",
        "cover": "20230523_010519_38f2faf0619660dd0af973562ca0475d.jpg"
    },
    {
        "podcast_id": 211717,
        "title": "Rock and Roll en México",
        "description": "<p>Escucha con nosotros la historia del Rock and Roll a lo largo de los años y descubre la evolución musica.</p>",
        "language": "es-mx",
        "author_name": "Paco Banks",
        "slug": "alamorockradio",
        "cover": "20230527_050546_342828333890414cc0c78d76acecb61a.jpg"
    },
    {
        "podcast_id": 211889,
        "title": "Noticiari d'havaneres",
        "description": "<p>Podcast conduït i dirigit per Gerard Moreno, musicòleg. Us explicarem, si no tots, molts dels secrets que envolten el món de les havaneres. Història, curiositats, materials, continguts, grups, artistes, trobades, cantades, festivals, instruments... tot allò que d'alguna manera té relació amb l'havanera podrà ser tractat en col·laboració amb el nostre musicòleg Martí Bacardí, especialista de l'havanera.</p><p>Temporades de 10 episodis.</p>",
        "language": "ca-es",
        "author_name": "Gerard Moreno Sabaté",
        "slug": "noticiaridhavaneres",
        "cover": "20230528_110516_02c692212fe02655041314562402117d.jpg"
    },
    {
        "podcast_id": 211891,
        "title": "Noticiario de habaneras",
        "description": "<p>Podcast conducido y dirigido por Gerard Moreno, musicólogo. Os contaremos, si no todos, muchos de los secretos que rodean el mundo de las havaneras. Historia, curiosidades, materiales, contenidos, grupos, artistas, encuentros, cantadas, festivales, instrumentos... todo lo que de alguna manera tiene relación con la habanera podrá ser tratado en colaboración con nuestro musicólogo Juanma Banero.</p><p>Temporadas de 10 episodios.</p>",
        "language": "es",
        "author_name": "Gerard Moreno Sabaté",
        "slug": "noticiariodehabaneras",
        "cover": "20230528_120554_113e4725183b9cc2bf8c84bcb9c1b514.jpg"
    },
    {
        "podcast_id": 212487,
        "title": "头号广播 DONN RADIO",
        "description": "<p>双人电波是一档由插画师BrolySu跟制作人好友FridayWav一起闲聊交流的嘻哈音乐分享栏目。每期我们都会挑几首喜欢的Hip-Hop来跟大家分享，目的就是为了推广更多我们觉得尖的音乐人和作品。从一起在美国留学的时期我们私下就会经常碰面做这件事，也感谢互联网的便利，能够持续让我们在不同的地方推进音乐分享。</p><p>DONN Radio is a hip-hop music-sharing column where illustrator BrolySu chats with producer friend FridayWav. In each episode, we will select a few favorite Hip-Hop songs to share with you, the purpose is to promote more musicians and works that we think are top-notch. Since we both studied at Indiana University, we have often met privately to do this. We are so grateful for the convenience of the Internet, which allows us to continue to promote music sharing in different places.</p><p>如果你想跟我们交流，欢迎你来我们的社交媒体跟我们进行互动：</p><p>IG / 小红书：8rolysu</p><p>IG / 网易云 / B站：FridayWav</p><p>Clothing IG：realdonnstudio</p><p>服装公众号 / Taobao：DONN Studio</p>",
        "language": "zh",
        "author_name": "Broly Su & FridayWav",
        "slug": "donnradio",
        "cover": "20230531_060507_42b533841928a5539476d36421661462.jpg"
    },
    {
        "podcast_id": 212630,
        "title": "Balearic Jazzy \"Balearic Network\" By Roberto Bellini",
        "description": "<p>Balearic Jazzy uno show sempre attento ed aggiornato sulle nuove sonorità Nu Jazz, Break'n'Bossa, JazzFunk,Acid Jazz &amp; New Bossanova.</p>",
        "language": "it",
        "author_name": "Balearic Jazzy",
        "slug": "balearic-jazzy",
        "cover": "20230601_010612_101dad82562b15ee5d14378b058e1f16.jpg"
    },
    {
        "podcast_id": 212632,
        "title": "Sunset Emotions \"Balearic Network\" By Marco Celloni",
        "description": "<p>Sunset Emotions</p>",
        "language": "it",
        "author_name": "Sunset Emotions",
        "slug": "balearic-sunset-emotions",
        "cover": "20230601_010639_9e5e8f68cde4be847830cb957f184b86.jpg"
    },
    {
        "podcast_id": 212633,
        "title": "La Guitarra Del Sol \"Balearic Network\" By Nicola Grassetto",
        "description": "<p>La Guitarra Del sol</p>",
        "language": "it",
        "author_name": "La Guitarra Del Sol",
        "slug": "la-guitarra-del-sol",
        "cover": "20230601_010604_8ef98a7b78e8df1cba893b1e0e2527ca.jpg"
    },
    {
        "podcast_id": 212634,
        "title": "Shark Beat \"Balearic Network\" By Nicola Grassetto",
        "description": "<p>ANCHE SE UNO SQUALO HA DENTI AGUZZI... HA ANCHE UN CUORE... HA UN BATTITO... ANCHE UNO SQUALO...SA BALLARE! “SHARK BEATS”! NUOVE TRACCE, NUOVI RITMI! EVEN IF A SHARK HAS SHARP TEETH.... IT ALSO HAS A HEART... HAS A BEATS... EVEN A SHARK...CAN DANCE! SHARK BEATS!! NEW TRACKS, NEW RHYTHMS! AUNQUE UN TIBURÓN TENGA DIENTES AFILADOS... TAMBIÉN TIENE UN CORAZÓN... TIENE UN LATIDO... INCLUSO UN TIBURÓN... ¡PUEDE BAILAR! SHARK BEATS!! PISTAS NUEVAS, RITMOS NUEVOS</p>",
        "language": "it",
        "author_name": "Shark Beat",
        "slug": "shark-beat",
        "cover": "20230601_010628_0ee8061ed121effe643f54237c94f7b7.jpg"
    },
    {
        "podcast_id": 212635,
        "title": "Metropolis \"Balearic Network\" By Nicola Grassetto",
        "description": "<p>L'HYPER TRENO \"BALEARIC NETWORK\" ORA FERMA A...METROPOLIS. LA CITTA' MUSICAMENTE MULTICULTURALE. GRATTACIELI, GIARDINO ETERNO, SOTTOSUOLO... SCOPRITE DOVE SI NASCONDE LA PIU' BELLA MUSICA DEL MONDO. METROPOLIS. LA CITTA' DELLA MUSICA. THE HYPER TRAIN \"BALEARIC NETWORK\" NOW STOPS IN...METROPOLIS. THE MUSICALLY MULTICULTURAL CITY. SKYSCRAPERS, ETERNAL GARDEN, UNDERGROUND... DISCOVER WHERE THE WORLD'S MOST BEAUTIFUL MUSIC HIDES. METROPOLIS. ONE PEOPLE, ONE MUSIC. EL HIPERTREN DE LA \" BALEARIC NETWORK \" PARA AHORA EN... METRÓPOLIS. LA CIUDAD MUSICALMENTE MULTICULTURAL. RASCACIELOS, JARDÍN ETERNO, SUBTERRÁNEO… DESCUBRA DÓNDE SE ESCONDE LA MÚSICA MÁS BELLA DEL MUNDO. METROPOLIS. UN PUEBLO, UNA MÚSICA</p>",
        "language": "it",
        "author_name": "Metropolis",
        "slug": "balearic-metropolis",
        "cover": "20230601_010653_744c1ddcb429e9c825ef25f4b4728ca9.jpg"
    },
    {
        "podcast_id": 212636,
        "title": "Darkness \"Balearic Network\" By Nicola Gassetto",
        "description": "<p>NON SIAMO SOLI... DALLO SPAZIO PROFONDO, L'OSCURITÀ È SCESA SU DI NOI. NON TEMERE. TI PORTERÀ IN UN'ALTRA DIMENSIONE SONORA. RITMO, SENZA ECCESSI. SUONI, SENZA DISTORSIONI. LA POTENZA, CON CONTROLLO. DARKNESS. NON SIAMO SOLI. WE ARE NOT ALONE... FROM DEEP SPACE, “DARKNESS” HAS DESCENDED UPON US. FEAR NOT. IT WILL TAKE YOU TO ANOTHER SOUND DIMENSION. RHYTHM, WITHOUT EXCESS. SOUNDS, WITHOUT DISTORTION. POWER, WITH CONTROL. “DARKNESS”. WE ARE NOT ALONE.... NO ESTAMOS SOLOS... DESDE EL ESPACIO PROFUNDO, OSCURIDAD HA DESCENDIDO SOBRE NOSOTROS. NO TEMAS. TE LLEVARÁ A OTRA DIMENSIÓN DEL SONIDO. RITMO, SIN EXCESOS. SONIDO, SIN DISTORSIÓN. PODER, CON CONTROL. “DARKNESS”. NO ESTAMOS SOLOS.</p>",
        "language": "it",
        "author_name": "Darkness",
        "slug": "balearic-darkness",
        "cover": "20230601_010620_85beb193c4036751fada9483dab6d024.jpg"
    },
    {
        "podcast_id": 212637,
        "title": "Volver \"Balearic Network\" By Andrea Cecchinato",
        "description": "<p>PER COMPRENDERE IL PRESENTE, ED IMMAGINARE IL FUTURO, OCCORRE ASCOLTARE IL PASSATO. VOLVER. L'HOUSE CHE FA FATTO STORIA. CON ANDREA CECCHINATO. SU... BALEARIC NETWORK INGLESE TO UNDERSTAND THE PRESENT, AND IMAGINE THE FUTURE, IT IS NECESSARY TO LISTEN TO THE PAST. VOLVER. THE HOUSE THAT MAKES HISTORY. WITH ANDREA CECCHINATO. ON... BALEARIC NETWORK PARA COMPRENDER EL PRESENTE E IMAGINAR EL FUTURO, HAY QUE ESCUCHAR EL PASADO. VOLVER. LA HOUSE QUE HA HECHO HISTORIA. CON ANDREA CECCHINATO. EN... BALEARIC NETWORK</p>",
        "language": "it",
        "author_name": "Volver",
        "slug": "balearic-volver",
        "cover": "20230601_010617_0836223a4bf1ab31c93fd611477b6bcc.jpg"
    },
    {
        "podcast_id": 212638,
        "title": "Viva La Vida \"Balearic Network\" By Nicola   Grassetto ",
        "description": "<p>GLI AMICI, LA FAMIGLIA, IL SESSO, LA SCUOLA, L’AMORE, IL LAVORO, LE VACANZE, LA MUSICA, LA NOTTE, IL GIORNO... LA VITA NON E’ SEMPRE FACILE. MA E’...VITA!! VIVA LA VIDA! MUSICA FELICE, RADIO FELICE! BALEARIC NETWORK! INGLESE FRIENDS, FAMILY, SEX, SCHOOL, LOVE, WORK, VACATIONS, MUSIC, NIGHT, DAY... LIFE IS NOT ALWAYS EASY. BUT IT IS...LIFE!!! VIVA LA VIDA!!! HAPPY MUSIC, HAPPY RADIO! BALEARIC NETWORK! SPAGNOLO AMIGOS, FAMILIA, SEXO, ESCUELA, AMOR, TRABAJO, VACACIONES, MÚSICA, NOCHE, DÍA... LA VIDA NO SIEMPRE ES FÁCIL. PERO ES... ¡¡¡LA VIDA!!! ¡VIVA LA VIDA! MÚSICA FELIZ, RADIO FELIZ BALEARIC NETWORK!</p>",
        "language": "it",
        "author_name": "Viva La Vida",
        "slug": "balearic-viva-la-vida",
        "cover": "20230601_010645_7dfa83ee6a7eba282433ca2cd776d8bc.jpg"
    },
    {
        "podcast_id": 212684,
        "title": "Scarves Only Know",
        "description": "<p>An original podcast walking through the unfathomably iconic discography of the Beach Boys, brought to you by one of your favorite modern bands, the Scarves. Tom and Genny chatting everything Brian, Dennis, Mike, Carl, and Al (of course with special guests). Surfs up!</p>",
        "language": "en",
        "author_name": "The Scarves",
        "slug": "scarvesonlyknow",
        "cover": "20230601_060650_549ea24e2b30f5ec226ef90cdb7b791f.jpg"
    },
    {
        "podcast_id": 213046,
        "title": "Dan and The Fork: From TL3's Bedroom",
        "description": "<p>Welcome to \"Dan and The Fork: From TL3's Bedroom\"! Join Dan and Tom in TL3's intimate bedroom conversations as they dive into two of their biggest passions: music and sports. In each episode, Dan and Tom, two self-proclaimed enthusiasts, explore the latest happenings in the world of music and sports. From dissecting the greatest albums and singles to discussing the thrilling victories and heart-wrenching defeats of their favorite teams, this dynamic duo leaves no stone unturned. Get ready for thought-provoking discussions, lively debates, and entertaining banter as Dan and Tom share their unique perspectives and insights. Whether you're a die-hard music aficionado or a sports fanatic, this podcast promises to provide a refreshing take on both subjects. Tune in to \"Dan and The Fork: From TL3's Bedroom\" for engaging conversations, hilarious anecdotes, and a peek into the lives of two passionate individuals who know how to blend their love for music and sports seamlessly. Let Dan and Tom be your guides on this entertaining and informative journey.</p>",
        "language": "en",
        "author_name": "TL3",
        "slug": "dan-and-the-fork",
        "cover": "20230604_040629_d2a72c2af40b5000b18dd3575acb0f3f.jpg"
    },
    {
        "podcast_id": 213121,
        "title": "Dancehall Official Radio",
        "description": "<p>Dancehall music has changed a lot in the past 8 years, with an inflation of new artists and established artists following the new sound. Dancehall Official Radio promotes the latest dancehall music, with a touch of classic dancehall/reggae. Tunes are played by DJ D-Train, the show is hosted by Richy Styles &amp; the latest dancehall news is shared by KD Shae</p><p>For more info: dancehallofficialradio@gmail.com</p>",
        "language": "en",
        "author_name": "DJ D-Train, KD Shae & Richy Stylez",
        "slug": "dhoradio",
        "cover": "20230604_030645_1b3a88d38630c669e40173d16a61977f.jpg"
    },
    {
        "podcast_id": 213581,
        "title": "Pausa",
        "description": "<p>Pausa es tu espacio para que tomes un respiro y escuches una perspectiva única del mundo del entretenimiento, deporte y estilo de vida. Haz una pausa, detente, recuerda, entérate y diviértete.</p>",
        "language": "es-mx",
        "author_name": "Jorge Avila Andrade",
        "slug": "pausa",
        "cover": "20230709_080719_3611d9786c1554a183e583639c0e81aa.jpg"
    },
    {
        "podcast_id": 214472,
        "title": "Canciones randoms",
        "description": "<p>Las canciones las saco por tik tok oh por YouTube :D créditos a los de que hicieron los audios</p>",
        "language": "es",
        "author_name": "Canciones Randoms",
        "slug": "cancionesrandoms",
        "cover": "20230611_070629_1b6b6c53557f1eb34ae4885382bef892.jpg"
    },
    {
        "podcast_id": 215189,
        "title": "On Top of the World",
        "description": "<p><em>On Top of the World </em>is a music history podcast hosted by Shane Louis. New episodes release on Friday.</p><p>Originally as a 5 episode series, <em>On Top of the World </em>started as my senior undergraduate thesis (or Independent Study / I.S.) at the College of Wooster under the title <em>Forever On My Mind</em>. I majored in History with a minor in Education, and decided to do my final senior thesis on my favorite genre of music: the blues. With the help and encouragement of the History Department of the College of Wooster, I was able to create 5 episodes outlining my historical argument. I explored the songwriting of blues musicians in the 1960s, when their genre was most popular.</p><p>Now, the podcast has become my own median of storytelling and historical thinking when it comes to music. I hope you enjoy my eccentric storytelling, overly-poetic descriptions, and occasional jokes in my podcast.</p><p>Podcast Instagram: @ontopoftheworld1930</p><p>linktree: <a href=\"http://linktr.ee/shanelouis\">linktr.ee/shanelouis</a></p><p>Patreon: <a href=\"https://www.patreon.com/ShaneLouis\">https://www.patreon.com/ShaneLouis</a></p><p>For business inquiries: <a href=\"mailto:officialshanelouis@gmail.com\">officialshanelouis@gmail.com</a></p><p>\"She's gone</p><p>But I don't worry</p><p>I'm sitting on top of the world\"</p>",
        "language": "en",
        "author_name": "Shane Louis",
        "slug": "ontopoftheworld",
        "cover": "20230614_080609_2ee27e6210c08ba3e04f4fe827c47f41.jpg"
    },
    {
        "podcast_id": 215447,
        "title": "Scry & Goose Talk Sh!t",
        "description": "<p>Horror, metal, and ghosts!!! Scry &amp; Goose Talk Sh!t is a variety podcast filled with all sorts of spooky scary goodies. Join your hosts Scry and Goose every week as they explore terrifying topics and share their own experiences in the world of music, the paranormal, and daily life.</p>",
        "language": "en",
        "author_name": "Scry and Goose",
        "slug": "scrygoosets",
        "cover": "20230616_050627_ee1c19f03a63e5f20ee766d09d0d85e0.jpg"
    },
    {
        "podcast_id": 215519,
        "title": "Return of the Morning Mayor",
        "description": "<p>Herb Oscar Anderson, the \"Morning Mayor\" of NYC radio in the 1960s. HOA is back on the mic in spirit - Hosted by his daughter Karla. During this podcast we will talk to DJ’s who knew him, entertainers from the 60's who had their songs played on his show, as well as some of his listeners. We hope you will join us as we discover what radio was like in the 60’s as well as the sound of American Music…that created a magical time in New York City. Support our podcast! <a href=\"https://gofund.me/e05e6afa\">https://gofund.me/e05e6afa</a></p>",
        "language": "en",
        "author_name": "Hello Again Productions, LLC",
        "slug": "returnofthemorningmayor",
        "cover": "20230629_070615_9aeae67f8e95d1abbe72c538d6f0453e.jpg"
    },
    {
        "podcast_id": 216461,
        "title": "StreetJazz Show 1010",
        "description": "<p><strong>WHO WILL YOU DISCOVER TODAY on</strong></p><p><strong>‘ STREETJAZZ ‘ on JAZZNET247 RADIO EUROPE ?</strong></p><p><strong>Learn more about our JAZZ FEATURES and view our latest PLAYLISTS</strong></p><p><strong>@ </strong><a href=\"https://www.jazznet247.net/playlists\"><strong>https://www.jazznet247.net/playlists</strong></a></p><p><strong>PLAYING THE LATEST CONTEMPORARY JAZZ RELEASES</strong></p><p><strong>AND TRACKS FROM THE LEGENDS OF JAZZ</strong></p><p><strong>TUNE IN SECURELY ANYTIME, ANYWHERE COMMERCIAL FREE</strong></p><p><strong>Wes George</strong></p>",
        "language": "en",
        "author_name": "Wes George",
        "slug": "jazznet247radioeurope",
        "cover": "20230623_090634_4d7696be3cb0d481af1f3e8be4375bb8.jpg"
    },
    {
        "podcast_id": 216550,
        "title": "Deleted songs",
        "description": "<p>Don’t take dis down</p>",
        "language": "en",
        "author_name": "kayybankoo",
        "slug": "kayyli",
        "cover": "20230624_010632_6ffe61e8b71105ef703fb4547b04bbfd.jpg"
    },
    {
        "podcast_id": 216694,
        "title": "tyun & yj ; paper hearts",
        "description": "<p>tyun &amp; yj cover of paper hearts</p>",
        "language": "en",
        "author_name": "awice",
        "slug": "awice",
        "cover": "20230624_110646_6cbb3a3474ed2371c321d4cac1bf8940.jpg"
    },
    {
        "podcast_id": 216743,
        "title": "snsd japanese discography !",
        "description": "<p>every snsd japanese song</p>",
        "language": "en",
        "author_name": "fran",
        "slug": "soshijapanese",
        "cover": "20230625_020642_78b9adb3cf586a3d32ec60fe48fa872f.jpg"
    },
    {
        "podcast_id": 216753,
        "title": "sansar dolambacli yollar",
        "description": "<p>sansar salvo dolambacli yollar</p>",
        "language": "tr",
        "author_name": "Mamiko",
        "slug": "mamikkoexe",
        "cover": "20230625_040633_2805d365d86ec5f010e41c3b3affe30a.jpg"
    },
    {
        "podcast_id": 216767,
        "title": "Notas musicales",
        "description": "<p>Notas musicales es un podcast creado por Raquel Moreno, periodista apasionada de la música. </p>",
        "language": "es",
        "author_name": "Raquel Moreno ",
        "slug": "notasmusicales",
        "cover": "20230625_060637_71e41c8a7999216673a3efe59de240e0.jpg"
    },
    {
        "podcast_id": 216812,
        "title": "SOMA - SCOPE",
        "description": "<p>The Hardest Grime Mixes</p>",
        "language": "en",
        "author_name": "SC🎯PE RECORDINGS - SOMA REC⏺️RDS ",
        "slug": "soma-scope",
        "cover": "20230626_030649_33f9f026133976d66fff6f82c88502c6.jpg"
    },
    {
        "podcast_id": 216842,
        "title": "Songs/edit audios",
        "description": "<p>I will add songs that aint on spofity</p>",
        "language": "en",
        "author_name": "SSBPtigers",
        "slug": "ssbptigers",
        "cover": "20230626_080608_de8b1eb61d9526d19e78219d286e5d90.jpg"
    },
    {
        "podcast_id": 216843,
        "title": "The Spotify Top 10 ",
        "description": "<p>Join Stephen A Ireland and DJ (hosts of TheProudShow.com) every week for the Spotify Top 10. Which artists are your favourites? Have your favourites made it to the top of the Spotify streaming chart? </p>",
        "language": "en",
        "author_name": "Stephen A Ireland & DJ",
        "slug": "thespotifytop10",
        "cover": "20230626_080603_dc7a68062cd84040875bdd14c2120c80.jpg"
    },
    {
        "podcast_id": 217025,
        "title": "DJ Anderman | Night Of Nights (Live On Mix3r Radio)",
        "description": "<p>Come join the Party</p><p>• Live On Mix3r Radio - <a href=\"https://www.mixcloud.com/live/Mix3rRadio\">https://www.mixcloud.com/live/Mix3rRadio</a></p><p>• Any Donations - <a href=\"https://www.paypal.com/donate/?business=FSPSVFJRX6JR8&amp;no_recurring=0&amp;currency_code=AUD\">https://www.paypal.com/donate/?business=FSPSVFJRX6JR8&amp;no_recurring=0&amp;currency_code=AUD</a></p><p>Follow me!</p><p>• Instagram - <a href=\"https://www.instagram.com/dj_anderman\">https://www.instagram.com/dj_anderman</a></p><p>• YouTube - <a href=\"https://www.youtube.com/@anderman800_djanderman\">https://www.youtube.com/@anderman800_djanderman</a></p><p>• Facebook - <a href=\"https://www.facebook.com/DJAnderman\">https://www.facebook.com/DJAnderman</a></p><p>• <a href=\"http://Twitch.TV\">Twitch.TV</a> - <a href=\"https://www.twitch.tv/dj_anderman\">https://www.twitch.tv/dj_anderman</a></p><p>• Discord - <a href=\"https://discord.com/invite/E2SZZGR\">https://discord.com/invite/E2SZZGR</a></p>",
        "language": "en",
        "author_name": "DJ Anderman | Night Of Nights",
        "slug": "dj-anderman-night-of-nights",
        "cover": "20230627_010628_211e8de8fd39d50de330f427b3514ae6.jpg"
    },
    {
        "podcast_id": 217330,
        "title": "Historias del Rock",
        "description": "<p>Lo mejor de la Historia de uno de los géneros más influyentes de todos los tiempos, el rock, esto es <strong><em>#HistoriasDelRock</em></strong> a través de la radio web <em>Medio Wariney Radio</em> dirigido por <strong>Andriw Paredes</strong> todos los sábados 12 del medio día hora Colombia 🇨🇴 🔥 👇🏻 📳 </p><p><a href=\"http://Zeno.fm/medio-wariney-radio\">Zeno.fm/medio-wariney-radio</a> 🎧 📻 </p><p><a href=\"http://Onlineradiobox.com.co/MedioWariney\">Onlineradiobox.com.co/MedioWariney</a> </p><p>#RockOnPeople 🤘🏻 </p><p><a href=\"http://Www.MedioWariney.com\">Www.MedioWariney.com</a></p>",
        "language": "es-mx",
        "author_name": "Andriw Paredes",
        "slug": "medio-wariney-radio",
        "cover": "20230629_030639_9650a3cec3f83d1eea14e22b68f06d9c.jpg"
    },
    {
        "podcast_id": 217393,
        "title": "note block rock symphony",
        "description": "<p>eeh... idk</p>",
        "language": "es",
        "author_name": "...",
        "slug": "note-block-rock-symphony",
        "cover": "20230629_100647_4cd78875c2f35a7d57a664be143991da.jpg"
    },
    {
        "podcast_id": 217610,
        "title": "covers i wish were on spotify",
        "description": "<p>aaaaaaaaaaa</p>",
        "language": "en",
        "author_name": "ChaValentine",
        "slug": "luxiemcovers",
        "cover": "20230701_040715_3b2b64ce99fcd03a2dca2f04fe2c4dad.jpg"
    },
    {
        "podcast_id": 217719,
        "title": "ts ai covers",
        "description": "<p>just taylor ai covers</p>",
        "language": "en",
        "author_name": "jules",
        "slug": "tsss",
        "cover": "20230702_050701_d60e08eca6ba05c2d4ec83726010296c.jpg"
    },
    {
        "podcast_id": 217817,
        "title": "DJ Mixes by GROUND:FAULT:INTERRUPT",
        "description": "<p>LIVE recorded DJ Mixes by GROUND:FAULT:INTERRUPT from Melbourne, Australia.</p><p>Styles covered are Minimal Techno, Detroit, Hard Techno, Acid House, Tech House, Deep House &amp; Psytrance / Goa. For more information on the GROUND:FAULT:INTERRUPT project visit: <a href=\"https://www.groundfaultinterrupt.com/\">https://www.groundfaultinterrupt.com/</a></p>",
        "language": "en",
        "author_name": "GROUND:FAULT:INTERRUPT",
        "slug": "groundfaultinterrupt",
        "cover": "20230703_010731_e23047aa2a89a72274bbcd5cfb39de21.jpg"
    },
    {
        "podcast_id": 217999,
        "title": "el volao y la niña",
        "description": "<p>musica, marihuana y video juegos </p>",
        "language": "es",
        "author_name": "marcelo cortes",
        "slug": "las-cronicas-de-strappy",
        "cover": "20230704_040714_ad0316dd13fabfa7524ac436b42ad499.jpg"
    },
    {
        "podcast_id": 218003,
        "title": "OPUESTAS",
        "description": "<p>Podcast de contenido musical y biográfico de mujeres y disidencias sexogenéricas</p>",
        "language": "es",
        "author_name": "Yara Karola Muñoz Vidal",
        "slug": "opuestas",
        "cover": "20230704_040729_e699788c83ef1342d7efa20438c531c9.jpg"
    },
    {
        "podcast_id": 218004,
        "title": "Kultura K´S",
        "description": "<p>Podcast sobre Hip-Hop</p>",
        "language": "es",
        "author_name": "Vaitiare Silva, Roberto Lagos, Pablo Sánchez",
        "slug": "radiokulturaks",
        "cover": "20230704_040727_69b701ceb9c0a4b6fe82659a295ff199.jpg"
    },
    {
        "podcast_id": 218152,
        "title": "Soul Sugar Conversations",
        "description": "<p>We just love timeless music, man.</p><p>Soul Sugar Conversations: The Minds Behind Timeless R&amp;B/Soul Music is a podcast for the music heads, old souls, and the young at heart. Hosted by a 24-year-old super fan of 70s and 80s Soul, Funk, and Jazz music (Brooks Welch), this podcast is dedicated to music that will never get old, whether it's released today or 50 years ago.</p><p>If you dig this podcast and have a moment to support, please leave a review and comment! It helps us out more than you know!</p><p>Write to the show at soulsugarjoint@gmail.com</p>",
        "language": "en",
        "author_name": "Soul Sugar Joint",
        "slug": "soulsugarconversations",
        "cover": "20230705_060754_89e15c035d18ef5bc877c234c942660c.jpg"
    },
    {
        "podcast_id": 218203,
        "title": "Fantastic Mr. Fills",
        "description": "<p>Ever wonder why a piece of music makes you move and groove? Ever hear a beat that becomes a tedious earworm? Ever wonder why a song from the 1600's makes you bop your head just has hard as hyperpop? Join me, DJ HiHat, to my personal drum circle to discover the ins and outs of the percussive paradise I call Fantastic Mr. Fills!</p>",
        "language": "en",
        "author_name": "Ezra Gomez",
        "slug": "fantasticmrfills",
        "cover": "20230706_030730_c02681ca06afed65496fc6e93124f40f.jpg"
    },
    {
        "podcast_id": 218239,
        "title": "Showing the donkeys poker",
        "description": "<p>Stuff about donkeys</p>",
        "language": "en",
        "author_name": "Dick",
        "slug": "dickbrown",
        "cover": "20230707_080728_26ec3ee8951d78d9e2192449136e5ff7.jpg"
    },
    {
        "podcast_id": 218241,
        "title": "Talk show on Gazal",
        "description": "<p><strong><em>Podcast emphasis on Hindi Gazal sing by me hope you all enjoy.</em></strong></p>",
        "language": "en",
        "author_name": "Jaideep Singh",
        "slug": "my-awesomesinging",
        "cover": "20230708_070738_d46ee20307e8b159372811a6b02e5b84.jpg"
    },
    {
        "podcast_id": 218262,
        "title": "Claudio Naranjo - Piano. Brahms & Bach",
        "description": "<p><strong>Ficha técnica:</strong></p><p><em>Título</em>: Claudio Naranjo Piano / Brahms &amp; Bach</p><p><em>Intérprete</em>: Claudio Benjamin Naranjo Cohen</p><p><em>Lugar</em>: Auditório Fernando Mello Vianna. Escuela de Música UFMG (Universidade Federal de Minas Gerais), Belo Horizonte</p><p><em>Fecha</em>: 3 de junio de 2004</p><p><em>Piano</em>: Steinway &amp; Sons Gran Concierto</p><p><em>Ingeniero de sonido</em>: Fernando Braga</p><p><em>Dirección y producción</em>: Eduardo Ribeiro</p>",
        "language": "es",
        "author_name": "FCN",
        "slug": "claudiocdpiano",
        "cover": "20230706_010742_b862345ee0e11ad2528c628a5e768ccc.jpg"
    },
    {
        "podcast_id": 218290,
        "title": "SOMALI MOOMBAHTON MIX ",
        "description": "<p>Showcasing Trending Somali Pop Hits Remixed in Moombahton Beats Fusion. Enjoy a VIBE from The Horn!</p>",
        "language": "en",
        "author_name": "Dj Hunky Vevo ",
        "slug": "somaliclubmusic",
        "cover": "20230712_050750_efa03e133e2f291b260e86ed7b0959d4.jpg"
    },
    {
        "podcast_id": 218437,
        "title": "The Macabre FUNK Study",
        "description": "<p>credit funke</p>",
        "language": "en",
        "author_name": "dick",
        "slug": "thelemons",
        "cover": "20230707_050728_5407ea420249115b7492660166f6dce1.jpg"
    },
    {
        "podcast_id": 218453,
        "title": "Dj HB In The Lab",
        "description": "<p>1 hour of whatever made or makes you dance!</p>",
        "language": "en",
        "author_name": "Harold Banks",
        "slug": "djhbinthemixx",
        "cover": "20230707_080758_ab36fee3232789ac41f35986c58516de.jpg"
    },
    {
        "podcast_id": 218490,
        "title": "Swift Podcasting",
        "description": "<p>A Podcast all about Taylor Swift and her music.</p>",
        "language": "en",
        "author_name": "zii13",
        "slug": "swiftpodcasting13",
        "cover": "20230822_020840_2fcfa9fe3f82d0da3c8d051b5c8d7e88.jpg"
    },
    {
        "podcast_id": 218493,
        "title": "lei's cover",
        "description": "<p>hilu-!</p>",
        "language": "en",
        "author_name": "alea",
        "slug": "leolaisle",
        "cover": "20230708_010737_73b4475e4d2b0969a684cebfe6b84e85.jpg"
    },
    {
        "podcast_id": 218748,
        "title": "Blue devils- Metamorph",
        "description": "<p>Metamorph</p>",
        "language": "en",
        "author_name": "Blue devils",
        "slug": "alberve",
        "cover": "20230710_080751_a7bf6090d863404480ae45e766095c5a.jpg"
    },
    {
        "podcast_id": 218806,
        "title": "Beach House Cabo by Grey Domaine",
        "description": "<p>Beach House Cabo features a unique blend of Organic, Melodic &amp; Deep House perfect for the Beach, the pool or anytime you want to escape to the sounds of Paradise.</p><p>Recorded Live &amp; Unedited in Cabo San Lucas by Grey Domaine</p>",
        "language": "en",
        "author_name": "Grey Domaine",
        "slug": "deep-house-cabo",
        "cover": "20230721_060732_1154367cb0ee11219e8e5e8966d94efe.jpg"
    },
    {
        "podcast_id": 218831,
        "title": "MF RADIO EPISODIO PILOTO",
        "description": "<p>Podcast sobre Rock Latino en donde se conversan temas de las bandas de las que se hablen, incluyendo los significados de discos del recuerdo.</p><p>Nos gusta la nostalgia, pero claramente también la actualidad, por lo que se hablará de tus artistas favoritos en el hoy.</p><p>Anécdotas, y mucho más acá en MF RADIO PODCAST.</p>",
        "language": "es",
        "author_name": "Matías Abarca, Francis Bravo",
        "slug": "mfradio2023",
        "cover": "20230710_070709_1f6be763bef257d2884b25c8f7d3230c.jpg"
    },
    {
        "podcast_id": 218883,
        "title": "Nightclubbing with Cherry Pie",
        "description": "<p><strong>Nightclubbing with Cherry Pie is a show about the underground social revolutions that occur in discotheques around the world. Clubgoers worship life through music, and often under the influence-- connecting heaven and earth on the dance floor. Join us 4th Tuesdays from 7:30pm to 9pm on Lower Grand Radio for a new episode each month, as we explore the realms in which people’s movements and entertainment meet, creating culture, community and music.</strong></p>",
        "language": "en",
        "author_name": "Caity Watson",
        "slug": "nightclubbingwithcherrypie",
        "cover": "20230711_020759_bb7ef32a6479d9495d1dffc44ef0d42b.jpg"
    },
    {
        "podcast_id": 218907,
        "title": "Fine and Dandy",
        "description": "<p>man lord bung man</p>",
        "language": "en",
        "author_name": "Lordbungarchive",
        "slug": "missconfinment",
        "cover": "20230711_060714_5ad937c78241a4c8e0420295d679d1c9.jpg"
    },
    {
        "podcast_id": 218997,
        "title": "July Songs",
        "description": "<p>Get ready to embrace the magic of pop music and discover the sounds that define our generation. This playlist is your ticket to an immersive and exhilarating sonic journey that will have you coming back for more. Enjoy the ultimate pop music experience!</p>",
        "language": "en",
        "author_name": "Chill MIX",
        "slug": "chill-mix",
        "cover": "20230711_070755_232eee37e8b25d8407dfc6bed62f9c8d.jpg"
    },
    {
        "podcast_id": 219384,
        "title": "I wanted to be able to add a video audio from my phone onto my feels playlist",
        "description": "<p>Ode to Vivian+ intense Florida rain</p>",
        "language": "en",
        "author_name": "ML",
        "slug": "i-just-wanted-to-find-a-way-to-listen-to-this-video-i-took-on-spotify",
        "cover": "20230714_010707_1825e316b9bc5b3f63ba73998b8b1a35.jpg"
    },
    {
        "podcast_id": 219639,
        "title": "DatKidRr History Of Music",
        "description": "<p>Stories share on how DatKidRr became a households name for rapper around the UK just started off at 13 years old nearly 15 now he has found the perfect way to settle in on big steaming services.</p><p>-</p><p>This is story on how he begun!</p>",
        "language": "en",
        "author_name": "Ryan Thompson - DatKidRr",
        "slug": "datkidrrpd",
        "cover": "20230716_120748_1f3408a5cc956f9506d3c987fff0b0c5.jpg"
    },
    {
        "podcast_id": 219883,
        "title": "REMEMBER MANIATICS",
        "description": "<p>PROGRAMA EN DIRECTO LUNES Y MIERCOLES DE 18.00 A 20.00 EN <a href=\"http://NORTERADIO.COM\">NORTERADIO.COM</a> NORTE RADIO 92.2 VITORIA Y KULTURA REMEMBER FM 104.1 VALENCIA,ONDA OCIO 107.5 LOGROÑO Y 107.9 TUDELA</p><p>LA MEJOR MUSICA DE VUESTRA VIDA,80s 90s y 2000,recopilatorios,especiales y mucho mas</p>",
        "language": "es",
        "author_name": "MARIO MENCHON",
        "slug": "remembermaniatics",
        "cover": "20230717_060755_82537f446ba6a9ed8e683933a50e92e4.jpg"
    },
    {
        "podcast_id": 220214,
        "title": "bamb00river",
        "description": "<p>Digital Titans For The Virtual Age</p>",
        "language": "en",
        "author_name": "BC Reid",
        "slug": "bambooriver",
        "cover": "20230719_020703_62cc5413bd2edf8920eead7d54cbd384.jpg"
    },
    {
        "podcast_id": 220245,
        "title": "Exploring the Soul of Music",
        "description": "<p>Welcome to \"Harmonious Rhythms: Exploring the Soul of Music,\" the ultimate podcast for music enthusiasts and curious minds alike! Join us on a captivating journey through the diverse and enchanting world of music, as we delve deep into its rich history, evolution, and cultural significance.</p><p>In each episode, we'll unravel the fascinating stories behind legendary musicians, iconic bands, and groundbreaking compositions that have left an indelible mark on the music landscape. From classical masterpieces to the latest chart-toppers, our discussions will encompass a wide array of genres, ensuring there's something for every music lover.</p>",
        "language": "en",
        "author_name": "Lil Yachty",
        "slug": "exploring-the-soul-of-music",
        "cover": "20230719_060740_4a5e101fbc7c47449d6ddcd6f832f592.jpg"
    },
    {
        "podcast_id": 220263,
        "title": "ayesha erotica",
        "description": "<p>just a repost for my playlists</p>",
        "language": "en",
        "author_name": "jc!",
        "slug": "aehu-2023",
        "cover": "20230719_070727_afd8ab5eafb97cf08d6ba3b4716df378.jpg"
    },
    {
        "podcast_id": 220414,
        "title": "欢迎来到CalmVibescape频道",
        "description": "<p>欢迎来到CalmVibescape频道！我们专注于通过放松音乐和美丽的自然景观带给您宁静的休憩时光。</p><p>🎵 放松音乐：沉浸在宁谧世界中，我们精心挑选了一系列舒缓小众的音乐。从温柔的钢琴旋律到平静的乐器曲目，我们的音乐旨在舒缓您的心灵，提升您的情绪。</p><p>🍃 自然氛围：通过我们迷人的视频，踏上一段穿越宁静景色和迷人风光的旅程。在舒适的环境中体验大自然的美景和声音，从宁静的森林到宜人的瀑布，尽在您的视线之间。</p><p>不论您是寻求繁忙一天中的片刻休憩，还是渴望重新连接大自然的宁谧，CalmVibescape为您提供一个充满安抚声音和美景的避风港。</p><p>🔔 订阅我们的频道，一同踏上这份宁静与焕发的旅程！🔔</p><p><a href=\"http://surl.li/jfzzx\">Youtube = CalmVibescape</a></p><p>感谢您成为我们社区的一部分，我们致力于为您提供放松、平静和宁谧的时刻。让我们一起拥抱这份平和的氛围，逃离尘世，进入宁静的世界。</p>",
        "language": "zh",
        "author_name": "CalmVibescape",
        "slug": "calmvibescape",
        "cover": "20230720_020720_ddbc46cb882cfc159d0ccbc3f9d5ce44.jpg"
    },
    {
        "podcast_id": 220564,
        "title": "Vũ Thanh Tùng",
        "description": "<p>Oskemix : Vũ Thanh Tùng</p>",
        "language": "vi",
        "author_name": "Vũ Thanh Tùng",
        "slug": "oskemix",
        "cover": "20230721_030720_0c4042e61dc6879d6383d4bf7db29380.jpg"
    },
    {
        "podcast_id": 220749,
        "title": "ryan ross unreleased",
        "description": "<p>ryan upload this on spotify pls</p>",
        "language": "en",
        "author_name": "Ryan Ross",
        "slug": "ryro",
        "cover": "20230723_040702_08185d3897d55d3c25df6135366be348.jpg"
    },
    {
        "podcast_id": 221028,
        "title": "Sound of LIFE",
        "description": "<p>This will help you go throughout the day!</p>",
        "language": "en",
        "author_name": "sparky",
        "slug": "millows",
        "cover": "20230725_040725_3ab1d3fb2139ec5390aa25881d221d08.jpg"
    },
    {
        "podcast_id": 221100,
        "title": "Desert duo song :3",
        "description": "<p>Bro idk</p>",
        "language": "en",
        "author_name": "Desertduo lover",
        "slug": "desertduo",
        "cover": "20230725_030751_c20b16846e4a715fb334ab45e87f1a50.jpg"
    },
    {
        "podcast_id": 221241,
        "title": "lebih indah dari angaksa",
        "description": "<p>formalitass</p>",
        "language": "id",
        "author_name": "laavie",
        "slug": "laavie",
        "cover": "20230726_030727_0e4dd2bc78289bf3ceed80053ee15c56.jpg"
    },
    {
        "podcast_id": 221499,
        "title": "dean",
        "description": "<p>title</p>",
        "language": "en",
        "author_name": "covers",
        "slug": "minchi",
        "cover": "20230728_030748_af064cd3b9d9136f3b0176654bb556fd.jpg"
    },
    {
        "podcast_id": 221642,
        "title": "Sin & Steel",
        "description": "<p>Sin and Steel! A podcast exploring all things heavy metal.</p><p>Listen in with Aussie host Sarah as we discuss a range of topics and explore our favourite bands or artists.</p><p>Are you metal?! Let’s test your knowledge with a monthly trivia episode. Play along alone, or get your mates together and be competitive.</p><p>Also available on Spotify and YouTube!</p><p><strong>Episodes Releasing Each Month:</strong></p><p>- 6th: Main Topic and Recent Releases</p><p>- 16th: Are You Metal?! Trivia</p><p>- 26th: Artist Spotlights</p><p><strong>Note: </strong>This podcast is written and recorded for distribution on Spotify, where I include some ripper tunes between segments. Versions on other platforms have had these removed. You can find the Spotify version, and the intended playlists through the link below. </p><p><a href=\"https://linktr.ee/sinandsteel\">https://linktr.ee/sinandsteel</a></p>",
        "language": "en",
        "author_name": "Sin & Steel Podcast",
        "slug": "sinandsteel",
        "cover": "20230729_040711_ea863ee57ebfe7ebbf44cb734c2671a5.jpg"
    },
    {
        "podcast_id": 221722,
        "title": "Live From: Love on Tour ",
        "description": "<p>Live versions of songs on the Love on Tour setlist! </p>",
        "language": "en",
        "author_name": "Katie Mae ",
        "slug": "livefromhslot",
        "cover": "20230729_100731_038e6ac31453feb31d9e82784836aee0.jpg"
    },
    {
        "podcast_id": 221985,
        "title": "Dźwięki Nocy",
        "description": "<p>Piękna muza na wieczór...</p>",
        "language": "pl",
        "author_name": "Kinga Dagmara Siadlak & Marek Rogala",
        "slug": "dzwiekinocy",
        "cover": "20230731_070732_6e7e0aacdf7dafa65b40d342613c1379.jpg"
    },
    {
        "podcast_id": 222337,
        "title": "Two Music Lovers",
        "description": "<p>Podcast entièrement dédié à la musique. Que vous soyez un mélomane passionné ou simplement curieux, vous êtes au bon endroit pour découvrir et explorer tous les genres musicaux, des classiques intemporels aux dernières tendances. Dans ce podcast, nous vous présenterons des artistes, des albums, des histoires fascinantes et des anecdotes surprenantes qui vous feront apprécier la musique sous un nouveau jour. Installez-vous confortablement, ajustez vos écouteurs, et laissez-vous emporter par la magie de la musique !</p>",
        "language": "fr",
        "author_name": "Gabriel et Rosalie ",
        "slug": "twomusiclovers",
        "cover": "20230802_080823_52ec03469f61a0c96db1f95909c73eaf.jpg"
    },
    {
        "podcast_id": 222501,
        "title": "Global Na Tua Banda",
        "description": "<p>So músicas Boas todos os</p>",
        "language": "en",
        "author_name": "Global Na Tua Banda",
        "slug": "globalnatuabanda",
        "cover": "20230803_110847_86fac0e239d429ef56e82b1bb7d449d6.jpg"
    },
    {
        "podcast_id": 222558,
        "title": "The Weekend Mix",
        "description": "<p>Get ready for an amazing weekend with the ultimate mixtape curated by none other than DJ Dotwood! Enjoy a carefully chosen selection of the best tracks that perfectly match your party mood. 🎶🥳</p>",
        "language": "en",
        "author_name": "The weekend mix",
        "slug": "the-weekend-mix",
        "cover": "20230804_100856_d2165acb435331b068a7f4f0fbeff917.jpg"
    },
    {
        "podcast_id": 222816,
        "title": "Angelica M. (Aka Dudely M.) - Party at the club remix",
        "description": "<p><strong>Lyrics and created by: Angelica M.</strong></p><p><strong>Instrumentals : Angelica M.</strong></p><p><strong>Sound Editor: Angelica M.</strong></p><p><a href=\"http://M.Support\"><strong>Support</strong></a><strong> me by bandcamp or through paypal:</strong><a href=\"http://dudelym.bandcamp.com\"><strong>dudelym.bandcamp.com</strong></a></p>",
        "language": "en",
        "author_name": "Angelica Mc Crann",
        "slug": "berlinstateofmind",
        "cover": "20230806_040837_b39b9bc2bb0824ff3329762533d38ffc.jpg"
    },
    {
        "podcast_id": 222936,
        "title": "Lana Del Rey",
        "description": "<p>xoxo</p>",
        "language": "en",
        "author_name": "Lana",
        "slug": "lanavault",
        "cover": "20230807_100840_2999b3c9e7d2601cf0da72f29bd509a3.jpg"
    },
    {
        "podcast_id": 222962,
        "title": "Lana Del Rey",
        "description": "<p>deluxe</p>",
        "language": "en",
        "author_name": "Lana",
        "slug": "lanadeluxe",
        "cover": "20230807_030815_e983152da5265940795f9e7bc4e43ffa.jpg"
    },
    {
        "podcast_id": 222973,
        "title": "Deadology",
        "description": "<p>Join author, Howard Weiner, as he explores the diverse musical universe of the Grateful Dead and Jerry Garcia. Howard draws upon his many years of touring with the Grateful Dead to analyze their best shows and jams, as well as sharing his personal tales from the road, Deadology will also provide a touch of Dylan, and other artists influential to the Dead.</p>",
        "language": "en",
        "author_name": "Howard Weiner",
        "slug": "deadology",
        "cover": "20230807_040800_f3a84ec7428fc1b625270bcff472aac1.jpg"
    },
    {
        "podcast_id": 223270,
        "title": "Lana Del Rey ",
        "description": "<p>Honeymoon era </p>",
        "language": "en",
        "author_name": "Honeymoon ",
        "slug": "honeymoonera",
        "cover": "20230809_110838_92d55af05beb163b8dd496f88112fe93.jpg"
    },
    {
        "podcast_id": 223387,
        "title": "Unreleased songs",
        "description": "<p><strong>unreleased songs</strong></p>",
        "language": "en",
        "author_name": "maki moto",
        "slug": "unrealesed-songs",
        "cover": "20230810_040840_9fa9720c58fb2f3c4b9721a699cb6921.jpg"
    },
    {
        "podcast_id": 223472,
        "title": "All The Front Bottoms Songs",
        "description": "<p>All TFB songs, including the ones not available on spotify. </p><p>Thank you to the below playlist for helping me find the songs.</p><p><a href=\"https://www.youtube.com/playlist?list=PLjqLfs_X-wBmYlHWSyNLI3TK0pvjnttfj\">https://www.youtube.com/playlist?list=PLjqLfs_X-wBmYlHWSyNLI3TK0pvjnttfj</a></p><p>I AM NOT BRAIN. I AM NOT AFFILIATED WITH THE BAND.</p>",
        "language": "en",
        "author_name": "Elias",
        "slug": "thefrontbottomsallsongs",
        "cover": "20230810_050855_d15d2728edfe353730ddfef9472cc421.jpg"
    },
    {
        "podcast_id": 223620,
        "title": "El Son y algo mas.",
        "description": "<p><strong>Historia del genero musical del Son.</strong></p>",
        "language": "es",
        "author_name": "Agustina Gonzalez",
        "slug": "agustinagonzalez",
        "cover": "20230811_050834_752140ee6ebb8e078c46e1ec34a0602a.jpg"
    },
    {
        "podcast_id": 223628,
        "title": "The Greatest Mixtape Podcast",
        "description": "<p>If music is life, then life is a mixtape. On <em>The Greatest Mixtape Podcast</em>, we talk about our love for all kinds of music and how that music has defined certain moments in our lives. We go deep and discuss our favorite artists, songs and albums from the worlds of heavy metal, hip-hop, classic rock, blues, punk, alternative and everything else in between.</p>",
        "language": "en",
        "author_name": "Eric & Mack",
        "slug": "thegreatestmixtapepodcast",
        "cover": "20230811_060859_5e5dc0fc2ebb16bc089206a3c017dc77.jpg"
    },
    {
        "podcast_id": 223758,
        "title": "Montevideo Sonoro",
        "description": "<p><strong>Montevideo Sonoro. Un recorrido musical por la ciudad.</strong></p><p><strong>Distintas líneas, distintos orígenes y destinos. Un único método de transporte, la música que nos une. Montevideo Sonoro es un programa realizado y conducido por Nicolás Hidalgo y Diego Castro en Radio Belcha, un mapa musical que nos invita a conocer distintos caminos que forman parte de nuestras vidas. Desde la Aduana al Prado. Desde Malvín a Belvedere. Desde Pocitos a Paso Molino, recorreremos a nuestro Montevideo, zonas, barrios y las historias que se encuentran atrás de cada canción.</strong></p><p><strong>Idea, conducción y producción: Nicolás Hidalgo, Diego Castro. Inspirado en el proyecto ideado y creado por Gabriel Bentancor y Daniel Machín.</strong></p><p><strong>Por aportes musicales y otras sugerencias entrá a </strong><a href=\"http://montevideosonoro.uy\"><strong>montevideosonoro.uy</strong></a><strong> y dejá tu granito de arena para seguir agrandando este mapa musical colaborativo.</strong></p><p><strong>Montevideo Sonoro es una intervención urbana y un proyecto interactivo de georreferenciación, puesta en valor y divulgación del patrimonio musical de la ciudad.</strong></p><p><strong>Montevideo Sonoro. Un proyecto en constante construcción. Ciudad viva, en movimiento.</strong></p>",
        "language": "es",
        "author_name": "Diego Castro Famea",
        "slug": "montevideosonoro",
        "cover": "20230812_050842_014e290cc73accf28bf2697b584e39fb.jpg"
    },
    {
        "podcast_id": 223780,
        "title": "Unreleased :)",
        "description": "<p>Cool tunes :3</p>",
        "language": "en",
        "author_name": "Ellie",
        "slug": "ellieunreleasedsongs",
        "cover": "20230812_080818_4410ae2d77cfbfd42cb051ce7581ea2a.jpg"
    },
    {
        "podcast_id": 223880,
        "title": "BlueTiek-in",
        "description": "<p>Enjoy music!</p>",
        "language": "nl",
        "author_name": "Dick Dikker",
        "slug": "thegenesiscast",
        "cover": "20230814_070803_12cba9026b1a85aafdc17cdd5bac30b2.jpg"
    },
    {
        "podcast_id": 224069,
        "title": "Believe ",
        "description": "<p>Stream it on any social media platforms </p>",
        "language": "en",
        "author_name": "Michael Miles Red Ft Angel ",
        "slug": "out-now-on-social-media-platforms",
        "cover": "20230814_080813_388ce46477174c80c2b032cafdd43bc4.jpg"
    },
    {
        "podcast_id": 224217,
        "title": "Lana Del Rey",
        "description": "<p>Kiss Me Hard Before You Go &lt;/3</p>",
        "language": "en",
        "author_name": "Ultraviolence",
        "slug": "sadness",
        "cover": "20230815_060802_6d305bb2f85ec2082056ef2f18880b3b.jpg"
    },
    {
        "podcast_id": 224225,
        "title": "Entrevista a los hijos del compositor Tomás Méndez",
        "description": "<p><strong><em>Entrevista a los hijos del compositor Tomás Méndez autor y compositor de Cucurrucucú paloma, Paloma negra, Leña de pirúl y otros éxitos mas.</em></strong></p><p><strong><em>En la casa de El Indio Fernández coincidió con Lola Beltrán y se convirtió en su compositor de cabecera. Con ella, en 1952 alcanzaron el éxito La luna dijo que no, Que me toquen las golondrinas, Tres días, Desafío, Gorrioncillo pecho amarillo, Huapango torero y la internacional Cucurrucucú paloma.</em></strong></p><p><strong><em>Otras obras de su autoría son Las rejas no matan, Los amigos del mayor, La muerte, A los cuatro vientos, Cuando canta la paloma, Puñalada trapera, El tren sin pasajeros, La muerte de un gallero, Paloma déjame ir, Golondrina presumida, Paloma negra, Suspenso infernal, El ramalazo, Bala perdida, El globero, No le temo a la muerte, Leña de pirul y Laguna de pesares, por mencionar algunas que fueron encumbradas por artistas como Pedro Infante, Javier Solís, Amalia Mendoza La tariácuri, Lucha Villa y María Dolores Pradera.</em></strong></p>",
        "language": "es",
        "author_name": "Mirza Herrera",
        "slug": "canto-amor-y-guitarras",
        "cover": "20230815_060831_718d0a757a6e936a4c1a7320b76e71f9.jpg"
    },
    {
        "podcast_id": 224245,
        "title": "Musical Tangents",
        "description": "<p>The hosts, Valerie and Loui, discuss and explore various topics within the bounds of music... but they can go into tangents ;) The world is big and the musical world is even bigger with creative artists who attempt to express their identities. How are we to navigate in the complex world of cultures in the musical world as consumers of music? Valerie and Loui don't promise any answers, but just geeky conversations that motivate you to think and ponder upon some of these topics.</p>",
        "language": "en",
        "author_name": "Loui & Valerie",
        "slug": "musicaltangents",
        "cover": "20230815_080852_937e9386f911ca3cdd0623d6753febb7.jpg"
    },
    {
        "podcast_id": 224375,
        "title": "Eclectic Earbuds Podcast",
        "description": "<p>A podcast for all things related to the love of music! Expect dives into music history, chats related to music with interesting people, exploration of classic and current music from all genre's, music production and writing talk, and a lot of love! </p><p>\"It's all about the music, man!\"</p>",
        "language": "en",
        "author_name": "Ben France",
        "slug": "eclecticearbuds",
        "cover": "20230816_040820_abd768072075016634c1e643c5ed2434.jpg"
    },
    {
        "podcast_id": 224393,
        "title": "jungkook",
        "description": "<p>Lately I've been thinkin', thinkin' 'bout what we had</p><p>I know it was hard, it was all that we knew, yeah.</p><p>Have you been drinkin', to take all the pain away?</p><p>I wish that I could give you what you, deserve</p><p>'Cause nothing could ever, ever replace you</p><p>Nothing can make me feel like you do.</p><p>You know there's no one, I can relate to</p><p>And know we won't find a love that's so true. </p><p>There's nothing like us, there's nothing like you and me</p><p>Together through the storm.</p><p>There's nothing like us, there's nothing like you and me</p><p>Together. </p><p>I gave you everything, baby, everything I had to give</p><p>Girl, why would you push me away?</p><p>Lost in confusion, like an illusion</p><p>You know I'm used to making your day.</p><p>But that is the past now, we didn't last now</p><p>Guess that this is meant to be.</p><p>Tell me was it worth it?</p><p>We were so perfect</p><p>But baby I just want you to see</p><p>There's nothing like us, there's nothing like you and me</p><p>Together through the storm.</p><p>There's nothing like us, there's nothing like you and me</p><p>Together.</p><p>There's nothing like us, there's nothing like you and me</p><p>Together through the storm.</p><p>There's nothing like us, there's nothing like you and me</p><p>Together.</p>",
        "language": "en",
        "author_name": "grit.",
        "slug": "pimstonesmain",
        "cover": "20230916_010918_d7868849a20af3a689cd04321038d9b2.jpg"
    },
    {
        "podcast_id": 224486,
        "title": "pim stones",
        "description": "<p>Oh, tell me this isn't true. </p><p>Oh, is this really the end? </p><p>And as all the leaves rustle above us. </p><p>And as all the dirt covers our skin. </p><p>Rest your head onto my chest. </p><p>I'll tell you stories of the life we could have had. </p><p>We danced bare-footed in the grass. </p><p>We read big, heavy books and we would smile. </p><p>Our only drug was love. </p><p>And boy did we get high, oh, how we smoked each other up. </p><p>And as all the leaves rustle above us. </p><p>And as all the dark covers our skin. </p><p>Rest your head onto my chest. </p><p>I'll tell you stories of the life we could have had. </p><p>Oh, my love, my one true friend. </p><p>Oh, is this really the end? </p><p>We worked hard and we made lots of money. </p><p>And when we had enough to be happy, we gave the rest away. </p><p>We didn't complain much. </p><p>We were good with what we had. </p><p>Oh, how we were happy. </p><p>And as all the leaves rustle above us. </p><p>And as all the cold buries our bones. </p><p>Rest your head onto my chest. </p><p>I'll tell you stories of the life we could have had. </p><p>We traveled to lands and then beyond. </p><p>Found ourselves a boat and sailed into the sun. </p><p>Oh, how we were happy. </p><p>In the life we could have had. </p><p>Had, had, had, had. </p><p>Rest your head onto my chest. </p><p>I'll tell you stories of the dream we could have lived. </p><p>Of the places we could have seen. </p><p>Of the things we could have done. </p><p>Of the people we could have been. </p><p>Now every word is a whisper. </p><p>And every sound is a song. </p><p>And as all the leaves rustle above us. </p><p>There's no moving on. </p><p>This is the end...</p>",
        "language": "en",
        "author_name": "grit.",
        "slug": "grit",
        "cover": "20230817_070817_cebf2993fb6eb066259f232a68c1b153.jpg"
    },
    {
        "podcast_id": 224524,
        "title": "CHUNLEJO MP3 Coll.",
        "description": "<p>Thadou la ngailu jousen ana ngai cheh ute....</p>",
        "language": "en",
        "author_name": "CHUNLEJO",
        "slug": "chunlejo",
        "cover": "20230817_030803_46bf3bd090eace30c8a46cc0db40a4c1.jpg"
    },
    {
        "podcast_id": 224765,
        "title": "MY L0VE",
        "description": "<p>ig</p>",
        "language": "en",
        "author_name": "Hashabu★!",
        "slug": "httpswwwtiktokcomtzt8fjdq3s",
        "cover": "20230819_010843_e180be871979c7c8dc95a28facb6d5a5.jpg"
    },
    {
        "podcast_id": 224821,
        "title": "ELEKTROPİ: Elektronik Müziğe Dair Podcast Serisi",
        "description": "<p>Elektropi serisi, ses şeridi üzerinde yapılan müziğin yani elektronik müziğin doğasına inebilme amacıyla düzenlenen bilgilendirici bir podcast serisidir. Bu seride; müziğin ulaştığı son noktayı tanıma yolunda elektronik müziğin tarihine, ilk atılımlarına, türlerine, füzyonlarına, önde gelen bestecilerine ve son olarak dj’lik sanatına değineceğiz. Yeri geldiğinde akıcılığı sağlamak adına türleri müzik üzerinden örneklerle değerlendirerek anlatmak istediklerimizin pekişmesini sağlayacağız.</p><p>Elektronik müziğin derinlerine yaptığımız bu turda Ecem ve ekip arkadaşı Arın size rehberlik edecek.</p>",
        "language": "tr",
        "author_name": "Ecem Ercan & Arın Aydoğan",
        "slug": "elektropi",
        "cover": "20230819_020807_04cef5840dff91be2dda576bd5a84bf1.jpg"
    },
    {
        "podcast_id": 224827,
        "title": "Melanie Martinez (unreleased) ",
        "description": "<p>This is brand new. I didn’t make Melanie Martinez not add any songs. </p>",
        "language": "en",
        "author_name": "Melanie Martinez (unreleased)",
        "slug": "mmunreleased",
        "cover": "20230819_030846_a6481f9d8b282608b2abfc4d6145b33a.jpg"
    },
    {
        "podcast_id": 224872,
        "title": "\"Yorushika\" J-Rock on Sounds of Life",
        "description": "<p>Yorushika is a captivating duo that has been making waves in the Japanese music scene. Formed by the talented vocalist n-buna and the multi-instrumentalist suis, their unique blend of indie pop, rock, and electronic elements has won the hearts of listeners worldwide.</p>",
        "language": "en",
        "author_name": "Joydeep on Earth",
        "slug": "joydeepelma",
        "cover": "20230819_090828_832d4c514f46b0e7aaabaafb7b76c578.jpg"
    },
    {
        "podcast_id": 224916,
        "title": "श्री बागेश्वर महादेव मन्दिर",
        "description": "<p>श्री बोगेश्वर महादेव मन्दिर नारनोल द्वारा -- सुबह 5 से 8 बजे तक व शाम को 5 बजे से रात को 8 बजे तक ..भगवान भोलेनाथ, भगवान राम ,भगवान कृष्ण के विशेष भजनो , स्तुतियों व आरती आदि का लाईव ओडियो प्रसागण किया जाता है</p><p>अगला भजन दोपहर 12 बज कर 56 पर होगा</p>",
        "language": "en",
        "author_name": "sbmmn",
        "slug": "sbmm",
        "cover": "20230820_060816_bb83789b045775528d6888a225a00d71.jpg"
    },
    {
        "podcast_id": 225005,
        "title": "Mis desacuerdos",
        "description": "<p>Poema de Waldo Leyva musicalizado e interpretado por Silvio Rodríguez y Augusto Blanca</p>",
        "language": "es",
        "author_name": "Waldo Leyva",
        "slug": "misdesacuerdos",
        "cover": "20230820_100800_16dbda511971df93a2dcb521835cdd32.jpg"
    },
    {
        "podcast_id": 225201,
        "title": "b slowed- dabby",
        "description": "<p>d bop slowed</p>",
        "language": "en",
        "author_name": "dbby",
        "slug": "bsloweddabby",
        "cover": "20230821_110840_fe96d9bdb3a538ea8aec48603e6d566e.jpg"
    },
    {
        "podcast_id": 225341,
        "title": "The Rock Quiz",
        "description": "<p>Test your Rock and Roll knowledge with the Little Known and Even Less Cared For Rock Quiz and Stomp with your friendly, neighborhood Quizmaster former Morning mouth Mike McCarthy</p>",
        "language": "en",
        "author_name": "Michael J McCarthy",
        "slug": "therockquiz",
        "cover": "20230822_060826_86c78b1adfc7bba87961b4e88671d8ca.jpg"
    },
    {
        "podcast_id": 225459,
        "title": "Hit it joe",
        "description": "<p>JOE</p>",
        "language": "en",
        "author_name": "Joe",
        "slug": "tunaandjoe",
        "cover": "20230823_120837_8ee467d716bb30fc8c09c58129248859.jpg"
    },
    {
        "podcast_id": 225555,
        "title": "MAR",
        "description": "<p>because it wasn’t on Spotify for some reason</p>",
        "language": "en",
        "author_name": " 🗣️🗣️🗣️",
        "slug": "greendayhybridmoments",
        "cover": "20230824_020810_fb8307f47b77e27a836787caa0fe1569.jpg"
    },
    {
        "podcast_id": 225775,
        "title": "TEST",
        "description": "<p>TEST</p>",
        "language": "ee",
        "author_name": "MOMO",
        "slug": "testttt23289232",
        "cover": "20230825_070854_845ff43263f0503f0b1756dbd8f37359.jpg"
    },
    {
        "podcast_id": 225842,
        "title": "*",
        "description": "<p>wAK3uPCArtI 💕 💋</p>",
        "language": "en",
        "author_name": "*",
        "slug": "idcboutnourl",
        "cover": "20230825_070825_e949d1c6d0bc1f77039993d81598d0f1.jpg"
    },
    {
        "podcast_id": 225947,
        "title": "Redneck Rewind",
        "description": "<p>Redneck Rewind is a weekly game where host Knot Johnny Cash plays a 10 second snippet of a Texas Country Song BACKWARD, and it is up to you to guess the name of the artist, and the title of the song!</p><p>If you think you know the answer, visit <a href=\"http://www.TexasRadioOne.com/redneckrewind\">www.TexasRadioOne.com/redneckrewind</a> to submit your answer!</p><p>Answer correctly and you could win some cool prizes!</p>",
        "language": "en",
        "author_name": "Knot Johnny Cash",
        "slug": "redneckrewind",
        "cover": "20230826_040837_f017a6051f3eee578a208e5f5859bacd.jpg"
    },
    {
        "podcast_id": 226019,
        "title": "ruv.yeon.°⑅༘",
        "description": "<p>(i do not own)🎧</p>",
        "language": "en",
        "author_name": "rubithv",
        "slug": "ruvth",
        "cover": "20230827_020832_0d5f6aa0a750fb8c7cba46fcd85e0a52.jpg"
    },
    {
        "podcast_id": 226244,
        "title": "Hudební legendy",
        "description": "<p>Jejich jméno je nositelem hudební kultury. Oni určovali směr, kterým se hudební trendy budou ubírat. Stali se úspěšnými, oceňovanými, uznávanými. Jaký byl ale jejich životní příběh? Co se skrývá za pozlátkem úspěchu?</p>",
        "language": "cs",
        "author_name": "rádio Trojka",
        "slug": "hudebnilegendy",
        "cover": "20230828_060834_e52b30d3f88a020db7c3837c7ffd5f07.jpg"
    },
    {
        "podcast_id": 226290,
        "title": "coolio",
        "description": "<p>Whoah</p>",
        "language": "en",
        "author_name": "ShelfOBooks",
        "slug": "thealmightyratgod",
        "cover": "20230828_110824_846a9c5bf5dae63c937efd8a6b96e320.jpg"
    },
    {
        "podcast_id": 226608,
        "title": "CARVER RANCHES RADIO",
        "description": "<p>THE BEST IN NEW MUSIC THROWBACKS UNDERGROUND HIP/HOP &amp; R&amp;B (DEFINITELY NOT THE USUAL)</p>",
        "language": "en",
        "author_name": "DJ ELNINO",
        "slug": "djelnino",
        "cover": "20230830_080801_0e7b6f4b3c2e4c1da27aec7de10300a9.jpg"
    },
    {
        "podcast_id": 226620,
        "title": "speak now (taylor’s version) sped up",
        "description": "<p>enjoy!!</p>",
        "language": "en",
        "author_name": "victoria",
        "slug": "breadiscool",
        "cover": "20230830_100852_efaf9100ece7720fbe9670bd227424df.jpg"
    },
    {
        "podcast_id": 226674,
        "title": "Right vs Left",
        "description": "<p>hi</p>",
        "language": "en",
        "author_name": "Rasis",
        "slug": "rasis",
        "cover": "20230831_060823_fe9161dd318110fb8ea6161619b8d1a3.jpg"
    },
    {
        "podcast_id": 226954,
        "title": "Parallel Lines | خطوط موازی",
        "description": "<p>توضیحاتی پیرامون سیر شکل گیری آلبوم و تم اصلی آن و سرچشمه های احساسی خلق اثر</p>",
        "language": "fa",
        "author_name": "Ali Ghamsari | علی قمصری",
        "slug": "parallel-lines",
        "cover": "20230902_040947_85febd60c9e648af2c5403c7fe3c0abd.jpg"
    },
    {
        "podcast_id": 226974,
        "title": "Music Memories ",
        "description": "<p>Music Memories is a podcast where guest talk about the songs that have influenced them! Join us as we embark on their musical journey and memories!</p>",
        "language": "en",
        "author_name": "Cheyenne S Francis ",
        "slug": "musicmemories",
        "cover": "20230902_090912_bd03ad271201d961e3fdc8c09ec2366a.jpg"
    },
    {
        "podcast_id": 227189,
        "title": "mars argo//runaway;runaway",
        "description": "<p><strong>ʚɞ ⸝⸝ feeling just like this song</strong></p><p>૮ ◞ ﻌ ◟ ა</p>",
        "language": "en-us",
        "author_name": "Vianka Tatiana",
        "slug": "marsagorunawayrunaway",
        "cover": "20230904_050904_d49eb47686f1e644295760fdc5b24559.jpg"
    },
    {
        "podcast_id": 227365,
        "title": "beomgyu wonder",
        "description": "<p>enjoy !! ♡</p>",
        "language": "it",
        "author_name": "Jennie kim",
        "slug": "jenniekim",
        "cover": "20230905_080958_6dde5dc8cb352aabb4e5d11047ae804a.jpg"
    },
    {
        "podcast_id": 227866,
        "title": "Top 9 at 9 with Matt and Trent",
        "description": "<p>Join Matt and Trent each week as they count down the Top 9 Songs for a different theme each week.</p>",
        "language": "en",
        "author_name": "Matt Barker",
        "slug": "top9at9",
        "cover": "20230909_120948_62f7ce64264a2d5cc2b9faa336a65910.jpg"
    },
    {
        "podcast_id": 227893,
        "title": "Taylor Swift ",
        "description": "<p>Lover Haze</p>",
        "language": "en",
        "author_name": "Lover",
        "slug": "loverhaze",
        "cover": "20230909_090906_0c68dfab902efabb008d5c7beee98135.jpg"
    },
    {
        "podcast_id": 228055,
        "title": "Prog Will Find A Way ",
        "description": "<p>We get together a couple of times a month to talk about most things Prog Rock. We can’t cover every band so we try to highlight Prog and Prog-adjacent music that moves us the most. Thanks for listening!</p><p>Your hosts: Jay and Jonathan</p>",
        "language": "en",
        "author_name": "Jonathan Block and Jay Valade",
        "slug": "prog",
        "cover": "20230910_030917_95513293ebd0d26319045596099235af.jpg"
    },
    {
        "podcast_id": 228087,
        "title": "Spank Thru - 1988 Sub Pop 200",
        "description": "<p>Sticky boredom with a book</p>",
        "language": "en",
        "author_name": "Ko_bain",
        "slug": "ko-bain",
        "cover": "20230910_080910_f5e6470e6decc23bfe34f60bf45b64c1.jpg"
    },
    {
        "podcast_id": 228101,
        "title": "Lemondemonisawsome",
        "description": "<p>Tally balls</p>",
        "language": "en",
        "author_name": "Ilovetallyhall",
        "slug": "danisamazing",
        "cover": "20230910_090955_69065b40edaf0a5f1229f82ad20e213d.jpg"
    },
    {
        "podcast_id": 228227,
        "title": "Piano Kitchen Sessions Mixed and Compiled by Fuego",
        "description": "<p>Welcome Piano Kitchen Sessions Mixed and Compiled by Fuego,\" a mixtape dedicated to the emerging artist who's setting the Amapiano scene ablaze. Fuego, a talented producer and DJ, brings the heat with infectious beats and soulful melodies. Get ready to groove to his signature sound and exclusives from other artists around the genre of amapiano.</p><p> Piano Kitchen Sessions has taken us on a musical adventure through the world of Amapiano. This emerging artist has proven his talent as a producer and DJ, leaving a fiery mark on the genre. Keep an eye out for Fuego as he continues to rise and set the dance floors ablaze with his scorching beats and infectious tunes.</p>",
        "language": "en",
        "author_name": "Fuego",
        "slug": "artmetoo-entertainment",
        "cover": "20230911_070911_592872aabdb920f135a508959172ddb9.jpg"
    },
    {
        "podcast_id": 228345,
        "title": "T'Nime Përnime (URBAN FM)",
        "description": "<p>“T ‘nime Përnime” eksploron në thellësi proceset e krijimtarisë muzikore, prej muzikës klasike, asaj folklorike, nëpërmjet rock and rollit e muzikës pop, e deri te hip-hopi e elektronika. Muzikanti Arbër Salihu gjithashtu i njohur si La Fazani, ka me analizu dhe shtjellu kompozime, tekste, aranzhmane dhe produksione të ndryshme përgjatë shumë dekadave që përfshijnë stile të larmishme muzikore. Përveç se analizohet aspekti muzikor e artistik i albumeve, duke përfshirë produksionin, kompozimet, performanca, kopertina, kurimi etj, gjithashtu studiohet impakti shoqëror që këto albume kanë pasur në kohën që janë lansuar. Para se te filloj emisioni, duhet të lëshohet albumi për të cilin po flitet në tërësi. T’nime pernime me Arber Salihu çdo të merkure nga ora 21:00 deri në 22:00 në 103.5 dhe 105.5 FM Web: <a href=\"http://radiourban.fm\">radiourban.fm</a></p>",
        "language": "en",
        "author_name": "URBAN FM",
        "slug": "tnimepernimeurbanfm",
        "cover": "20230914_110945_5fec2caf6e7b4c41a59197258ce00dcc.jpg"
    },
    {
        "podcast_id": 228432,
        "title": "Jesse Pinkman Ai Covers",
        "description": "<p>You know him, you love him, and now, listen to him! (voice provided by voicemy.ai)</p>",
        "language": "en",
        "author_name": "Vivi",
        "slug": "jessepinkmansingalong",
        "cover": "20230912_110918_9f571a45014e7984adba0b53c4d4561e.jpg"
    },
    {
        "podcast_id": 228702,
        "title": "kpop covers- beomgyu's wonder ♡",
        "description": "<p> </p>",
        "language": "it",
        "author_name": "Jennie kim",
        "slug": "jennierubyjane",
        "cover": "20230914_080916_d734cc091384bc6debe4236306254e15.jpg"
    },
    {
        "podcast_id": 228754,
        "title": "The 11th Hour: A Rancid Podcast",
        "description": "<p>A podcast where two dudes in their 40s discuss a different Rancid song each week. They reflect on their lives, their (inexplicable) fandom, and why certain parts of our youth continue to hold meaning beyond simple nostalgia. Is it a midlife crisis or honest self-reflection? Join us on a journey to the end and find out... THE 11TH HOUR IS NOT AFFILIATED WITH RANCID</p>",
        "language": "en",
        "author_name": "Foxy Digitalis",
        "slug": "rancidpod",
        "cover": "20230916_010910_56d2b8ec10046046daadf24c24bc03ad.jpg"
    },
    {
        "podcast_id": 228839,
        "title": "pim stones",
        "description": "<p>All is forgiven for patriotism</p><p>A lazy word I have hidden behind before</p><p>Running along to a rhythm on a path so bitter</p><p>With the nets and the treasure chests of the people's applause</p><p>But we're both one of many boys</p><p>Who like to seek adventure and dangerous toys</p><p>Holding a gorilla's gaze</p><p>Drumming on the jaguar's cage</p><p>They can no longer be contained</p><p>Everyone hold the line</p><p>Hunting a python's prey</p><p>Feeding in the crocodile's lake</p><p>They can no longer be restrained</p><p>Everyone hold the line</p><p>Uh oh, well here comes trouble</p><p>I can hear the belly of the beast grumble</p><p>It's chaos in the jungle</p><p>For love of the land, for honor in a man</p><p>The key words are spoken and off we go</p><p>No question of why, why the enemy cries</p><p>Easier to ask: who's friend who's foe?</p><p>Cause we're both one of many boys</p><p>Who like to seek adventure and dangerous toys</p><p>(Everyone hold the line)</p><p>Through the comfort of screams</p><p>Thundering skies so far away</p><p>Never will I stare down the eye</p><p>Of the hurricane</p><p>I won't hear your screams</p><p>And I'll feel no pain</p><p>It's chaos in the jungle</p>",
        "language": "en",
        "author_name": "grit.",
        "slug": "jungle",
        "cover": "20230916_090925_5d27217572e326ae2499e5beebff5a13.jpg"
    },
    {
        "podcast_id": 228927,
        "title": "Songs of Our Lives",
        "description": "<p>Songs of Our Lives is a podcast series from Foxy Digitalis that explores the music that's made us and left a certain mark. Whether it's a song we associate with our most important moments, something that makes us cry, the things we love that nobody else does, or our favorite lyrics, we all have our own personal soundtrack.</p>",
        "language": "en",
        "author_name": "Brad Rose",
        "slug": "songsofourlives",
        "cover": "20230916_010921_167ac1b1193f89597fc37e28697dfc74.jpg"
    },
    {
        "podcast_id": 228928,
        "title": "jungkook",
        "description": "<p>I'm in my bed</p><p>And you're not here</p><p>And there's no one to blame but the drink in my wandering hands</p><p>Forget what I said</p><p>It's not what I meant</p><p>And I can't take it back, I can't unpack the baggage you</p><p>What am I now? What am I now?</p><p>What if I'm someone I don't want around?</p><p>I'm falling again, I'm falling again, I'm fallin'</p><p>What if I'm down? What if I'm out?</p><p>What if I'm someone you won't talk about?</p><p>I'm falling again, I'm falling again, I'm fallin'</p><p>You said you cared, and you missed me too</p><p>And I'm well aware I write too many songs about you</p><p>And the coffee's out at the Beachwood Cafe</p><p>And it kills me 'cause I know we've run out of things we can say</p><p>What am I now? What am I now?</p><p>What if I'm someone I don't want around?</p><p>I'm falling again, I'm falling again, I'm fallin'</p><p>What if I'm down? What if I'm out?</p><p>What if I'm someone you won't talk about?</p><p>I'm falling again, I'm falling again, I'm fallin'</p>",
        "language": "en",
        "author_name": "grit.",
        "slug": "fallingharry",
        "cover": "20230916_010924_0bcf44bb0e33ad16070d79d113f9dffc.jpg"
    },
    {
        "podcast_id": 228929,
        "title": "jungkook",
        "description": "<p>We were so beautiful</p><p>We were so tragic</p><p>No other magic could ever compare</p><p>Lost myself, seventeen</p><p>Then you came, found me</p><p>No other magic could ever compare</p><p>There's a room</p><p>In my heart with the memories we made</p><p>Took 'em down but they're still in their frames</p><p>There's no way I could ever forget, mmm</p><p>For as long as I live and as long as I love</p><p>I will never not think about you</p><p>You, mmm</p><p>I will never not think about you</p><p>From the moment I loved, I knew you were the one</p><p>And no matter what I-I do, ooh, mmm</p><p>I will never not think about you</p><p>What we had only comes</p><p>Once in a lifetime</p><p>For the rest of mine, always compare</p><p>To the room</p><p>In my heart with the memories we made</p>",
        "language": "en",
        "author_name": "grit.",
        "slug": "nevernot",
        "cover": "20230916_010930_6517a9889ff775ccb87afc0e25b303b1.jpg"
    },
    {
        "podcast_id": 229055,
        "title": "The Saxophone History Podcast",
        "description": "<p>A thoughtful, researched, and slightly irreverent look at the most interesting players in our history. Join us as we bring to life the stories of some of the most important people, events, and pieces of repertoire from the history of our instrument. This podcast will go deep into the lives of players from all different styles and look critically at players as diverse as Sigurd Rascher and Clarence Clemons. Sources, links, and other info can be found at <a href=\"http://www.andrewdmeyer.com\">http://www.andrewdmeyer.com</a></p>",
        "language": "en",
        "author_name": "Andrew D. Meyer",
        "slug": "saxophonehistorypodcast",
        "cover": "20230917_040936_0a1830076a0dee33a6728fd352a3ba5b.jpg"
    },
    {
        "podcast_id": 229076,
        "title": "Teasing Around- Brian May",
        "description": "<p>I do not own any music used</p>",
        "language": "en",
        "author_name": "JupiterSin",
        "slug": "jupitersin",
        "cover": "20230917_100959_5578b7f3c8ef0648afb022ec80700dc8.jpg"
    },
    {
        "podcast_id": 229332,
        "title": "Underground ",
        "description": "<p>Musica e altro</p>",
        "language": "it",
        "author_name": "Luca Sorrenti",
        "slug": "il-cantastorie",
        "cover": "20230919_020916_24e7563dfb199a8420a1f2a7fd1ea0f9.jpg"
    }
]