[
    {
        "podcast_id": 2280,
        "title": "Urban Wilderness",
        "description": "Follow on a journey to master the art of wilderness survival. Subscribe for updates, history lessons, and reviews of relevant works of fiction.\n",
        "language": "en",
        "author_name": "Elyse Michalow",
        "slug": "urbanwilderness",
        "cover": "20210812_212551_55380f8f7d8a9cd7cf3f202614a5c92a.jpg"
    },
    {
        "podcast_id": 8145,
        "title": "Dirty Giants",
        "description": "Tune in every week to listen to stories about big bucks, and get tips and tactics from some of the most successful mule deer hunters around. ",
        "language": "en",
        "author_name": "Konley Heaton ",
        "slug": "dirtygiants",
        "cover": "20200506_030221_553959fc4ddeaaff4a0e78b33d9e93c1.jpeg"
    },
    {
        "podcast_id": 10384,
        "title": "Forward Farming",
        "description": "<p>Hi there! We are two farmers here to spread the good word about Wisconsin agriculture. From cranberries to cows, and everything in between. THIS is Forward Farming. Grab a drink and let’s hang out!</p>",
        "language": "en",
        "author_name": "Amber & Becca",
        "slug": "forwardfarming",
        "cover": "20230616_080623_63580841af0496ffcd34f4d9b243cd43.jpg"
    },
    {
        "podcast_id": 10590,
        "title": "Soil4Climate Voices - Outspoken Advocates of Soil Restoration as a Climate Solution",
        "description": "Soil4Climate interviews with heroes of the regenerative agriculture and soil restoration as a climate solution.",
        "language": "en",
        "author_name": "seth itzkan",
        "slug": "soil4climate",
        "cover": "20200715_225954_5e20fe241bec64302eab6a9b95e7e2b2.jpg"
    },
    {
        "podcast_id": 11051,
        "title": "Wilder Gents",
        "description": "Just two guys talking all things outdoors and wilderness therapy with years of experience in the woods. Come hangout around the fire with us! New outdoor topic each episode! ",
        "language": "en",
        "author_name": "Rhett Garrett and Dakota Shaffer",
        "slug": "wildergents",
        "cover": "20200801_232247_8dd5961b5d78d1d151a617b8451db0d8.jpg"
    },
    {
        "podcast_id": 11796,
        "title": "Cryptids On Cryptids",
        "description": "Cryptids On Cryptids is a Podcast where hosts, Martin and Nadia, explore the wonderful and frightening world of Cryptozoology. So welcome to our deep dive into the cryptids of our planet, as we try to examine the worlds most mysterious creatures (and make goofs about them)",
        "language": "en",
        "author_name": "Myd Point LLC",
        "slug": "cryptidsoncryptids",
        "cover": "20200827_202653_eabc74c36a12df5fce82a5422a866a1e.jpg"
    },
    {
        "podcast_id": 12211,
        "title": "ASMR TRIGGERS",
        "description": "<p>If you're looking for that infamous tingling sensation that makes you scream then look no more. ASMR Triggers is a collection of stimulating audio recordings from various sounds to provide you with an ultimate experience.</p><p>\"ILoveRSS\"</p>",
        "language": "en",
        "author_name": "ASMR",
        "slug": "asmrtriggers",
        "cover": "20200909_044918_97beb1ed2a099aa64c9ba1af6828d900.jpg"
    },
    {
        "podcast_id": 13229,
        "title": "EHR Zaļā Zona",
        "description": "Kā ne tikai ņemt, bet arī dot dabai atpakaļ? Kā pieņemt videi draudzīgus lēmumus ikdienā, dzīvot atbildīgi un ilgtspējīgi? EHR sadarbībā ar Latvijas Vides aizsardzības fondu uzsāk jaunu projektu \"Zaļā zona\", kurā aicināsim mainīt savus ikdienas paradumus, lai mēs dzīvotu zaļākā pasaulē. Reklāmas aģentūras TBWA Latvija vadītājs un radošais direktors Kaspars Eglītis katru nedēļu aicinās uz sarunu kādu ekspertu, lai uzzinātu vairāk par notiekošo dabā un to, kā aprites ekonomikas principus varam ieviest savā ikdienā. Projektu finansiāli atbalsta Latvijas Vides aizsardzības fonds. ",
        "language": "lv",
        "author_name": "EHR - European Hit Radio",
        "slug": "zalazona",
        "cover": "20201008_112808_88b185abeddbd65b2d9d003357e96ee6.jpg"
    },
    {
        "podcast_id": 14035,
        "title": "Lady Scientist Podcast",
        "description": "Lady Scientist Podcast brings you into conversations with scientists. Academic research is often siloed in tough-to-read academic journals. This podcast strives to introduce you to new voices and to break down barriers, along with striking a note of positivity in an often-negative world. \n \nSupport the podcast through patreon.com/ladyscientistpodcast\nAll links are available through our website, ladyscientistpodcast.com\n",
        "language": "en",
        "author_name": "Jocelynn Pearl",
        "slug": "ladyscientistpodcast",
        "cover": "20210708_140307_a1908e28c90fd587484971a4a007ab25.jpg"
    },
    {
        "podcast_id": 14659,
        "title": "For the love of weather",
        "description": "Meet Gemma and Aisling. They have worked in the UK as meteorologists for over ten years. Gemma came up with the idea that maybe others might like to listen to the non stop conversations they still have all these years later about the weather.\n\nOver the years they have forecast for festivals, farming, road, rail, energy, media, aviation and even the humble ice cream demand forecast and so much more. They have gone through job changes, life changes and delved in and out of many hobbies and somehow the weather still weaves in and out of their lives. \n\nSo this podcast is for anyone who would like to join our weather conversations and wherever the jet stream may take us!\n                                   \nWe hope you join us for our bi weekly chat and leave each episode loving the weather just that little bit more.",
        "language": "en",
        "author_name": "Gemma Plumb & Aisling Creevey",
        "slug": "for-the-love-of-weather",
        "cover": "20201117_204905_44c7c33c7ced457da5272cf078496f9d.jpg"
    },
    {
        "podcast_id": 15202,
        "title": "Insight & Excite ",
        "description": "Excitement is a powerful catalyst for change. When shared with others, it has the power to change the world. Tune in with me, and let’s learn from individuals working toward a future that excites them the most.",
        "language": "en",
        "author_name": "Najeeb Akbar",
        "slug": "najeeb-gets-excited",
        "cover": "20201212_163410_ec9b143c9e887fc81448da62a9a8fecb.jpg"
    },
    {
        "podcast_id": 16412,
        "title": "İklim Kafe Konuşmaları",
        "description": "İklim Kafe Konuşmaları'nda iklim değişikliğiyle ilgili çeşitli konuları, politikadan atmosfer bilimlerine, ekonomiden psikolojiye kadar disiplinler arası bir ortamda tartışmak üzere bir araya geliyoruz.  İklim Kafe Konuşmaları serisini buradan dinleyebilirsiniz. ",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipm",
        "cover": "20201202_135237_87088afee167711c4d957188e962855f.jpg"
    },
    {
        "podcast_id": 17889,
        "title": "Siren Sundays",
        "description": "Reconnecting people with nature; 🌎Saving the world one ocean at a time, w/one conversation at a time 🎥🧜🏽‍♀️",
        "language": "en",
        "author_name": "Lashanti Jupp",
        "slug": "sirensundays",
        "cover": "20201214_115012_4251fca625f2e13699eb8dcdd924151f.jpg"
    },
    {
        "podcast_id": 18989,
        "title": "The Women of Regenerative Ag: Transforming the Health of the Soil, Land & People",
        "description": "This is a platform for the extraordinary women leading the regenerative agricultural movement—and the transformation of our societies--around the world. They are on the ground, creating critical shifts in seemingly intractable and highly unsustainable systems. And they've been doing so for a long time. \n\nIn this series, we look to explore beyond the soil, to the underlying theme of transformation itself across multiple dimensions: from that very internal landscape of human consciousness to the outer manifestation in the world around us, be it in the form of agricultural management practices, tools and techniques, to culture, economics, policy, and the built environment. \n \nThis series is a joint venture with Soil4Climate and my own organization, the Ouroboros Agency, where we work to help transform the human social infrastructure, and the built environment, to create truly resilient and regenerative societies. \n \nThese recordings originally aired as interactive livestream interviews on social media. They were held during the initial months of the US Covid lockdown and due to limited facilities, we sometimes had to get creative with our locations and dealt with the occasional technical issue. ",
        "language": "en",
        "author_name": "Aurora Flynn",
        "slug": "thewomenofregenerativeag",
        "cover": "20201225_025849_d12af27f749d52f081ef1ecfafaa5bf6.jpg"
    },
    {
        "podcast_id": 22560,
        "title": "Charlie the Chicken Mushroom",
        "description": "An exploratory journey into all the things that feed us. What feeds our bellies, feeds our minds and our souls? And how are they all connected? We focus on environmental health and how that contributes down the path from our farms, foods and individual health. This series is partnered with my children's cook book series, The 9 Lives of Charlie the Chicken Mushroom. An adventure series complete with kid friendly recipes. I believe healthy habits start young and encourage kids to gain nutrition through variety. Together we can learn more about our current food systems and collectively improve the health of our planet and our bodies, minds and spirits. It takes a village. \nwww.charliethechickenmushroom.com ",
        "language": "en",
        "author_name": "Katie Kirwan",
        "slug": "charliethechickenmushroom",
        "cover": "20210106_200226_09c3f8e9e9860e3947d14407156abcb8.jpg"
    },
    {
        "podcast_id": 23483,
        "title": "Hunting With Jbone",
        "description": "Hey Everyone, if you are like me and struggled getting into hunting. You can learn from my mistakes, this show will cover all the topics you need to get into the sport and become a successful hunter. This is an Edmonton based podcast that will give regulars people like you and me an opportunity to harvest animals without breaking the bank",
        "language": "en",
        "author_name": "Jerome",
        "slug": "huntingwithjbone",
        "cover": "20210110_164926_118b51c2f0fcb6927f8a1936a6375217.jpg"
    },
    {
        "podcast_id": 23836,
        "title": "Comercio Justo Latinoamérica y el Caribe ",
        "description": "El Comercio Justo es un modelo comercial que pone al centro los seres humanos y la sostenibilidad social, económica y ambiental de las sociedades; dignificando el trabajo, respetando el medio ambiente y fomentando una gestión responsable y sostenible de los recursos naturales.",
        "language": "es",
        "author_name": "CLAC-Fairtrade",
        "slug": "comerciojustoclac",
        "cover": "20210112_011132_f6975b6476ad0c571bb64d6676d7ef68.jpg"
    },
    {
        "podcast_id": 24768,
        "title": "Natural Beauty Podcast",
        "description": "<p>Natural Beauty Podcast brings you the latest news from the natural beauty scene. In the episodes, we share trending beauty tips of course, though we are also having important and deep discussions on the state of our beauty industries around the world. Natural Beauty Podcast is powered by the Nordic &amp; European Natural Beauty Awards. By following the Natural Beauty Podcast, you will stay updated with the highlights from both awards. Your host is the founder of the awards, Satu Mäkinen, originally from Finland herself. Disclaimer: This podcast is for entertaining and educational purposes only. If you have health concerns, seek professional medical advice. Note: Prior, this podcast was Nordic Natural Beauty Podcast, hence the episodes from 2020-2022 are the original Nordic Natural Beauty Podcast episodes.</p>",
        "language": "en",
        "author_name": "Natural Beauty Directory",
        "slug": "nordicnaturalbeautypodcast",
        "cover": "20221208_011247_7dfa5440fb559518c2b8ba4e712e56de.jpg"
    },
    {
        "podcast_id": 26666,
        "title": "Podcast Molecular - Nos Bastidores da Ciência",
        "description": "No Podcast Molecular, fala-se sobre os bastidores da Ciência, com foco especial na Química.\nSerão entrevistados Investigadores e Professores universitários que nos falarão dos projetos científicos em que estão a trabalhar, dos problemas que estes pretendem responder, no percurso que tiveram até chegar aqui e naquilo que fazem para além da ciência.",
        "language": "pt-pt",
        "author_name": "Molecular JE",
        "slug": "podcastmolecular",
        "cover": "20210123_215013_421586a663d952e0353fcfd14962ebfa.jpg"
    },
    {
        "podcast_id": 32340,
        "title": "The Fascinating World of Fungi with Lacey Roberts",
        "description": "Come with me and let’s explore the world beneath our feet. Through a lens of these seemingly small organisms, we will gain an understanding of how they have helped shape our world through the ages. We will explore the interconnectivity through topics of Dinosaurs, Zombies & Space; Edible and Poisonous Mushrooms; Medicinal Properties & Uses; Innovation & Technology; and The Wood Wide Web. All for the purpose of stewardship and conservation of our natural spaces. Because when people connect with the things around them, they tend to care more about the health and safety of it. For it is with a full understanding of how a system works that appropriate change can be enacted.\n\nFollow me on instagram @fascinatingwfungi to keep up to date on coming events. \n",
        "language": "en",
        "author_name": "Lacey Roberts",
        "slug": "thefascinatingworldoffungi",
        "cover": "20210212_230553_e44991aff882502939fe001963f316e5.jpg"
    },
    {
        "podcast_id": 33731,
        "title": "Land Ethic",
        "description": "The Land Ethic Podcast features people who have dedicated their lives to conservation and stewardship of the natural world. Hosted by Dylan Bagnasco. ",
        "language": "en",
        "author_name": "Dylan Bagnasco",
        "slug": "landethic",
        "cover": "20220428_030437_8707c1db3eb4973801c3375a438ee88b.jpg"
    },
    {
        "podcast_id": 36892,
        "title": "The Planet Today",
        "description": "New episodes every Friday covering the latest in Wildlife Conservation, Renewable Energy, Climate Change, and Environmental Policy.\n\nAt least two bonus Monday episodes each month, including shorter mini-sodes and interviews with other people in the environmental and/or sustainability fields.\n\nHosted by Matt Norden, produced/co-hosted by Nick Gennusa, and co-hosted by Giselle Herrera. You can find us on TikTok, Twitter, and Instagram @PlanetTodayPod!",
        "language": "en",
        "author_name": "Matt Norden and Nick Gennusa",
        "slug": "theplanettoday",
        "cover": "20230106_010124_c0880b75fd2453840f6d8a95fe80342b.jpg"
    },
    {
        "podcast_id": 37284,
        "title": "GreenPanther de Wellness Podcast",
        "description": "GreenPanther de Wellness Podcast is een zowel audio als videopodcast die gaat over onderwerpen op het gebied van wellness. Welzijn dus. Welzijn voor jezelf, de mensen om je heen én onze aarde. In de podcast komen verschillende experts voorbij die proberen te inspireren en adviseren. Denk aan onderwerpen als seksualiteit, duurzaamheid en bewustwording.",
        "language": "nl",
        "author_name": "GreenPanther",
        "slug": "greenpanther",
        "cover": "20210308_163022_25b0c2e323aeccbe091a397f08122e0c.jpg"
    },
    {
        "podcast_id": 38060,
        "title": "Eläimellistä viestintää",
        "description": "Eläimellistä viestintää on podcast, jossa tutkittu tieto ja eläinlähtöisyys kohtaavat.\n \nEläimellistä viestintää -podcastissa eläinten hyvinvointiaiheisiin erikoistunut Art Director ja viestinnän asiantuntija pohtii eläinten hyvinvointikysymyksiä, eläinten ja median välisiä suhteita sekä eläinten hyvinvointiin liittyviä ilmiöitä tieteellisellä, analyyttisellä ja kriittisellä otteella.",
        "language": "fi",
        "author_name": "Sari Toivola",
        "slug": "elaimellistaviestintaa",
        "cover": "20210302_120210_78cc845bacd5545add11fb52139d4326.jpg"
    },
    {
        "podcast_id": 38903,
        "title": "Rybářské podcasty Zachytame.cz",
        "description": "Audiočlánky a podcasty o rybaření, rybolovných technikách, nástrahách i návnadách a všemu co k našemu milovanému koníčku patří. Poslechněte si unikátní rybářské tipy, rady a zážitky z naší redakce. Pusťte si některý z naších rybářských audiočlánků, například při jízdě autem k vodě nebo při navazování a chystání nových sestav. ",
        "language": "cs",
        "author_name": "Zdeněk \"Rybostroj/Fishmachine\" Řeřucha",
        "slug": "zachytame",
        "cover": "20210305_085352_ab5555a39069fe3cba4b4805eb690ce1.jpg"
    },
    {
        "podcast_id": 41724,
        "title": "Songscapes: Music and Nature",
        "description": "Songscapes: Music and Nature is a podcast that shows off the two most moving things in the world. Each episode shares the story of diverse musicians, their music and their relationship to nature. Songscapes draw on the emotional hook of music and cultural capital of artists to build public support for the environment. Hosted by former NFL and NHL music executive, Charles Coplin, and produced by nonprofit Sustain Music and Nature.",
        "language": "en",
        "author_name": "Charles Coplin, Sustain Music and Nature",
        "slug": "songscapes",
        "cover": "20210315_185850_e27f6ef3376b3490c8f522f1e6f27578.jpg"
    },
    {
        "podcast_id": 43070,
        "title": "Human, All Too Human",
        "description": "<p>A podcast exploring living with the human condition - reconciling our philosophical quest for meaning and the absurdity of existence.</p>",
        "language": "en",
        "author_name": "Chris Liu",
        "slug": "alltoohuman",
        "cover": "20211225_031231_c24ec0c1af121b7d54a0b13d1221e586.jpg"
    },
    {
        "podcast_id": 45572,
        "title": "De Ventos em Popa",
        "description": "Um podcast de conversas íntimas e descontraídas, no qual cabem relatos de boas “estórias”, acções e movimentos inspiradores em torno de um eixo comum: a Sustentabilidade. \n\n| CRÉDITOS:\nConceito: Roda dos Ventos |\nRealização e Locução: Ana Regedor e Tiago Carvalho |\nProdução: PixelAdepto/ Casa da Lenha |\nMúsica: Filipe Melo \n",
        "language": "en",
        "author_name": "Roda dos Ventos",
        "slug": "deventosempopa",
        "cover": "20210416_155059_86339b2881d2a7552f0e0743c8d2083e.jpg"
    },
    {
        "podcast_id": 45742,
        "title": "Ramble On",
        "description": "<p>Ramble On! is a podcast about the outdoors. Short vignettes revolve around a topical theme. This podcast is for serious adventurers and weekend warriors, for homebodies and hikers. The official podcast of Drift Magazine — a student publication at The University of Texas at Austin. </p><p>Here's a feedback survey for our podcast. Fill it out for a free Ramble On! sticker: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfLmNA5wcYDx9MqWYBOsmgUympLTVLGB2dp3Cgu9xymC_gnhQ/viewform?usp=sf_link\">https://docs.google.com/forms/d/e/1FAIpQLSfLmNA5wcYDx9MqWYBOsmgUympLTVLGB2dp3Cgu9xymC_gnhQ/viewform?usp=sf_link</a> </p>",
        "language": "en",
        "author_name": "Ramble On!",
        "slug": "driftmagrambleon",
        "cover": "20210331_040728_23417cf719cad301fe551a62f83d8c3d.jpg"
    },
    {
        "podcast_id": 45847,
        "title": "Gin + Gems Podcast",
        "description": "This podcast will cover several life topics through a spiritual lens! Are you into something more solid? We'll talk about geology and crystals. What about divination? We have that too! What if you're trying to connect with your body or do some deep light and/or shadow work? We have you covered!",
        "language": "en",
        "author_name": "Gin and Gems Podcast",
        "slug": "ginandgems",
        "cover": "20210331_180809_fac73a15bdd7529c324ebc48ee57216d.jpg"
    },
    {
        "podcast_id": 46473,
        "title": "El Lado Salvaje",
        "description": "Acompañanos mientras nos adentramos en temas interesantes y salvajes del reino animal, relatando historias fascinantes sobre animales extraordinarios y únicos que dejaron su huella a través de los años. Y aprenderemos datos curiosos sobre las mas sorprendentes especies extintas o en peligro de extinción.",
        "language": "es",
        "author_name": "Alfonso & Nancy Loya",
        "slug": "elladosalvaje",
        "cover": "20230106_070113_67d08acd3dc5583d2b29854a1bd5bee0.jpg"
    },
    {
        "podcast_id": 49372,
        "title": "Agromeetings",
        "description": "No podcast Agromeetings teremos várias conversas com convidados, onde nos propomos debater temáticas dedicadas à agricultura e ao agronegócio.",
        "language": "pt-pt",
        "author_name": "Espaço Visual",
        "slug": "agromeetings",
        "cover": "20230111_090133_7b619c62d7b9ad3fd2ddc3e164466956.jpg"
    },
    {
        "podcast_id": 51731,
        "title": "Comment s'aiemer",
        "description": "Un podcast queer+trans 👽👽👽 qui parle parfois de plantes, parfois de relations, mais surtout de care 👯‍♂️👯‍♂️✨✨🐌🐌",
        "language": "fr",
        "author_name": "Filix Femina",
        "slug": "commentsaiemer",
        "cover": "20210916_151846_a3eb087a6005bde8c896e13abedef252.jpg"
    },
    {
        "podcast_id": 52726,
        "title": "Conservation Talk Story",
        "description": "Conservation Talk Story is a storytelling forum for conservationists in Hawaii. We host experts on topics covering every aspect of conservation science, including mitigating human impacts, protecting rare species, and improving public education. Our goal is not only to increase awareness regarding specific conservation issues in the state but also to provide correct information, backed by science, to our listeners so they are equipped to make decisions about sustainability and conservation in their own lives. Hosted by Emily Sesno and Max Bendes, Conservation Talk Story is brought to you by the Hawaii chapter of The Society for Conservation Biology (HISCB) with support from KTUH.",
        "language": "en",
        "author_name": "Max Bendes",
        "slug": "contalkstory",
        "cover": "20210428_033503_657810a74d62dd6f64651e8f7d52cda8.jpg"
    },
    {
        "podcast_id": 53348,
        "title": "Night Meetups ",
        "description": "A podcast where a couple of adolescent apes huddle together to try and figure out life and the knowledge it holds. So swoop in down to our frequency, hang out and help us figure out this crazy world.",
        "language": "en",
        "author_name": "Angus & Harry",
        "slug": "nmu",
        "cover": "20210507_040522_c7673c3bf99c30518e6dd0e49e786501.jpg"
    },
    {
        "podcast_id": 57804,
        "title": "AfriNuke Podcast",
        "description": "Welcome to the AfriNuke podcast - Africa’s soundbytes on peaceful nuclear technology! This podcast brings you amazing views of peaceful nuclear technology through the African voice. Interviews, career talks, nuclear applications, competitions, giveaways, industries, decarbonization, healthcare, cancer, nuclear security, clean energy, electricity, sustainability, research, unexpected/unusual perspectives and maybe some killer instincts to make you a nuclear enthusiast!\n\nListen on Apple Podcast, Google Podcast, Spotify, TuneIn and other podcast platforms. \nSupport this podcast's independence and verility: https://ravesandbox.flutterwave.com/pay/afrinukepodcast1ohv\n",
        "language": "en",
        "author_name": "Afrinuke Podcast",
        "slug": "afrinuke",
        "cover": "20210520_081142_256565a2a947793c7bb00c92ce8b1ebf.jpg"
    },
    {
        "podcast_id": 58033,
        "title": "Can Architecture Fix This? ",
        "description": "'Can Architecture Fix This?' is a podcast from White arkitekter in Oslo. Join host Rebekah Schaberg and producer Ingjerd Sandven Kleivan for discussions and interviews with experts in the fields of design to see if we can answer the question: Can Architecture Fix This? - whatever this may be!",
        "language": "en",
        "author_name": "White arkitekter Oslo",
        "slug": "caft",
        "cover": "20210520_113352_2358b1f03e4037f8ff89a045c50153f5.jpg"
    },
    {
        "podcast_id": 58288,
        "title": "The Source Connection ",
        "description": "There is a space where you are all you want, you are all you need. All there is, is here.\nIt expands with endless awe. Its capacity of love knows no bounds. No walls or containers define it; no place it is or isn't. Formless and forever.\n",
        "language": "en",
        "author_name": "Tarah Long & Liz Bee",
        "slug": "thesourceconnection",
        "cover": "20221221_061213_8717aef5515b0ab6b51fc839668971a4.jpg"
    },
    {
        "podcast_id": 60200,
        "title": "Weather or Not?",
        "description": "From Tropical Talk to Space Chats, Climate Change, and Environmental Concerns, will any of them impact you?",
        "language": "en",
        "author_name": "WSVN-TV",
        "slug": "weatherornot",
        "cover": "20210531_182944_1295ffb083ac8e753ef61aa31d8459af.jpg"
    },
    {
        "podcast_id": 60951,
        "title": "Růst s čistým svědomím",
        "description": "Udržitelný podcast Mikuláše Peksy. Všechno, co jste chtěli vědět o perspektivních inovacích, plánech na čistou ekonomiku, o modernizaci průmyslu a boji s klimatickou změnou. Jak z toho v Česku můžeme profitovat a co se vlastně bude dít? A jak zajistit, abychom naši zemi předávali dalším generacím, aniž bychom se u toho museli stydět?\n\nPodcast jsme založili proto, aby bylo možné otevřeně diskutovat o současném směřování ČR a EU v otázce ochrany klimatu. Chceme dát prostor věcným argumentům, chceme mít možnost podrobněji popsat trendy, ať už je jejich povaha ekonomická, společenská či čistě fyzikální. Zveme si hosty napříč profesními obory a poctivě reportujeme o tom, co je na stole v evropské legislativě.\n\nMikuláš Peksa je pirátský europoslanec, vystudovaný fyzik a profesí vědec a programátor. V Evropském parlamentu se zabývá především pravidly pro rozvoj moderních technologií, inovacemi a smysluplnou digitalizací.",
        "language": "cs",
        "author_name": "Mikuláš Peksa",
        "slug": "cistyrust",
        "cover": "20210604_085554_44840f16c486126219fad1e61fe8bf71.jpg"
    },
    {
        "podcast_id": 61365,
        "title": "Bylinkárium",
        "description": "PODCAST O BYLINKÁCH\n\nKaždú rastlinu rozoberáme v dvoch dieloch - samostatných epizódach. @bystrabylinka vás prevedie epizódami o rastlinách, ku ktorým podáva výklad z vedeckého a historického hľadiska. Nájdete tu aj mýty a legendy, recepty, a iné vychytávky. @kan_krist moderuje epizódy so zaujímavými hosťami. Každý z nich rezonuje s konkrétnou bylinkou a témou, ktorú bylina reprezentuje. Dozviete sa o vzťahu človeka k prírode, ktorá lieči. \nModeruje Kristína Kanátová.\n\nInstagram: @bylinkari_um ",
        "language": "sk",
        "author_name": "Kristína Kanátová",
        "slug": "bylinkarium",
        "cover": "20220217_110249_9106307f5e467b29d87f485834487333.jpg"
    },
    {
        "podcast_id": 61518,
        "title": "Taste sustainability_ Wired X PasquaWines",
        "description": "Taste sustainability_ Wired X PasquaWines",
        "language": "en",
        "author_name": "Pasqua Wines",
        "slug": "tastesustainability-wiredxpasquawines",
        "cover": "20210610_201948_91a36f11373659329883a5309c0c7d6d.jpg"
    },
    {
        "podcast_id": 62035,
        "title": "Greater Greener Georgia",
        "description": "Greater Greener Georgia is a short biweekly podcast where we talk about current event issues in Georgia, especially issues around climate change and the environment. We know it can be hard to focus on important news in today’s society, especially with the flood of information that comes at us from all directions. We want to help simplify things and highlight the problems and successes that matter. ",
        "language": "en",
        "author_name": "Georgia Conservation Voters",
        "slug": "gcvoters",
        "cover": "20210622_182547_df9f233b6604c26f0037f1d598e850d9.jpg"
    },
    {
        "podcast_id": 62244,
        "title": "Peak Season ",
        "description": "The Peak Season Podcast, brought to you by the Mountain Bureau LLC, is a interview based podcasts following the seasons of North America's iconic Mountain Ranges. The people that explore the rocks, glaciers, slopes and walls are the focus of the show. The host Steffan Gregory, a climbing guide working with the Mountain Bureau will introduce you to the people that have made these places so special to so many. ",
        "language": "en",
        "author_name": "Peak Season",
        "slug": "peakseasonpodcast",
        "cover": "20210612_003412_e93d0f6b19eed5b02d4e665be42aa3c0.jpg"
    },
    {
        "podcast_id": 65324,
        "title": "Earth Lad's Roundup",
        "description": "Welcome to Earth Lad's Roundup! A show diving into the most pressing topics surrounding environmental sustainability, hosted by me, Michael Fanelli. In each episode, I'll round up some timely news and information related to the climate crisis, and we'll consider what it means for us humans, and what we can do about it. Come learn along with me as I attempt to get a grasp on the unwieldy beast that is climate change.",
        "language": "en",
        "author_name": "Michael Fanelli",
        "slug": "earthladsroundup",
        "cover": "20210811_045653_59a949830a2e41a41f160cc9e2be9bc8.jpg"
    },
    {
        "podcast_id": 72032,
        "title": "Around the Campfire",
        "description": "A conversational podcast where we'll talk about anything and everything outdoors. Including but not limited to: Hiking, camping, paddling, climbing, hunting, french kissing, fishing, and maybe even acrobatics.",
        "language": "en",
        "author_name": "Seth and Devon",
        "slug": "aroundthecampfire",
        "cover": "20210806_042404_3c4be4d417c496af6618eb48ed7e4307.jpg"
    },
    {
        "podcast_id": 72070,
        "title": "Adventures In Dialogue",
        "description": "Braving a new world. Topics on relationships and bridge building, emotional health, creativity and innovation, sustainable and regenerative systems. Exploring collective narrative as one way to come together.",
        "language": "en",
        "author_name": "Melissa Belongea",
        "slug": "adventuresindialogue",
        "cover": "20210829_000327_f02c1c6896012057613f4447bedfc1da.jpg"
    },
    {
        "podcast_id": 72800,
        "title": "Restore Our Planet Podcast",
        "description": "<p>Welcome to the Restore Our Planet Podcast where we delve into the great minds of the heroes on the frontline of conservation across the UK and the Globe. </p><p>If you would like to donate to one of our causes: restoreourplanet.org/donate/ Or follow Restore Our Planet: </p><p><a href=\"https://www.linkedin.com/company/79297440/\">https://www.linkedin.com/company/79297440/</a> </p><p><a href=\"https://www.facebook.com/restoreourplanet/\">https://www.facebook.com/restoreourplanet/</a> </p><p></p><p><a href=\"https://twitter.com/Restore_Planet\">https://twitter.com/Restore_Planet</a></p><p></p><p><a href=\"https://www.instagram.com/restoreourplanetpodcast/\">https://www.instagram.com/restoreourplanetpodcast/</a></p>",
        "language": "en",
        "author_name": "Jack Cole",
        "slug": "restoreourplanet",
        "cover": "20210810_110706_5ec3e1fe33d520d99d557bb893446e12.jpg"
    },
    {
        "podcast_id": 76842,
        "title": "CrocKast Podcast",
        "description": "<p>In this podcast series, Nate and Matt interview the leading figures in field herping, reptile research, zoo work and captive reptile husbandry. Join us as we explore and learn from the best in the world!</p>",
        "language": "en",
        "author_name": "Nathanael Truax",
        "slug": "croc-kast-podcast",
        "cover": "20210901_205210_f82b8bb17dc9732c882dfa6afb81efe0.jpg"
    },
    {
        "podcast_id": 79054,
        "title": "SOI Bridge",
        "description": "Over the past year, we’ve hosted many live conversations with incredible people and youth on topics relating to climate action, healthy oceans, ecosystems, and thriving communities. Now, we are offering these discussions on our new podcast!",
        "language": "en",
        "author_name": "SOI Foundation",
        "slug": "soibridge",
        "cover": "20210914_131031_8903b392b5d945db9799bb596e27125a.jpg"
    },
    {
        "podcast_id": 79746,
        "title": "Ridge Hunter Outdoors Podcast",
        "description": "<p>Every Monday, the Ridge Hunter Outdoors team and guests share stories, tips, tactics, and strategies that have made them both successful and unsuccessful in the whitetail woods. Join us and you might learn something to help you become a better hunter. At the very least, you should be entertained.</p><p>Be sure to tune in for Full Draw Fridays as well, where you'll learn even more about habitat management and hunting strategy.</p>",
        "language": "en",
        "author_name": "Ridge Hunter Outdoors",
        "slug": "ridgehunteroutdoorspodcast",
        "cover": "20230308_080318_889ded138c9d3f5e1e3a9e4c662b7e45.jpg"
    },
    {
        "podcast_id": 85311,
        "title": "Nature's Tales",
        "description": "Flora, fauna, and fungi folklore! Stories, anecdotes, poetry, and folk tales from around the world focusing on nature. From Greek mythology of woodland flowers to fairy doorways in a Hawthorn tree, this podcast will enhance your relationship with the natural world and make you think differently about the magic that surrounds you.",
        "language": "en",
        "author_name": "Lily Harper",
        "slug": "naturestales",
        "cover": "20211015_133127_b5b3cf3753bd2d231bc1418602aa34ab.jpg"
    },
    {
        "podcast_id": 86106,
        "title": "Exploiting Ignorance Podcast",
        "description": "Three grown men talk about all the things that they know absolutely nothing about.",
        "language": "en",
        "author_name": "James Stacey",
        "slug": "exploiting-ignorance",
        "cover": "20211027_065944_b119a6579ef89591d9af6411d5e61a2e.jpg"
    },
    {
        "podcast_id": 86466,
        "title": "The Wildlife Experience",
        "description": "The goal of this podcast is to have down-to-earth conversations with people interested in wildlife. This may include biologists, naturalists, conservationists, hobbyists, hunters, fishermen, and any other outdoors folks. With any luck, this will lead to meaningful discussions and a greater sense of unity among all the different wildlife and outdoors groups. \n\nFollow the Instagram page @the_wildlife_experience and my personal page @thetexasnaturalist for updates. Instagram is also a good way to reach me if you have comments or are interested in coming on to the podcast.",
        "language": "en",
        "author_name": "Andrew Austin",
        "slug": "thewildlifeexperience",
        "cover": "20211210_031240_72f438653c72e1b71fb9e0ccb3f1462d.jpg"
    },
    {
        "podcast_id": 87766,
        "title": "Big Trip - Tracking New Connections ",
        "description": "THE BIG TRIP - A curatorial movement tracking new connections to the rooted practices and ancestral wisdoms around the world and linking them to a plural web that supports a more holistic global narrative.\n\nWe are a group of curators, each with their own skillset, combining to share and transform knowledge on three pillars: \n\n- Purposeful sound practice\n- The pilgrimage trip\n- The rituals of handing down\n\nDrawing together specialists, practitioners, communities and curators from around the world, we are sharing stories through modern media – podcasts, online media, articles, exhibitions and ultimately a forum – to create artistic transformation through international exchange.\n\n​​Four story snippets are juxtaposed and interwoven in this listening experience, providing you with a glimpse of first-hand interviews and completed narratives composed together by conversation setters and people in front of them.  Full-length podcast series will release throughout 2021/2022 on Big Trip online platform. \nPlease kindly follow us on:\n​​Website: https://reurl.cc/Ok6RL7\nSpotify: https://reurl.cc/Kr2OLn\nInstagram : @thebigtrip.tnc\nFacebook: https://www.facebook.com/thebigtrip.tnc/\n\n＿＿＿＿\nThe project is initiated by The Corridor from Taiwan & Borneo Laboratory \nfrom Malaysia with the support from Asia Cultural Council.\n",
        "language": "en",
        "author_name": "Big Trip Team",
        "slug": "bigtrippilot",
        "cover": "20211029_072423_6c878f1e23e5625db43a60f440dae926.jpg"
    },
    {
        "podcast_id": 88630,
        "title": "KULTÚRA, ÖKOLÓGIA, BOTANIKA - KERT A KÖBÖN",
        "description": "Kert a köbön - avagy a tudományos-kulturális szórakoztatás az ökológiai szemléletformálás oltárán.\nAz Ökológiai Kutatóközpont egyedülálló projektje 2021 nyarán izgalmas estekkel, valamint egy háromnapos fesztivállal várta a látogatókat Vácrátóton, a Nemzeti Botanikus Kertben.\nAz ország legjelentősebb ökológiával foglalkozó intézeteit tömörítő Ökológiai Kutatóközpont útjára indította a Kert a köbön eseménysorozatát, amely tényleg köbre emelte hazánk első számú botanikus kertjét: egymás mellé állította a kultúrát, az ökológiát és botanikát. \nA multidiszciplináris és multikulturális programsorozat fő célja volt olyan témák boncolgatása ‒ közérthetően és nyári könnyedséggel ‒, amelyek fontosak az ökológiai szemléletformálás szempontjából. A projekt hidat teremtett a tudományos és művészeti megközelítés között, hogy a valóság megértéséhez egy átfogóbb képet kapjon a társadalom.\nA programsorozat beszélgetésekkel összekötött koncertélményekkel várta a közönséget. A borkóstolós, nyár esti társalgások sajátja volt, hogy különböző területről érkeztek szakemberek: többféle tudományterületről, a gyakorlati életből, a művészetből és a médiából egyaránt. \nA nyár végén háromnapos Kert a Köbön Fesztivállal zárult a különleges és hagyományteremtő kezdeményezés, amelynek középpontjában az ökológia, az irodalom és a zene állt. \nMindez egy kétszáz éves történeti kertben, amely kiemelkedő természeti és kulturális gazdagságával fogadta be az eseményeket.",
        "language": "hu",
        "author_name": "Ökológiai Kutatóközpont",
        "slug": "kert-a-kobon",
        "cover": "20211103_164629_d5cfcfd45bcf8e5661db502f2bace758.jpg"
    },
    {
        "podcast_id": 88858,
        "title": "The Green Screen Podcast",
        "description": "Account run by University of Minnesota Duluth Student Association. College students talking about sustainability and a variety of topics associated with it! A new episode will be released each week so make to hit the follow button!  ",
        "language": "en",
        "author_name": "The Green Screen Podcast Group",
        "slug": "thegreenscreenpodcast",
        "cover": "20211110_231513_436ed1854457a828609e3ba17b3675b8.jpg"
    },
    {
        "podcast_id": 89104,
        "title": "آوای محیط زیست ",
        "description": "<p>آوای محیط زیست (دکتر محمدرضا حیدری و همیاران) متشکل از گروهی از برجسته ترین کارشناسان و دانش آموختگان رشته های مرتبط با محیط زیست و همچنین علاقه مندان و فعالان محیط زیستی می باشد. هدف ما آموزش همگانی جهت ارتقا آگاهی های اجتماعی در حوزه محیط زیستی است. آدرس ما در شبکه های مجازی @avaemohitzist تماس با ما Heidari@umich.edu لطفا ما را در فضای مجازی دنبال نمایید. <a href=\"https://www.instagram.com/avaemohitzist/\">https://www.instagram.com/avaemohitzist/</a></p><p><a href=\"https://linktr.ee/avaemohitzist\">https://linktr.ee/avaemohitzist</a></p>",
        "language": "fa",
        "author_name": "AvaeMohitZist (Dr. Mohammadreza Heidari)",
        "slug": "avaemohitzist",
        "cover": "20220910_090951_8b94fa1d74535e5be8ea34fd840b5bfd.jpg"
    },
    {
        "podcast_id": 90690,
        "title": "Design Echo",
        "description": "<p><strong>Design Echo</strong> adhering to bringing about a change in Architecture/Interior Design Fraternity, where great minds can stretch the real dimensions, address the current state of Architecture and locate the crux of Architectural Future. The integration of great minds via this Summit will hopefully make the young and the grown to find the purpose behind Architecture and it’s meaning. PODCAST From Greatest Minds and World-Changing Thinkers in Architectural and Interior Design Community Initiative by <strong><em>The Architect's Diary</em></strong><em>.</em></p>",
        "language": "en",
        "author_name": "IIDA Summit",
        "slug": "nature-inspired-design",
        "cover": "20230602_070648_d39468703db86d76e342a1b974f2c1fb.jpg"
    },
    {
        "podcast_id": 92326,
        "title": "Šumavské podcasty ",
        "description": "Šumavské podcasty Vás provedou nejen Šumavou, ale i Pošumavím.\nPředstaví projekty, které nesmíte minout, osoby, které tvoří velké věci a místa, která třeba neznáte. Jedinečná příroda, šumění potůčků, štěbetající ptáci, husté lesy, klid. Typické znaky rozmanité šumavské krajiny. Jestli si ji chcete užít ještě blíž, pohodlně se usaďte a klidně i zavřete oči. Nabízíme Vám Šumavské podcasty, ve kterých nahlédnete takříkajíc pod pokličku tohoto podmanivého kraje jižních Čech. ",
        "language": "cs",
        "author_name": "Šumavsko",
        "slug": "sumavskepodcasty",
        "cover": "20211124_051112_31b6082ea8c31bc5b0e79f1f46e5b08a.jpg"
    },
    {
        "podcast_id": 94570,
        "title": "Talking Country with Brad and Chancey",
        "description": "On our podcast we discuss things going on in the woods, on the creek banks, in the pastures and farms! Join life long friends, Brad and Chancey, as we discuss the things we love! Thank you for listening!",
        "language": "en",
        "author_name": "Brad Vaculin, Chancey Lewis",
        "slug": "talkingcountry",
        "cover": "20211208_041221_95d82fc3903d5aea14adb693dbfb1cee.jpg"
    },
    {
        "podcast_id": 94800,
        "title": "EKKERT RUSL",
        "description": "Ruslið okkar kemur upp um okkur segja sérfræðingarnir. EKKERT RUSL er að vonum skemmtilegt og lifandi hlaðvarp um umhverfismál í umsjón Lenu Magnúsdóttur, sem hefur verið umhverfissinni frá fæðingu og Margréti Stefánsdóttur, sem er ekki beint umhverfissinni en er öll af vilja gerð að læra. Við fáum til okkar skemmtilega og jafnvel óvenjulega gesti í samhengi við umhverfismál sem og viðmælendur sem þekkja hvað best til málanna.  Umhverfisvernd er heita kartaflan í dag – flestir hafa eitthvað til málanna að leggja, eða vilja það að minnsta kosti. Það er ekki nóg að kaupa Teslu og telja sig umhverfisverndarsinna - það þarf víst aðeins meira til. Kannski slæðast nokkrir fræðslumolar með inn á milli í þessu hlaðvarpi til þess að hjálpa venjulegum íslenskum heimilum að bæta sig í umhverfisvernd. Við sitjum víst öll í sömu súpunni og þurfum að hysja upp um okkur. Við getum þetta saman.\n",
        "language": "is",
        "author_name": "EKKERT RUSL - Lena og Margrét",
        "slug": "ekkert-rusl",
        "cover": "20211209_081209_20cf6f4ee84e902a58f514d3cb32561b.jpg"
    },
    {
        "podcast_id": 96364,
        "title": "The Dog Manual",
        "description": "The goal is to create high quality content that helps people understand dog/animal behavior to help improve their lives together, as well as create a welcoming community that is willing to constructively help other owners. Dogs (and all animals) are something we are very passionate about and would love to help others understand through our experiences. Please, come pull up a seat by our table, get cozy and enjoy.",
        "language": "en",
        "author_name": "The Dog Manual",
        "slug": "thedogmanual",
        "cover": "20211218_041253_9586bc759874b754cb269e2b8834354d.jpg"
    },
    {
        "podcast_id": 96956,
        "title": "MixXed In America ",
        "description": "Are you interested in exploring the unique experiences of people who have lived within the gray area of America? Tune into the \"MixXed In America\" Podcast with host Damien Doran. From discussions on sensitive topics that are often overlooked in mainstream media, to illuminating the struggles and challenges of growing up mixed-race in the US, this show provides a fresh perspective on people, politics, profits, policy, propaganda, and the American way. Don't miss out on this thought-provoking and insightful listen - subscribe now on your favorite podcast app or follow us on social media for updates!\n#MixXedInAmerica #Podcast #Race #Identity #Multiculturalism #CulturalDivides #DamienDoran #MrGreenBay",
        "language": "en",
        "author_name": "Damien T Doran",
        "slug": "mixxedinamerica",
        "cover": "20211222_081243_db5116b1bb54160a1142239976ff5c7b.jpg"
    },
    {
        "podcast_id": 97895,
        "title": "Piece of Mind",
        "description": "An unfiltered and unapologetic exploration of topics relevant to the wonders and complexities of life, derived from the mind of a curious and over-analyzing undergrad. \nTopics include: A mathematical sequence that may or may not be the key to unifying literally everything in the universe -- The neurons in the brain that are the foundation of your ability to speak, empathize, and interact with the world -- Why Legos are the best thing ever -- The (not so) existential threat of climate change -- Why \"chill\" is the worst ever adjective to describe a person -- Dreams are like, craaazy man. \n\n\n\n",
        "language": "en",
        "author_name": "Daniel H Smith",
        "slug": "pieceofmind",
        "cover": "20220102_100129_a0a6e9d065f25eea90e14b8d28d9fd85.jpg"
    },
    {
        "podcast_id": 98432,
        "title": "Venom Exchange Radio",
        "description": "<p>Venom Exchange Radio! A Podcast for all things Venomous! </p><p>Hosted By, Nipper Read and Phil Wolf </p><p>Venom Exchange Radio and Venomous Etiquette Videos on YouTube!</p><p> www.youtube.com/channel/UC0KozTrYrzjiFI1CiPfiU6g</p>",
        "language": "en",
        "author_name": "Nipper & Phil",
        "slug": "venomexchangeradio",
        "cover": "20220102_040126_6e14cc0c81c9da133118d340ec200c90.jpg"
    },
    {
        "podcast_id": 99070,
        "title": "Jammers In The Rough",
        "description": "Join Paige, Cody, and Josh, as they discuss the world of disc golf without boundaries. This is recorded live and raw in one take. With special guests, news, disc reviews, and other disc golf topics. ",
        "language": "en",
        "author_name": "Paige, Cody, and Josh",
        "slug": "jammersintherough",
        "cover": "20230124_090159_1ecccf3e10e5df1865e4d3ae6a0e283e.jpg"
    },
    {
        "podcast_id": 99593,
        "title": "Dock Talk WV",
        "description": "YOUR ULTIMATE RESOURCE for tournament bass fishing in West Virginia and the Tri-State area. Showcasing local anglers and tournament results.",
        "language": "en",
        "author_name": "Chase Sansom",
        "slug": "docktalkwv",
        "cover": "20220108_030134_73a65a682595dcceb682bfe957db2668.jpg"
    },
    {
        "podcast_id": 103616,
        "title": "Muerte - Untonga Podcast",
        "description": "Pegar epitafios en la calle te puede llevar a entablar un vínculo con la muerte.\nAsí llegué a una nueva forma de relacionarme con lo que significa la vida. El ahora como forma de plenitud. La curiosidad en incremento. Desde ahí la necesidad de encontrarme con personas que desde su saber y su sentir puedan compartirme su visión sobre algo que todxs tenemos en común. La muerte siempre como una oportunidad. Y nunca está sola: rituales, comunidad y naturaleza parecen formar parte de lo mismo.",
        "language": "es",
        "author_name": "Gastón Rosa",
        "slug": "untonga",
        "cover": "20220125_020138_a2c9cc52cabf758fb26612f468dfee34.jpg"
    },
    {
        "podcast_id": 106595,
        "title": "Following the Tracks",
        "description": "Join Sammi Shimota and Giselle Ray as we discuss wildlife research reports and talk about its relevance to today's issues and its implications for our future. ",
        "language": "en",
        "author_name": "Samantha Shimota",
        "slug": "followingthetracks",
        "cover": "20220417_080401_4a78155340aea2afe6a573b687a2ae2e.jpg"
    },
    {
        "podcast_id": 106625,
        "title": "MICROCOLLEGE:  The Thoreau College Podcast",
        "description": "MICROCOLLEGE is an exploration of the crisis in higher education and the innovative projects and thinkers working to address it, with a special focus on the human-scaled, place-based, meaning-oriented learning communities we call \"microcolleges.\"  The podcast is hosted by Jacob Hundt, Founder of Thoreau College, a microcollege initiative rooted in the Driftless Region of rural southwestern Wisconsin, and inspired by the model of Deep Springs College, the pedagogy of the Waldorf schools, and the life of Henry David Thoreau.                                                                                                      \n                                                                                                                                                This is a podcast for thoughtful, motivated teenagers and young adults who are disappointed by the options available to them in post-secondary education, as well as their teachers, parents, counselors, and mentors, and anyone interested in the quality of higher education and its role within our culture.                                                  \n                                                                                                                                        Listeners will be introduced to new ideas and alternative opportunities for post-secondary education, as well as thoughtful criticism of mainstream models and practices at colleges and universities. Listeners will discover exciting educational programs to apply to, books to read, and thinkers to learn more about.                                         \n                                                                                                                                              Learn more about Thoreau College and the microcollege movement at https://thoreaucollege.org/",
        "language": "en",
        "author_name": "Thoreau College",
        "slug": "thoreaucollege",
        "cover": "20220717_030738_7cdf9db065340ef1f294f1921fe9f59a.jpg"
    },
    {
        "podcast_id": 106984,
        "title": "RushHour",
        "description": "Life all walks of life",
        "language": "en",
        "author_name": "Laron Rush",
        "slug": "hourrush",
        "cover": "20220209_070236_7cd0cfbdee478abb8937aa88bf9075c4.jpg"
    },
    {
        "podcast_id": 107930,
        "title": "Northern Latitudes",
        "description": "Northern Latitudes is a Canadian-based podcast dedicated to exploring the people, places, news and events that make the great outdoors great.",
        "language": "en",
        "author_name": "Bill Ault",
        "slug": "northernlatitudes",
        "cover": "20220318_020330_bc74452160b7f9c8c08d90b2246c89cc.jpg"
    },
    {
        "podcast_id": 110559,
        "title": "All About Animals",
        "description": "All About Animals Radio is an ad free community talk radio station dedicated to all animals and those who act to protect and advocate for them.",
        "language": "en",
        "author_name": "All About Animals Radio",
        "slug": "allaboutanimals",
        "cover": "20220712_010737_498bfdfef612305f280b4302f1ba07af.jpg"
    },
    {
        "podcast_id": 110869,
        "title": "Rising Clyde",
        "description": "Rising Clyde is a Glasgow-based digital publication made for young people who care about the climate emergency. A platform that brings together news, stories and voices from under an eco-perspective, offering climate journalism through every vertical.\nWe want a brighter future for our natural world by informing, inspiring and engaging young people to make change possible. Because the future of our planet matters.\n",
        "language": "en",
        "author_name": "Stefan Carlin",
        "slug": "rising-clyde",
        "cover": "20220223_120208_4f923e0113300bb20d925726bc469514.jpg"
    },
    {
        "podcast_id": 111290,
        "title": "talkin trees",
        "description": "<p>we talk in the woods and stuff enjoy</p>",
        "language": "en",
        "author_name": "oliver and nathan",
        "slug": "amitystra",
        "cover": "20230811_090837_aaf4a8a29b19973a4d7e4289b854ed8f.jpg"
    },
    {
        "podcast_id": 111986,
        "title": "F.E.S. Podcast",
        "description": "Fondacija Friedrich Ebert u Zagrebu i Sarajevu – u saradnji sa regionalnim uredom za Jugoistočnu Europu – kreirali su F.E.S. Podcast. Ovaj jedinstveni podcast zapravo se sastoji od tri tematska virtualna prostora za razgovor – odnosno podcaste „Riječ na F...“ (Sarajevo), „Riječ na E...“ (Zagreb) i „Riječ na S...“ (#loading). Različite playliste ovog podcasta posvećene su trima izrazito važnim društvenim temama – feminizmu, ekologiji i okolišu, te socijalnim temama. \n\n„Riječ na F...“ donosi nam razgovore o umjetnosti, politici, religiji, aktivizmu, i svakodnevnom životu iz perspektive feminizma i sa ciljem promoviranja rodne ravnopravnosti, sa govornicima/cama iz cijele Bosne i Hercegovine. \n\n„Riječ na E...“ epizode poslušajte ukoliko i sami želite uvrstiti nove, održivije prakse u svoj svakodnevni život, ali i čuti nešto novo o temama održivosti, zaštite i poboljšanja okoliša, jer „ne postoji plan(eta) B“. \n\nKroz ova dva podcasta vode vas Ines Baždalić (Sarajevo) i Nina Skočak (Zagreb), a nove epizode dostupne su svakog mjeseca. ",
        "language": "bs",
        "author_name": "Friedrich-Ebert-Stiftung",
        "slug": "fespodcast",
        "cover": "20220228_120256_1d812d8535dee87bfb64549961916894.jpg"
    },
    {
        "podcast_id": 112654,
        "title": "Pranarôm Aromathérapie Scientifique",
        "description": "Pranarôm est le spécialiste de l'aromathérapie scientifique. Par ce podcast, nous souhaitons vous former sur les huiles essentielles afin qu'elles deviennent vos alliées  pour une vie plus harmonieuse.\n",
        "language": "fr",
        "author_name": "Pranarôm International",
        "slug": "pranarom",
        "cover": "20220303_080330_a09a511ec9b3d7cae3e8ba6b98953c4b.jpg"
    },
    {
        "podcast_id": 114160,
        "title": "Saving water, one drop at a time !",
        "description": "Podcast made by kids for kids about the future of our planet and specifically about tips on saving water, ",
        "language": "en",
        "author_name": "Balthazar Marc Eliott Luc",
        "slug": "saving-water-one-drop-at-a-time-podcast",
        "cover": "20220311_020358_531bc6f04c052e53a61b5fae80920b89.jpg"
    },
    {
        "podcast_id": 114326,
        "title": "Bayou Dragons Podcast ",
        "description": "A group of friends who share a driven passion for the outdoors. Good times and good stories.",
        "language": "en",
        "author_name": "Bayou Dragons Podcast",
        "slug": "bayoudragons",
        "cover": "20220310_060323_dbd7dc3df27ba5e94ac3084810aa57d7.jpg"
    },
    {
        "podcast_id": 115471,
        "title": "Whiskey Bros Around The Table",
        "description": "Hang out with your favorite whiskey bros and kick back as we discuss various topics from great whiskeys to food to better health and wellbeing.  We feature selected special guests on our podcasts as well so you just might learn a thing or two! ",
        "language": "en",
        "author_name": "Whiskey Bros ",
        "slug": "whiskeybrosatt",
        "cover": "20220315_110300_1c394b6a6ce13c36a2728b65b7c24f2a.jpg"
    },
    {
        "podcast_id": 116573,
        "title": "Camp Catastrophe",
        "description": "Everyone thinks they can survive the zombie apocalypse. Everyone believes they know their own doomsday prep. But do you know how to detect a gas leak in your bunker or an abandoned house? Do you know which flora and fauna, when you're building your bomb shelter, are safe to eat? Do you know how to distill your own pee to drink? That's where we come in. Welcome to Camp Catastrophe, where we counsel you on crises. An apocalyptic podcast where we explore survival in real life and pop culture. Camp counselors Poppy and Rain are here to make sure you survive with us. ",
        "language": "en",
        "author_name": "Camp Catastrophe",
        "slug": "campcatastrophe",
        "cover": "20220321_020317_78b268a4e93430632f20124660fe3649.jpg"
    },
    {
        "podcast_id": 117131,
        "title": "The SOTAG (Servants of the Almighty God) Podcast",
        "description": "Servants of the Almighty God - We recognize that we exist in the presence of The Living God, we embrace Truth, Love, Knowledge and the Brotherhood of Mankind.",
        "language": "en",
        "author_name": "Sydney Herrera",
        "slug": "sotag",
        "cover": "20220324_110307_3cd0ab3b5e9835e8ccd5d77d61405a43.jpg"
    },
    {
        "podcast_id": 119293,
        "title": "Way To Zero Waste",
        "description": "Bienvenidos al podcast de Way To Zero Waste, un espacio de entrevistas a los mejores profesionales de cada sector para tratar la sostenibilidad desde un enfoque crítico y con una mirada hacia los diferentes ámbitos donde esta puede ser aplicada.\n\nwww.waytozerowaste.com",
        "language": "es",
        "author_name": "Maria Cantó Martínez",
        "slug": "waytozerowaste",
        "cover": "20220401_040408_dfc4f41c0a3af30e17aa46d1674b131d.jpg"
    },
    {
        "podcast_id": 120353,
        "title": "Economy Class",
        "description": "<p>Willkommen zur Economy Class, dem Podcast für WU-Studierende! Unser Moderatorenteam, bestehend aus Kristin Brünnel &amp; Oliver Planner, bereichert dich monatlich mit interessanten und hilfreichen Themen rund um das Studierendenleben an unserer Universität.</p>",
        "language": "de",
        "author_name": "ÖH-WU",
        "slug": "economy-class",
        "cover": "20220408_120441_5b6d524a6dee18d852403839d8cd8b77.jpg"
    },
    {
        "podcast_id": 122702,
        "title": "B jak biologia",
        "description": "W podcaście B jak biologia opowiadam sobie wesoło o, a jakże, biologii. Zdobędziecie tu wiedzę na temat świata ożywionego w przystępny sposób. Czasem się tu denerwuję, czasem sobie pożartuję, często się zachwycam. Nie obiecam Wam, że lepszy będzie świat, jednak mogę obiecać, że będzie tu całkiem luźno i przyjemnie. \n\nJeśli chcecie popatrzeć sobie na zdjęcia roślin czy grzybów, nauczyć się ich nazw i nie tylko, to zapraszam na mój Instagram: @zamollony",
        "language": "pl",
        "author_name": "Maciej Móll",
        "slug": "bjakbiologia",
        "cover": "20220417_050418_05becf394d4fd564ba314a83330c60df.jpg"
    },
    {
        "podcast_id": 124223,
        "title": "The Orangutan Podcast",
        "description": "The Orang Utan Republik, a rainforest education and conservation organization, lets you dive into their world of adventures, as host Anthony Porter and Gary Shapiro take a look into what makes the rainforest such a special place. ",
        "language": "en",
        "author_name": "The Orangutan Podcast",
        "slug": "torangutanpodcast",
        "cover": "20220424_060403_8306f098b57cd1b12185c4401da97650.jpg"
    },
    {
        "podcast_id": 124506,
        "title": "MOKSHA",
        "description": "The Moksha Podcast is a place to listen to open-hearted talks about healing our relationships with ourselves, others, and the natural world. \nFrom yoga to permaculture design, feminist and decolonial perspectives on ecology, and somatic therapies, we are two women wishing to inspire you on your reconnection path. ",
        "language": "en",
        "author_name": "Maeva Belloiseau and Evanthia Drakousis",
        "slug": "mokshapodcast",
        "cover": "20220426_010433_26faa948b175bede8898fa059102aaf8.jpg"
    },
    {
        "podcast_id": 124869,
        "title": "Natureversity Podcast",
        "description": "Since 2014, Natureversity Outdoor School has been committed to restoring eco-literacy among children and adults in order to help them foster a deeper connection with our natural world. Listen as school director Chris Hyde sits down to interview students, teachers, parents and wilderness survival professionals from around the country about all things nature.",
        "language": "en",
        "author_name": "Natureversity Outdoor School",
        "slug": "natureversity",
        "cover": "20220427_020404_4d5a410edc1f93424d63ed941011e0bf.jpg"
    },
    {
        "podcast_id": 125138,
        "title": "EQUILIBRIUM BY P.E.A.C.E.",
        "description": "Come listen as P.E.A.C.E. co-founder Sarien Slabbert is joined by humans in the movement to discuss subjects about farm sanctuary, farmed animal rescue, and the vegan world. Let's come together to create some waves of unbalance for change and explore the shades in between black-and-white, while learning something new together. ",
        "language": "en",
        "author_name": "Sarien Slabbert",
        "slug": "equilibriumbypeace",
        "cover": "20220428_050405_70fce0ed9c9a41e013bbcc22160bfc91.jpg"
    },
    {
        "podcast_id": 125278,
        "title": "The Wicked Witchery",
        "description": "Welcome to The Wicked Witchery - podcast edition!  This channel is a place for witches and spiritualists of all kinds to learn all things witchy; from history, to beginner tips, to deep into different magickal practices.  Thank you for tuning into my podcast while it is in its beginning stages.  I currently plan to upload two episodes per week.  If you would like to support me further, feel free to show some love on my other social media platforms: @thewickedwitcheryco and reach me by email: thewickedwitcheryco@gmail.com.",
        "language": "en",
        "author_name": "Shelby Nelson",
        "slug": "thewickedwitchery",
        "cover": "20220503_030527_22d65ac354ec48f14bce3487d0a6cdb0.jpg"
    },
    {
        "podcast_id": 126184,
        "title": "Mundo Sustentable",
        "description": "Bienvenidos a Mundo Sustentable, el podcast en el que, semanalmente, presentamos entrevistas con temas de conciencia ambiental y sustentabilidad, en compañía de Alberto Larios, Jaime Salazar, Carlos Mendoza, Elías y Erick Larios.",
        "language": "es",
        "author_name": "Alberto Larios, Jaime Sálazar, Carlos Mendoza , Erick y Elías Larios",
        "slug": "mundosustentablemx",
        "cover": "20220509_040530_0bc5321a8b7d8352b08b5027c0d931d0.jpg"
    },
    {
        "podcast_id": 126551,
        "title": "The Fight for Our Existence",
        "description": "Defending sacred land and water. Protecting our right to our Native American culture and religion. The battle to Save Oak Flat continues.  We will also being discussing history, music, spirituality, and nutrition. \n\nIf you like to come on to the Podcast or any questions.  \nEmail at:\nfight4ourexistencepodcast@gmail.com\n\nHere is the link to all platforms:\nhttps://linktr.ee/Fight4ourexistence",
        "language": "en",
        "author_name": "Uncle Fox",
        "slug": "fight4ourexistence",
        "cover": "20220520_120535_b552a784ea2560a2eda7a63bccd8f3e3.jpg"
    },
    {
        "podcast_id": 126570,
        "title": "mostgreen talks",
        "description": "كلام عن البيئة والحياه المستدامة وأشياء أخرى - يقدمه مصطفى مجدي",
        "language": "ar",
        "author_name": "Mostafa Magdy",
        "slug": "mostgreentalks",
        "cover": "20220506_100555_2f26e50aac324325753b9280c439b23b.jpg"
    },
    {
        "podcast_id": 127458,
        "title": "Tyritroll",
        "description": "Ole og Ingrid gikk fra Oslo til Nordkapp med sønnen sin på 4 år, i denne podcasten snakker de om hva som skjer med parforhold, foreldrerollen og psyken når man er så mye ute i naturen. De inviterer inn aktuelle gjester for å høre hvordan friluftsliv påvirker det som skjer i oss og mellom oss. ",
        "language": "nb",
        "author_name": "Flow Works AS",
        "slug": "tyritroll",
        "cover": "20220513_070527_e21adf038447e5be36ed54a7ac6d1088.jpg"
    },
    {
        "podcast_id": 128315,
        "title": "Buggin Out",
        "description": "Hi! And welcome to “Buggin’ out” A podcast dedicated to all things creepy and crawly. I’m your host Tyler Wiedmeyer a Entomology Master’s student at the University of Delaware here to take you on a journey to the world of insects, arachnids, and all the rest of the ‘bugs’.  ",
        "language": "en",
        "author_name": "Tyler Wiedmeyer",
        "slug": "bugginout",
        "cover": "20220515_060555_dec5f221e652edb4019edd7be5e8ffdc.jpg"
    },
    {
        "podcast_id": 129296,
        "title": "Failing to Save the Earth",
        "description": "What if one of the most effective ways to save our battered and feverish planet lies in our failure to be able to do so? \n\n“Failing to Save the Earth,” is a revolutionary dual-tool for frontline and fence line organizers who wish to achieve greater effectiveness by facing potential failures head-on. Forget the old concept of movement “wins'' or “losses,” this podcast and guide-booklet (coming soon!) are an invitation to rethink our relationship with the definition of failure when working to create social change. Learn from the L’eau Est La Vie resistance camp leadership and their epic, yet “unsuccessful,” campaign to stop the Bayou Bridge pipeline. Determine powerful leverage points within your struggle. Listen to veteran frontline water and land protectors, get inspired, and then prepare to follow the additional step-by-step printed guide-booklet (due to be released in Fall 2022). Learn how to design your own plan for artful and effective failing, and also find out the one way that you will most certainly fail when working to stop social and environmental injustices.\n\nA must listen for anyone committed to saving the Earth!\n\nCherri Foytlin is an executive director for Movement Training Network, and founder of L'eau Est La Vie Resistance Camp and Ndn Bayou Food Forest in Deep South Louisiana. Join our mailing list! https://global.us15.list-manage.com/subscribe?u=96ab610195ad24c962dd79be2&id=2dd3311286&fbclid=IwAR0iz5EC9xtsOpqHEaIT5pNz3pizg8yC62SfyqUWVne1jINK2hcKqjFayAU ",
        "language": "en",
        "author_name": "Cherri Foytlin",
        "slug": "failingtosavetheearth",
        "cover": "20220520_030515_5ebdfd12e808f86d29e2520dcb10b518.jpg"
    },
    {
        "podcast_id": 129582,
        "title": "CASA VIDA",
        "description": "Centro Agroecológico de Saberes Campesinos, CASA VIDA. Somos un lugar de encuentro, para compartir y tejer saberes, prácticas, pensares y sabores. Es un lugar para  reconocernos, seguir caminando y cuidarnos entre nosotras, nosotros, nosotres, en armonía con la Madre Tierra, las plantas, los animales, el aire, el suelo, el agua y seres sintientes. Aquí la vida campesina dialoga con la agroecología, la economía solidaria, el buen vivir, el ecofeminismo, la salud, la espiritualidad  y la soberanía alimentaria.",
        "language": "es",
        "author_name": "Centro Agroecológico de Saberes Campesinos, CASA VIDA",
        "slug": "casavida",
        "cover": "20220521_060544_e3fce4f05044a697fcf525770c4809a8.jpg"
    },
    {
        "podcast_id": 129880,
        "title": "The Outdoor Wiser Brand",
        "description": "The Outdoor Wiser Brand is a small group of outdoorsmen bringing everything to you that will help out on your adventures and make you laugh along the way.\nStay smart, stay Outdoor Wiser.",
        "language": "en",
        "author_name": "Seth Petersen",
        "slug": "the-outdoor-wiser-brand",
        "cover": "20220523_020510_92625476665c3027399bd9f8ccae81fc.jpg"
    },
    {
        "podcast_id": 130094,
        "title": "Le podcast de Jersey Québec",
        "description": "Jersey Québec propose des discussions entre passionnés de l'élevage de sujets bovins de race Jersey. On y parle d'expositions, d'alimentation et de coûts et bien plus encore.",
        "language": "fr",
        "author_name": "Jarold Dumouchel",
        "slug": "jerseyquebec",
        "cover": "20220524_010510_4c31d99fc2042741a05fa6903ce02b59.jpg"
    },
    {
        "podcast_id": 130743,
        "title": "The Outsiders",
        "description": "Join us as we talk about one of our greatest passions, the outdoors.  We will explore not only our own stories, but the people we have met along our way in this world. With a combined 18 years of travel to a total of nearly 50 countries and the ever changing landscape of this little planet we call home, there should be no shortage of conversation.",
        "language": "en",
        "author_name": "Guy Crawford",
        "slug": "theoutsiders",
        "cover": "20220527_040546_4ba6b765dd216c4defa6213b4b8e1e56.jpg"
    },
    {
        "podcast_id": 131523,
        "title": "Space Ranger Stone",
        "description": "Join Lucas Stone and his acquaintances for a thematic podcast of sprawling conversation.",
        "language": "en",
        "author_name": "Lucas Stone",
        "slug": "srs",
        "cover": "20220601_040602_3b611aba492f0da667276c307320ba81.jpg"
    },
    {
        "podcast_id": 131578,
        "title": "A Just Natural Africa ",
        "description": "Africa holds up to 30% of the global biodiversity yet losing it at the fastest rate then ever recorded in the history of humanity. \nThis podcast brings forth unique narratives, experiences and insights from young African across the continent speaking to and sharing stories from their landscapes. ",
        "language": "en",
        "author_name": "Aiita Joshua Apamaku ",
        "slug": "naturewild",
        "cover": "20221022_081033_32afded38d28f315169abb981d613250.jpg"
    },
    {
        "podcast_id": 131620,
        "title": "Soothing Noise",
        "description": "The sounds of simple nature",
        "language": "en",
        "author_name": "Sal",
        "slug": "soothingnoise",
        "cover": "20220612_010652_07ad36c675280b1947ee21547548a349.jpg"
    },
    {
        "podcast_id": 132264,
        "title": "platicación contigo 💗🌿 ",
        "description": "Bienvenidxs a nuestro podcast platicación contigo :), donde cada semana hablaremos de algo nuevo contigo. ",
        "language": "es",
        "author_name": "Fátima yLliliana ",
        "slug": "platicacioncontigo",
        "cover": "20220604_110636_ee63971f8ebb7a047265887d853a7112.jpg"
    },
    {
        "podcast_id": 133428,
        "title": "Labákový Podcast InUPS 📚",
        "description": "Miško a Nika sú nadšení doktorandi, vďaka ktorým sa zamilujete do vedy, výskumu a inovácií aj vy 👩🏼‍🔬 Spolu budeme spoznávať zaujímavosti vo vede 🧪a vyspovedáme mnohých vedcov 🧑🏻‍🔬 Naším mottom je: \"po vedecky, ale stále zrozumiteľne\". Tento podcast vznikol s finančnou podporou projektu InUPS \"Inovačné zoskupenie na podporu udržateľných potravinových systémov\". www.inups.uniag.sk\n",
        "language": "sk",
        "author_name": "Labákový Podcast inUPS",
        "slug": "labakovypodcastinups",
        "cover": "20220610_120624_1409c395fe01b40b4b00804217c06fd5.jpg"
    },
    {
        "podcast_id": 134493,
        "title": "Framtidsland",
        "description": "Podcasten Framtidsland är ett samtal med en miljöengagerad forskare om dennes arbete och hur fantasi, berättelser och science fiction kan bidra till en hållbar utveckling.\n\nwww.framtidsland.se ",
        "language": "sv",
        "author_name": "Torill Kornfeldt och Tobias Abrahamsson",
        "slug": "framtidsland",
        "cover": "20220703_060739_2da421c988d4be27880a6bb31d85ba68.jpg"
    },
    {
        "podcast_id": 138653,
        "title": "Chemical FM",
        "description": "<p>Jump into the world of ChemicalFM, a real-time podcast interviewing activists and game changers in the chemical industry and beyond!</p>",
        "language": "en",
        "author_name": "Ecolink, Inc.",
        "slug": "chemicalfm",
        "cover": "20220705_020751_df66c9ae9042e747fd9907bb3f288b02.jpg"
    },
    {
        "podcast_id": 140013,
        "title": "The Collective Tap: Conversations About Water",
        "description": "THE COLLECTIVE TAP is a podcast about water and the many ways we interact with this critical resource every day. Some of those uses are obvious: washing dishes, swimming, or watering plants. Others are less obvious: generating energy, building roads, and manufacturing goods that travel far from the water’s source to reach their destination. But even given those many uses—and the many more users who expect clean water on demand—it’s easy to take for granted how critical this one resource is to life.\n\nWhat, exactly, is the value of water? We try to answer this question through a series of engaging conversations with experts in their fields, and, hopefully, inspire a new appreciation of the waters you call home.\n\nTHE COLLECTIVE TAP is a project of the White River Alliance, a 501(c)(3)organization located in Indianapolis, Indiana. We are an alliance of diverse interests and organizations that work together to steward the River and its watershed. It is made possible with generous funding from the Nina Mason Pulliam Charitable Trust.\n\nProduced in partnership with Absorb., a boutique music and media label. ",
        "language": "en",
        "author_name": "The White River Alliance",
        "slug": "thecollectivetap",
        "cover": "20220712_060733_37726984038898529d5af00a4527d326.jpg"
    },
    {
        "podcast_id": 140150,
        "title": "Zahradnická kuchařka",
        "description": "Zahradničení je velká výzva pro začátečníky i letité zahradníky. K zahradě a rostlinám patří i jiná zajímavá témata, která vám budeme v jednotlivých dílech představovat. Uslyšíte zajímavé rady a informace a často budeme promlouvat s různými hosty. Pojďte s námi tvořit přírodu doma.\nhttps://zahradnickakucharka.cz/\nhttps://www.facebook.com/zahradnickakucharka\n",
        "language": "cs",
        "author_name": "Rašelina a.s.",
        "slug": "zahradnicka-kucharka",
        "cover": "20220713_070715_7754a3b0426e285a34168078f5b5d527.jpg"
    },
    {
        "podcast_id": 140953,
        "title": "Green Flag",
        "description": "Bienvenidos a Green Flag, un podcast sobre la crisis climática en España.",
        "language": "es",
        "author_name": "Clara Varo",
        "slug": "greenflag",
        "cover": "20220717_080740_46f3b9cf4d499ef424ebad1d270cb40f.jpg"
    },
    {
        "podcast_id": 141903,
        "title": "Nature to Soul",
        "description": "We are nature. Too often, we lose sight of that.\n\nNature to Soul has a vision to help to reconnect people back to their true nature. Through the Nature to Soul's podcast, I hope to empower you to reconnect with your higher self and mother nature to take back your power over your health and wellbeing.\n\nWe'll explore topics from yoga to energy healing, from getting out in nature to nourishing your body, from biohacking to important life discussions.",
        "language": "en",
        "author_name": "Lindsay",
        "slug": "naturetosoul",
        "cover": "20220722_110751_7894736f797afcf3f0c80553db285d34.jpg"
    },
    {
        "podcast_id": 142677,
        "title": "5 vor 12 - Ein Aufruf zur Veränderung",
        "description": "Größen aus den Bereichen Tier- und Umweltschutz sprechen mit PANDA Tierversicherung über ihre Inspiration, ihren täglichen Kampf um Erfolge und den heutigen Stand unserer Welt. Das Ergebnis - es schlägt 5 vor 12.  \nGreenpeace, One Earth - One Ocean, Hunderunde und Probiene: Gründer und Geschäftsführer lassen im Gespräch mit PANDA hinter die Kulissen blicken.\nWir wollten alles wissen - von den persönlichsten Erlebnissen, die dazu bewogen, das Leben dem Aktivismus zu widmen, bis zu konkreten Zukunftshoffnungen. Welche Rolle \"Seekuh,\" Armreifen und die \"dunkle Biene\" dabei spielen und wer beim Klimaschutz wirklich die Zügel in der Hand hat, erfahren Sie im neuen PANDA Podcast.\nTeilnehmer:\nGünther Bonin - Gründer, One Earth - One Ocean\nAlexander Egit - Geschäftsführer, Greenpeace Zentral- und Osteuropa\nTobias Miltenberger - Gründer, Probiene\nFabio Lehnert - Co-Founder, Hunderunde   \n\nBei uns im 10-Tages-Takt! Hören Sie rein und lassen Sie sich mitreißen - es ist nicht zu spät, um einen Unterschied zu machen. ",
        "language": "de",
        "author_name": "PANDA Tierversicherung",
        "slug": "pandatierversicherung",
        "cover": "20220726_040734_578a40968747bbf1bdc89c162fb795e7.jpg"
    },
    {
        "podcast_id": 142931,
        "title": "Big World, Small Bites",
        "description": "As the climate crisis carries on, it can be daunting to try and follow along and find your role. Is it worth it to recycle? Does composting make a difference? Do we blame the corporations and step back? In Big World, Small Bites, hosts Calli Lambard and Grant Rowe walk you through the wicked problem of climate change, offering action in small, digestible pieces. Listen in and learn about the true impact of your actions, what you can do, and how to find your place in this fight. Using their campus as a small case study, Calli and Grant exemplify how impactful small actions can be. We all play a part in our future. The world can seem big, but Calli and Grant will break it down into small bites. ",
        "language": "en",
        "author_name": "Grant Rowe and Calli Lambard",
        "slug": "bigworld-smallbites",
        "cover": "20220915_020927_1adf4dff29c354c4f6f4aee4ace3ac4f.jpg"
    },
    {
        "podcast_id": 143688,
        "title": "The Lookout Podcast",
        "description": "Host Luke Barrett sits down with guests to discuss topics such as Wildland Firefighting, Forest Service, Montana, home brewed beer, hockey, fishing, hunting, outdoor recreation, mental health, and mindfulness. ",
        "language": "en",
        "author_name": "The Lookout Podcast",
        "slug": "the-lookout-podcast",
        "cover": "20220731_100717_5c173cff8d5c427ba036c114f58cc113.jpg"
    },
    {
        "podcast_id": 144167,
        "title": "Geographic",
        "description": "<p>A nature enthusiast shocks and awes her friends each week with some of the most harrowing and haunting tales of man versus wild from around the world. Nature is a real mother!</p>",
        "language": "en",
        "author_name": "Alexis Flores",
        "slug": "geographic",
        "cover": "20221228_091208_6809c3e90e8dd25d5f51ab1dbd0c2461.jpg"
    },
    {
        "podcast_id": 146594,
        "title": "Unleashed",
        "description": "<p>Each week, Brent Henderson will take you on an adventure into some of the craziest places on earth. Throughout these adventures, Brent will help you discover who you really are at your core, while also providing the necessary tools to enable you to break free from unhealthy thoughts, emotions, and actions. It's all about identity.</p>",
        "language": "en",
        "author_name": "Brent Henderson",
        "slug": "unleashedpodcast",
        "cover": "20230710_080720_e28cdedaccb3bbc57dd059cdfd6671f8.jpg"
    },
    {
        "podcast_id": 147138,
        "title": "ALL PAK'D UP",
        "description": "PAKMULE is a conservation-minded company, whose goal is to encourage and inspire folks to escape on the weekends to wild places that invigorate their senses and warm their souls.  It’s about recovery, renewal, confidence and inspiration; while also gaining a greater appreciation for our wild places, public lands, parks. We’re building future stewards who will dig in, and work to protect these great places for generations to come. ",
        "language": "en",
        "author_name": "PAKMULE",
        "slug": "pakmule",
        "cover": "20221021_051008_b835e15bbbe7782e1241586c7aa9c662.jpg"
    },
    {
        "podcast_id": 148775,
        "title": "The Birdy Bug Pod",
        "description": "Just a father and son who are passionate about wildlife, photography and the environment. Grab a coffee and join us as we chat about doing our bit for the planet, interesting news stories and the incredible work being done around the world that gives us hope. Oh, and we'll probably have a good natter about our photographic escapades from time to time too.",
        "language": "en",
        "author_name": "Matthew and Steve ",
        "slug": "thebirdybugpod",
        "cover": "20220825_010819_f38d08ccf3debb07a6359bb0a9a97fff.jpg"
    },
    {
        "podcast_id": 148896,
        "title": "AMUATMA",
        "description": "deep dives with Sukhpreet into astrology, tarot, herbalism, nature-based wisdom, end of life, death and all that lurks in the depths of the 8th house.\n\n",
        "language": "en",
        "author_name": "amuatma",
        "slug": "amuatma",
        "cover": "20220825_090838_bb74429069a4ebee983acea8693b894c.jpg"
    },
    {
        "podcast_id": 149674,
        "title": "A Wild Life featuring Michael the Wild Life Detective",
        "description": "Introduction to Michael the Wild Life Detective and his non profit Research Wild hosted by Jim Fisher.",
        "language": "en",
        "author_name": "Jim Fisher",
        "slug": "awildlife",
        "cover": "20220830_120827_7f103b777cbcbe20914ee2712e0388e9.jpg"
    },
    {
        "podcast_id": 150151,
        "title": "TruTheater Radio",
        "description": "Audio Drama Meets Long \nForm Discussions.\n\nHollywood and the main stream media has taken over the minds of the masses. However, many have become wise to this fact and have turned to alternative sources to seek truth to asend to greater heights of conciousness. This has left something lacking in the truth seeking movement. Trutheater Radio is stepping in the fill the void. Dramatization through audio to make us laugh, cry, uplift and inspire while discussing the deeper truths and mysteries of this realm. Join us in our assent",
        "language": "en",
        "author_name": "Joshua and Jonah Earl",
        "slug": "trutheaterradio",
        "cover": "20221106_051153_d0ac07666a849ea9363b65eafb0b6c0a.jpg"
    },
    {
        "podcast_id": 152084,
        "title": "MERLIN Podcast: Bringing Europe’s freshwaters back to life",
        "description": "Europe’s freshwaters are in an alarming state. Water pollution, habitat destruction and the ongoing effects of climate change have caused significant biodiversity loss and ecological decline across the continent. There is a pressing need for major freshwater restoration projects which tackle these declines and bring rivers, streams, peatlands and wetlands back to life. \n\nMERLIN is a major European Union funded project which is investing millions of Euros to help mainstream freshwater restoration across the continent over the coming years. This podcast follows the MERLIN project in this journey. It offers a behind the scenes look at some of the continent’s most ambitious freshwater restoration projects carried out through cutting-edge aquatic science and conservation.\n",
        "language": "en",
        "author_name": "MERLIN project",
        "slug": "project-merlin",
        "cover": "20220908_040936_e979230da85a9e773d02e8fe2069ce9c.jpg"
    },
    {
        "podcast_id": 153775,
        "title": "The State Parks Project: America's Second Best Idea",
        "description": "A journey celebrating and telling the stories of the unsung heroes of our public lands, America's State Parks.",
        "language": "en",
        "author_name": "Chumstick Productions",
        "slug": "stateparksproject",
        "cover": "20220915_110943_9c3a40df7bbb61f7f8727b10c24aeca2.jpg"
    },
    {
        "podcast_id": 153909,
        "title": "WildBrewed",
        "description": "Join me for a conservation chat over a cup of coffee. Explore topics like sustainability, animal species, conservation, minimalism and how to be a better steward of the planet.",
        "language": "en",
        "author_name": "PB Crotinger",
        "slug": "wildbrewed",
        "cover": "20220916_010951_5d630ae6c08e6de8b871a906a51582eb.jpg"
    },
    {
        "podcast_id": 155594,
        "title": "A Critter's Corner",
        "description": "<p>An animal enthusiasts' podcast hosted by animal enthusiasts for animal enthusiasts. Every week, best friends of 10 years Dann and Raymon discuss all things, but mainly animals. Please be warned, Dann and Raymon are animal enthusiasts, they are not animal experts.</p>",
        "language": "en",
        "author_name": "Dann & Raymon",
        "slug": "acritterscorner",
        "cover": "20230427_060440_692e65aa97df3994b90d673fa0c356e1.jpg"
    },
    {
        "podcast_id": 155857,
        "title": "Cache Break Radio",
        "description": "<p>-Cache Break Radio is a tree planting podcast created by a Big Family ( Vanh, MeKaWish, Léo Dauphin, MitchMills (Michelle Maisonneuve), Big Wastehya ) We've been planting for a long time and we put More than 5 Millions Trees Together . We made this podcast to showcase our tree planting friends and their experiences in the planting world. Our goal is to share these experiences in hopes of bring the planting community closer together, and to encourage more people to come experience tree planting for at least one season. Enjoy the show!</p><p>- Cache Break Radio est un podcast de plantation d'arbres créé par une Grande Familles De Vétérans ( Vanh, MeKaWish, Léo Dauphin, MitchMill, Big Wastehya) Nous plantons depuis longtemps et nous avons Mis tous Ensemble en Terre un 5Millions et Plus d'arbres.. Nous avons créé ce podcast pour présenter nos amis planteurs d'arbres et leurs expériences dans le monde de la plantatio et dans leur vie après la Plantation. Notre objectif est de partager ces expériences dans l'espoir de rapprocher la communauté des planteurs et d'encourager davantage de personnes à venir faire l'expérience de la plantation d'arbres pendant au moins une saison. Profite du spectacle!</p>",
        "language": "fr",
        "author_name": "Vanhmano Phonekeo, MeKaWish Proulx, Leo Dauphin, MitchMills ( Michelle Maisonneuve ) , *Big Wastehya Harper",
        "slug": "cachebreakradio",
        "cover": "20230219_110226_1b534d341f5f410bd3492a6bf9b6f8e4.jpg"
    },
    {
        "podcast_id": 156583,
        "title": "HONIY - Heart Of Nature In You",
        "description": "Connect with the HONIY, the Heart Of Nature In You.  ",
        "language": "en",
        "author_name": "Meredith Ball",
        "slug": "tulip-iris-k4aks",
        "cover": "20220928_070928_6ff0df411c4938d4433e6cd19e645799.jpg"
    },
    {
        "podcast_id": 156870,
        "title": "The Grow With Scott Podcast",
        "description": "Owner operator of the Shudder Seed Company giving grow tips and education.",
        "language": "en",
        "author_name": "Scott Stockwell",
        "slug": "gwsp-1",
        "cover": "20220929_080936_f7a992c6dc6b677578f72da9a80dea94.jpg"
    },
    {
        "podcast_id": 158212,
        "title": "SUPA SAPS - Single Use Plastic Awareness, Stop All Plastic Straws",
        "description": "These podcasts are the result of international volunteering project \"Single Use Plastic Awareness, Stop All Plastic Straws\".\nIt aims to empower young people to become active agents of social change in their local communities, increase the capacity for self-management, independence and proactivity. And also to favor and give value to civic and solidarity activities, promote initiative, creativity and solidarity between young people from different countries.",
        "language": "es",
        "author_name": "Fundació Catalunya Voluntària",
        "slug": "catvoluntaria",
        "cover": "20221005_011008_d52a07bb5330e397cfe8af30e2e12842.jpg"
    },
    {
        "podcast_id": 159421,
        "title": "Crag Gals",
        "description": "Hey there!\n Crag Gals is a podcast where gals' talk about crags'! Carolyn DeRosa, Emma Shepherd, and Macy Grove are all students at Pennsylvania State University who represent the University's Club Climbing!\n In Crag Gals, we cover a variety of topics around rock climbing such as mental health, environmentalism, risk management, professional and competitive rock climbing, and much more! Come join us at the Crag and learn about the amazing sport of rock climbing!",
        "language": "en",
        "author_name": "Carolyn DeRosa, Emma Shepherd, and Macy Grove",
        "slug": "crag-gals",
        "cover": "20221011_121037_5f7883c367d2a107492652a0ee7573dc.jpg"
    },
    {
        "podcast_id": 161856,
        "title": "Programa radio GATS",
        "description": "Los miércoles, cada 15 días, la voluntaria de la asociación Gats de Carrer Cubelles, Marta López, presenta en Radio Cubelles el Programa GATS, un espacio donde hablamos de las últimas actuaciones de la asociación así como de temas relacionados con los michis con invitados como veterinarios, peluqueros felinos, miembros de la administración pública... Si te gustan los gatos, no te lo pierdas!",
        "language": "es",
        "author_name": "Gats de Carrer Cubelles ",
        "slug": "gatscarrercubelles",
        "cover": "20221020_071036_10d06489ce17ebb7f0ffd8723475327c.jpg"
    },
    {
        "podcast_id": 162268,
        "title": "Tiny Living Beings",
        "description": "<p>Tiny Living Beings is a weekly podcast where listeners get to know a scientist, a weird microorganism they like, and why they think it’s interesting. Our planet is full of billions of different microscopic organisms, most of which are still unknown to science. The ones we do know are diverse and strange. Microbiology knowledge is often gatekept by scientists who discuss this information in exclusive professional circles, but more of these topics need to be shared with the public! Although generally upbeat and fun, conversations often tangentially address frustrations with society or become existential, which, because of the time we are living through, is inherently connected to any discussion of topical scientific information. Content is geared toward all ages and backgrounds, anyone who is scientifically curious. </p>",
        "language": "en",
        "author_name": "Julia Van Etten",
        "slug": "couchmicroscopy",
        "cover": "20221022_121007_d0a2e054b491323f02a8193f01c2d099.jpg"
    },
    {
        "podcast_id": 162372,
        "title": "AMBIENTIAMOCI",
        "description": "𝗔𝗺𝗯𝗶𝗲𝗻𝘁𝗶𝗮𝗺𝗼𝗰𝗶, è il nostro nuovo podcast in collaborazione con enciclopediambiente.com. In ogni puntata, con una definizione e un testo, tratteremo tematiche ecologiche e tutto ciò che riguarda l'ambiente.\n\nPotete ascoltare le puntate di 𝗔𝗺𝗯𝗶𝗲𝗻𝘁𝗶𝗮𝗺𝗼𝗰𝗶 nella sezione podcast del nostro sito, su Spotify e sul nostro canale YouTube",
        "language": "it",
        "author_name": "Frammaradioweb",
        "slug": "ambientiamoci",
        "cover": "20230124_030151_54210d04791c6cfd3688ae074bf8ae96.jpg"
    },
    {
        "podcast_id": 162803,
        "title": "The Fishing Podcast",
        "description": "Una lenza, un amo e qualche pesce: fiumi, laghi e mari sono da sempre il refugium peccatorum di milioni di pescatori.\nNon senza problemi, la pesca in Italia muove moltissime persone.\nMa oggi, nonostante comodità e tecnologia, perché andiamo ancora a pescare?",
        "language": "it",
        "author_name": "Gianmarco Mondini",
        "slug": "thefishingpodcast",
        "cover": "20221024_011029_112399d3c8c470197d15e8dc60ca04e4.jpg"
    },
    {
        "podcast_id": 164943,
        "title": "Natures True Crime",
        "description": "Thanks for tuning in to listen to Nature’s True Crime, tales of the more unknown natural disasters, how they happened, and what impacts they had on the areas affected. \nEvery now and then we do an \"Off the rails\" section, where we discuss weird, unknown, things that have happened that may not specifically fall under the \"Nature\" theme.\n\nNatures True Crime is a podcast produced by Saneka's Legacy an environmental education non profit in Florida.\nAll in all we like to discuss odd occurrences and have fun!",
        "language": "en",
        "author_name": "Kali Hiemier",
        "slug": "naturestruecrime",
        "cover": "20221102_071152_2f92cc6cc129c1345d6b10a300d90d83.jpg"
    },
    {
        "podcast_id": 164985,
        "title": "Silence is a Myth",
        "description": "Is silence real? Let's dive into our sound world and listen deeply. If you're here to listen intently or if you're here for relaxing sounds, welcome.",
        "language": "en",
        "author_name": "Andrew Hulse",
        "slug": "silenceisamyth",
        "cover": "20221102_091111_af8355f04cfe2e227fd7ae55cfeb9e41.jpg"
    },
    {
        "podcast_id": 165264,
        "title": "Pets Weekly Podcast",
        "description": "Hello! And welcome, to the Pets Weekly Podcast!\nMy name is Lyndie and I will be your weekly host, as we discuss all things pets.\nI am the founder of Sunshine’s Pet Services, where I offer in-home pet services for all animals regardless of species, breed, or temperament.\nI became a certified dog trainer and behavior consultant in 2011. I offer virtual dog behavior consultations to pet parents in the united states. Additionally, I am a professional pet sitter that loves, loves, loves to take care of animals.\nAbove all, I am a passionate animal advocate and a complete nerd when it comes to pet care, behavior, health, and everything in between!\nPets Weekly will cover animal behavior, health care, and pet care. Additionally, I will share heartwarming stories and inspirational stories of pets and the people who love them. \nAlso, we will go for a deep dive into dog and cat breeds, along with animal rescue, and advocacy content. I would love to do Q&A’s and share my knowledge and experience with you. I will have various segments that will educate and entertain you on a wide range of pet-related topics. There will be something for everyone that loves animals. \nIf you are a listener, you can find the podcast everywhere you listen to podcasts. \nIf you are a viewer on YouTube, There is a visually appealing version of the podcast that includes adorable pictures and videos of pets that coincide with what we are discussing in that episode. Furthermore, you can see me while I sit down and talk with you about all of my pet-related passions. \nNEW MERCH: https://pets-weekly-podcast.creator-spring.com\nYou can follow the Pets Weekly Podcast on Instagram where I will post information about each episode, general info, and updates.\nInstagram: www.instagram.com/petsweeklypodcast\nAdditionally, you can find the Pets Weekly Blog at sunshinespetservices.com.\nSunshine’s Pet Services Instagram & Facebook: www.instagram.com/sunshinespetservices\nwww.facebook.com/sunshinespetservices\nI have a lot of ideas and dreams for this podcast that could help animals in need. With your support, we can go on that journey together.\nNow that I’ve introduced myself and the podcast, I hope to see you every week as we dive into the lives of our four-legged friends together.\nVirtual Dog Behavior Advice Consultations for all pet parents in the US:\nVirtual Dog Training - Affordable Online Dog Behavior Consultations (sunshinespetservices.com)\nPhone or video consultations are available now!\n",
        "language": "en",
        "author_name": "Lyndie, ABCDT & Behavior Consultant",
        "slug": "petsweeklypodcast",
        "cover": "20221103_101152_3bdfcacc7d68820df4d1f0c1abd8fe1f.jpg"
    },
    {
        "podcast_id": 165336,
        "title": "Mother's Money",
        "description": "Our podcast is an informal/casual conversation with our hosts Mary Grace & Mark. Where we discuss environmental-related topics, with guests about their role and involvement in the topic.",
        "language": "en",
        "author_name": "Mother's Money",
        "slug": "mothersmoney",
        "cover": "20221104_051145_5564b1669b47e4369abdd47b72ad52c0.jpg"
    },
    {
        "podcast_id": 165496,
        "title": "Farmer Friday",
        "description": "Farmer Friday | This interview series amplifies the voices of our farmers, agriculturists, ag organizations, and ag businesses in the Appalachian region. It gives YOU, as the consumer, the resources needed to understand what is going on in our agricultural industry and what you can do to help. Let's bridge the gap between producers and consumers! ",
        "language": "en",
        "author_name": "Elizabeth Lynch",
        "slug": "farmerfriday-elizabethlynch",
        "cover": "20221104_081151_b3c30bc485635813ff4894b58e1a46e3.jpg"
    },
    {
        "podcast_id": 165699,
        "title": "Different Aspects",
        "description": "<p>Different Aspects Podcast features stories and experiences of women and gender diverse folks who make their livelihoods in the outdoors- from mountain guides to field scientists to artists. We want to elevate access to stories of women who shred, who educate, and who want to share their love of remote places. Different Aspects is hosted and produced by Clancy Sindlinger, a guide and outdoor educator from Northern British Columbia.</p>",
        "language": "en",
        "author_name": "Clancy Sindlinger",
        "slug": "differentaspectspod",
        "cover": "20221125_051146_e2ffb899eeca928a074ddaef3100d947.jpg"
    },
    {
        "podcast_id": 165821,
        "title": "Camping on the wild side ",
        "description": "Hello and welcome \nMy name is Steve Walker I am an Actor, Voiceover Artist, Radio Presenter, Rookie You Tuber and now venturing into Podcasting. If you have a passion for Wild Camping, Tents the Outdoors and Scotland then this will be for you. Here I will be talking about my Wild Camping trips around Scotland, talking in detail about preparation, foods, gear, tents and the whole set up that I go through, so join me as I take you Camping on the wild side.",
        "language": "en",
        "author_name": "Steve Walker",
        "slug": "campingonthewildside",
        "cover": "20221106_061151_b736a2a7699525a4562cfc4b03170b95.jpg"
    },
    {
        "podcast_id": 167148,
        "title": "Voices Of Wilderness",
        "description": "<p>Voices of wilderness, produced by the WILD Foundation, dives into wilderness concepts and stories that will inspire and empower you to speak out, take action, make a difference and find solutions to the biodiversity and climate crisis.</p>",
        "language": "en",
        "author_name": "The WILD Foundation",
        "slug": "voicesofwilderness",
        "cover": "20230331_070350_7b0ca3e484ef6a4a8b0998e5f557eb57.jpg"
    },
    {
        "podcast_id": 168572,
        "title": "[Biota]LKS Podcast",
        "description": "Candid conservation conversations. ",
        "language": "en",
        "author_name": "Shelby Herbert",
        "slug": "biotalkspod",
        "cover": "20221117_041151_4d19febd7cec0973cad43fe123f4b94b.jpg"
    },
    {
        "podcast_id": 168680,
        "title": "Kwu Sneqsilxw",
        "description": "Qwayqwayaqn and Skukalaqw listen to stories from local elders, family, and knowledge keepers and talk about the Nsyilxcen language used and the lessons they've learned from listening.",
        "language": "en",
        "author_name": "Kwu Sneqsilxw",
        "slug": "kwusneqsilxw",
        "cover": "20221117_101137_4084cf552e3b120d0a0102b0392d246d.jpg"
    },
    {
        "podcast_id": 169157,
        "title": "Plant Pals",
        "description": "The people behind the plants! A casual exploration of how people find their way into the outside world, field stories, and the species that blow their minds.",
        "language": "en",
        "author_name": "Michael Heine",
        "slug": "plantpals",
        "cover": "20221126_021157_0b237e3208cc497af6bdba1760076372.jpg"
    },
    {
        "podcast_id": 169546,
        "title": "TheaWellbeing - Our Curated Sleep Sounds",
        "description": "<p>A specially selected group of 20 sounds to help you drift off to sleep. From White Noise to Pink Noise as well as a host of soothing sounds to distract you from external noise and help you wake up relaxed and refreshed.</p>",
        "language": "en",
        "author_name": "TheaWellbeing",
        "slug": "theawellbeing",
        "cover": "20230119_100115_50623b6ef6e5ebeee6b37c1b68a49a1f.jpg"
    },
    {
        "podcast_id": 170227,
        "title": "Let's Talk Ecosystems Podcast",
        "description": "<p>In the context of the UN Decade on Ecosystem Restoration, the United Nations Environment Programme (UNEP) Europe Office and the Food and Agriculture Organization of the United Nations (FAO) have interviewed young environmentalists who are making a positive change for our planet. This podcast aims to give the floor to these passionate people who are doing great things all around the world, so they can share their experience and inspire others.</p><p><em>Disclaimer: The views expressed in this podcast are those of the interviewees and do not necessarily reflect the views of the UNEP or the FAO.</em></p>",
        "language": "en",
        "author_name": "the UN Decade on Ecosystem Restoration (2021-2030)",
        "slug": "un-decade-on-ecosystem-restoration",
        "cover": "20221214_031244_d3c990664def8c1a840fa01ba050e412.jpg"
    },
    {
        "podcast_id": 170285,
        "title": "Friends of Markham Hill Podcast",
        "description": "<p>Listen to stories about historic Markham Hill in the middle of Fayetteville, Arkansas. Markham Hill contains 300 acres of intact, urban forest and natural areas, several Pratt family-built structures, at least two Native American sites, and has a history of cultural importance to the area, including a boys &amp; girls camp from the 1920s-1940s, hippies and students living in the abandoned camp cabins from the 1950s-2000s, over 40 years of University of Arkansas runners on the trails, wildlife studies, horseback riding, bird walks, etc. However, developers have bought almost half of the mountain so far and plan to deforest and develop it. Friends of Markham Hill is a grass roots effort to save Markham Hill from deforestation and development. But we need help spreading the word and using public pressure to protect this land. This podcast contains at least 80 'Weekly Markham Hill Moments of History' that were initially posted on Facebook, sent to the Fayetteville City Council, and aired on Fayetteville's KPSQ 97.3 FM Community Radio. So far, the developers and Big Money are winning. They have started deforesting. Please share this podcast and help spread the word. Thank you so much. Let's save Markham Hill!</p>",
        "language": "en",
        "author_name": "Lisa M Orton",
        "slug": "friendsofmarkhamhill",
        "cover": "20221125_041114_b60cec919b02dd510094f05a25447280.jpg"
    },
    {
        "podcast_id": 171938,
        "title": "Música EPI",
        "description": "<p>Dos adolescentes dando una opinión divertida sobre la música.</p>",
        "language": "es",
        "author_name": "Dianita",
        "slug": "fastfashional",
        "cover": "20230309_020316_ebbeeac7132ca5c12f5be25120eebc28.jpg"
    },
    {
        "podcast_id": 172812,
        "title": "Speaking of Sustainability",
        "description": "Hosted by composting maven Colleen Falicki (Back To Earth Compost Crew), Speaking of Sustainability shines a spotlight on leaders and change agents making a difference in the sustainability space!",
        "language": "en",
        "author_name": "Colleen Falicki",
        "slug": "speakingofsustainability",
        "cover": "20221206_061240_45f177f3b351d62cdc0db9e2ba35298d.jpg"
    },
    {
        "podcast_id": 173350,
        "title": "SHARKS",
        "description": "A deep water exploration of our planet's coolest predator. Tune in for wacky info about your favorite species of shark delivered by special celebrity guests.",
        "language": "en",
        "author_name": "William Hap Phelps",
        "slug": "sharks",
        "cover": "20221208_051224_55f1d04d6a3ba55eaa2b89cd38c55fe8.jpg"
    },
    {
        "podcast_id": 173584,
        "title": "Tender Joy",
        "description": "Your hosts Scott and Cindy recap a few interesting articles that they found throughout the week.",
        "language": "en",
        "author_name": "Scott Klinker & Cindy Sam",
        "slug": "tenderjoy",
        "cover": "20221210_011237_d25c9225b9f695620d6cd83c2a2238c3.jpg"
    },
    {
        "podcast_id": 174789,
        "title": "What the SUST?",
        "description": "<p>A sustainability podcast by students, for students!</p>",
        "language": "en",
        "author_name": "What the Sust?",
        "slug": "whatthesustpod",
        "cover": "20221216_021227_52e4f1935c7f169a03ddbc8093c40630.jpg"
    },
    {
        "podcast_id": 175245,
        "title": "Simon Says Recycling",
        "description": "<p>SIMON SAYS RECYCLING, czyli recycling po ludzku. </p><p>Stworzyliśmy podcast, żeby uświadomić społeczeństwu po co segregować, jak segregować i co dzięki segregacji możemy uzyskać.</p><p>___________________________________________________________________________</p><p>Podcast poprowadzą: Szymon Dziak-Czekan polski przedsiębiorca, menedżer, prezes Stowarzyszenia „Polski Recykling” oraz grupy SPDC Holding zajmującej się recyklingiem tworzyw sztucznych. W latach 2006-2021 wprowadził na rynek ponad 200 000 ton recyklatów z tworzyw sztucznych, stanowiących alternatywę dla surowców pierwotnych. Autor ponad 200 publikacji dotyczących ochrony środowiska, recyklingu i zrównoważonego rozwoju przedsiębiorstw. Prywatnie jest zapalonym żeglarzem, który uwielbia narty, golfa oraz tenis stołowy.</p><p>Host - Bogna Komorowska- Jędrzejewska: Przedsiębiorca, mama, prezenterka radiowa, dziennikarka, lektorka. Od 18 lat prowadzi swoją agencję PR, która specjalizuje się w komunikacji kampanii społecznych, programów telewizyjnych oraz wielkich wydarzeń medialnych. Jej misją jest zachęcanie ludzi do dialogu, w każdej sprawie. Sztukę komunikacji zamienia w sztukę słuchania. Interesuje się ludźmi, ich różnorodnością, motywacjami i historiami.</p>",
        "language": "pl",
        "author_name": "Szymon Dziak-Czekan",
        "slug": "simonsaysrecycling",
        "cover": "20221221_091245_520911baf29f6ef4d674c1241dba7a02.jpg"
    },
    {
        "podcast_id": 175884,
        "title": "Stop it..",
        "description": "<p>Hehe..</p>",
        "language": "en",
        "author_name": "Sora",
        "slug": "animal-crossing-music-with-rain-noises",
        "cover": "20230806_110807_25b1b94f9bee76c3001d3a0a930746e3.jpg"
    },
    {
        "podcast_id": 177226,
        "title": "Eveciencia (Preguntas Ñoñas) ",
        "description": "En este podcast preguntas ñoñas, divulgamos filosofía y ciencia, desde matemáticas, física, química, biología, ciencias sociales, ambientales, geografía y un poco de historia, todo con una actitud positiva, y en modo de aprender. Queremos, promover la curiosidad entre nuestro público, la discusión y método dialéctico para resolución de problemas.",
        "language": "es-mx",
        "author_name": "Bernardo Águila",
        "slug": "evecienica",
        "cover": "20221231_011232_12577996efd44af54063cf93de4d3696.jpg"
    },
    {
        "podcast_id": 178036,
        "title": "The Flocks Given",
        "description": "The Flocks Given attempts to connect some dots on how birds exist. Sometimes it’s parallel. Sometimes it weaves and intertwines. Sometimes it’s plain ducked up.",
        "language": "en",
        "author_name": "Josh ",
        "slug": "theflocksgiven",
        "cover": "20230104_120129_84af3d85d9898fa0873081187cbeaf52.jpg"
    },
    {
        "podcast_id": 185944,
        "title": "Totally Buggin’",
        "description": "<p>The podcast about all things creepy crawly with host organisms Cammie and Faith.</p>",
        "language": "en",
        "author_name": "Cammie Murray and Faith Mihalick",
        "slug": "totallybuggin",
        "cover": "20230426_090453_2e2f0d7bdd2e07e8cc87e00ad1ac010d.jpg"
    },
    {
        "podcast_id": 186225,
        "title": "Science & Société avec Leonardo Orlando et ses invités",
        "description": "<p>RePlanet France - les écohumanistes vous invitent à découvrir la série de podcasts \"Science et Société\". Chaque émission mettra en avant un expert qui présentera son travail en lien avec ce thème, et explorera différents aspects de la relation spéciale que les sociétés entretiennent avec la science, la recherche et les scientifiques. Des solutions technologiques à la compréhension psychologique du déni scientifique, ces podcasts vous permettront de mieux appréhender les dynamiques en jeu et de trouver des solutions pour relever le défi climatique. Rejoignez-nous et plongez dans cette passionnante exploration de la science et société.</p>",
        "language": "fr",
        "author_name": "RePlanet France - les  écohumanistes",
        "slug": "replanetfrance",
        "cover": "20230515_120550_2560426effc4b3108da701267cef6590.jpg"
    },
    {
        "podcast_id": 187083,
        "title": "Podcast about nothing by no one for nobody",
        "description": "Podcast where I talk about nothing whatsoever",
        "language": "en",
        "author_name": "No one ",
        "slug": "podcastnothing",
        "cover": "20230206_080225_4fcba09938cc5b0f02efc02cebcb2be1.jpg"
    },
    {
        "podcast_id": 188114,
        "title": "The Healthy Forests Podcast",
        "description": "<p>Brought to you by Stewardship West, a non profit organization with a boots-on-the-ground, action focused approach to forest stewardship.</p>",
        "language": "en",
        "author_name": "The Healthy Forests Podcast Crew",
        "slug": "thehealthyforestspodcast",
        "cover": "20230209_080234_1c2a8d656df1dd716c78b9335b969a5e.jpg"
    },
    {
        "podcast_id": 191409,
        "title": "Green Spritz   aperitivo nel mondo del verde",
        "description": "<p>Incontri informali con personaggi del mondo del giardinaggio, vivaismo, architettura del paesaggio... tutto ciò che è GREEN ( Profilo Instagram per tutti i contenuti @floriana.bulbose )</p>",
        "language": "it",
        "author_name": "Christian Shejbal",
        "slug": "florianabulbose",
        "cover": "20230221_100247_9dec2d61a28a2ed1a554d906265690d0.jpg"
    },
    {
        "podcast_id": 191437,
        "title": "Outdoor Adventures Podcast ",
        "description": "<p>This is the Outdoor Adventures Podcast. The O.A.P. crewmembers are regular guys, with normal lives, with a passion for the outdoors. We discuss hunting, fishing, hiking, back-packing, mushroom hunting, and all things wild. E-mail us at <a href=\"mailto:oapcrewquestions@gmail.com\">oapcrewquestions@gmail.com</a> to suggest topics or share stories.</p>",
        "language": "en",
        "author_name": "Sam Williams",
        "slug": "outdooradventures",
        "cover": "20230222_120212_913054cadee3e91107ed7baa6543eba8.jpg"
    },
    {
        "podcast_id": 191524,
        "title": "Píldoras forestales",
        "description": "<p>Bienvenido/a a Píldoras Forestales.</p><p>Este podcast está realizado por los alumnos y alumnas que están cursando el ciclo de Técnico Superior en Gestión Forestal y del Medio Natural en el CIFP Almázcara.</p><p>Forma parte de las prácticas del módulo de Técnicas de Educación Ambiental.</p><p>Podrás ver una parte del resto de sus prácticas en <a href=\"http://www.almazcara.wordpress.com\">www.almazcara.wordpress.com</a></p><p>Con estas Píldoras Forestales aprenderás y te divertirás con temática forestal.</p><p><a href=\"https://almazcara.wordpress.com/podcast/\">https://almazcara.wordpress.com/podcast/</a></p>",
        "language": "es",
        "author_name": "CIFP_Almázcara",
        "slug": "pildorasforestales",
        "cover": "20230222_080236_8f732042ffa28306b7f7d189efc6bb38.jpg"
    },
    {
        "podcast_id": 192522,
        "title": "Rabbithole fantasy",
        "description": "<p>Cryptids, conspiracies and the paranormal. Buckle up and let's go down the rabbit hole.</p>",
        "language": "en",
        "author_name": "Cpt Redbeard, Tala, Mr Hobbit and Sawtooth",
        "slug": "rabbit-hole-fantasy",
        "cover": "20230315_060305_4bc2384499d4d85c3523080a3e5049df.jpg"
    },
    {
        "podcast_id": 194176,
        "title": "Theodore Payne Foundation Wild Flower Hotline",
        "description": "<p>Hear weekly recorded wildflower reports, narrated by Emmy Award-winning actor Joe Spano, the Voice of the Wild Flower Hotline. New reports are released every Friday, March through May! </p><p>The acclaimed Theodore Payne Wild Flower Hotline, founded in 1983, offers free weekly online and recorded updates – posted each Friday from March through May – on the best locations for viewing spring wildflowers in Southern and Central California. All locations are on easily accessible public lands and range from urban to wild, distant to right here in Los Angeles.</p>",
        "language": "en",
        "author_name": "Theodore Payne Foundation for Wild Flowers & Native Plants",
        "slug": "wildflowerhotline",
        "cover": "20230303_100346_696862fdde97c45148ec00b35b50f4c9.jpg"
    },
    {
        "podcast_id": 195256,
        "title": "Cryptids: Folklore or More?",
        "description": "<p>A podcast that welcomes cryptid skeptics and believers alike. Hosts Dominick and Meaghan take you, the listeners on a journey through a world of strange and potentially unknown creatures. We ponder over the evidence in an objective, analytical, and deductive manner. At the end of episodes, we will grade discussed cryptids based on how much we personally believe in them, employing our own custom scale. </p><p>Make sure to follow our Facebook page for updates <a href=\"https://www.facebook.com/profile.php?id=100092225752561&amp;mibextid=LQQJ4d\">https://www.facebook.com/profile.php?id=100092225752561&amp;mibextid=LQQJ4d</a></p>",
        "language": "en",
        "author_name": "Dominick and Meaghan",
        "slug": "cryptids-folklore-or-more",
        "cover": "20230307_090302_18b2757984ae8628b8f929f614175b32.jpg"
    },
    {
        "podcast_id": 196436,
        "title": "LOW TIDES MUST RISE",
        "description": "<p>Join me, Ben Hardouin - Founder of RISING TIDES PROJECT as we dive into the complex world of LOW TIDE Mental Health. This podcast uses FISHING as a platform to launch powerful dialogue featuring REEL PEOPLE, REEL LIVES and REEL STORIES!</p><p>Regular episodes posting in summer 2023.</p>",
        "language": "en",
        "author_name": "Ben Hardouin",
        "slug": "risingtidesproject",
        "cover": "20230313_020332_814f1514531f9fbff8a378ec93eaa2d8.jpg"
    },
    {
        "podcast_id": 196543,
        "title": "RamAirRadio",
        "description": "<p>Ram Air Radio is the Student Radio for The University of Bradford run by students for students.</p><p>To get involved, send an email to <a href=\"mailto:student-radio@ubu.bradford.ac.uk\">student-radio@ubu.bradford.ac.uk</a></p>",
        "language": "en",
        "author_name": "RAM AIR RADIO",
        "slug": "ramairradio",
        "cover": "20230320_100324_94204cfe53ed106dfb55f9cdad12a51f.jpg"
    },
    {
        "podcast_id": 198046,
        "title": "Eko Eho",
        "description": "<p>Eko Eho novi je podcast Fondacije Friedrich Ebert u suradnji sa Radiotelevizijom Bosne i Hercegovine. Pridružite nam se svake sedmice u informativnim i inspirativnim razgovorima o okolini - u najširem smislu. Od aktualnih tema vezanih za energetsku tranziciju, do svakodnevnih tema koji se tiču našeg životnog okruženja - naš novi podcast nudi vam svježe informacije na jednom mjestu. </p>",
        "language": "en",
        "author_name": "Eko Eho",
        "slug": "ekoeho",
        "cover": "20230320_090343_b8b6bfd3be7aaa489f7d0d55b5c91cbf.jpg"
    },
    {
        "podcast_id": 198132,
        "title": "Día Mundial da Meteoroloxía",
        "description": "<p>Dende a <a href=\"https://ucc.webs.uvigo.es/\">Unidade de Cultura Científica e da Innovación</a> da Universidade de Vigo presentamos unha serie de 5 podcasts para celebrar e conmemorar o Día Mundial da Meteoroloxía, 23 de marzo de 2023.</p><p>Esta actividade non sería posible sen a colaboración do persoal investigador do <a href=\"https://cim.uvigo.gal/\">Centro de Investigación Mariña (CIM)</a>, protagonistas das pezas.</p><p>A acción encádrase dentro do plan anual de actividades da UCC+I 22-23 \"Ciencia de Ida e Volta\" que conta co apoio da <a href=\"https://www.fecyt.es/\">Fundación Española para la Ciencia y la Tecnología - FECYT.</a></p>",
        "language": "es",
        "author_name": "Unidade de Cultura Científica e da Innovación da Universidade de Vigo",
        "slug": "ucc-metereoloxia",
        "cover": "20230320_030346_824db9521959ebfe9e164b2ebef0a58c.jpg"
    },
    {
        "podcast_id": 199297,
        "title": "Branching Out",
        "description": "<p>Welcome to Branching Out, the podcast that delivers interesting facts and tidbits about WashU's trees right to your ears. Hosts Faith, Ivy, and Cameryn discuss well-known and more niche trees around the campus, diving into their rich histories and unique quirks that make these trees so special. The hope is that you get to know some of our green neighbors, one tree at a time. Written and Produced by Ivy Moore, Cameryn Berryhill, and Faith Liang. Show art by Ivy Moore.</p><p><a href=\"https://instagram.com/branchingout_podcast?igshid=YmMyMTA2M2Y=\">https://instagram.com/branchingout_podcast?igshid=YmMyMTA2M2Y=</a></p>",
        "language": "en",
        "author_name": "Ivy Moore, Faith Liang, Cameryn Berryhill",
        "slug": "branchingoutpodcast",
        "cover": "20230325_050353_1d576240718408313f4cef73ea13785a.jpg"
    },
    {
        "podcast_id": 199904,
        "title": "Storied",
        "description": "<p>As participants in our natural world, we are fortunate to witness some awe-inspiring events. Not limited to hunting and fishing, this is a fireside chat podcast that dives into all stories made in the outdoors. Join us to relive great memories made in wild places.</p>",
        "language": "en",
        "author_name": "Ryan Wierzba & Reuben Frey",
        "slug": "storied-podcast",
        "cover": "20230331_120342_258c3db165da9a5cf48de4cba65f1919.jpg"
    },
    {
        "podcast_id": 200056,
        "title": "Elements of a Garden",
        "description": "<p>The <a href=\"https://www.nativeplantgardentour.org/\"><strong>2023 Native Plant Garden Tour</strong></a> podcast celebrates the hidden meaning within our gardens — how each element is nested within something larger: a seed, a plant, a garden, an ecosystem. Join UCLA climate scientist and native plant gardener <a href=\"https://www.ioes.ucla.edu/person/alex-hall/#:~:text=Alex%20Hall%20is%20Professor%20in,both%20regional%20and%20global%20scales.\">Dr. Alex Hall</a> and TPF Executive Director Evan Meyer for an exploration of a single garden within the deeper context of environmental and cultural forces shaping our changing planet.</p><p><strong>For images and more information on Dr. Alex Hall’s garden visit:</strong></p><p><a href=\"https://www.nativeplantgardentour.org/06-carthay-rewilding-and-renewal/\">Carthay Rewilding &amp; Renewal</a></p><p>#nativeplants #theodorepaynefoundation #nativeplantgardentour</p><p> </p><p> </p><p>© 2023 Theodore Payne Foundation for Wild Flowers &amp; Native Plants</p>",
        "language": "en",
        "author_name": "Theodore Payne Foundation",
        "slug": "gardentour",
        "cover": "20230329_030340_88b0b01b3130486883b7b4b22c94ce13.jpg"
    },
    {
        "podcast_id": 200690,
        "title": "zCast - a HVG fenntarthatósági podcastja",
        "description": "<p>Ez a zCast, a HVG fenntarthatósági podcastja.</p><p>Legyen szó a szélsőséges időjárásról, a kerékpározásról és a tömegközlekedésről, az étkezésről, az öltözködésről, a kistelepülésekről, városokról, az otthonunkról: azok a viták, amelyeket ma folytatunk, nem azért fontosak, hogy ma legyen igazunk bennük.</p><p>A zCast új évadjában ezeket a beszélgetéseket fogja elhozni Nagy Iván László kéthetente</p>",
        "language": "hu",
        "author_name": "HVG podcastok",
        "slug": "hvgzcast",
        "cover": "20230401_050422_8f49429a84ab323883ccd4a3b6737e07.jpg"
    },
    {
        "podcast_id": 201732,
        "title": "DogTalks",
        "description": "<p><em>Da più di 2000 anni l'uomo si evolve con i cani, nel 2023 è ancora possibile vivere con un cane? DogTalks affronta il tema della relazione che si instaura tra i cani e le persone, una delle relazioni che più tocca il cuore dell'essere umano. E' un podcast pensato e realizzato da Roberta Ponzoni e Costanza Desiderio - istruttrici cinofile esperte in area comportamentale - che ogni quindici giorni affronteranno una tematica ricorrente nella vita di tutti i giorni di coloro che condividono la quotidianità con un cane. Gli episodi saranno pubblicati il secondo e il quarto mercoledì di ogni mese.</em></p>",
        "language": "it",
        "author_name": "Roberta Ponzoni e Costanza Desiderio",
        "slug": "dogtalks",
        "cover": "20230406_050431_48ec3ef14195a1492b7824ec77104c29.jpg"
    },
    {
        "podcast_id": 201932,
        "title": "PsyCliCri: The Podcast",
        "description": "<p>Hello everyone! Welcome to the first episode in our PsyCliCri podcast series. This series has been created by Eleanor Smyth, Joshua Hernon and Sadhbh Carpenter as part of an undergraduate module, Psychology of the Climate Crisis, taught by Dr. Clare Kelly at TCD.</p><p>If you would like to stay up to date in the discourse of all things related to the psychology of the climate crisis, visit @<a href=\"mailto:TCDPsyCliCri@climatejustice.social\">TCDPsyCliCri@climatejustice.social</a> on twitter.</p>",
        "language": "en",
        "author_name": "Sadhbh Carpenter, Joshua Hernon, Eleanor Smyth",
        "slug": "psyclicri-thepodcast",
        "cover": "20230407_080429_52eb1a9ab7e697b07b415619f4f30c33.jpg"
    },
    {
        "podcast_id": 202065,
        "title": "The Wild Air Podcast",
        "description": "<p>The Wild Air Podcast is a show about nature writing. Tune in for weekly conversations with some of the finest nature writers working today--from environmental journalists to cli-fi novelists to songwriters and poets, The show celebrates the beauty of the natural world and explores themes around conservation and environmental loss through the lens of story telling. </p>",
        "language": "en",
        "author_name": "Brad Badelt",
        "slug": "thewildairpodcast",
        "cover": "20230408_030449_d1d9b2ccda61f54e8423a74a512c2232.jpg"
    },
    {
        "podcast_id": 203043,
        "title": "La Encina Guapa",
        "description": "<p>Bienvenidos a “La Encina Guapa”, un podcast dedicado al turismo rural en España. En este espacio, exploraremos los encantos de los pueblos y casas rurales, descubriremos los lugares más interesantes para visitar y conversaremos con expertos en el campo. Nos sumergiremos en la cultura local, hablaremos sobre los productos locales, la gastronomía y las tradiciones, y descubriremos cómo el turismo rural puede ser una forma sostenible de apoyar a las comunidades rurales y combatir la despoblación. ¡Únete a nosotros en esta aventura rural y descubre el lado más auténtico de España!</p>",
        "language": "es",
        "author_name": "La Encina Guapa",
        "slug": "laencinaguapa",
        "cover": "20230419_050438_f314ae566ac2df3bcc6d099019641f21.jpg"
    },
    {
        "podcast_id": 203431,
        "title": "Adéla už večeřela",
        "description": "<p>Jsem Adéla a už nějakou dobu mi chybí na české scéně podcast o rostlinách v celé šíři, které toto téma nabízí. Chystám se rozebírat historii rostlin, jak ovlivnily a stále ovlivňují naše životy, jejich význam a přínos v umění napříč disciplínami i role v popkultuře. Občas si pozvu i někoho dalšího.</p><p>Za mikrofonem sedím já, Adéla nebo taky @tygriik.</p><p>Kde mě dál sledovat?</p><p><a href=\"https://www.instagram.com/adela_vecerela\">https://www.instagram.com/adela_vecerela</a></p><p>Newsletter a bonusový obsah na <a href=\"https://www.pickey.cz/adela_vecerela\">https://www.pickey.cz/adela_vecerela</a></p><p>DM me přes Instagram nebo <a href=\"mailto:adelavecerela@gmail.com\">adelavecerela@gmail.com</a></p>",
        "language": "cs",
        "author_name": "Adéla",
        "slug": "adelavecerela",
        "cover": "20230415_070441_f85df7169593b1a8def786b64775fb05.jpg"
    },
    {
        "podcast_id": 203644,
        "title": "We’re Not Woke",
        "description": "<p>A podcast where we share our perspectives on reality while rooted in the knowing that at the end of the day, none of us really have the answers to life’s’ biggest questions.</p><p>We’re all here together, figuring this sh*t out, one day at a time. So what have you learned so far?</p>",
        "language": "en",
        "author_name": "Sienna Noelle Peeples",
        "slug": "wnwpod",
        "cover": "20230421_050402_d152d5b392d8f7a4761534d242e384ab.jpg"
    },
    {
        "podcast_id": 203653,
        "title": "The End of the World As We Know It",
        "description": "<p>Sometimes it feels like the world is ending. Yes, climate change is real, believe me I've checked. A giant doomsday clock hovers over our heads. It's scary stuff, I get it. Can we fix the climate crisis and take the batteries out of that clock? I think so. Do you?</p>",
        "language": "en",
        "author_name": "Carmen LeCluyse",
        "slug": "the-end-of-the-world-as-we-know-it",
        "cover": "20230419_020444_92cc41fdc75180d63f9bf32667370bf0.jpg"
    },
    {
        "podcast_id": 204177,
        "title": "Lost In The Forest ",
        "description": "<p>Our series of trail experiences, where we ride, and how we spend a day on the trail.</p><p>We will talk about our opinion of a location, the culture, any cafe or ice cream joints we like, bike shops and even if the place has potential for wild edibles. We are always on the hunt for quiet lunch eating spots or an area to dip your feet in a clear stream without picking up a Tick!</p>",
        "language": "en",
        "author_name": "Sleaford",
        "slug": "lost-in-the-forest",
        "cover": "20230724_030714_3b35ca70632b15ca9f5623f65d207ef1.jpg"
    },
    {
        "podcast_id": 206118,
        "title": "The Fieldwork",
        "description": "<p><a href=\"http://www.thefield.work\">www.thefield.work</a></p>",
        "language": "nl",
        "author_name": "Kim Hertogs _ The Fieldwork",
        "slug": "thefieldwork",
        "cover": "20230429_120437_f11bedcd1b678eee07f7df42ce8a6520.jpg"
    },
    {
        "podcast_id": 206717,
        "title": "The Mutation Station",
        "description": "<p>\"The Mutation Station\" is a gripping 10-episode podcast that delves deep into the fascinating world of genetic mutations. Hosted by a mutant, each episode explores a different mutation, from the well-known like Heterochromia Iridium to the more obscure like chimerism and diastema.</p><p>Listeners will be taken on an enlightening journey through the intricacies of each mutation, learning about the genetic causes and how they manifest in the human body. But \"The Mutation Station\" doesn't just stop there. Each episode will also dive into the historical and cultural significance of these mutations, exploring how they've been perceived and treated throughout history.</p><p>Listeners with an interest in Heterochromia Iridium will be particularly captivated by this podcast. They'll learn about the genetics behind this fascinating condition that results in one eye being a different colour from the other, and how it's been viewed in different cultures around the world.</p><p>But even those without a specific interest in Heterochromia Iridium will find something to enjoy in \"The Mutation Station.\" The podcast provides a rare opportunity to learn about the unique mutations that make us all different, and to appreciate the diversity of the human experience.</p><p>Overall, \"The Mutation Station\" is an engrossing podcast that is sure to appeal to anyone with a curious mind and an interest in the incredible diversity of human genetics.</p>",
        "language": "en",
        "author_name": "Mish Cavanagh-Downs",
        "slug": "themutationstation",
        "cover": "20230502_040537_d0793fa389b9776a7937ef26cdbf4a17.jpg"
    },
    {
        "podcast_id": 207214,
        "title": "Muskies On Tap",
        "description": "<p>Wisconsin northwoods musky Guide, Gus Mantey, his brother Max Mantey and their childhood buddy, Brian Eckle chronicle each week of Gus’s journey as a Musky guide. Hear real time fishing reports, stories from the boat, tournament results, tactics, and the occasional beer recommendation. We hope you enjoy!</p><p>Muskies on Tap - a division of Sug's Fishing LLC</p><p></p>",
        "language": "en",
        "author_name": "Gus Mantey, Max Mantey, & Brian Eckle",
        "slug": "muskiesontap",
        "cover": "20230511_040538_dbc115b8b41ed70207264ca44054d33e.jpg"
    },
    {
        "podcast_id": 211993,
        "title": "Sleepy Rain Sounds ",
        "description": "<p>Rain sounds to relax you and help you fall asleep</p><p><a href=\"http://patreon.com/LostinLife\">patreon.com/LostinLife</a></p>",
        "language": "en",
        "author_name": "Sleepy Time Dreamer",
        "slug": "relaxing-rain",
        "cover": "20230529_020526_44333fbf2696090647d7acdbd0d359e9.jpg"
    },
    {
        "podcast_id": 213302,
        "title": "Keep Them Wild: the wildlife news podcast",
        "description": "<p>Keep Them Wild brings you the latest wildlife news and discussions on wildlife conservation, ethics, and welfare. We bring you up-to-date conservation news on the current state of wildlife populations, environmental policies, and global initiatives aimed at saving wildlife. From time-to-time we'll feature discussions and interviews with scientists, conservationists, wildlife experts, and advocates who dedicate their lives to protecting and promoting the welfare of animals. Join us, as we deepen our understanding of what it really takes to save wild animals.</p>",
        "language": "en",
        "author_name": "Adventurers for Animals",
        "slug": "keepthemwild",
        "cover": "20230605_010641_bdbeedba132a597fe77aacc288298303.jpg"
    },
    {
        "podcast_id": 213524,
        "title": "Breaking the Grid",
        "description": "<p>Welcome to Breaking the Grid, the podcast where we talk about the unseen sides of off grid living, self-sufficiency, and a life without modern society. Dan Martin, one of the foremost experts in the field of off-grid living, and his co-host, Julia, a beginner homesteader, share the ins and outs of living self-sufficiently and what people don't tell you about this lifestyle. They share stories, experiences, and revelations they've come to only after leaving society. Whether you are looking to leave society as a whole or just looking to be less dependent on society's structures and systems, this is the place for you.</p>",
        "language": "en",
        "author_name": "Breaking the Grid",
        "slug": "breakingthegrid",
        "cover": "20230606_030603_8fce6089d743e6093430ff30975b6aa7.jpg"
    },
    {
        "podcast_id": 214072,
        "title": "Cuidado de los ecosistemas ",
        "description": "<p>Orientacion educativa - cuidado de los ecosistemas</p>",
        "language": "es-mx",
        "author_name": "Sandra Suri Ramirez Sanchez",
        "slug": "cuidado-delosecosistemas",
        "cover": "20230609_010629_f20d488219b074b431ccb4801cb4e504.jpg"
    },
    {
        "podcast_id": 214926,
        "title": "Mammals R Us",
        "description": "<p>Part science, part cultural history,  part travelogue, and part bad jokes, our podcast gives a 360° perspective on some of our most charismatic wild mammals.  </p><p>Fiona Mathews and Tim Kendall are the first married couple ever to make a podcast together. Fiona is Chair of Mammal Conservation Europe and Professor at the University of Sussex, and Tim is Professor of English Literature at the University of Exeter. They are the authors of <em>Black Ops and Beaver Bombing; Adventures with Britain's Wild Mammals</em> ('The book I'll be recommending for the rest of the year', <em>BBC Countryfile Magazine</em>;  'Surprisingly interesting', our daughter's friend's boyfriend).                        </p><p>All episodes available at <a href=\"http://Britishmammals.com\">Britishmammals.com</a>, </p><p>Hosted on <a href=\"http://rss.com\">rss.com</a>. See <a href=\"http://rss.com/privacy\">rss.com/privacy</a> for more information.</p><p>℗ &amp; © 2023. Mammals R Us. </p><p>                                                                                            </p>",
        "language": "en",
        "author_name": "Fiona Mathews & Tim Kendall",
        "slug": "mammalsrus",
        "cover": "20230613_120605_6fd57c5fdc8fdc369959e632f15f9008.jpg"
    },
    {
        "podcast_id": 215721,
        "title": "Port N Stuff",
        "description": "<p>Steven Gama, Big Tom McClain, and Tommy McClain sit down every week and talk about Big Boats, Port Hueneme, and the importance of keeping our coastal areas clean. Each week they discuss a different boat as a part of the fun.</p>",
        "language": "en",
        "author_name": "Thomas McClain",
        "slug": "portnstuff",
        "cover": "20230618_070602_de3df10dd838f5a9f4befa6f817abc70.jpg"
    },
    {
        "podcast_id": 215978,
        "title": "VIVE LA REGIÓN DE COQUIMBO ",
        "description": "<p>¡Bienvenido a la Región de Coquimbo, nos sumergiremos en los encantadores y mágicos paisajes y actividades que ofrece esta hermosa región del norte de Chile!</p><p>Conducido por<strong> Andrea Obaid</strong></p>",
        "language": "es",
        "author_name": "SERNATUR Región de Coquimbo",
        "slug": "sernatur-region-de-coquimbo",
        "cover": "20230620_010657_2cd0eca6b26732d657e3c76fb485d55e.jpg"
    },
    {
        "podcast_id": 216758,
        "title": "The London System",
        "description": "<p>An interesting podcast featuring the CEO of NewsCoo Anurag Sharma and the main cast of The podcast- The London System!</p>",
        "language": "en",
        "author_name": "Anurag Sharma",
        "slug": "anurag-sharma69420",
        "cover": "20230625_050614_c416ab913094cef5de04657515000c76.jpg"
    },
    {
        "podcast_id": 216839,
        "title": "The Berlin System",
        "description": "<p>English Subject Enrichment</p>",
        "language": "en",
        "author_name": "Anurag Sharma",
        "slug": "lapislazuli1",
        "cover": "20230626_070615_a5ab569c35d207bfc1b4e70dc1592258.jpg"
    },
    {
        "podcast_id": 217371,
        "title": "The Sparta System ",
        "description": "<p>CIVILISING THE NATIVE EDUCATING THE NATION </p>",
        "language": "en",
        "author_name": "Anurag Sharma",
        "slug": "lapislazuli2",
        "cover": "20230629_070621_9576acd1ff5a86a520e0bfba2577cf4b.jpg"
    },
    {
        "podcast_id": 217379,
        "title": "Beyond The Collar; Exploring The World Of Working K9's",
        "description": "<p>We look forward to presenting our first episode very soon. Please bookmark, share and follow our podcast Thank You!</p>",
        "language": "en",
        "author_name": "Brian Anderson ",
        "slug": "beyondthecollar",
        "cover": "20230629_080614_d08b7a539c54d37811d815c14ce7235f.jpg"
    },
    {
        "podcast_id": 217475,
        "title": "Touching Grass",
        "description": "<p>Esotericism, Biology, Spirituality, Conservation, Mysticism, Psychedelics, Botany - A few things to expect.</p><p>Exploring the consciousness within ourselves and nature through all these things; a soulful, holistic cocktail of the predicament we find ourselves in.</p>",
        "language": "en",
        "author_name": "Arman Parsa",
        "slug": "touching-grass",
        "cover": "20230630_020647_4b7a28148f3f4a1d494845047350e566.jpg"
    },
    {
        "podcast_id": 218372,
        "title": "Voices from the Elbow",
        "description": "<p>Born a trickle from high in the Rocky Mountains, the Elbow River flows for 120km through mountains and foothills before entering the Bow River in Mohkinstis (Calgary, Alberta). After joining the Bow River system, the waters eventually flow into the Hudson’s Bay as the Nelson River. Over 500,000 people rely on the Elbow River for their drinking water. There are many other ways people and all creatures big and small rely on Elbow waters. The Elbow River is a part of the source waters for 3 provinces (Alberta, Saskatchewan, and Manitoba). The Lake Winnipeg Basin (a part of the Nelson River) flows across the territories of Treaties 1, 2, 3, 4, 5, 6, and 7.</p><p>This pilot series titled \"Voices from the Elbow\" looks at the 10-year anniversary of the 2013 Calgary, AB and surrounding area flood. ' June 2023 marked the 10th year anniversary of the most recent flood on the Elbow River. Topics we touch on during this pilot podcast: water and climate, water quantity (flood, drought), water management, water quality, restoration, wetlands, nature-based solutions, nature appreciation, and communities that are a part of the Elbow and Bow basins.</p><p>The impact of the flood can still be seen today (for example - constructing engineered berms, constructing Springbank Reservoir, higher insurance rates, and PTSD). We conducted a range of interviews with scientists, The City of Calgary water management and the former ED of the local non-profit watershed planning and advisory council, to learn about actions that have been taken since 2013 to help mitigate flood impacts and make the watershed more resilient (to both flood and drought). This is also an opportunity to explore and share knowledge about the watershed, its ecosystem, its climate and what impact there was from the flood and the river’s natural processes.</p><p>There are three hosts of Voices from the Elbow:</p><p>Jer Bobosky, Jer Bobosky is Nîhithaw (Woodland Cree) from mihkwâkamîwi-sîpîsis (Little Red River Cree Nation). Jer is a Podcast technician with the Elbow River Watershed Project working on the “10-year Flood Anniversary\" episodes as well as the “Tsuut'ina Aquatic Habitat Restoration” podcast. She was connected to ERWP from community involvement at UCalgary as an undergraduate student in Political Science, with a primary focus on Indignizing and decolonizing political philosophy.</p><p>Flora Giesbrecht is the Executive Director for the non-profit organization, Elbow River Watershed Partnership (ERWP).</p><p>Tyler Redmond was an Integrated Water Management student from SAIT at the time of the interview. He worked with the ERWP as part of his capstone project.</p><p>The Elbow River Watershed Partnership (ERWP) is a non-profit watershed stewardship organization based out of Calgary Alberta. Our vision - Working together for a healthy Elbow River watershed.</p><p>ERWP mission - is to improve the watershed and bring together communities who live, work or play in the watershed <em>(provides a forum for learning about watershed management and the land-water connection. Using local knowledge and scientific expertise, the ERWP promotes watershed management improvement through collaborative, targeted and cost-effective actions by all who have an interest in the watershed.)</em></p>",
        "language": "en",
        "author_name": "Elbow River Watershed Partnership",
        "slug": "erwp",
        "cover": "20230715_040735_6afddf4e79af87302f2e808db0891a8f.jpg"
    },
    {
        "podcast_id": 218563,
        "title": "Coastal Catch Ups",
        "description": "<p>A podcast exploring the marine and coastal environments.</p>",
        "language": "en",
        "author_name": "Sam Purdon",
        "slug": "coastalcatchups",
        "cover": "20230718_080732_b29b2ab1726198848a045bb36962a1ab.jpg"
    },
    {
        "podcast_id": 218847,
        "title": "Animals Working in Conservation",
        "description": "<p>Did you know that human researchers are able to partner with highly trained working animals to improve wildlife conservation outcomes? These working animals may be contributing in more ways than you think! The truth is, we have just begun to scratch the surface of the potential of trained working animals to assist humans in their efforts to study, preserve, and restore wildlife and the environment.</p>",
        "language": "en",
        "author_name": "Anna Gustafson",
        "slug": "awic",
        "cover": "20230710_090749_e1ea974f2fec254e96ae36cf2bcf28dd.jpg"
    },
    {
        "podcast_id": 218996,
        "title": "سبب تسمية الظاهرات الطبيعية فى مصر",
        "description": "<p>يحتوى البودكاست على معلومات عن سبب تسمية بعض الظاهرات الطبيعية فى مصر</p>",
        "language": "ar",
        "author_name": "M.A",
        "slug": "monaabdelmonem",
        "cover": "20230711_060706_66089c797abb57884bb85618f6eac402.jpg"
    },
    {
        "podcast_id": 220033,
        "title": "All for Nature",
        "description": "<p>Learn along with us as we explore the natural world with the staff of Shaw Nature Reserve!</p><p>Hosted by Michelle Bonebrake, Outdoor Educator</p><p>Visit our <a href=\"https://www.missouribotanicalgarden.org/plan-your-visit/family-of-attractions/shaw-nature-reserve\">website</a>!</p>",
        "language": "en",
        "author_name": "Shaw Nature Reserve",
        "slug": "allfornature",
        "cover": "20230718_070719_9ce8cdfd5db845b99faf5c9cc9dfe956.jpg"
    },
    {
        "podcast_id": 220361,
        "title": "Trees and the environment",
        "description": "<p>Trees have a huge impact on the environment. They help regulate the air, reduce pollution, provide oxygen, prevent floods and droughts, conserve biodiversity, and improve people's quality of life.</p><p>Air conditioner</p><p>Trees help regulate the air by absorbing carbon dioxide and releasing oxygen. Carbon dioxide is a greenhouse gas that causes the greenhouse effect, which contributes to climate change. Oxygen is an essential gas for the life of humans and other animals.</p><p>Reduce pollution</p><p>Trees also help reduce air pollution by filtering dust and other pollutants. Dust and pollutants can cause health problems like asthma, bronchitis and lung cancer.</p><p>Oxygen supply</p><p>Trees provide oxygen for humans and other animals. Oxygen is a gas necessary for life. One tree can provide oxygen for about 10 people in a day.</p><p>Preventing floods and droughts</p><p>Trees help prevent floods and droughts by holding water in the soil. When it rains, plants absorb water from the soil and use it to grow. This helps to reduce the amount of water that flows into rivers, lakes and seas, thereby preventing flooding. When it's dry, trees release water into the atmosphere, thereby helping to reduce drought.</p><p>Conservation of biodiversity</p><p>Trees are home to many animals, including birds, insects, small animals and mammals. Trees help conserve biodiversity by providing food, shelter and breeding grounds for animals.</p><p>Improve people's quality of life</p><p>Trees help improve people's quality of life by reducing stress, enhancing concentration and improving mood. Trees also help reduce noise and create a green and beautiful living environment.</p><p>In short, trees have a huge impact on the environment. They help regulate the air, reduce pollution, provide oxygen, prevent floods and droughts, conserve biodiversity, and improve people's quality of life. We need to plant and protect trees to protect the environment and improve our quality of life.</p>",
        "language": "en",
        "author_name": "Alkeyrou Issoufou",
        "slug": "alkeyrouissoufou",
        "cover": "20230720_080724_116b5d928b9ce5f386438b6ad218d23c.jpg"
    },
    {
        "podcast_id": 221037,
        "title": "HOPEtalk",
        "description": "<p>Contact us via these social media platforms!</p><p>Facebook: <a href=\"https://www.facebook.com/hopetalk2023\">https://www.facebook.com/hopetalk2023</a></p><p>Instagram: <a href=\"https://www.instagram.com/hopetalk_/\">https://www.instagram.com/hopetalk_/</a></p><p>Youtube: <a href=\"https://www.youtube.com/@HOPEtalk2023\">https://www.youtube.com/@HOPEtalk2023</a></p><p>Email: hopetalk2023@gmail.com</p>",
        "language": "en",
        "author_name": "HOPEtalk",
        "slug": "this-is-hopetalk",
        "cover": "20230725_060726_76346ed1595b37b95247795e712d722e.jpg"
    },
    {
        "podcast_id": 221162,
        "title": "Cryptids Unlimited Episode 1",
        "description": "<p>Welcome. Meet your hosts and find out why we're here.</p>",
        "language": "en",
        "author_name": "Lisa Leach",
        "slug": "cryptidsunlimitedpodcast",
        "cover": "20230806_100823_68669b4995b1fb594d2a1425910b1e37.jpg"
    },
    {
        "podcast_id": 221331,
        "title": "Conversation Currents with SIMS",
        "description": "<p>Welcome to the 'Conversation Currents with SIMS' podcast.</p><p>Every episode will feature a guest speaker in the marine science space and will focus on science to revive our oceans. This will include researchers, academics, philanthropists, technical staff and many more!</p>",
        "language": "en",
        "author_name": "Sydney Institute of Marine Science",
        "slug": "conversation-currents-with-sims",
        "cover": "20230727_020718_c08f3ebc92cc68941050c0df847e66c4.jpg"
    },
    {
        "podcast_id": 221499,
        "title": "dean",
        "description": "<p>title</p>",
        "language": "en",
        "author_name": "covers",
        "slug": "minchi",
        "cover": "20230728_030748_af064cd3b9d9136f3b0176654bb556fd.jpg"
    },
    {
        "podcast_id": 222133,
        "title": "On-Farm Trials Podcast with the PNW Farmers' Network",
        "description": "<p>Here on the On-Farm Trials Podcast, host Carol McFarland dives into the different trials that come with farming systems innovation in the inland Pacific Northwest, speaking with professionals all across the region about how they get things done.</p>",
        "language": "en",
        "author_name": "PNW Farmers' Network",
        "slug": "pnwfarmersnetwork",
        "cover": "20230801_080853_f8bd34ba2d3643fc3372865b639f6744.jpg"
    },
    {
        "podcast_id": 222458,
        "title": "MI MUNDO VERDE ",
        "description": "<p>Podcast basado en la ecología y su conocimiento.</p>",
        "language": "es",
        "author_name": "Alondra",
        "slug": "mi-mundo-verde",
        "cover": "20230803_040852_5fe64a9ca5ff82e358930580df6cd385.jpg"
    },
    {
        "podcast_id": 222723,
        "title": "Growth Beyond the Church",
        "description": "<p>Its time to explore outside of the four walls of organized religion as well as traditional thinking. The Universe Consciousness is expanding which is motioning for the chosen to get in alignment with its frequency.</p>",
        "language": "en",
        "author_name": "Come Out of Her My People & Expand in Consciousness",
        "slug": "growthbeyondchurch",
        "cover": "20230805_100844_3d66e883de152cdd3736579f793b960e.jpg"
    },
    {
        "podcast_id": 223178,
        "title": "The Future of Agriculture",
        "description": "<p>Welcome to our engaging podcast, hosted by the passionate members of the Sierra Club Food and Agriculture Outreach team. Join us as we delve into enlightening conversations with esteemed industry professionals and experts, centered around the future of agriculture in the United States. Tune in and embark on a journey of discovery as we navigate the exciting realms of food, farming, and sustainability. Hope you enjoy!</p>",
        "language": "en",
        "author_name": "Sierra Club Food and Agriculture Subteam",
        "slug": "sierraclubfoodandagteam",
        "cover": "20230808_080842_c3f008a32b24150b80e4917301efbec3.jpg"
    },
    {
        "podcast_id": 223895,
        "title": "kooleposhti | کوله پشتی",
        "description": "<p>About the different cultures and customs of people around the world</p>",
        "language": "fa",
        "author_name": "kooleposhti",
        "slug": "kooleposhti",
        "cover": "20230813_070855_aa58c50e6e00f5e31af0c86d7dcf2b99.jpg"
    },
    {
        "podcast_id": 224104,
        "title": "NEED PEACE, and little ol LADIES that smell GOOD",
        "description": "<p>Don't walk behind an elderly person</p>",
        "language": "en",
        "author_name": "Richard Hartz",
        "slug": "baitnswitch",
        "cover": "20230815_120810_9552760e8b3b9817c682678185228963.jpg"
    },
    {
        "podcast_id": 225444,
        "title": "گفتار: پادکستی برای المپیاد زیست شناسی",
        "description": "<p>گفتار مجموعه پادکستی هست که توسط گروه آموزشی سیمرغ تدوین میشه.</p><p>در این مجموعه به صورت تخصصی المپیاد زیست شناسی رو مورد بررسی قرار میدیم.</p><p>@simurgh_biology</p>",
        "language": "fa",
        "author_name": "گروه آموزشی سیمرغ",
        "slug": "simurgh-goftar",
        "cover": "20230823_100836_fc98c377f6d84270a418d63ac848723a.jpg"
    },
    {
        "podcast_id": 225684,
        "title": "Prep-Life Pro Pod",
        "description": "<p>Your favorites from Prep-Life Pro!</p>",
        "language": "en",
        "author_name": "Prep-Life Pro",
        "slug": "preplifepro",
        "cover": "20230824_040849_be9818346183608c7e12f1742b1031f8.jpg"
    },
    {
        "podcast_id": 225714,
        "title": "Your Best Travel Guide for Ireland by Locals [2023 Update]",
        "description": "<p>Planning a <a href=\"https://travel2ireland.ie/\">travel to Ireland</a>? Discover the best places to visit, stay and eat in Ireland with our ultimate travel guide. Start your Irish adventure today! </p>",
        "language": "en",
        "author_name": "Travel2Ireland",
        "slug": "travel2ireland",
        "cover": "20230824_070835_e8f2a20633cf822795b1fd7459480406.jpg"
    },
    {
        "podcast_id": 226142,
        "title": "CONCIENCIA AMBIENTAL",
        "description": "<p>con base a una cartilla educativa de educación ambiental de Ecoembes España, cree este podcast con el fin de generar conciencia sobre la importancia de cambiar nuestros hábitos de consumo y reciclaje, como actividad de lo análogo a lo digital de la asignatura de Comunicación digital sonora de la Fundación universitaria Católica del Norte. Bienvenidos.</p>",
        "language": "es",
        "author_name": "Alejandro Colorado Villada",
        "slug": "educacionambiental",
        "cover": "20230828_120844_f5a60dea28286e0c8304c0f5c4f61ff0.jpg"
    },
    {
        "podcast_id": 226306,
        "title": "RegenCircle",
        "description": "<p>In recent years the concept of regeneration has re-emerged as a focal point in our collective consciousness and modern narrative. There is a great opportunity and inherent danger in the increasing popularity of regeneration:</p><p>Will we, as a species, embrace a co-creative relationship with the natural world? Or merely adopt the language of regeneration to sustain extractive practices with optimistic rhetoric?</p><p>RegenCircle is dedicated to exploring questions like these and uncovering the roots of regeneration, beginning with our food system.</p>",
        "language": "en",
        "author_name": "Page Faye",
        "slug": "regencircle",
        "cover": "20230906_040941_d26266279039c1cc8bac5725cd47edcc.jpg"
    },
    {
        "podcast_id": 226434,
        "title": "Adapa Rafaela",
        "description": "<p>Acción de Defensa Animal y Protección Ambiental</p>",
        "language": "es",
        "author_name": "Ana Paula Rosillo",
        "slug": "adaparafaela",
        "cover": "20230829_070800_feff8baaf40492fa0abfd7a4e983700c.jpg"
    },
    {
        "podcast_id": 226571,
        "title": "Save it for the Blind Podcast",
        "description": "<p><strong>Welcome to the Save it for the Blind Podcast. Dive into the world of duck hunting, conservation, and legislation. Join us for insightful discussions on preserving both tradition and nature. Our podcast isn't complete without tackling the legislative side of things. Discover how local and national policies impact hunting seasons, bag limits, and wetland preservation. Interviews with experts and policymakers will shed light on the intricate balance between hunting traditions and the need for sustainable practices.</strong></p>",
        "language": "en",
        "author_name": "California Waterfowl",
        "slug": "saveitfortheblindpodcast",
        "cover": "20230830_100822_2f5ea3836681c37987e6331613cdd21e.jpg"
    },
    {
        "podcast_id": 226879,
        "title": "My Stuff ",
        "description": "<p>jajajajaja</p>",
        "language": "en",
        "author_name": "Ava Rose",
        "slug": "avastuff",
        "cover": "20230901_100918_075a55bec50b5650541f5d754d3bb2ac.jpg"
    },
    {
        "podcast_id": 227311,
        "title": "Creatures and Characters",
        "description": "<p>Farming and education has always been in my blood. Most people don't think about the food they eat. Creatures and Characters includes stories from my life combining the two, as well as information about critical issues that many people misunderstand. </p>",
        "language": "en",
        "author_name": "Pat Garland Stewart",
        "slug": "creatures-and-characters",
        "cover": "20230905_010920_30f4c93aec0a3859697953efcbd0de10.jpg"
    },
    {
        "podcast_id": 227809,
        "title": "The Happily Living Podcast",
        "description": "<p>We discuss how to better ourselves by developing routines that set us up for a better existence uncovering deeper connections with nature, eventually growing awareness, and leaving you with a new relationship with the world.</p>",
        "language": "en",
        "author_name": "Gabrielle Brown",
        "slug": "thehappilylivingpodcast",
        "cover": "20230908_040953_c6b6a474c3d3cdada3feaf05ee0a0eb5.jpg"
    },
    {
        "podcast_id": 228031,
        "title": "The Saola Foundation Podcast",
        "description": "<p>Exciting adventures, conservation success stories, and insights from the incredible individuals who form the backbone of the Saola Foundation Field Team. Together, we can make a difference for our planet's most precious ecosystems!</p><p>For more information about the Saola Foundation please visit our website: <a href=\"https://www.saolafoundation.org/\">https://www.saolafoundation.org/</a></p><p>To subscribe to our newsletter for the latest information: <a href=\"https://www.saolafoundation.org/newsl\">https://www.saolafoundation.org/newsl</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbmlCNFRpemdVTDBaeXdkNkwwdVdaWVhNd3FNQXxBQ3Jtc0tucWliZEVWUHY4MFI5bGI2ZjlPdVpiSl9ldUFYcC1Sdm1sQ2Utd1pudjRRTVYwUXdyeS1sSVlyWVBqc0lLN2ZWT1l0NUg0T0ZnM2RFZlA5dFJIWXdiZk1GbmV2aktHbU54TEl0TjVwakNoaThWeGFLbw&amp;q=https%3A%2F%2Fwww.saolafoundation.org%2Fnewsletter%2F&amp;v=OrYmIZVhthk\">...</a></p><p>To donate: <a href=\"https://www.saolafoundation.org/donate/\">https://www.saolafoundation.org/donate/</a></p>",
        "language": "en",
        "author_name": "Saola Foundation",
        "slug": "saolafoundation",
        "cover": "20230910_100902_76c46f029c7c6ea15c1257e5faab5dc8.jpg"
    },
    {
        "podcast_id": 228413,
        "title": "Awi'nagwis Talking",
        "description": "<p>Awi'nagwis Talking is an Indigenous hosted podcast looking at social, political and Human issues that affect our environment. Follow your host Lakos as he explores different topics.</p>",
        "language": "en",
        "author_name": "Lakos - Jessie Everson",
        "slug": "awinagwistalking",
        "cover": "20230912_090910_235b3695199c2c4b16c0c9ae6dabbec8.jpg"
    },
    {
        "podcast_id": 228434,
        "title": "Fingerprints of the Past",
        "description": "<p>The fingerprints of scientists from the past are all over the science that we study today. It matters to know who they were, what they did, and where we come from. We need to learn our whole story as scientists.</p>",
        "language": "en",
        "author_name": "Beth Wittmann",
        "slug": "fingerprintsofthepast",
        "cover": "20230913_020906_480478911648ae1adef2cfd0c17eb88f.jpg"
    },
    {
        "podcast_id": 228539,
        "title": "WILD ONTARIO with James Alofs",
        "description": "<p>Conservation of health, wildlife, and wilderness in ONTARIO. With your host James Alofs.</p>",
        "language": "en",
        "author_name": "James Alofs",
        "slug": "wildontariopodcast",
        "cover": "20230913_060936_0c880e4877e7d95397a113ae67569dcb.jpg"
    },
    {
        "podcast_id": 228643,
        "title": "Energies unravelled ",
        "description": "<p>This podcast opens a new perspective of looking upto spirituality and paranormal activities </p>",
        "language": "en",
        "author_name": "Gungun Rai",
        "slug": "energiesunravelled",
        "cover": "20230914_020917_3767c830cc8e92d7d87841f54916f83a.jpg"
    },
    {
        "podcast_id": 229203,
        "title": "Traverse Pod",
        "description": "<p>Welcome to Traverse Pod! I'm Kaylie Armitage and I love exploring nature and the human experience stories that go along with it. Follow along to hear about cool adventures from people with some interesting stories. Traverse with me (<a href=\"https://www.instagram.com/kayliearmitage/?hl=en\">instagram</a>)!</p>",
        "language": "en",
        "author_name": "Kaylie Armitage ",
        "slug": "traversepod",
        "cover": "20230918_040939_09235ae1de62c69a82c5a3019a2f8b2f.jpg"
    },
    {
        "podcast_id": 229256,
        "title": "El planeta que nos queda",
        "description": "<p>Miguel Ángel Angeles y Aurelien Guilabert platican con expertos en medio ambiente sobre el cambio climático y las emergencias ambientales que estamos por enfrentar.</p>",
        "language": "es",
        "author_name": "Miguel Angel Angeles y Aurélien Guilabert",
        "slug": "el-planeta-que-nos-queda",
        "cover": "20230918_100950_ef0a9178c16d765a8937f615012826e9.jpg"
    }
]