[
    {
        "podcast_id": 14659,
        "title": "For the love of weather",
        "description": "Meet Gemma and Aisling. They have worked in the UK as meteorologists for over ten years. Gemma came up with the idea that maybe others might like to listen to the non stop conversations they still have all these years later about the weather.\n\nOver the years they have forecast for festivals, farming, road, rail, energy, media, aviation and even the humble ice cream demand forecast and so much more. They have gone through job changes, life changes and delved in and out of many hobbies and somehow the weather still weaves in and out of their lives. \n\nSo this podcast is for anyone who would like to join our weather conversations and wherever the jet stream may take us!\n                                   \nWe hope you join us for our bi weekly chat and leave each episode loving the weather just that little bit more.",
        "language": "en",
        "author_name": "Gemma Plumb & Aisling Creevey",
        "slug": "for-the-love-of-weather",
        "cover": "20201117_204905_44c7c33c7ced457da5272cf078496f9d.jpg"
    },
    {
        "podcast_id": 15898,
        "title": "The Laughing Matters Podcast",
        "description": "At the start of 2010's spring semester, APSU student, W.S. Walker walked out of his dorm room in the middle of a blizzard with only two blank books, and lived the next 44 days without any money or ID, going where the wind blew. Because of a single discovery, he stopped everything to walk out into the world, throwing wide open all of his defenses, and making himself completely vulnerable to anyone he met. And what was the discovery which caused this? The massive hidden secret behind what laughter is and why we find something funny. \n<p><p>\nHave you ever tried to explain why somethings are funny and somethings aren't? Tune in to W. S. Walker's The Laughing Matters, the ground-breaking book, read chapter by chapter by the author (and then all manner of advice, musings, and wisdoms after Season 1), and hang on as he sends you reeling through some of the most incredible discoveries on human behavior, why we don't feel right so much of the time, and the core blueprint for the universal design of happiness; things hidden in plain sight your entire life and answers that you never would have expected. The moment you hear them, you will understand that you've always known them.<p>The true motivations behind why we laugh will shock you to your core.<p>\n<p><p><i><b>A fair bit of warning: once you hear some of the hidden truths, you cannot unhear them. They are night and day obvious once you know which angle to see them from. </b></i><p><p>\n\nThis is an advanced edition. The book has not been publicly released yet. If you want a much better understanding of who you are, why you don't feel important, where so much of your internal conflict (at a base-level) comes from, come on in and have a listen. <p><p>\n\nI've got some good news, and some bad news for you.\n<p><p>\nyoutube.com/couldhelp<p>\nwww.thelaughingmatters.com<p>\nfacebook.com/icouldhelp<p>\nwillhelpmail@gmail.com\n\n",
        "language": "en",
        "author_name": "W. S. Walker",
        "slug": "thelaughingmatters",
        "cover": "20210204_091006_b32da2afd14ad1dd56e0e75537e1cf7f.jpg"
    },
    {
        "podcast_id": 43945,
        "title": "The Comic Cosmonaut",
        "description": "Hi ya! My name is Bek, and this podcast is aimed toward anything and everything space related! So come hang out and chill with me :) Let's listen to music and talk about space!",
        "language": "en",
        "author_name": "Rebekah Denton",
        "slug": "thedowntimedentons",
        "cover": "20220618_070621_7eadcdbb78e1e3814aedbdf4fc029f82.jpg"
    },
    {
        "podcast_id": 44805,
        "title": "Physique & Chimie en pandémie",
        "description": "Nous, Félix - Physique - (maîtrise en physique) et Mathieu - Chimie - (bientôt Docteur en sciences pharmaceutiques) essayons, du mieux qu'on peut, de vous présenter/expliquer de façon simple des phénomènes naturels qui nous passionnent et qui vous intriguent. Sans math, sans calcul, sans équation. Bref, sans tout ce qui vous fait normalement suer. On commence, ça ne va y aller qu'en s'améliorant! Bonne écoute!",
        "language": "en",
        "author_name": "Felix Blais",
        "slug": "physique-et-chimie",
        "cover": "20210328_192119_ccf09062ad4b9c53526cc9e7ac17d373.jpg"
    },
    {
        "podcast_id": 46899,
        "title": "The Friendship Chronicles",
        "description": "Hey everyone ! \nWelcome to our podcast series ! \nWe are just a bunch of lads getting together and looking to chat a little more in detail about different things and have a laugh along the way. The intention of these podcasts is to encourage the importance of sitting down with mates and just talking about particular peoples opinions, the occurrences of the world, prospects for the future and the effects of the immediate. \n",
        "language": "en",
        "author_name": "Bounce Brothers",
        "slug": "bouncebrothers",
        "cover": "20210405_100309_e633cc2393f76442fd948c8f28cabe0c.jpg"
    },
    {
        "podcast_id": 47773,
        "title": "The World Around Us",
        "description": "Hello ! \nThis podcast is intended to expand our knowledge of the world around us and expose us to the wonderful people who compose it ! \nIt is extraordinarily easy to meet people in a somewhat tangential fashion, never really uncovering the intricacies of their personalities and what they are interested in. My name is Jake and I am a Bachelor of advanced science student at the University of Sydney. Consequently, I will be aiming to chat primarily to people from the University, such as professors and students, aiming to establish true relationships with them and learn even a small part of the knowledge these amazing people have uncovered in their time. \nSit back relax as we get to know various people from various walks of life and continue to learn more about the world around us. ",
        "language": "en",
        "author_name": "Jake Chidiac",
        "slug": "theworldaroundus",
        "cover": "20210408_104419_2e96e2be48f2660fcf716ef913c54ab8.jpg"
    },
    {
        "podcast_id": 60596,
        "title": "Friendly Physics",
        "description": "Physics should be simple. It is all around us, relevant in math, biology, sports and space.\n\nLet's break it down and listen to ~10 minute episodes on topics ranging from speed to parallel universes. \n\nFriendly Physics is produced by a high school physics teacher and steps listeners through kinematics, simple machines, electromagnetism and more. ",
        "language": "en",
        "author_name": "Gabriela Gallego",
        "slug": "friendlyphysics",
        "cover": "20210604_151622_9d86a3b623cd8007a21feaf25c09b5d4.jpg"
    },
    {
        "podcast_id": 65337,
        "title": "ShuttlePod Cast // Space and Astronomy",
        "description": "Follow along with Nic and Echo as they share their love for astronomy and all things space-y! On this podcast, you will find space facts, astronomy news, and general banter about space-esque topics.",
        "language": "en",
        "author_name": "Nic and Echo",
        "slug": "shuttlepodcast",
        "cover": "20210628_020050_2ea589e9ac36ab33d6647790be36a52f.jpg"
    },
    {
        "podcast_id": 77786,
        "title": "The Qubit Guy's Podcast",
        "description": "The Qubit Guy (Yuval Boger) hosts thought leaders in quantum computing to discuss business and technical questions that impact the quantum computing ecosystem.",
        "language": "en",
        "author_name": "Yuval Boger",
        "slug": "qubit",
        "cover": "20210906_214813_d13b15e3fec57fbcc6e1546e711d14a5.jpg"
    },
    {
        "podcast_id": 81068,
        "title": "StarSeed “An Intrepid Adventure with Mark Glen Moore”",
        "description": "<p>Mark Glen Moore’s StarSeed “An Intrepid Adventure” begins at a very early age discussing visits with his brother from the Great Beyond. Mark Glen Moore is an entrepreneur, sustainability pioneer, artist and musician. https://markglenmoore.com.</p>",
        "language": "en",
        "author_name": "Mark Glen Moore",
        "slug": "anintrepidadventure",
        "cover": "20230824_080816_4811d2c9245de1380963525e7c7e7d33.jpg"
    },
    {
        "podcast_id": 85560,
        "title": "The Final Frontier",
        "description": "Today we will be taking a journey through time and space, from near earth orbit to the farthest reaches of the Milky Way. We will explore strange worlds and the vastness of the void, and seek to understand the greatest mysteries of the cosmos. This… is the Final Frontier.\n",
        "language": "en",
        "author_name": "Matt Walz",
        "slug": "thefinalfrontier",
        "cover": "20211016_224117_ab036871d7fd19865fcdcd3c355c4837.jpg"
    },
    {
        "podcast_id": 111193,
        "title": "Science Society",
        "description": "<p>We invite you to dive into the world of science and discovery, where knowledge knows no bounds. This podcast series aims to bring together a diverse array of scientists, researchers, and thought leaders who are at the forefront of their respective fields. From astrophysics to zoology, climate science to genetics, each episode explores groundbreaking research and innovative insights, providing listeners with a firsthand look at the progress shaping our world.</p><p>Our conversations stretch beyond the confines of laboratories and research papers. They venture into the significance and societal impact of these discoveries, the intriguing challenges scientists face, and the stories behind their aha! moments. Each week, a distinguished guest brings their latest findings to the table, making complex concepts accessible and engaging for both science enthusiasts and the scientifically curious.</p><p>Whether you are a science professional seeking to keep abreast of the latest breakthroughs or a curious mind wanting to better understand the world around you, \"Breakthrough Dialogues\" serves as your window into the fascinating world of scientific discovery. Tune in to stay informed, get inspired, and join the journey toward the future of science.</p>",
        "language": "en",
        "author_name": "Catarina Cunha",
        "slug": "sciencesociety",
        "cover": "20230704_040744_3982aa1d83750960f6e212bee0dfa33e.jpg"
    },
    {
        "podcast_id": 111356,
        "title": "Tien päällä ",
        "description": "Tuleva ope/farmaseutti kokeilee siipiään oman podcastin parissa. Luvassa on vierailevia tähtiä, pitkiä aasinsiltoja sekä välillä jopa ihan hauskoja juttuja. Punainen lanka saattaa välillä olla hukassa, mutta rennoin ottein kohti Tien päällä -podcastin ensimmäistä kautta. Tervetuloa mukaan!\n\nInstagram @tiepodi",
        "language": "fi",
        "author_name": "Mirja ",
        "slug": "tienpaalla",
        "cover": "20220320_060329_92204f53e06098ba4b464a97456125b9.jpg"
    },
    {
        "podcast_id": 116246,
        "title": "Physics By The River",
        "description": "<p>I'm Junaid, a Maths/Physics undergraduate student at Durham University aiming for a career in Physics. I meet with academics to discuss their research, their path in academia, science in general, and anything else that comes up in conversation! Check out my blog at: Junaid-Afzal.com and my YouTube channel: https://www.youtube.com/channel/UCB452vA6j_SSSCrcCBD1PMQ</p>",
        "language": "en",
        "author_name": "Junaid Afzal",
        "slug": "pbtr",
        "cover": "20221116_021131_7ed9cad4611c7aa296466024b78f51a5.jpg"
    },
    {
        "podcast_id": 120336,
        "title": "BE AHEAD | TRAIN.RED",
        "description": "BE AHEAD a podcast by TRAIN.RED hosted by Kim ter Stege and co-host Jeroen Molinger. We believe that every athlete should be able to fully benefit from their own muscles' potential.",
        "language": "en",
        "author_name": "TRAIN.RED",
        "slug": "trainred",
        "cover": "20220406_100417_8cc48c721f837d90d48b9061e0541313.jpg"
    },
    {
        "podcast_id": 122688,
        "title": "Cosmos Crusaders",
        "description": "Podcast created to highlight the stories and achievements of people of color, minorities, and underrepresented individuals in the fields of astronomy and physics. Created by Gokul Srinivasaragavan and Simi Bhullar.",
        "language": "en",
        "author_name": "Gokul Srinivasaragavan and Simi Bhullar",
        "slug": "cosmoscrusaders",
        "cover": "20220417_040408_fbd7929051076a166d25d2b307e87c50.jpg"
    },
    {
        "podcast_id": 123719,
        "title": "Building The #Railroad2Mars",
        "description": "This podcast contains pitches, explanations and document read-throughs from H. Industries published content on building the railroad to Mars. Check out the website, Medium, TikTok or Twitter for more! \nhttps://h-industries.io",
        "language": "en",
        "author_name": "Morgan Wegener",
        "slug": "h-industries",
        "cover": "20230120_070132_9eafb13bee726f6156cf3bbc632d476c.jpg"
    },
    {
        "podcast_id": 124734,
        "title": "Podcast-A: A Paranormal Show ",
        "description": "A show where we discuss a variety of topics related to the natural world, physics, metaphysics, mythology, and philosophy! We're an Ottawa based scientific paranormal investigation and research team. We use every resource possible to attempt to debunk and disprove paranormal claims, using scientific methodology and skepticism - in hopes we can't!",
        "language": "en",
        "author_name": "C.L.A.S.S.-A Paranormal Team",
        "slug": "classaparanormal613",
        "cover": "20220502_080512_833d8fd0feca7ed31eca866debf8a90b.jpg"
    },
    {
        "podcast_id": 128573,
        "title": "TECHNION FIZZICAST ",
        "description": "ברוכים המאזינים לפודקאסט (תסכית) של הפקולטה לפיזיקה בטכניון!\n בכל פרק ישתפו החוקרים בפקולטה מהו תחום המחקר שלהם, מה שאלות המחקר הבוערות ואיך מתבצע המחקר, בשיחה בגובה העיניים עם חוקר עמית או סטודנט בפקולטה. \n\nמוזמנים לבקר אותנו באתר הפקולטה לפיזיקה בטכניון\nPhys.technion.ac.il/",
        "language": "he",
        "author_name": "Technion Physics Department ",
        "slug": "technion-fizzicast",
        "cover": "20220616_110613_cfc3e47eaa93d1c71aa8a8374e48fa55.jpg"
    },
    {
        "podcast_id": 128769,
        "title": "Sneller & Beter",
        "description": "<p>Welkom bij \"Sneller &amp; Beter\", een podcast die je helpt om als bedrijf efficiënter te worden, minder kosten te maken en de groei te stimuleren. Elke aflevering verkennen we een ander aspect van procesoptimalisatie op het gebied van operations management, supply chain management, change management, en zoveel meer… Kom met experts te weten wat procesoptimalisatie voor jouw organisatie kan betekenen.</p>",
        "language": "nl",
        "author_name": "9altitudes BE",
        "slug": "de-innovatie-podcast",
        "cover": "20230228_110215_3a7acd7f0f4d3dc03328a309ab67de5a.jpg"
    },
    {
        "podcast_id": 133100,
        "title": "Accès Innovation",
        "description": "Accès Innovation est une série d'entrevues qui ont pour but de présenter les beaux projets et découvertes dans l'ingénierie au Québec.\n\nSi vous participez à un projet qui vaudrait la peine d'être présenté, écrivez-moi: emile.demers97@gmail.com\n\nLe podcast est créé et édité par Émile Demers.",
        "language": "fr",
        "author_name": "Émile Demers",
        "slug": "accesinnovation",
        "cover": "20220609_010610_d38c191f16a15b6e34dad6ed5fd2af42.jpg"
    },
    {
        "podcast_id": 135118,
        "title": "The Pragmatics",
        "description": "Discussing today's most important topics pragmatically with some humour, while sticking to the data.  Guests appearing on The Pragmatics are subject matter experts that help us understand the information rather than hearing it from the mainstream media, who have been quite dishonest.  Much of the time, dishonest by omission.  Come on in and join us.",
        "language": "en",
        "author_name": "The Pragmatics",
        "slug": "thepragmatics",
        "cover": "20220901_030914_5ca3d7930ad932d00f93c4834976f677.jpg"
    },
    {
        "podcast_id": 151499,
        "title": "Επιστημονικό Μανιφέστο",
        "description": "Επιστημονικές συζητήσεις χωρίς όρια και προκαταλήψεις.",
        "language": "el",
        "author_name": "Whiskey Joe the 1st",
        "slug": "epistimonikomanifesto",
        "cover": "20220906_110909_f7b0b01d6f808a41857a74478c79017c.jpg"
    },
    {
        "podcast_id": 152452,
        "title": "Talking With The Source",
        "description": "<p>Looking for a podcast that delves deep into the world of paranormal research? Look no further than <strong>Talking With The Source</strong> - the popular video/audio podcast that brings <strong>together four international paranormal researchers </strong>from the <strong>UK</strong>, <strong>Canada</strong>, and <strong>USA</strong> to <strong>explore</strong> the <strong>supernatural</strong> and <strong>unexplained</strong>.</p><p>With <strong>well-known guests </strong>ranging from psychic mediums like <strong>Patti Negri</strong> and <strong>Heather Mattison</strong>, to renowned <strong>parapsychologist Dr Ciaran O’Keeffe</strong> of the popular <strong>TV show Most Haunted</strong>, there's never a dull moment on Talking With The Source.</p><p>But the excitement doesn't stop there - this podcast also features <strong>local paranormal</strong> researchers from <strong>all over the globe </strong>sharing their <strong>experiences</strong>, <strong>techniques</strong>, and <strong>paranormal evidence clips</strong>. And with new episodes <strong>streaming every week</strong> (sometimes multiple times a week), <strong>you'll always have something new to look forward to.</strong></p><p>Whether you're a <strong>believer</strong> or a <strong>skeptic</strong>, there's something for everyone on <strong>Talking With The Source.</strong> So tune in to our <strong>live stream</strong> <strong>or listen</strong> to <strong>new episodes on your favorite podcast listening platform</strong>, and discover the mysteries of the paranormal like never before. Visit our official website at <a href=\"https://linktr.ee/talkingwiththesource\">https://linktr.ee/talkingwiththesource</a> to learn more about our fascinating world of <strong>paranormal research!</strong></p>",
        "language": "en",
        "author_name": "AJ Capasso & Robin Haffern & Stevo Hopkins",
        "slug": "talkingwiththesource",
        "cover": "20221218_071221_961de776d2995bf866f57a597181df66.jpg"
    },
    {
        "podcast_id": 165129,
        "title": "PeppTalks",
        "description": "Hi! We are First Tech Challenge Team Peppers 19044 from Romania and this is our new podcast. We interview teams and STEM personalities from all over the world in order to create an all in one learning platform for other robotics nerds just like us! ♥️🌶️",
        "language": "en",
        "author_name": "Peppers ",
        "slug": "pepptalks",
        "cover": "20221103_011133_84363e8c139e86ef14a9cd684622cfcf.jpg"
    },
    {
        "podcast_id": 171512,
        "title": "Param Himalaya Podcasts",
        "description": "<p><a href=\"https://www.paramhimalaya.com/\">Param himalaya</a> Podcasts</p>",
        "language": "en",
        "author_name": "PRANAV KUMAR TYAGI",
        "slug": "paramhimalaya",
        "cover": "20230907_030952_bfe9d2073485023ed9693d66942634a3.jpg"
    },
    {
        "podcast_id": 175005,
        "title": "The Hyperthetical Podcast",
        "description": "Hyperthetical is the podcast where we answer questions that you never wanted the answers to. We propose a thesis and try to analyse it based off of science and factual sources. This show is by no means meant to be taken seriously, its just for entertainment. If you enjoy, please follow!",
        "language": "en",
        "author_name": "Hyperthetical Podcast",
        "slug": "hyperthetical",
        "cover": "20221219_091228_c527da7836fd1195a12bf0b33bbeb955.jpg"
    },
    {
        "podcast_id": 179801,
        "title": "The Rad Lab",
        "description": "This podcast mainly focuses on radiochemistry and nuclear science. We will be diving into its rich history and where it is headed with experts in the field. We will also use this platform to explore other aspects of science through special guests. We will discuss their research in detail and learn about who the person is beyond the lab.",
        "language": "en",
        "author_name": "Dr. David Dan",
        "slug": "theradlab",
        "cover": "20230111_020148_86479041acf0f611aefefc5a76842094.jpg"
    },
    {
        "podcast_id": 196807,
        "title": "fAQ by SandboxAQ",
        "description": "<p>Welcome to Sandbox AQ’s podcast, fAQ, hosted by Adam Green and Tai-Danae Bradley. This new series features casual conversations on topics in AI and quantum technologies targeted at general audiences. All curious humans are invited to join!</p><p>New episodes every other Tuesday.</p><p>Want to get in touch? Write us at <a href=\"mailto:faq-podcast@sandboxaq.com\">faq-podcast@sandboxaq.com</a></p><p>Interested in a video version of this podcast? Check out <a href=\"https://www.youtube.com/@sandboxaq\">https://www.youtube.com/@sandboxaq</a></p>",
        "language": "en",
        "author_name": "Adam Green & Tai-Danae Bradley",
        "slug": "faq",
        "cover": "20230314_100324_445d53c10dda0225aa4bd04d2d10ceea.jpg"
    },
    {
        "podcast_id": 207147,
        "title": "Ciencias Ciencillas",
        "description": "<p>Podcast dedicado a la divulgación científica. Segmentos cortos con la finalidad de informar e incentivar la curiosidad científica.</p>",
        "language": "es",
        "author_name": "Juan Carlos Diaz y Sergio Mancillas",
        "slug": "cienciasciencillas",
        "cover": "20230503_080522_2c0bd3df93696d0e4ebdac5656ee19a1.jpg"
    },
    {
        "podcast_id": 212726,
        "title": "Please Look Up",
        "description": "<p>Tune in each month for a guided tour of the night sky as seen from Perth, Western Australia.</p><p>Each episode highlights all of the fascinating constellations, planets, and asteroids that you should be keeping an eye out for in the night sky. And don't worry, we'll also be highlighting the latest in space news so you'll always be in the know when it comes to the extra-terrestrial.</p><p>Please Look Up is brought to you by <a href=\"https://particle.scitech.org.au/\">Particle</a> and powered by <a href=\"http://scitech.org.au/\">Scitech</a>.</p>",
        "language": "en",
        "author_name": "Particle WA",
        "slug": "please-look-up",
        "cover": "podcast_cover.png"
    },
    {
        "podcast_id": 220573,
        "title": "Podcast sobre el tiempo",
        "description": "<p>Hablamos y debatimos sobre el tiempo en un podcast interactivo para una prueba semestral de nuestra institucion educacional</p>",
        "language": "es",
        "author_name": "Kevin Amaral y Agustin Correa",
        "slug": "podcast-tiempo",
        "cover": "20230721_040732_548679692322c9d5cf6ac561a1a3a297.jpg"
    },
    {
        "podcast_id": 222782,
        "title": "lullabyes",
        "description": "<p>i write songs about silly people that disappoint me sometimes!</p>",
        "language": "en",
        "author_name": "Jem!m☆",
        "slug": "jemimslullabyes",
        "cover": "20230807_020806_285f3d24b5340dedcdb999a30620ca76.jpg"
    },
    {
        "podcast_id": 224291,
        "title": "Podcast cámaras de combustión en motores a reacción",
        "description": "<p>El mejor podcast del mundo mundial</p>",
        "language": "es",
        "author_name": "Astrid Isabela Ceballos Aguilar",
        "slug": "aicapodcastddm",
        "cover": "20230816_050814_2cad60a4744cc2ce350f9cfd6c344d61.jpg"
    },
    {
        "podcast_id": 224953,
        "title": "Ahora Oppenheimer",
        "description": "<p>El Pódcast sobre Oppenheimer.</p><p>Este pódcast contiene 4 capítulos en los que se tratarán cuestiones técnicas de la física y curiosidades sobre la antesala al Proyecto Manhattan. Está inspirado en la película de Christopher Nolan: OPPENHEIMER, que me hizo empezar a investigar sobre el tema hasta llegar hasta aquí.</p><p>En el primer capítulo empezaremos sobre la base, Desmontando el núcleo del átomo. En él veremos importantes nombres del mundo de la física teórica como Niels Bohr o Lise Meitner. Después de este capítulo introductorio iremos directos a una de las secuencias que pudimos ver en la película.</p><p>La pila de Chicago, mejor conocida como La Pila de Fermi. La construcción del primer reactor nuclear en el que se aceleraron partículas creando una reacción en cadena. Proseguiremos con Luz verde en La colina.</p><p>La colina era como conocían los habitantes cercanos a la zona de Los Álamos. Comprenderemos aquí la situación política de la época y la gran inversión económica en la que un proyecto militar necesitaría de los avances de la física para llevarse a cabo.</p><p>Y Ahora Oppenheimer, un capítulo en el que conoceremos más sobre la historia de este peculiar personaje. Su cara A y su cara B. Con él concluimos este pódcast. Sin más, te invito a que me dejes tu feedback.</p><p>Han sido semanas de investigación y profundización en el tema para poder realizar este proyecto, libros, artículos, podcast, documentales y películas para conseguir toda la información necesaria y recopilarla en estos 4 capítulos. Os pediría una ayuda, para llegar a más gente, si sabéis de alguien a quien le pueda interesar este pódcast, no dudéis en compartirlo. Para vosotros es un momento y a mi me ayuda a hacer crecer el canal.</p><p>Ahora si, con todos vosotros: Ahora Oppenheimer.</p><p>¡Gracias por estar!</p>",
        "language": "es",
        "author_name": "Ramon Teleco",
        "slug": "ahora-oppenheimer",
        "cover": "20230820_020815_d5fb5a2099e53ad0b40914e87dfc94e8.jpg"
    },
    {
        "podcast_id": 225169,
        "title": "Titan",
        "description": "<p>Astronomy and astrophysics podcast. We will put the information in simple way follow us for more.</p>",
        "language": "ar",
        "author_name": "Marym fayyad ",
        "slug": "titan26",
        "cover": "20230821_080859_865157c180c4c307996981bd436c1040.jpg"
    },
    {
        "podcast_id": 228591,
        "title": "StarGuide: Your Map to the Universe",
        "description": "<p>Hey there stardust! Welcome to StarGuide: Your Map to the Universe! Ok, let's get this straight. We have SO many questions. Yet answers are limited, and so are resources. Chemistry, physics, and biology are the standard go-to science subjects taught extensively in schools, yet delving into astronomy is uncommon and restrained. But in an age dominated by space science, it is imperative that people have an understanding of it, and why not start this experience with some conversation? This podcast hopes to inspire everyone to never stop thinking about what lies there when you look up! We'll be delving into astronomy research, internship opportunities, interviews with professionals, and more! Stay tuned for more!</p>",
        "language": "en",
        "author_name": "SpaceTourist",
        "slug": "starguide",
        "cover": "20230914_030926_694ac6532300e53b9db8e43fa0ed2f1d.jpg"
    }
]