[
    {
        "podcast_id": 62,
        "title": "The Screw",
        "description": "A weekly, queer podcast thoroughly examining the intricacies of sex in all spaces and places. We navigate topics with nonchalance and without judgment. Our goal is to educate and open minds (while having a laugh along the way). New themes discussed monthly. Hosted by Felicia Rose and Alove from New York City. ",
        "language": "en",
        "author_name": "With Felicia Rose and ALove",
        "slug": "thescrew",
        "cover": "20210602_025609_fa59e998500425cdc262e8462634fdfb.jpg"
    },
    {
        "podcast_id": 1775,
        "title": "Joy Exposed w/ Joycelyn Wells ",
        "description": "Late night adult talk radio show... meeting people where they are to discuss love, passion, happiness and exposing the joy within!",
        "language": "en",
        "author_name": "Joycelyn Wells",
        "slug": "joycelynwells",
        "cover": "20200929_190119_6fb695d69c813d3d2e4b3a6ddb9b6451.jpg"
    },
    {
        "podcast_id": 2871,
        "title": "Sex Like This",
        "description": "Why do we always hear the same love stories? The abled-bodied, hetero, storybook version of what it’s like to fall in love gets told over and over and over again. Not anymore. Welcome to Sex Like This - an Uncomfortable Revolution podcast about sex and dating with a chronic illness or disability, hosted by Nicole Edwards, URevolution Media Fellow, 2018. www.sexlikethis.com",
        "language": "en",
        "author_name": "Uncomfortable Revolution",
        "slug": "sexlikethis",
        "cover": "5d5802855edce.png"
    },
    {
        "podcast_id": 4449,
        "title": "/Queer",
        "description": "<p>How much do you know about gender &amp; sexuality? /Queer takes us beyond the lens of 'LGBTQ' and Western concepts in this oral histories podcast of human diversity. Across Seasons 1 &amp; 2, gender &amp; sexuality researcher Georgie Williams travels through the USA, Japan, Indonesia, the United Kingdom, Ireland, Malta, Turkey, South Africa and Lesotho- interviewing human rights workers, activists, professors and everyday people whose lived experiences fall under the umbrella of 'gender and sexuality variance'. At the core of this project lies the question- what is 'queer' and where in the world is it found?</p>",
        "language": "en",
        "author_name": "/Queer",
        "slug": "slashqueer",
        "cover": "5dc09e13d1415.jpg"
    },
    {
        "podcast_id": 4761,
        "title": "38 Mil +",
        "description": "It's time to end the AIDS epidemic!",
        "language": "en",
        "author_name": "Directed and Produced by Andre W. Martins & LGBTQ+A ERG at Colgate Palmolive Company.",
        "slug": "38milplus",
        "cover": "5dd8254c58f2a.jpg"
    },
    {
        "podcast_id": 5922,
        "title": "Speaking Queerly",
        "description": "Produced by Kaleidoscope Youth Center - a 501(c)3 nonprofit located in Columbus, OH - Speaking Queerly examines pop culture, news, politics, and other topics that affect LGBTQIA+ youth and young adults. Learn more about us at kycohio.org.",
        "language": "en",
        "author_name": "Kaleidoscope Youth Center",
        "slug": "speakingqueerly",
        "cover": "20200129_190153_b147a7c57e07271d99e50c7f70d6cb2d.jpeg"
    },
    {
        "podcast_id": 5985,
        "title": "SEXED Puerto Rico",
        "description": "Podcast para conocer sobre bienestar sexual. Si quieres comenzar a mirar tu cuerpo con libertad y disfrutar mejor de tu sexualidad, te invito a que escuches este podcast. Hablamos sobre temas como: negociación sexual con tu pareja, libido, prevención de infecciones de transmisión sexual y muchos otros temas. Desde  el respeto y aceptación a la diversidad sexual creamos un espacio seguro para hablar de estos temas.",
        "language": "es",
        "author_name": "Alexa",
        "slug": "sexedpuertorico",
        "cover": "20210619_171652_e9b45bc0d838d25d181c95c85a0a7e8a.jpg"
    },
    {
        "podcast_id": 6236,
        "title": "Love in Los Angeles",
        "description": "A new podcast from two certified non-experts in dating, LOVE IN LOS ANGELES chronicles stories about romance, relationships and falling in love in the City of Angels. Join us for special guest discussions about horror stories, happy endings, and the unique journey of navigating relationships in LA.",
        "language": "en",
        "author_name": "Love in Los Angeles",
        "slug": "loveinlosangeles",
        "cover": "20200214_204506_7fe672e3ae991cc87e8b25da95b067ca.jpeg"
    },
    {
        "podcast_id": 7055,
        "title": "Lemon Squeeze Pod",
        "description": "Millennium podcast with Kila featuring guest that get into mental health, popular topics, relationships, sex and etc. All bundled up in a fun easy accessible weekly episode. ",
        "language": "en",
        "author_name": "Lemon Squeeze Pod ",
        "slug": "2020",
        "cover": "20200325_142414_7a892318877468fea19fc15f36ada3eb.jpeg"
    },
    {
        "podcast_id": 7708,
        "title": "CAM4 Presents: How's It Hanging?",
        "description": "How’s It Hanging? is a podcast dedicated to opening up important discussions about erectile health, sexual psychology, succeeding at erotic exploration, and overall wellness for pleasure seekers. Host Paul Nelson is the Founder of the world-renowned men's wellness network Franktalk.org and a clinical sexologist at MAZE Men’s Health in New York. He's passionate about facilitating access to important information and destigmatizing certain health issues and concerns.\n\nNOTE: This series is meant to spark important conversations and debunk stigmas; these episodes by no means replace a face to face consultation with a licensed medical professional.  \n",
        "language": "en",
        "author_name": "CAM4 Radio",
        "slug": "howsithanging",
        "cover": "20200904_042654_ca13764cb004877519a645131cf3e3e0.jpg"
    },
    {
        "podcast_id": 8177,
        "title": "Charge Your Vibrator!",
        "description": "Welcome! I am an aspiring Sex Therapist and I'm here to remind you to chill out, learn something new and charge your vibrator!\n",
        "language": "en",
        "author_name": "Hannah De Priest",
        "slug": "chargeyourvibrator",
        "cover": "20200425_224934_548bdd61d6aad397f8dd2c2ccb24faf7.jpeg"
    },
    {
        "podcast_id": 8704,
        "title": "It's Only Sex, Mom!",
        "description": "A podcast where we talk about the science, anthropology, sociology, and psychology of sex.",
        "language": "en",
        "author_name": "IOSM Podcast",
        "slug": "iosm",
        "cover": "20200512_011248_bc271e81a0910fede87bb60a66e23e60.jpeg"
    },
    {
        "podcast_id": 11244,
        "title": "Here If You Need",
        "description": "Join Jennifer Atilemile and her bestie Amy Gambrill for their weekly chat about all the stuff that as womxn, we’re told not to talk about. \n\nFollow us on Instagram @hereifyouneedpodcast\n\nMain Cover Illustration by Tea Rose Wright\n",
        "language": "en",
        "author_name": "Jennifer Atilemile & Amy Gambrill",
        "slug": "hereifyouneed",
        "cover": "20200810_211622_42eb522985c65f280f0ebb9fc1c7c608.jpg"
    },
    {
        "podcast_id": 11530,
        "title": "CAM4 Presents: Licked & Loaded with Laura Desirée",
        "description": "This is a conversation series that takes the listener from the playfulness of the bar room to the intimacy of the bedroom. Licked&Loaded sifts today's hot topics, front page headlines and (of course) sexual curiosities through the life experience of this star-studded line up!",
        "language": "en",
        "author_name": "CAM4",
        "slug": "lickedandloaded",
        "cover": "20210429_201208_7555a7277692f3f71150135c05c7a34e.jpg"
    },
    {
        "podcast_id": 11537,
        "title": "Queer Discourse with Lou Barrett",
        "description": "Queer Discourse with Lou Barrett is a podcast all about finding our commonalities through our differences. Each episode has a different queer guest alongside cohost Lou Barrett. Together they explore a different book by a queer writer and discuss the ways it made them feel, the ways it challenged them, and what they want to do with that information. Podcast starts October 21st, 2020!",
        "language": "en",
        "author_name": "Lou Barrett",
        "slug": "queerdiscourse",
        "cover": "20200819_221245_cbc5e5939476904fab6bca7f6de38daa.jpg"
    },
    {
        "podcast_id": 11977,
        "title": "F*ck This Podcast!",
        "description": "This sex positive podcast is real and ridiculous in equal measures. Join Cute Little F*ckers creator Step Tranovich and an inspiring new guest every episode as they get real about sex, sexuality, gender, queer sh*t, trans sh*t, polyamory, bodies, and more! ",
        "language": "en",
        "author_name": "Step Tranovich",
        "slug": "fuckcast",
        "cover": "20200901_235702_f046a8f7ce401592db1b8001f7526682.jpg"
    },
    {
        "podcast_id": 11996,
        "title": "The House of La'Don",
        "description": "The House of La’Don is a podcast hosted by Aaron La’Don, an enthusiastic free spirit whose made encouragement, inspiration, and self-care a lifelong mission. Prepare yourself for a journey of positivity and personal well-being. At a time when mental health issues threaten our happiness and undermine our security, the need for self-love has become super important. We all face challenges when trying to appreciate and better ourselves, and this podcast will work to reach out and connect people from all walks of life who want to broaden their horizons and tap into their undiscovered talents--those unique, incredible individuals who understand that life is meant to be great and full of continuous growth. Aaron La'Don, the House Mother, will bring attention to topics including sexuality, love, travel, wealth, mindfulness, mental and physical health, and developing one's personal style with a goal towards constant improvement and steady persistence. Want to love yourself? Push through and never quit knowing you're not alone! Let's learn and grow together.",
        "language": "en",
        "author_name": "Aaron La'Don",
        "slug": "thehouseofladon",
        "cover": "20201005_044640_a1ec37eb7a15981782a4f2fec5f8eccf.jpg"
    },
    {
        "podcast_id": 12052,
        "title": "CAM4 Presents: Royal Fetish Radio",
        "description": "A journey into the world of BDSM, Fetish, Sex Work and Politics with iconic pleasure-seeking power couple, King Noire and Jet Setting Jasmine. New episodes every Friday! ",
        "language": "en",
        "author_name": "CAM4",
        "slug": "royalfetishradio",
        "cover": "20200904_032918_c8d946e3373b656305900186cd122410.jpg"
    },
    {
        "podcast_id": 12335,
        "title": "The Hurt By The Female Pain Docs",
        "description": "Dr. K and Dr. P, of The Female Pain Docs, are board certified anesthesiologists and interventional pain physicians that discuss topics relating to women's pain and general health. The Hurt Podcast contributes to the public discourse on women's health with specific focus on female pain, both diagnoses and treatments. The podcast pursues a fact-based exploration of disease and ailments affecting women by discussing advances in analysis and treatment. Dr. K and Dr. P hope to empower women and men to engage in the advancement of their health by educating them about their body in regards to pelvic pain, the peripartum period, sexual dysfunction, and more. All views are our own and do not reflect the views of our institution. Instructional Media. \n\nFollow us on Social Media:\nInstagram: @thefemalepaindocs\nTwitter: @femalepaindocs\nTikTok: @thefemalepaindocs\n",
        "language": "en",
        "author_name": "Dr. Meera Kirpekar and Dr. Alopi Patel",
        "slug": "thehurtwiththefemalepaindocs",
        "cover": "20210228_191748_1c61c0496f95ee7d7fa31d61106b04e1.jpg"
    },
    {
        "podcast_id": 12490,
        "title": "Pembenin Elli Tonu",
        "description": "Aşkın Tonları pembedir. Kırmızı tonlarında kışkırtıcı, sıcak ve delirten, içimizi kıpır kıpır hissettiren aşktan, yumuşacık bembeyaz olan saf sevgiye kadar uzanan konuları ele alıyorum. Okuduklarımdan ve yaşadıklarımdan, danışanlarımdan gördüklerimden esinlenerek aşk ve ilişkilerin boyutlarını, sevgi hakkındaki bilinmesi gerekenleri, mutlu ve sağlıklı ilişkilerin kurulabilmesi için temel bilgiler ve şartların neler olduğunu anlatıyorum. Bir kadın için ve bir erkek için neler önemli olabileceği, farklı bakış açılarına değinip, tabi cinsellik, güven, sadakat, kıskançlık ve aldatma gibi aşk hakkında bildiğimiz ve sarsıcı gerçeklerin hepsi bir arada bulacağınız bölümler yaratıyorum. Aşkın pembe tonlarını keşfetmeye meraklıysanız, her hafta yeni bir bölüm ile karşınızda olacağım. Takipte kalın. ",
        "language": "tr",
        "author_name": "Kendini Sifirla -Müge Yücel",
        "slug": "pet",
        "cover": "20200917_181633_1a48553bd4afb560ecf5d22b3705ffff.jpg"
    },
    {
        "podcast_id": 13017,
        "title": "I Love That for You",
        "description": "Cody and Laney talk about how much they love the everyday inconveniences of modern day life. We're here to tell it how it is and spread a little bit of love, positivity, and  support. ",
        "language": "en",
        "author_name": "Laney Sturm and Cody Burris",
        "slug": "ilovethatforyou",
        "cover": "20201002_191019_794405b87a71bcbea2d95cd3daca5d3c.jpg"
    },
    {
        "podcast_id": 13360,
        "title": "pronouns in bio",
        "description": "Welcome to pronouns in bio, the very funny podcast for trans and non binary people and people who don't know they're trans and non binary yet (yes, we mean you). Each month we talk about what's hip and happening in the 'community', ask ourselves why cis people are like that, and explain why your favourite thing is gay (yes, that one).",
        "language": "en",
        "author_name": "Cleo Madeleine and Rhy Brignell",
        "slug": "pronounsinbio",
        "cover": "20201012_183952_9a120191785632147f94fd1f33549651.jpg"
    },
    {
        "podcast_id": 13532,
        "title": "Good Girl Gone Goddess- De-construction, Spirituality, Feminine Embodiment,Sex Positivity, Wahine",
        "description": "<p>Welcome to the Good Girl Gone GODDESS podcast!</p><p>This podcast is a soft place to land when you begin to question it ALL. It focuses on the exploration of personal truths, not dogma or a critique of religion itself. Instead, it delves into the history of ancient worship and rituals of women, allowing listeners to redefine their relationship with themselves, God, and the Great Goddess in all her forms. The host provides supportive and integrative tools, feminine embodiment practices, ancestral healing, holistic sexuality, and a touch of magic.</p><p>The Good Girl Gone Goddess podcast is a space for women, mothers, dual souls to come as you are and learn to be intimate with life again. It encourages you to embrace your worthiness of fulfillment, ecstasy, prosperity, and peace, as you <em>untangle from your old life and create a new</em></p>",
        "language": "en",
        "author_name": "U'ilani Tevaga - Feminine Embodiment Coach , Trauma-informed Somatic Healing",
        "slug": "beyondthereef",
        "cover": "20230718_100733_7b23e0ed1983f3216344bed216b26818.jpg"
    },
    {
        "podcast_id": 13625,
        "title": "Pillow Talk with Cinnamon",
        "description": "friends asked me to do this & i have nothing better to do bc its only week 3 so i’ll start watching my lectures right around midterm szn\nthinking about giving advice that I’ve learned from my messy mf life, telling some of my fan-fav stories, and “beer with chad” segments where i’ll collect questions from you guys for a ucla frat bro, have a few beers with him, then ask the questions",
        "language": "en",
        "author_name": "Sollie \"Cinnamon\" Clark",
        "slug": "pillowtalkwithcinnamon",
        "cover": "20201019_012618_16999428757dd35e1f2cd44b2e9ebbc1.jpg"
    },
    {
        "podcast_id": 13689,
        "title": "STD-CAST",
        "description": "<p>Mitä saadaan kun yhdistetään yksi äärimmäisen avoin parikymppinen nainen, treffit yli sadan miehen kanssa ja muutamia kavereita sekä vanhoja deittejä mukaan höpöttelemään? Vastaus on, että yksi erittäin korvia kuumotteleva ja nauruhermoja koetteleva podcast, jossa selviää mikä on chillu, millä tavalla EI kannata kieltä tunkea deitin suuhun baarijonossa ja missä häilyy normaalin stalkkaamisen ja häiritsevän psykopaatin-leiman saamisen raja. Tämän podin kuunteleminen ilman kokovartalo-kondomia tapahtuu omalla vastuulla. 3. Tuotantokausi leviämässä! Seuraa Instagramissa ja TikTokissa: @stdcast Lähetä sähköpostia: ronja.ronjarontti@gmail.com</p>",
        "language": "fi",
        "author_name": "STD-CAST",
        "slug": "stdcast",
        "cover": "20230316_030335_3df71af655c77062559ac629d1f99bec.jpg"
    },
    {
        "podcast_id": 13795,
        "title": "Behind the Mask",
        "description": "The PALS Leadership Podcast",
        "language": "en",
        "author_name": "Sophia, Margot, Kaicheng, & Irene.",
        "slug": "behind-the-mask",
        "cover": "20201023_042438_f95e51e81850d647c8e93dc9695a4a7b.jpg"
    },
    {
        "podcast_id": 14199,
        "title": "pumpkin seeds podcast",
        "description": "A podcast for the quarter-life crisis.\n\nA podcast for the over-thinkers and over feelers. \n\nA podcast for the over the top in everything.\n\nI want to talk about all the shit we are supposed to be afraid or embarrassed to talk about. Let's talk about sex, our bodies, dating, friends, jobs, school, careers, ALL OF IT. \n\nI want to talk about everything from what you like in bed to what you thought you wanted to be when you grew up. Let's talk about a women's right to feel respected while also wanting to be spanked and called a dirty little slut. Let's talk about what it feels like to be in your late 20s with no f**king clue what you're doing. \n\nLet's talk about all the ways your parents f**ked you up. Let's talk about food, and feeling GOOD in your body.. or not; the hot and the ugly. Let's talk about how some days you love who you are, but other days you low-key hate yourself. Let's talk about feeling sexy in your own skin. Let's talk about boobs, nipples, orgasms and buttholes. Let's talk dicks that rocked your world and dicks that sent you home to your vibrator. Let's talk about REAL self-esteem and self-love. Confidence, sexuality, sensuality.   \n\nSo welcome to my audible diary. My virtual burn book. The place where all are welcome to pop a squat, plant their pussy or park their penis. Everyone thinks about and feels about this shit, I know we all do.\n\nSo welcome to the pumpkin seeds podcast. \n\nLets. Fucking. Talk about it. ",
        "language": "en",
        "author_name": "Sheyne Davy-Lynn",
        "slug": "thepumpkinseedspodcast",
        "cover": "20230105_010125_198d3f326356fb7d05f90e16755eacc4.jpg"
    },
    {
        "podcast_id": 14221,
        "title": "The Whorascopes Podcast",
        "description": "A podcast hosted by Damian Hernandez, an aspiring human sexuality psychology major who likes to drink and talk about life and relationships with his friends.  Enjoy!",
        "language": "en",
        "author_name": "Damian",
        "slug": "meatplunger",
        "cover": "20201104_121342_3b06a26a83d4393f76efd4487fb5fd5d.jpg"
    },
    {
        "podcast_id": 14365,
        "title": "Die Männerschmiede",
        "description": "<p>Was bedeutet Mannsein im 21. Jahrhundert? Was ist maskuline und feminine Polarität? und was bewegt uns Menschenmänner wirklich? Wir sind Max Zeilinger und Jason Fairbrother Psychologen (<a href=\"http://B.Sc\">B.Sc</a>.) &amp; Coaches. Der Männerschmiede Podcast gibt euch durch Zahlreiche Gespräche und Themen, die, in die tiefe des Menschseins führen, wertvolle Wegpunkte für deine eigene Reise zu dir selbst.</p>",
        "language": "de",
        "author_name": "Jason Fairbrother",
        "slug": "thebrotherspodcast001",
        "cover": "20221122_111119_1fd4dcb68c7690a0f0778ed2d133e1eb.jpg"
    },
    {
        "podcast_id": 14416,
        "title": "Tranos & the Lived Experience",
        "description": "Welcome to Tranos and the Lived Experience! \nA podcast confronting current events, politics, comedy, and calamity from the perspective of a Trans Titaness.  She’s a verbal black belt, skilled in the Roast arts! The \"Hell Mouth\",  \"Doom Sayer.\"\nC.E.O. of the Amazon Position! Here’s your host, Kamryn Ehlen Jerrel...",
        "language": "en",
        "author_name": "Kamryn Ehlen Jerrel",
        "slug": "tranos",
        "cover": "20210109_044524_a131733abb4c50dafbcd4398cbee3af6.jpg"
    },
    {
        "podcast_id": 15988,
        "title": "The Slutty Scientist Podcast",
        "description": "Not your middle school sex education course!  Join Brooke and her special guests as they break stigmas surrounding sexual experiences with scientific and medical insight.  She provides facts and resources to help normalize and educate about these taboo and socially stigmatized topics, while providing first-hand insight and experiences.  Buckle up and wrap your willy because this is going to be one hell of a ride. ",
        "language": "en",
        "author_name": "The Slutty Scientist",
        "slug": "thesluttyscientistpodcast",
        "cover": "20220112_040145_b98698f0bd2e8951910b00a19d10f1e6.jpg"
    },
    {
        "podcast_id": 20537,
        "title": "Hook up Culture",
        "description": "Love advice with a twist of Kris Lionheart style!",
        "language": "en",
        "author_name": "Kris Lionheart",
        "slug": "hookupculture",
        "cover": "20201226_072853_d59fe5230116dac74e1aef5793a8d893.jpg"
    },
    {
        "podcast_id": 22582,
        "title": "Space Fuckers",
        "description": "Sluts in space.\n\nhttps://spacefuckerspodcast.com/",
        "language": "en",
        "author_name": "Simon Geballe",
        "slug": "spacefuckers",
        "cover": "20210108_011237_c92e5296ab5b244c94957da007c234bf.jpg"
    },
    {
        "podcast_id": 24647,
        "title": "καθαρός (Katharos)",
        "description": "Speaking Leaves Us Transfigured: a couple trans folk and their friends discussing religion, ugly metal, and The Unfortunate Act of Existing",
        "language": "en",
        "author_name": "Valerie and Serena",
        "slug": "katharospod",
        "cover": "20210115_034207_85076db3c85bfe8bfae58e2c45e7aef2.jpg"
    },
    {
        "podcast_id": 25196,
        "title": "Girls and Gays Only ",
        "description": "We are here. We. are. queer. Giving you the realest of the real in gay, lesbian, trans,  bisexual + topics. Because no one likes to talk about that kind of stuff. ",
        "language": "en",
        "author_name": "Girls and Gays Only ",
        "slug": "girlsandgaysonly",
        "cover": "20210117_135633_29341d9f6a8944beafeba3a6c9ad9e8f.jpg"
    },
    {
        "podcast_id": 25424,
        "title": "Cough Up A Lung w/ Chris",
        "description": "Just a regular girl. A wife, A mom. Who LOVES weed and sex! Come smoke one with me! WARNING GRAPHIC CONTENT *21 and over please!   ",
        "language": "en",
        "author_name": "Christina Smiley",
        "slug": "coughupchris",
        "cover": "20210129_210914_09e6203f86f414c152f758b19469a7b6.jpg"
    },
    {
        "podcast_id": 27676,
        "title": "Switch",
        "description": "A quirky podcast about love, relationships, sexuality, dating, sex, bdsm, spirituality and how it all ties into together. ",
        "language": "en",
        "author_name": "Selena Quintana",
        "slug": "switch",
        "cover": "20210126_202515_0ee49ecac41bb1db35b94dde629ffcf5.jpg"
    },
    {
        "podcast_id": 30685,
        "title": "Nova Femme",
        "description": "We're just two ladies talking about ladies! We hope to create a safe space for womxn to express their opinions and open up a larger discussion about sisterhood. Covering vast topics about the womxn experience, we hope to help womxn feel seen and heard. Come hang out for us for an hour; you might make a new friend! ",
        "language": "en",
        "author_name": "Crystal Wyllie and Claudia Corneyea",
        "slug": "novafemme",
        "cover": "20210213_173254_74b9412ffa7912ca88a35bb46f854fa8.jpg"
    },
    {
        "podcast_id": 32471,
        "title": "Hunter J Allen's Valentine's Day Extravaganza",
        "description": "Spending Valentine's Day alone? not anymore you aren't with this special, sensual gift from your favorite heartthrob extraordinaire, Hunter J Allen. Spend a glorious 15 minute date with the master of romance, including poetry, love letters, dinner, and so much more. Don't spend your Valentine's day alone, spend it alone with Hunter J Allen.",
        "language": "en",
        "author_name": "Hunter J Allen",
        "slug": "hunterjallen",
        "cover": "20210213_135314_7888c0f209d18be780818e3fa0bc7857.jpg"
    },
    {
        "podcast_id": 32579,
        "title": "When Humanists Attack!!!",
        "description": "<p>Why should \"secular humanism\" be defined mostly by its opponents? Your three co-hosts talk to fabulous humans working toward humanist goals like social justice, critical thinking, exploiting the power of humor, and improving society by means of communication skills. Some are recovering from a religious upbringing; others exploring secular spirituality. Some believe in a deity--and are open to respectful inquiry about where our beliefs come from (i.e., our epistemology). Topics range widely but all guests present eye-opening observations!</p>",
        "language": "en",
        "author_name": "The Humanist Being",
        "slug": "whenhumanistsattack",
        "cover": "20210213_224329_59498aa67d0b86fe21f17d33c49df760.jpg"
    },
    {
        "podcast_id": 32792,
        "title": "Cognac Confessions Podcast",
        "description": "Cognac Confessions is a podcast that makes you realize there is nothing to be ashamed of. Hosted by two girls keeping it raw & uncut. So, grab your Dusse’ and get ready to get Lusse’ every Friday with @TheJaylaO & @ShutUpTalon. Follow us on Instagram @cognacconfessionspodcast",
        "language": "en",
        "author_name": "Cognac Confessions Podcast",
        "slug": "cognacconfessions",
        "cover": "20210217_195001_c005460507a49b1ef8152749f5c63a4a.jpg"
    },
    {
        "podcast_id": 34791,
        "title": "Mostly Messy",
        "description": "Life, relationships, sex, dating, kids and everything in-between...it’s a mess! If you are interested in relatable stories, laughing, learning, mediocre advice and general shit; this is the podcast for you! Because let’s be honest, we all make a mess. ",
        "language": "en",
        "author_name": "Melissa Boosalis",
        "slug": "mostlymessy",
        "cover": "20210514_162417_bcfb93c15fcc8bfe56d1054ca3a31dc9.jpg"
    },
    {
        "podcast_id": 35024,
        "title": "Intu It with Ella",
        "description": "I came here to talk about healing.\nI look for my voice, for my truth.\nLast year I began this podcast, as an experiment, a way to share insight stemming from my own journey, and to discover my own voice.\nThis year I have deleted all of last year's material, as a way to start anew.\nWelcome to this space, where I share part of my journey.\nI truly hope you enjoy.\n(To book a session in person or online, for now you can contact me via Facebook- Ella Fuksbrauner. Website coming soon!)",
        "language": "en",
        "author_name": "Ella Ray Phoenix",
        "slug": "ellafuksbrauner",
        "cover": "20220305_030315_8127873cb80000bf75ff18fa6b2e909b.jpg"
    },
    {
        "podcast_id": 36246,
        "title": "Fuckbuddies!",
        "description": "<p>A humorous look into the world of sexuality, sex, and sexual education. Hosted by Mischa and Hayden, each episode delves into a new theme, ranging from STD's, to LGBT's, and sometimes to TMI's. Come join us in our auditory classroom! Episodes usually the first and third Sunday of a given month. NOTE: 18+ only! Theme by Hazel Alva: @hazelalvamusic Instagram: @heckbuddies</p>",
        "language": "en",
        "author_name": "Mischa and Hayden",
        "slug": "heckbuddies",
        "cover": "20210224_125826_5043932ab80efe1b919c7d7283d4ce2a.jpg"
    },
    {
        "podcast_id": 37067,
        "title": "So True Bestie ",
        "description": "Welcome to the So True Bestie podcast! Sit down, grab a coffee and listen to us chat about everything and nothing! Starring legendary besties Joe Grundy and Jodie Carvell 👩🏻‍🤝‍👨🏼♥️ Keep up with us on Twitter at http://twitter.com/sotruebestiepod & thanks for listening! ",
        "language": "en",
        "author_name": "Jodie Carvell and Joe Grundy",
        "slug": "sotruebestie",
        "cover": "20210226_191450_cee050fd998f7bd5594ffb217b134d6b.jpg"
    },
    {
        "podcast_id": 37114,
        "title": "Life With Money",
        "description": "An exploration of everything I think about, believe and know. Let yourself live through someone else for just a moment, Every Tuesday with your host Money!\n\nAvailable on Spotify & Apple Podcasts ",
        "language": "en",
        "author_name": "Jmonet Hill",
        "slug": "lifewithmoney",
        "cover": "20210226_215441_5e2d2c212af2dae21858319f236d04cb.jpg"
    },
    {
        "podcast_id": 37803,
        "title": "Unicorns, Dragons, and Poly... OH MY!",
        "description": "We take a look at the swinging and poly lifestyle. We share experiences and advice we have, as well as interview other singles and couples. ",
        "language": "en",
        "author_name": "Captain HD",
        "slug": "unicorns-dragons-and-poly-oh-my",
        "cover": "20210301_140033_1597a782879d52482ae55444a6038a6c.jpg"
    },
    {
        "podcast_id": 38587,
        "title": "Homo Hetero",
        "description": "Hey homos and heteros! We're Makayla and Aaron and we may be the funniest people you'll ever meet. Just kidding... but we are stupid. Stupid enough to tell you some of the nastiest and cringiest moments the two of us have had as a girl and her gay best friend. So sit with your lovers, or yourself baddie, and enjoy. (And if you're hot, hit us up.)",
        "language": "en",
        "author_name": "Makayla Leilua and Aaron Tenorio",
        "slug": "homohetero",
        "cover": "20210304_041331_d12361707aecf83027047c9e08482445.jpg"
    },
    {
        "podcast_id": 38669,
        "title": "Cor e Coragem",
        "description": "Color y Coraje (Cor e Coragem) trae muchas historias, cada una con su color diferente pero todas inspiradas y llevadas por el mismo coraje. Se trata de personas perseverantes, que apesar de los prejuicios y barreras de la sociedad, lucharon para encontrar su propia identidad y por tanto, su felicidad.\n\nCor e Coragem traz muitas histórias, cada uma com sua cor diferente, mas todas inspiradas e levadas pela mesma coragem. Se trata de pessoas perseverantes, que apesar dos preconceitos e barreiras da sociedade, lutaram para encontrar sua própria identidade, e portanto sua felicidade.",
        "language": "es",
        "author_name": "Abraham Orozco",
        "slug": "corecoragem",
        "cover": "20210304_131525_fa60e3986e5e6641041a2b6f01c095fb.jpg"
    },
    {
        "podcast_id": 39018,
        "title": "Already Cancelled w/ Phen",
        "description": "Already Cancelled is a podcast where Phen (and a guest) lays it all out on the table. Each episode, Phen (YA BOI!) chats with one of their friends to discuss whatever topic has been on Phen's mind that week. The topics range from pop culture, true crime, mental health, AND A WHOLE LOTTA OTHER SHIT! \nAnd of course... Somebody has had a few drinks, or smoked some grass.\nBut, be aware, while ya boi refuses to deal with homophobia, transphobia, racism, and all that other bullshit; don't think that Phen and the homies aren't afraid to be unfiltered... Cuz they ain't!\n\nBe sure to follow the IG @pheniscancelled ",
        "language": "en",
        "author_name": "QueeryNet",
        "slug": "alreadycancelled",
        "cover": "20210430_214207_0e6b3a586a8b78d8f9ad87bb881de22c.jpg"
    },
    {
        "podcast_id": 39416,
        "title": "De Les'be podcast",
        "description": "Een podcast over nou ja, van alles. Een podcast die deels zal gaan over seksualiteit en de verschillende vormen van liefde en relaties. Maar ook een podcast die vooral zal gaan over dat je kunt zijn wat je wil zijn.\n\nMijn naam is Shanice Gillet en als het gaat om de liefde, heb ik wel het een en ander mogen ervaren. Monogame relaties, open relaties en relaties met meerdere personen. Met vrouwen en met mannen. Fijne relaties en minder fijne relaties. \n\nIn deze podcast zal ik je vertellen over mijn ervaringen, spreek ik met verschillende gasten over verschillende onderwerpen en zal ik je meenemen in mijn wereld. Die wereld bestaat uit meer dan alleen bovengenoemde onderwerpen, dus wanneer ik daar zin in heb, zullen er ook zeker andere onderwerpen besproken worden. \nLes'be what the hell we want to be!\n\nFoto: Anne van Zantwijk",
        "language": "nl",
        "author_name": "Shanice Gillet",
        "slug": "de-les-be-podcast",
        "cover": "20210307_172300_d8230f12136c269a0f70962cb7482e85.jpg"
    },
    {
        "podcast_id": 39835,
        "title": "No todos necesitan un podcast",
        "description": "Bienvenidos a no todos necesitan un podcast, un podcast donde Zaira y Shaddy hablarán de todo un poco y explorarán los rabbit holes del internet.\nNuevo episodio todos los martes!\n",
        "language": "es",
        "author_name": "Zaira & Shaddy",
        "slug": "notodosnecesitanunpodcast",
        "cover": "20220118_060148_b271c19a2db98571221135db2a0db9ba.jpg"
    },
    {
        "podcast_id": 39917,
        "title": "Ginasaisquoi",
        "description": "I want to share my past present and Future dating stories. Dating over 40 can be rough .It takes a look inside of my comical yet disturbing dates. I want to hear about your dating experiences as well. We have to laugh to keep from crying.",
        "language": "en",
        "author_name": "Ginasaisquois",
        "slug": "ginasaisquois",
        "cover": "20210311_060713_e6572b9ba2744442479f37c869e0f741.jpg"
    },
    {
        "podcast_id": 40555,
        "title": "Two Therapists Talking",
        "description": "David and Sherie talk about self-worth, sexual addiction, betrayal trauma, depression, anxiety, and other therapy issues. Each podcast is a different topic of conversation with tools, guidance, and help for navigating these complex problems. Learn more at https://www.twotherapiststalking.com. ",
        "language": "en",
        "author_name": "David Thompson & Sherie Christensen",
        "slug": "twotherapiststalking",
        "cover": "20210311_015355_a6ae8b78b1ce5e183669db44c272f7ed.jpg"
    },
    {
        "podcast_id": 41968,
        "title": "Pari Suhteesta",
        "description": "Pari Suhteesta on Aleksin ja Sandran sukellus parisuhteeseen. Se on sielukas katselmus henkisestä matkasta, jota parisuhde peilaa.  Kuinka miehen ja naisen suhde voi toimia? Kuinka molemmat osapuolet voivat kukoistaa? Kuinka \"me\" näyttäytyy yksilötasolla ja kuinka \"minä\" käyttäytyy yhteisellä tasolla? Puhumme rehellisesti tantrisesta seksuaalisuudesta, tunteista ja kasvustamme tässä suhteessa.\n\nAleksi on kouluttautunut kundaliinijoogaohjaaja. Lisäksi Aleksin henkisiin harjoitteisiin kuuluvat hengitys- ja kehonpainoharjoitteet, laulu, kitaransoitto, leikkimielisyys, vapaa ekstaattinen tanssi sekä suuri rakkaus ja kunnioitus kylmäaltistusta kohtaan. Aleksilla on valtava halu tuoda henkistä syvyyttä länsimaiselle keholle ja mielelle helpommin lähestyttävässä muodossa. Hän on vahva kehorakkauden puolestapuhuja. \n\nSandra opiskeli viisi vuotta psykologiaa yliopistossa, kunnes koki itsessään sen, että tie sisäiseen voimaan ja kukoistukseen löytyy länsimaista psykologiaa laajemman kehollisen varjotyöskentelyn, seksuaalisuuden ja sielullisuuden kautta. Niinpä Sandra jätti yliopisto-opinnot kesken ja opiskelee nyt Fertility Awareness- ja Sexual Health Educator :iksi etänä Yhdysvalloista. Sandra tutkii elämää tantran kautta, jossa seksuaalienergia nähdään pyhänä elämänenergiana ja joka tukee kokijaansa löytämään viisauden omasta kehostaan.\n\nTervetuloa podcastimme pariin!\n-Sandra & Aleksi\n\n* Muista seurata meitä myös instagramissa: @pari__suhteesta *",
        "language": "fi",
        "author_name": "Aleksi & Sandra",
        "slug": "parisuhteesta",
        "cover": "20211210_011207_0ef3d80e7b4331d2c71882b2d546f96d.jpg"
    },
    {
        "podcast_id": 42626,
        "title": "Opiniones with Steven and Z",
        "description": "Discussing and Focusing on a various amount of topics from a BIPOC and queer perspective. Mostly conversations over a nice cup of café de La olla. ",
        "language": "en",
        "author_name": "Steven Cervantes and Z Nez",
        "slug": "opinionespod",
        "cover": "20210411_185044_330a46ed188eea518628446172af0fcd.jpg"
    },
    {
        "podcast_id": 45176,
        "title": "The Ebby Online Podcast ",
        "description": "I'm a London based journalist, my name is Ebun Felicity Hargrave.\nI have a passion for communications, so I decided to create a podcast to host voices from all different walks of life. \nI will be talking about anything and everything from sex, politics, women's stories, current affairs, mental health, spirituality. \n\nTune in every other Monday for a brand new episode!\n\nFor more of my content check out: www.ebbyonline.com                                     \nInstagram: @EbunFelicityHargrave",
        "language": "en",
        "author_name": "Ebun Felicity Hargrave",
        "slug": "ebbyonline",
        "cover": "20210617_201728_93441a40ace6bad7300084522857e2c5.jpg"
    },
    {
        "podcast_id": 45776,
        "title": "And That's Okay",
        "description": "Here on \"And That's Okay\" we talk about all things different. With the help of my lovely guest speakers, we teach you that being yourself is the best thing you can be, no matter who that is. Everyone here knows what it's like to be different AND THAT'S OKAY!",
        "language": "en",
        "author_name": "Alyssa Hunsaker",
        "slug": "andthatsokay",
        "cover": "20210331_094457_c0d87726de0ade57c93c89602d9e6da0.jpg"
    },
    {
        "podcast_id": 45957,
        "title": "Enlivening Musings",
        "description": "Crystal and Katie muse around with all topics that range from women's wellness, sensuality, and everything that makes us feel lit up. ",
        "language": "en",
        "author_name": "Crystal Franco",
        "slug": "enliveningmusings",
        "cover": "20210401_031551_d477ba8018dc96bec890c690016f37fc.jpg"
    },
    {
        "podcast_id": 47254,
        "title": "Shit About Shagging",
        "description": "When you mix a brutally honest host - Zizi Siyolo - with an overload of romantic fumbles and bucket full of sexual curiosity, you get this relatable shit talk podcast about everything that goes down in the streets and in between the bedsheets. \nThis is the funny side of how to navigate dating, sex and love in young adult lives.",
        "language": "en",
        "author_name": "Zizi Siyolo",
        "slug": "shitaboutshagging",
        "cover": "20211004_202538_99f5fcdff826668a29b2c910538b8590.jpg"
    },
    {
        "podcast_id": 48208,
        "title": "The Birds & The Bees",
        "description": "A forum for people who are not part of the hetereonormative binary to talk openly & uninterrupted about human sexuality.",
        "language": "en",
        "author_name": "Susan Johnson",
        "slug": "thebirdsandthebees",
        "cover": "20210409_223947_5fcf84df43ff9b9b54ce5e32afd2510a.jpg"
    },
    {
        "podcast_id": 49095,
        "title": "Rowdy Rocca ",
        "description": "The podcast where we talk about everything the girls won’t tell you.",
        "language": "en",
        "author_name": "Sam Rocca ",
        "slug": "rowdyrocca",
        "cover": "20210910_144400_4a6f34c1fe4ec82698df5fe6454ec300.jpg"
    },
    {
        "podcast_id": 50071,
        "title": "I podcast di matrimoniocristiano.org",
        "description": "Podcast degli articoli tratti dal blog www.matrimoniocristiano.org",
        "language": "it",
        "author_name": "Antonio De Rosa",
        "slug": "segretocoppiafelice",
        "cover": "20210417_075051_e39d8721eb2107ddcd1b997d8312eef7.jpg"
    },
    {
        "podcast_id": 50407,
        "title": "Health Glow with Clo",
        "description": "Welcome to Health Glow with Clo , where Health is ALWAYS a MOOD! \nThis podcast is a fun, entertaining and enlightening look at health and fitness. No subject is off limits!  On this journey, we will debunk common myths, spill health care secrets and break generational health curses! \n\nYou can Find me at \nSocial : Instagram : chloe_v_\n\nAlways remember, A healthy glow comes from within!\n",
        "language": "en",
        "author_name": "Chloe Rolle",
        "slug": "healthglowwithclo",
        "cover": "20210418_204736_efe7294971b9177c302eb88773ec36ea.jpg"
    },
    {
        "podcast_id": 54144,
        "title": "The Rose Rambles",
        "description": "The Rose Rambles is a podcast where I, Angel Rose, do in fact ramble. Ramble about topics that I am passionate about with people I find interesting! Grab a coffee, tea or a glass of wine. Let's have a laugh and maybe a cry.",
        "language": "en",
        "author_name": "Angel Rose",
        "slug": "theroserambles",
        "cover": "20210503_184804_c1a918357a0edc7d0446b872aee88f5d.jpg"
    },
    {
        "podcast_id": 54239,
        "title": "The Kinky Hedon Podcast",
        "description": "The Kinky Hedon Podcast explores Black Sex Culture, Black Sex Ed, and the Lifestyle as it pertains to kinks, fetishes, and paraphilias within the Black Community. We will be talking to anyone no matter how they identify; queer, straight, non-binary, or otherwise because everyone has their own unique experiences. \n\nJoin us as we learn and educate one another.   @TheKinkyHedonPodcast",
        "language": "en",
        "author_name": "G. R. Hedon",
        "slug": "thekinkyhedonpodcast",
        "cover": "20210504_022538_b91e3e07c5d3102117385796d3fdbe06.jpg"
    },
    {
        "podcast_id": 55043,
        "title": "Let Me Be Blunt ",
        "description": "Blunts, bottles, and two LA best friends telling the filthy truth. ",
        "language": "en",
        "author_name": "Blaque Diamond & Miss Raine ft. Producer Phillip",
        "slug": "letmebeblunt",
        "cover": "20210507_134404_7fc6b37c1691d6b5180a0d9007ab1973.jpg"
    },
    {
        "podcast_id": 55839,
        "title": "El Podcast de Celia",
        "description": "<p>Este podcast esta ahora en exclusiva en la plataforma de Podimo. Escúchalo y consigue 30 días GRATIS a través del siguiente link 👉<a href=\"https://go.podimo.com/celia\"> https://go.podimo.com/celia</a> 👈 </p><p>Sabemos que en las relaciones no todo es coser y cantar, en este podcast divulgaré sobre relaciones, amor, pareja y otras cositas, por qué no. Para empezar con una pareja, primero tenemos que empezar por nosotros mismos, ¿te apuntas?</p>",
        "language": "es",
        "author_name": "Celia Betrian Roca",
        "slug": "el-podcast-de-celia",
        "cover": "20230614_020627_50970b41320d4fbf042b9b39d019ad50.jpg"
    },
    {
        "podcast_id": 55866,
        "title": "Never Have I Ever ",
        "description": "Hosted by Ariela Allen, \"Never Have I Ever\" is a podcast in which we tell crazy life stories and dive into the even crazier explanations behind them! Tune in every other Tuesday at 10am EST to listen to this week's episode and get your weekly adrenaline rush. ",
        "language": "en",
        "author_name": "Ariela Allen",
        "slug": "never-have-i-ever",
        "cover": "20210510_211025_30d9b080aad9205ad327b46fcd2897a5.jpg"
    },
    {
        "podcast_id": 62286,
        "title": "Ciseducation with Betsy & Bobby",
        "description": "Everything you’ve ever wanted to know about trans people but were too afraid to ask (and everything you’ve wanted to say to cis people but didn’t have the patience).\n\nEach week a trans woman sits down with her cisgender friend and has awkward conversations so you don’t have to.",
        "language": "en",
        "author_name": "Elizabeth Anne",
        "slug": "ciseducationpod",
        "cover": "20210929_133120_28ecc35c2c225e39551b12a7056c71d8.jpg"
    },
    {
        "podcast_id": 68133,
        "title": "Holy Ship",
        "description": "We are by no means experts in relationships, but something we wished we had growing up was the space in which to have meaningful, Christ-centered discussions surrounding various topics on maintaining relationships. \n\nWe will be covering all the topics surrounding relationships, not shying away from the awkward and uncomfortable topics. This is our way of opening a dialogue that many Christians, especially within church, tend to avoid. Because we are women discussions will be oriented for a female audience, but we believe many principals discussed apply to all.",
        "language": "en",
        "author_name": "Lydia Vreeman and Emma Roberts",
        "slug": "holyship",
        "cover": "20220303_020303_4dd50604c26c16bb0326b62532e480f4.jpg"
    },
    {
        "podcast_id": 69743,
        "title": "Let's Have The Humanity Talk",
        "description": "We're having the talk! Sex, human rights, wellness, and everything in between. Two hosts getting certified in the field of sexuality sharing conversations, and occasionally with field experts. A relatable, educative, and inclusive podcast.",
        "language": "en",
        "author_name": "Natalia Simo Fiallo",
        "slug": "letshavethehumanitytalk",
        "cover": "20210723_210911_3b4fdd239b58c081d77ce96792d13634.jpg"
    },
    {
        "podcast_id": 72155,
        "title": "Cinema Alterno",
        "description": "Cinema Alterno es un podcast de cine LGTBQIA+ que busca resaltar historias queer en la ficción y en la realidad. ¡Contáctanos para participar en próximos episodios!\n\nInstagram: @cinema.alterno\nDiscord: https://discord.gg/HPVc2pSy\nFormulario de participante: https://forms.gle/tnLYq1iMYRJdbHBFA",
        "language": "es",
        "author_name": "Cinema Alterno",
        "slug": "cinema-alterno",
        "cover": "20210902_011649_fc549dcdcbad2a3770ff12425e52e2b5.jpg"
    },
    {
        "podcast_id": 72924,
        "title": "This Is Not About Your Body",
        "description": "Welcome! This Is Not About Your Body is a podcast hosted by Jessi Kneeland that explores the intricacies of Body Neutrality, Body Positivity, and body image issues on the whole. ",
        "language": "en",
        "author_name": "Jessi Kneeland",
        "slug": "jessikneeland",
        "cover": "20210811_004418_4b623dc0768db31daaca3b9cdf75c6a1.jpg"
    },
    {
        "podcast_id": 75201,
        "title": "MachX Rehabilitacion",
        "description": "Información y entrevistas con perspectiva de género. Machx se escribe con X porque todos tenemos algo de machismo en el interior que nos urrrrrge cambiar.",
        "language": "es",
        "author_name": "Tamara de Anda",
        "slug": "machxrehabilitacion",
        "cover": "20210823_200533_090c81ef9cdd1fcac061f9e120d37712.jpg"
    },
    {
        "podcast_id": 76700,
        "title": "KurveUncensored",
        "description": "A video podcast that encourages open, honest and raw emotions and discussions.  We discuss, cry and laugh together; as we navigate around various obstacles we must deal with in this thing called life. ",
        "language": "en",
        "author_name": "Carolyn Hall",
        "slug": "kurveuncensored",
        "cover": "20210901_034459_eedc537032a31b59bcb936ddcab1e41e.jpg"
    },
    {
        "podcast_id": 78052,
        "title": "Sex and Sensuality: The Podcast",
        "description": " Join Meka Nicole along with her co-host Gigi as they discuss topics surrounding sex, relationships, and love. If you have questions that you'd like addressed on the show please email \nsexnsensualityshow@gmail.com. You will remain anonymous. \n\nFollow us on Instagram @sexsensualitypodcast.  Make sure to subscribe, follow, and share :-). Thank you for listening!\n\n",
        "language": "en",
        "author_name": "Meka Nicole",
        "slug": "sexnsensuality",
        "cover": "20210908_043939_3cb380c2c73813cf8bc9d68fdd0c0b90.jpg"
    },
    {
        "podcast_id": 79322,
        "title": "Only Being You Unfiltered",
        "description": "Hello! Thank you all so much for listening to Only Being You Unfiltered!\n\nOBY Unfiltered is a podcast that serves as a platform for all of us to discuss and listen to a wide variety of stories about issues that are quite prominent in the status quo. \n\nIf you would like us to cover a specific topic OR if you would like to be featured on our podcast, feel free to let us know! You can reach out to us through Instagram or through email!\n\nInstagram: @_onlybeingyou\nEmail: onlybeingyou@gmail.com",
        "language": "en",
        "author_name": "Only Being You",
        "slug": "obyunfiltered",
        "cover": "20210915_075421_fd77317af82947e40eb0d7198383c24a.jpg"
    },
    {
        "podcast_id": 80937,
        "title": "GEAR SHIFTS with Colstyn R. Edwards",
        "description": "Real life transitions, personal growth from challenges, and life/chaos management with some humor.",
        "language": "en",
        "author_name": "Colstyn R. Edwards",
        "slug": "gearshifts",
        "cover": "20210923_034756_13098416818b1fee0b620f0535a4457d.jpg"
    },
    {
        "podcast_id": 81756,
        "title": "Young, British and Black",
        "description": " Often, young black people’s experiences and views are presented as one dimensional, or a monolithic experience. Through conversations with ordinary young black British people, “Young, British and Black” paints a picture of the diversity of black British youth today. \n\nTo celebrate Black History Month, this podcast discusses the struggles and hurdles facing black youth, and also highlights the incredible joys of being young British and black, with four ordinary black British people aged 19-24.\n",
        "language": "en",
        "author_name": "Naked Politics",
        "slug": "nakedpoliticsuk",
        "cover": "20210927_114359_70bbfa76966a823a1f93e3d9e48b6c10.jpg"
    },
    {
        "podcast_id": 83852,
        "title": "Openly Spoken",
        "description": "<p>Welcome to Openly Spoken, the podcast to help you show up, speak out, and be seen. Here you'll get to eavesdrop on connected women's conversations about self love, confidence, healing, relationships, creativity, and more. Hosted by Cilia Antoniou, your guide to getting grounded into your body, feeling your full spectrum of emotion, and expanding to your fullest self expression.</p>",
        "language": "en",
        "author_name": "Cilia Antoniou",
        "slug": "openlyspoken",
        "cover": "20230422_070414_64e726eff87441a2d3c8eaf7e0524f84.jpg"
    },
    {
        "podcast_id": 83883,
        "title": "La vida desde una mirada existencial",
        "description": "Estos son los audios de los en vivos de la cuenta de Instagram de Ferexistencial. En colaboración con las personas que invito, dialogamos y abordamos diferentes temas con respecto a la salud mental, relación con el cuerpo, feminismo, salud sexual, etc. ",
        "language": "es",
        "author_name": "Fernanda Hernández",
        "slug": "ferexistencial",
        "cover": "20211007_183318_5e473ca86dae9a4e139fc9fa462949fb.jpg"
    },
    {
        "podcast_id": 84480,
        "title": "Kochaj zdrowiej",
        "description": "O tym jak kochać zdrowiej i zdrowieć kochając opowiadają psycholożki i edukatorki seksualne - Dominika Płachetka i Małgorzata Woźniak. ",
        "language": "pl",
        "author_name": "Gosia i Dominika",
        "slug": "kochaczdrowiej",
        "cover": "20211011_091217_226203cdb7c4ee74761e3ed2debe824b.jpg"
    },
    {
        "podcast_id": 84610,
        "title": "xHalfBakedx Podcast ",
        "description": "Join Victoria and Sarah on awkward conversations, weird situations, and alot of what the hells. Here we will talk about life in the sex industry, personal life, and topics everyone can relate to.",
        "language": "en",
        "author_name": "Victoria Bones and Sarah Ds",
        "slug": "xhalfbakedxpodcastx",
        "cover": "20211012_002627_39b1ceed13d0fe3efa8a9be9c263fd13.jpg"
    },
    {
        "podcast_id": 85073,
        "title": "Μίλησέ μου γι'αυτό",
        "description": "Μία παρέα που αναλύει θέματα για τις ανθρώπινες σχέσεις και όχι μόνο...πάντα με πολύ όρεξη, τρέλα και τις περισσότερες φορές με συντροφιά ένα ποτήρι κρασί, ή και όχι.\nSee you soon, στο επόμενο ΔΙΚΟ ΜΑΣ podcast-Μίλησέ μου γι'αυτό.",
        "language": "el",
        "author_name": "Antonia Rouchota",
        "slug": "milisemougiauto",
        "cover": "20220301_110313_b16307f8a640ac54121ed0e93e1a9473.jpg"
    },
    {
        "podcast_id": 87311,
        "title": "The Breaking Barriers Podcast, LLC",
        "description": "<p>The Breaking Barriers Podcast discusses hot topics, current events, and relationship issues. Join the conversation! New episode LIVE every Tuesday!</p>",
        "language": "en",
        "author_name": "The Breaking Barriers Podcast, LLC",
        "slug": "thebattlebuddies",
        "cover": "20230502_060543_1da120fb9dce56f2c756008090aa0dbf.jpg"
    },
    {
        "podcast_id": 88812,
        "title": "Séduis-moi!",
        "description": "Bienvenue à Séduis-moi!, le balado où on discute de tous les sujets qui touchent de près ou de loin à la sexualité! Prêt.es à en apprendre plus sur le plaisir?",
        "language": "fr",
        "author_name": "Boutique Séduction",
        "slug": "seduismoi",
        "cover": "20211104_154029_2ca89caa9ef68cba8a301a85ce692042.jpg"
    },
    {
        "podcast_id": 88814,
        "title": "PORNOLOGY",
        "description": "A Podcast analysing the good the bad and the camp of Porn and its sub-genres, ranging from the 80s craze of VHS B-movies and pompous Art House Eros to the deep ends of OnlyFans content. Pornology is brought to you by Unkanny  Mag (https://www.unkannymag.com/blog)\n(Instagram: @unkannymag)\nHosted by: Yevhen (Instagram: @yungyev) - Lulu (Instagram: @coolblockbustergirl)",
        "language": "en",
        "author_name": "Pornology ",
        "slug": "pornologybyunkanny",
        "cover": "20211104_154513_3d07ed0cfb1078f0a1d8f7410034e3e3.jpg"
    },
    {
        "podcast_id": 88853,
        "title": "The GrownFolks",
        "description": "Real, raw grown-folk conversations with Court & Lex.",
        "language": "en",
        "author_name": "Court & Lex",
        "slug": "thegrownfolks",
        "cover": "20211104_185126_13e5a18a72d77acf9603dcde91ae9336.jpg"
    },
    {
        "podcast_id": 89801,
        "title": "3 Stoned Idiots",
        "description": "\nHello, this is the ''3 Stoned Idiots Podcast'' where 3 good friends talk about life, actuality, dr*gs and share stories they've been through. \nBased in Montreal, we are a podcast full of stupid decision sparkled with derision and wrapped in love. \nWe hope you will enjoy listening to this podcast as much as we enjoy making it! ",
        "language": "en",
        "author_name": "Jacob Leclerc",
        "slug": "3-stoned-idiots",
        "cover": "20211110_014929_0d716e24f14dcca6fea7a501261d1d56.jpg"
    },
    {
        "podcast_id": 90904,
        "title": "We Can Still Be Friends",
        "description": "Interesting conversations with interesting people\nI cover all sorts of topics from things easy to talk about to others that are'nt so much. \nagree, disagree it doesnt matter after all we can have a differing opinion and \"We Can Still Be Friends\"!",
        "language": "en",
        "author_name": "Kye Michael",
        "slug": "wecanstillbefriends",
        "cover": "20220518_070542_4fcfd7eceb72912706f5e904993a90b4.jpg"
    },
    {
        "podcast_id": 95265,
        "title": "Lyt til din cyklus",
        "description": "Lyt til din Cyklus måske prøver den at sige noget vigtigt \n\nFor nogle år siden blev jeg nysgerrig på den kvindelige cyklus hvordan den fungere jeg var træt af at have følelsen af at være i krig med min hormon balance som igen igen trak mig rundt i manegen\nI min undersøgelse af hvem der vidste noget om emnet fandt jeg Doro Knudsen faldt med det samme for hendes måde at formidle og forsimple hvordan du kan bruge din cyklus lærer den at kende slutte fred med den måske ligefrem lærer et elske den \n\nHun indvilgede i at dele sin store viden ved at svarer på mine mange spørgsmål gennem en personlig samtale os imellem. Jeg havde lyst til at vi skulle optage samtalen så andre også kunne drage nytte af hendes store viden og smukke tilgang til cyklus bevidsthed det er blevet til 4 afsnit som afdækker den mest basale viden om kvindens cyklus hvis du ønsker at dyrke den og værne om det cykliske liv både som mand eller kvinde er denne podcast serie \n",
        "language": "da",
        "author_name": "Ida Sand Michelsen & Doro",
        "slug": "lyttildincyklus",
        "cover": "20211211_101212_9ba60275c71ef2fdd7164481e0aac292.jpg"
    },
    {
        "podcast_id": 96690,
        "title": "Thoughts I Have When I'm Driving ",
        "description": "<p>Hello! Welcome to my podcast, Thoughts I Have While I'm Driving. Whenever I am in the car, I always think and reflect about life changes and the world in general, so I figured, why not record it? This podcast is all about navigating the world as a 20-something-year-old. It covers topics from mental health, body image, college insight, and life post-grad.</p>",
        "language": "en",
        "author_name": "Natalie Scott",
        "slug": "youngadultperspective",
        "cover": "20230628_050646_4975c395e36d1be161bbb9c857c8cd56.jpg"
    },
    {
        "podcast_id": 97628,
        "title": "The Horny Jail Podcast",
        "description": "Just some real pals that like to talk about life in some problematic ways. Make sure to tune in, if only for a few laughs and some offensive jokes.",
        "language": "en",
        "author_name": "Christian Pohl",
        "slug": "thehornyjail",
        "cover": "20230113_090124_a98f92105964d238cf5341da6fdc1e1e.jpg"
    },
    {
        "podcast_id": 98716,
        "title": "She Said What She Said",
        "description": "#SheSaidWhatSheSaid is a fun, honest podcast fronted by a best friend duo who are willing to talk about (almost) anything and everything. From relationships to situationships to everyday life experiences, you can expect unadulterated girl talk with no filter that’s appealing to both men and women. We hope you enjoy the show!",
        "language": "en",
        "author_name": "She Said What She Said",
        "slug": "shesaidwhatshesaid",
        "cover": "20220311_060306_c8a916264f77ac685b7c299df8b5b348.jpg"
    },
    {
        "podcast_id": 100108,
        "title": "The Sister Channel",
        "description": "in this dutch podcast, we'll be creating a space where we'll discuss taboos we don't talk about too often, in a fun and casual way! from vaginismus to objectification, we'll discuss it all! :)\n\nnew episode every two weeks!\n\nlet your voice be heard at https://bit.ly/taboob-talk\n\n\n\n\n",
        "language": "nl",
        "author_name": "Quinty and Yoëlle",
        "slug": "taboob-talk",
        "cover": "20221115_031107_6de5e3b51b4d392aa18cdb3211899d16.jpg"
    },
    {
        "podcast_id": 100193,
        "title": "Queer Halftime",
        "description": "Join Bekah, Kelsey, and Paige as they don't talk about sports but do talk about all things queer! And maybe one day talk about sports, never say never.",
        "language": "en",
        "author_name": "Bekah, Kelsey, and Paige",
        "slug": "queerhalftime",
        "cover": "20220111_060155_ed2f26ad51b488e808e892960b6d86aa.jpg"
    },
    {
        "podcast_id": 100590,
        "title": "Cougar Bate",
        "description": "Listen to Ricky Pumpkinseed dive into unique facets of reality, exploring varying perspectives amongst the human theory of mind. Through intimate (not sexual) conversation, Ricky attempts to collect an archive of captivating information shared through the word of mouth. ",
        "language": "en",
        "author_name": "Ricky Pumpkinseed",
        "slug": "cougar-bate",
        "cover": "20220113_040106_04f0c581487eda6b062aee85d90cfc2a.jpg"
    },
    {
        "podcast_id": 100693,
        "title": "Sorry i Said That",
        "description": "A comedy podcast about relationships, sex and everything in between. Realistic takes on the male vs. female, single vs. married take on our human needs.\n\n@SorryiSaidThatPodcast",
        "language": "en",
        "author_name": "Abby Hammes & Issa Currie",
        "slug": "sorryisaidthat",
        "cover": "20220114_020112_13625d91a58e7eb326499ad8b5ae9370.jpg"
    },
    {
        "podcast_id": 100865,
        "title": "LOVEGODESSS Podcast with Katya Melvin",
        "description": "Welcome to Lovegodesss podcast. Here we help regular women like you embrace their sexual confidence, step into their power, take charge of their own life, and become the most beautiful and sexiest versions of themselves. Lovegodesss is a woman who unapologetically accepts herself without second-guessing. She breaks people pleasing patterns and reclaims her independent power to become  the most authentic and confident version of herself.",
        "language": "en",
        "author_name": "Katya Melvin",
        "slug": "lovegodesss",
        "cover": "20220114_080106_ea2bfd4a28dbe06fe4fd0388ecded294.jpg"
    },
    {
        "podcast_id": 103653,
        "title": "Balanced & Empowered Fitness Podcast",
        "description": "<p>Hannah is the owner and head coach of Team PPF, an authentic Fitness Coaching Company that has successfully impacted and transformed over HUNDREDS of lives. Helping women find happiness/confidence through fitness and living a healthier lifestyle. Along with that, Hannah has years of experience in the Fitness Industry and shares her personal views of the industry and obstacles she has overcome to bring awareness on what it really entails to reach your fitness goals. The Balanced &amp; Empowered Fitness Podcast brings REAL insight on how to live a healthier lifestyle, train smarter, improve nutrition, reach your fitness/body goals, overcome obstacles you may encounter, and improve your mental/physical health!</p>",
        "language": "en",
        "author_name": "Hannah Polly ",
        "slug": "thiccfit-fitness",
        "cover": "20230511_050514_78621d419599c97c4b95f7db39dd903a.jpg"
    },
    {
        "podcast_id": 105327,
        "title": "The Kinky Podcast",
        "description": "Welcome to the Kinky Podcast, hosted by Derrick Monnie.\n\n\nA Dating Coach, a Sex Educator, and a Non-Monogamous Relationship Expert, Derrick Monnie will be your Carnal Concierge as we discuss polyamory, throuples, swinging, threesomes, BDSM, role-play, exploring kinks, self-confidence, and any other hedonistic pleasure you can think of.  \n\n",
        "language": "en",
        "author_name": "Derrick Monnie",
        "slug": "thekinkypodcast",
        "cover": "20220220_100220_22429d4cf641d5db37449125026e4eba.jpg"
    },
    {
        "podcast_id": 107355,
        "title": "Sapphire's $#!T Show : Men's Mental Health Podcast",
        "description": "Let's talk about Men's Mental Health. \nThis subject is near and dear to my heart because I love the men in my life, and I have 3 little boys I hope to raise into awesome healthy grown men one day! \nIn this podcast I would like to spread awareness of the struggles of men, provide guys with advice and information on where/how to find help, and also to hopefully help women understand the way men think and that they are only human to. We will discuss topics like Dating, Depression, Anxiety, Personality Types, and of course Porn.\nThis will be a Judgement Free zone. I want us to get very Real and have opinions, questions, and input from all people, though I want to focus on the Male perspective. No right or wrong answers guys, Let's just start the discussion!",
        "language": "en",
        "author_name": "Sapphire Slate",
        "slug": "sapphireslate",
        "cover": "20220208_050244_5bc39bb399683c4bc539c33dd6452bf0.jpg"
    },
    {
        "podcast_id": 107510,
        "title": "The (Dam)n Podcast",
        "description": "Welcome to the (Dam)n Podcast! We’re just two women in our early twenties just trying to figure this life shit out, so grab a glass of wine with us and tune in because shit is just getting started !! 🎙💜",
        "language": "en",
        "author_name": "Dayna J Francois and Mikayla Lexsus",
        "slug": "damnpodcastofficial",
        "cover": "20220209_070223_263fef6f0514f655be49acdab108b1c5.jpg"
    },
    {
        "podcast_id": 107900,
        "title": "That's Sus",
        "description": "A new podcast created by two college student's with the realest shit you've ever heard. ",
        "language": "en",
        "author_name": "Sydney and Elle",
        "slug": "thatssus",
        "cover": "20220213_110218_86c6a36ce515c8bec6e70d5cad6565a1.jpg"
    },
    {
        "podcast_id": 107958,
        "title": "Good Romance",
        "description": "A podcast featuring host Rachel, and your favorite romance writers, as well as members of the Romancelandia community. We have a two-person book club to discuss one of our guest's favorite romance books, and talk tropes, favorite authors, and pet peeves. ",
        "language": "en",
        "author_name": "Rachel Finston",
        "slug": "goodromance",
        "cover": "20220211_010215_27e4a5e6a49c380e7f2a9ce02ff16e8b.jpg"
    },
    {
        "podcast_id": 109016,
        "title": "Soul Refiner Live",
        "description": "Whether you're struggling with sexual addiction, fighting for your marriage, need healing from trauma or betrayal, or looking for answers in parenting, etc.,  Soul Refiner was created to deliver biblical and science based truths to help renew the mind and transform the heart.",
        "language": "en",
        "author_name": "Soul Refiner",
        "slug": "soulrefiner",
        "cover": "20220412_020428_8c79e637d675f2ca1d5ad24babc1b204.jpg"
    },
    {
        "podcast_id": 109795,
        "title": "dubsahara",
        "description": "Psychedelic journeys in sound sequenced by Greg Hunter. ",
        "language": "en",
        "author_name": "greg hunter",
        "slug": "dubsahara",
        "cover": "20220226_100201_87210cca61dddc2fbcbfb94ea59c41e0.jpg"
    },
    {
        "podcast_id": 109990,
        "title": "Killin' Time Productions",
        "description": "Killin' time productions produces two podcasts. The War Room- The War Room is a podcast about nothing! You will learn nothing and gain nothing! What you will do, is laugh! Whether it be under your own power…. Or forced\n\nThe Arc of Rock- Take a journey thru the history of rock and roll with yours truly Jared Cornelius ",
        "language": "en",
        "author_name": "Killin' Time Productions",
        "slug": "ktp",
        "cover": "20220222_030239_05109bdc39a05afb207f507d57aa63e7.jpg"
    },
    {
        "podcast_id": 110350,
        "title": "Perseenmyynnin päiväkirja",
        "description": "Perseenmyynnin päiväkirja starttaa! Kerron tässä podcastissa suoraan mitä suljettujen ovien takana tapahtuu. Aiheena seksityö sekä aihealueen ympärillä pyörivät asiat.",
        "language": "fi",
        "author_name": "Melissa Sten",
        "slug": "perseenmyynninpaivakirja",
        "cover": "20220221_030217_4345ec8664d742f0800fb06bb32a225a.jpg"
    },
    {
        "podcast_id": 110511,
        "title": "PorNofenderte",
        "description": "PorNofenderte, nace de la facilidad que tenemos para contar todo aquello que ofende y que a veces nos prohíben hablar, queremos compartir todo los temas que se nos vayan cruzando en el camino, como noticias, datos curiosos, anécdotas y alguna que otra metida de pata en nuestra vida.",
        "language": "en",
        "author_name": "PorNofenderte",
        "slug": "pornofenderte",
        "cover": "20220317_110330_d91e177defadca0c08c0b8f5fe4a0a91.jpg"
    },
    {
        "podcast_id": 111202,
        "title": "How Much Is Too Much?",
        "description": "A podcast where I will be talking openly and vulnerably about my own life experiences and topics that are typically considered taboo to discuss. Pushing the envelope of how much is too much to admit and talk about while letting no bs honesty lead the conversations. \nHow Much Is Too Much? We are about to find out.",
        "language": "en",
        "author_name": "Alisha Taylor",
        "slug": "howmuchistoomuch",
        "cover": "20220224_070227_742b53daa1616daea48af9b62335e47e.jpg"
    },
    {
        "podcast_id": 111206,
        "title": "Rainbow Room",
        "description": "Our podcast on writing, representation, and gay stuff!",
        "language": "en",
        "author_name": "Andrew Stier and Erik Martinez",
        "slug": "rainbowroom",
        "cover": "20220329_050300_0ab81beaee3965ec8ad9795d7a6553b2.jpg"
    },
    {
        "podcast_id": 112630,
        "title": "Estúpido, Sensual y Delicioso Podcast",
        "description": "Es un pódcast para hablar de placer y erotismo, temas prohibidos buscando controlar a las personas. \nEsta prohibición genera miedos, ignorancia, culpas, sufrimiento, doble moral y violencias.\nAcepta la invitación a explorar las profundidades del inframundo erótico y transformemos nuestro erotismo con un intercambio de miradas y vivencias. \nSomos: Antonio Trujillo y Pilivet Aguiar, educador sexual y psicóloga... acompáñanos a descubrir los caminos del placer.",
        "language": "es",
        "author_name": "Antonio Trujillo & Pilivet Aguiar",
        "slug": "estupido-sensual-y-delicioso",
        "cover": "20220401_110458_a26cf403409b4be4fa413c95f89861b9.jpg"
    },
    {
        "podcast_id": 115248,
        "title": "High & Bothered",
        "description": "Talking highly about things that bother us and trying (mostly failing) to stay on topic! \nFollow us on Instagram @highnbothered and DM us your topic suggestions! ",
        "language": "en",
        "author_name": "Courtney J Miller",
        "slug": "highnbothered",
        "cover": "20220315_120304_7526f7e77a5f9be7ad05bfe8358448a2.jpg"
    },
    {
        "podcast_id": 115472,
        "title": "Art of Undress",
        "description": "The Art of Undress explores the ideas of undress by exploring through a 8 episode podcast series looking at undress in conjunction with sex, identity, society and habits. The conversations will be lead with guests from photographers that use undress in their art work, people that work within the industry of fashion, to close friends and family. Gaining a broader perspective and allowing the primary research to be guided through the eyes of those that are in conversation with. \n          ",
        "language": "en",
        "author_name": "Ethan Goodchild",
        "slug": "artofundress",
        "cover": "20220315_110307_f05faaba5472ad21186683c71b56a6ee.jpg"
    },
    {
        "podcast_id": 115783,
        "title": "The Down Bad Show",
        "description": "The show where we help down bad guys find a baddie",
        "language": "en",
        "author_name": "Jimmy Zhang",
        "slug": "downbadshow",
        "cover": "20220317_080301_84d28884343098d7af25bdf24cb60aea.jpg"
    },
    {
        "podcast_id": 116320,
        "title": "Café with Strangers",
        "description": "Join me on a journey in sharing stories from people navigating life as a latine in America. And yes, caffeine is involved.\n\n",
        "language": "en",
        "author_name": "Monica Moreno",
        "slug": "cafewithstrangers",
        "cover": "20220410_050431_79b0b3c12ea0ce3033437b0939cd2019.jpg"
    },
    {
        "podcast_id": 116857,
        "title": "bare fruits ",
        "description": "bare fruits is a monthly-ish conversation about queer literature, hosted by Rosie Haward and Georgie Sinclair. In each episode we foray into the lives and loves of our favourite characters, a book's themes, ideas, and the writing itself. Then we conclude with a segment on TV, where we gossip about the shows we’ve been watching.",
        "language": "en",
        "author_name": "Rosie Haward and Georgie Sinclair",
        "slug": "bare-fruits-podcast",
        "cover": "20220322_100339_f307bc24506619b6dba4ad98d1c19d1d.jpg"
    },
    {
        "podcast_id": 117111,
        "title": "OU3A - أوعى ",
        "description": "أوعى! هو البودكاست الذي يركز على القضايا السياسية والاجتماعية التي تخص افراد مجتمع الميم عين في لبنان والشرق الأوسط. هذا البودكاست من انتاج وتقديم منظمة حلم في لبنان، يهدف الى نشر الإدراك ومحاربة الخرافات التي تتعلق بحياة وحريات افراد مجتمع الميم عين. نبحث من خلال هذا العمل مع ضيوف متخصصين بمجالات مختلفة كيفية انتاج \n سياسات وقوانين دامجة للمجتمع الكويري وكيفية الحشد لخلقها ضمن أطر تنظيمية ونضالية واستراتيجيات واضحة على مختلف الأصعدة التي تتعلق بحقوقنا المدنية والسياسية والاجتماعية والإقتصادية",
        "language": "ar",
        "author_name": "Helem - حلم",
        "slug": "ou3a",
        "cover": "20220323_010300_ac001126405dfe5578a249300492590e.jpg"
    },
    {
        "podcast_id": 117164,
        "title": "HABLANDO DE…",
        "description": "En este espacio vamos a estar hablando LAS COSAS CÓMO SON. La verdad detrás de mejorar la relación con nosotros mismos, con los demás, el amor, el trabajo, los amigos, la familia, la conciencia y la vida. Con un bonus en entender el mundo en que vivimos; la física, la química, la filosofía, la política y la psicología. ",
        "language": "es",
        "author_name": "Maria Paula Salinas",
        "slug": "mariapaulasalinasg",
        "cover": "20220323_050320_213a76b6b168f05096f96dec0ababcfe.jpg"
    },
    {
        "podcast_id": 117539,
        "title": "Life In Colors",
        "description": "The good, the bad and the ugly all in one place. Welcome to Life in Colors, a podcast created by Maggie Mae to show all the colors of life. Maggie is a 22 year old living the  post graduate life in Tampa, Florida. Follow along as she navigates her 20s and learn from her wins, losses and everything in between. Whether she's getting free drinks or somehow on a yacht, she's taking life one color at a time. ",
        "language": "en",
        "author_name": "Maggie Mae",
        "slug": "lifeincolors",
        "cover": "20220329_120359_3ca5c18166159d26cefb08fdf9de19db.jpg"
    },
    {
        "podcast_id": 118123,
        "title": "Totally Not Unhealthy",
        "description": "The premise being real, raw, unscripted conversations with everyday people. We’ll discuss the very real things that shape who and what we are, along with a multitude of subjects such as but not limited to; love, sex, psychology, drugs, spirituality, aliens, energy, etc. In essence, it’s time to do away with surface level bullshit and share genuine conversations about what’s really going on in our lives.",
        "language": "en",
        "author_name": "B",
        "slug": "totallynotunhealthy",
        "cover": "20220327_100303_3f32388067b5f92bf77a70e2fbf209fa.jpg"
    },
    {
        "podcast_id": 118899,
        "title": "Smut Sluts Book Podcast",
        "description": "Girls who love to talk smutty books \nNew episodes released biweekly \nYoutube/Instagram/TikTok @SmutSluts.BookPodcast",
        "language": "en",
        "author_name": "Smut Sluts Book Podcast",
        "slug": "smutslutsbookpodcast",
        "cover": "20220407_020407_3766a63764a4c00931d57ba4fc36ca0e.jpg"
    },
    {
        "podcast_id": 119174,
        "title": "Christian Pedophile",
        "description": "We are Christians who also happen to experience pedophilia. We have an unwanted and involuntary attraction to children, but we have decided to obey Christ and not act according to those feelings. In no way do we condone sexual involvement with children. It is inherently harmful and is not what God wants for our sexuality.\n\nWe are part of the family of God, and we know that he loves us. God isn't stumped by pedophilia. He's able to lead us to the victory Jesus won on the cross. He can bless us, and make our lives wonderful stories. Our desire is to share the Gospel with others who experience pedophilia, and the hope of freedom and new life that Jesus offers.\n",
        "language": "en",
        "author_name": "Christian Pedophile",
        "slug": "christian-pedophile",
        "cover": "20220401_020409_6dc0b9aa6af07f82a7719a6cc78d9abf.jpg"
    },
    {
        "podcast_id": 119493,
        "title": "Missionary Qweens Podcast",
        "description": "<p>Two women talking about sex, sexuality, fetishes, kinks, likes, dislikes, and everything else under the sun. We discuss as we get high and drunk with some episodes featuring guests. Email us at missionaryqweens@gmail.com for topic requests, questions you need help answering or just to comment. We love to hear from our listeners!! &lt;3 Follow us on Instagram, Facebook and TikTok for updates. If you would like to donate, please click the donate button and you will be redirected to our GoFundMe page. Thanks for checking us out!</p>",
        "language": "en",
        "author_name": "Tanisha/Grace",
        "slug": "missionaryqweens",
        "cover": "20221231_091257_adae7f176bdd8afc20e35037e50d5134.jpg"
    },
    {
        "podcast_id": 120340,
        "title": "Quarter Life Strife",
        "description": "A podcast on everything under the sun about nearing your late twenties. Your hosts, Mel and Megan talk good and bad relationships, dating, life goals, juggling career, living with friends, and the crème de la crème of turning 25... unlearning our childhood trauma. \n\nJoin us for passionate stories, upbeat laughs and a thoughtful outlook on a wild and messy time in our lives.",
        "language": "en",
        "author_name": "Megan and Mel",
        "slug": "quarterlifestrife",
        "cover": "20220509_010510_0180a76c50b416174360faa87cf8211c.jpg"
    },
    {
        "podcast_id": 120344,
        "title": "Vi bliver mennesker - en Podcast serie om at være menneske sammen ",
        "description": "Find et godt sted for dig at lytte med. \nMåske på din vej gennem byen, måske et stille sted hvor unger og andre små og store behovsdyr ikke kan nå dig. \nMåske i en pause fra noget af det, livet er fyldt med, og som du glæder dig til at vende tilbage til når du har lyttet\n\nDit sted. Dit tempo. Din plads. Der hvor du har det lækkert. \nDenne podcast må gerne nydes. Det hele er til dig.\nFordi den handler om dig. Og den handler om os. Hvordan vi er mennesker. Sammen.\n\nVelkommen på tur i det lækre, det grimme, det svære og det nære i det at være menneske; alene og sammen. \n\nI den her serie vil jeg sammen med en flok dejlige mennesker undersøge hvordan vi kan bruge Human Design, astrologien, vores måder at relatere på gennem nervesystemet og alt det sjove og besværlige bagage vi har med fra gode og dårlige tider i vores liv.\n\nVi bliver mennesker - En Podcast serie om at være menneske sammen \n\n\nVil du vide mere så findes jeg på insta: \nkristabellamidwife\n\nOg Facebook:\nwww.facebook.com/humandesigninmotion\n\n\nFor en læsning kontakt mig på humandesigninmotion@gmail.com",
        "language": "da",
        "author_name": "io hultén",
        "slug": "rebirthtobefree",
        "cover": "20220602_080641_f43b2ddff653ffbc49fbdb151654110c.jpg"
    },
    {
        "podcast_id": 122519,
        "title": "Cool vibes podcast ",
        "description": "We bring people fun & wild stories to uplift their mood ",
        "language": "en",
        "author_name": "Demetrius shair",
        "slug": "coolvibes",
        "cover": "20220518_010552_2819163e5bf9e1e14587d82e84259137.jpg"
    },
    {
        "podcast_id": 123398,
        "title": "Adventures Of The Soul ♥️ ",
        "description": "Activations, Meditations, Ceremonies, Sacred Sexuality, Affirmations and Spirituality - To add to your sacred space and create specials rituals and ceremonies for you to dive into! \n\n🌈 🕊♥️",
        "language": "en",
        "author_name": "Zoey Mayenburg",
        "slug": "adventuesofthesoul",
        "cover": "20220420_080414_d78e64a4eeb629bf92a07a0883182d1a.jpg"
    },
    {
        "podcast_id": 124688,
        "title": "Snatched! By Vivent Health",
        "description": "SNATCHED! A podcast discussing safe sex, LGBTQIA+ news, HIV care and Prevention in ways that anyone can understand. ",
        "language": "en",
        "author_name": "Vivent Health Prevention St. Louis ",
        "slug": "snatched",
        "cover": "20220928_050951_8d47cb594b1c1da1935e7649d6ef5e2e.jpg"
    },
    {
        "podcast_id": 126231,
        "title": "Into the Light",
        "description": "Our names are Braylen Drew and Aaron Stanger and we created this podcast to share stories of empowerment and clarity regarding the gray area around sexual topics and mental health in modern-day culture within The Church of Jesus Christ of Latter-Day Saints! We're so happy you're joining us in the quest for more open and meaningful conversations! ",
        "language": "en",
        "author_name": "Braylen Drew and Aaron Stanger",
        "slug": "intothelight",
        "cover": "20221018_101032_4197e3916a043255c3e3b28c0c8fe87b.jpg"
    },
    {
        "podcast_id": 127066,
        "title": "Raw Dawg Productions",
        "description": "Welcome to Raw Dawg Productions…the wildest, the realest, most uncut, Grown Folk Podcast You Will Ever Hear, PERIODT! RDP is a group of friends that come together every week to laugh, joke, and talk trash about EVERYTHING from relationships to our personal preferences in the RAWEST form. We ask that you relax, take a break from life, and come join us each week as we deliver our insight and drunken perspectives on life as we try to answer letters written by our faithful listeners and discuss the CRAZIEST topics you could ever imagine. Trust us, you WILL NOT be disappointed by this group of jackasses.  ",
        "language": "en",
        "author_name": "Raw Dawg Productions",
        "slug": "raw-dawg-productions",
        "cover": "20221222_121248_27f810feada742bb168d7b1ee5bc2574.jpg"
    },
    {
        "podcast_id": 127304,
        "title": "Tutto un altro genere",
        "description": "Dodici studenti di liceo e un docente intraprendono un viaggio in sei tappe alla scoperta degli studi di genere.",
        "language": "it",
        "author_name": "Giorgio Scrofani",
        "slug": "tuttounaltrogenere",
        "cover": "20220509_030519_494fe996214bb44c35a72e9c6a735a53.jpg"
    },
    {
        "podcast_id": 127599,
        "title": "The History of Everything Sex",
        "description": "Something entertaining...a little bit educational....something fun and funny....not too vulgar to be offensive, but just vulgar enough....and focusing on our favorite subject.",
        "language": "en",
        "author_name": "Melinda and Teri",
        "slug": "thehistoryofsexpod",
        "cover": "20220510_090516_2a18f2fe461bcd8e5259da70d73b4bf8.jpg"
    },
    {
        "podcast_id": 127719,
        "title": "The Real Reel Podcast",
        "description": "An indecisive girl's guide to living her best life",
        "language": "en",
        "author_name": "Jessie and Sarah",
        "slug": "realreelpodcast",
        "cover": "20220511_030526_5fd9de091492463fb85eebb78b927a22.jpg"
    },
    {
        "podcast_id": 127901,
        "title": "Nontoxic Pod",
        "description": "black owned and produced\nOn unceded turrbal and yuggera land\n✨for black aussie women and lqbtq+ bipoc folks alike meeting together and talkin trash ✨\n",
        "language": "en",
        "author_name": "Nontoxic Pod",
        "slug": "nontoxicpod",
        "cover": "20220601_070645_8a05050290f6eda4592a8f338bf5e452.jpg"
    },
    {
        "podcast_id": 129691,
        "title": "Movimento Pan Siena",
        "description": "Il podcast del Movimento Pan Arcigay Siena.\n\nContiene la rubrica Alfabetizzazione, di approfondimento tematiche queer, e la rubrica Siamo sempre stat3 quee (r), che racconta la vita di personaggi lgbt della storia.",
        "language": "it",
        "author_name": "Movimento Pansessuale Arcigay Siena",
        "slug": "movimentopansiena",
        "cover": "20220606_100657_db00e0f53c416b9ae2c625046277bd2d.jpg"
    },
    {
        "podcast_id": 130138,
        "title": "Don’t Yuck My Yum",
        "description": "A podcast where I’m joined by different guests within my social circle in the kink community. I wanted to start this podcast because I found a lack of related content out there that isn’t just for shock value. I want to provide a platform for people within the kink community to speak their truth, and hopefully reduce the stigma around some of the non-mainstream kinks out there. ",
        "language": "en",
        "author_name": "Andrew Mok",
        "slug": "dymy",
        "cover": "20220524_040524_bbd4163928b6d3fce2fed1567e74fa6d.jpg"
    },
    {
        "podcast_id": 131449,
        "title": "Sexymonios",
        "description": "www.patriciaalvarez.online/sexymonios\n\nLa sexualidad es una parte sumamente importante de nuestra vida, la podemos anular, evadir, manipular, olvidar o minimizar pero eso no la hará desaparecer. ¿Qué mejor que tomar las riendas de tu sexualidad?\n",
        "language": "es",
        "author_name": "Patricia Alvarez",
        "slug": "sexymonios",
        "cover": "20220531_100500_bc116fa4b936df9a1f21859aad89f15b.jpg"
    },
    {
        "podcast_id": 131645,
        "title": "Tikva Talks",
        "description": "In an effort to provide resources for those facing infertility and to educate the broader community, Yesh Tikva launched “Tikva Talks,” a set of conversations with field experts about issues surrounding infertility and reproductive health.\n\nTraditionally, reproductive health is not a subject publicly discussed in the Jewish community. Tikva Talks allows Yesh Tikva to openly discuss the topic, while also raising awareness and sensitivity.\n\nSome of the topics we’ve covered include:\n\nMen and infertility\nImpact of infertility on sexual intimacy\nMaintaining relationships \nThe challenges of Mikvah (ritual bath)\nIf you would like us to cover a topic not yet discussed in previous Tikva Talks please contact us!",
        "language": "en",
        "author_name": "Yesh Tikva",
        "slug": "tikvatalks",
        "cover": "20220601_100629_f0f338a389d928203fe1023b6e7b9f40.jpg"
    },
    {
        "podcast_id": 132283,
        "title": "Down to Heal ",
        "description": "Healing can be hard to do alone. That’s why I am here with you! Bringing you advice from my experience, sharing the lows and the highs, and connecting with you!",
        "language": "en",
        "author_name": "Jordaine Penaflor",
        "slug": "downtoheal",
        "cover": "20220610_030633_e245bd7b66e38523078ad830b8ecd548.jpg"
    },
    {
        "podcast_id": 132427,
        "title": "Twin Flames Read",
        "description": "Tilted and Vic are two amateur voice actors who find joy in trying new voices. \n\nEvery week they will each choose a NSFW/Smut script offer for the other host to read with absolutely no preparation. The rest of the show is spent trying to read these scripts without fully crying with laughter. \n\nTwin Flames Reads attempts to be the  perfect combination of sexy, funny, and incredibly entertaining. ",
        "language": "en",
        "author_name": "Victreeon",
        "slug": "twin",
        "cover": "20220606_010619_1ef0a62e9ca2b5ea65b012930e2343cb.jpg"
    },
    {
        "podcast_id": 132696,
        "title": "Meddlin' Gays",
        "description": "Meddlin' Gays features a pair of obnoxiously gay friends exploring the cultural zeitgeist of the modern world through the queer perspective! From coming out, content creation, social media, politics, and more, Katy and Chief break down the queer roots of it all with humor, self-deprecation, and stories that'll blow you away! Welcome to the Meddlin' Gays Podcast, where the gay don't quit, and neither do our mouths!\n\nWant to support our pod? Follow our socials: https://linktr.ee/meddlingays\nWant more of Chief? Follow their socials: https://linktr.ee/chiefkief\nHow about Katy? Follow her socials: https://linktr.ee/ChaoticKT\nWant to join our community? Join our Discord here: https://discord.gg/WSAfGqgWRD",
        "language": "en",
        "author_name": "ChaoticKT and ChiefKief",
        "slug": "meddlingayspod",
        "cover": "20220815_110849_92c3a55e6b2a594ab7b3666109e515e0.jpg"
    },
    {
        "podcast_id": 133398,
        "title": "ヴィーナスRadio",
        "description": "バルセロナからセックスコーチのおちさぎりがお届けする\n性から女性をエンパワーメントする番組です。\n　\n・人にはなかなか聞けない性やプレジャーのこと\n・自分らしい人生のベース！セルフラブのこと\n・オーセンティックで制限なしに輝く素敵なゲストへのインタビュー\n　\nをお届けしてまいります。\n　\n聞くだけで、自分の可能性をもっと信じてみようと思えたり\n「私はこんなものじゃない！」と制限を取り払ったり。\nそんなきっかけをお持ち帰りください。",
        "language": "ja",
        "author_name": "おちさぎり",
        "slug": "venus-radio-podcast",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 134207,
        "title": "Just Like Martin: A High Vibrational Podcast",
        "description": "Just Like Martin: A High Vibrational Podcast is hosted by Martin Cuevas. This weekly podcast explores effective ways to raise your vibration - mentally, physically, emotionally, spiritually, & sexually. Who said being spiritual cannot be playful? Turn up your frequency and tune in to Just Like Martin: A High Vibrational Podcast! New episodes every Wednesday. Hump days just got a whole lot better... & wiser!\n\nSubscribe and listen to Just Like Martin: A High Vibrational Podcast on Apple Podcasts, Spotify, Google Podcasts, or wherever you get your podcasts.\n\nConnect with me on Instagram: @martinjcuevas",
        "language": "en",
        "author_name": "Martin Cuevas",
        "slug": "just-like-martin",
        "cover": "20220614_040630_4c757b6a605bdca0a5638cfc529efbae.jpg"
    },
    {
        "podcast_id": 134627,
        "title": "Ope! I Did It Again Podcast",
        "description": "A podcast for Midwestern millennials who hate online dating, but don’t want to die alone. \nJoin friends Rachel and Tonya, two Midwestern single ladies, as they discuss everything from dating apps, boy bands, mental health, crushes, abortion and more! ",
        "language": "en",
        "author_name": "Ope! I Did It Again Podcast",
        "slug": "opeididitagain",
        "cover": "20220705_010718_9314df0a5f5f30075435c0d4a5ec577b.jpg"
    },
    {
        "podcast_id": 135943,
        "title": "CONVERSACIONES CON AMIGAS ",
        "description": "Conversaciones con amigas, un podcast de la puta y la santa",
        "language": "es",
        "author_name": "Conversaciones con amigas",
        "slug": "conversacionesconamigas1",
        "cover": "20220622_070600_5a886b5222b6269058cbab1f1c792904.jpg"
    },
    {
        "podcast_id": 135977,
        "title": "Sim.ply Be Podcast",
        "description": "Hi beautiful being! \n\nThis podcast is dedicated to all things spirituality, alternative healing modalities, and uncovering lost ancient wisdom. \n\nMy mission is to ponder life's greatest mysteries, share the love in my heart with you, and remind you that you are both the question & the answer - the seeker & the found. \n\nI truly believe that the freedom & liberation we all seek is an inside job, and that we all carry within us, the unique piece of the puzzle to unlock Heaven on Earth for our Selves & for All. \n\nTo do this, we must release the fear & conditioning that keeps us playing small and not stepping into our true authentic expression. \n\nAnd don’t get me wrong… I know that birthing a new reality is certainly not easy, but I do believe it can be simple. \n\nWith a deep breath, let's start Here & Now. \n\nAll my Love, \nSimin ",
        "language": "en",
        "author_name": "Simin Goudarzi",
        "slug": "sim-plybe",
        "cover": "20220622_010610_dbecd1b047429e60fffbf800b8364a20.jpg"
    },
    {
        "podcast_id": 136329,
        "title": "Sinners Podcast ",
        "description": "Sinners Podcast is all about exploring the unknown and divulging into our guests deeper inner thoughts and reality.\n\nDuring the sinners podcast we like to have an open and honest interview where there will be an atmosphere and a lot of conversation topped off with a whole load of laughter.  We intend to ask our guests questions out of the ordinary and get to know the real them. There's no right or wrong answers on our show. We are here to see our guests character and get to know more about them, the industry they work in and some of the experiences of life they have had.\n\nSinners Podcast is born from  its sinful parent Secret Sinners, an adult toy retail brand. Parts of Secret Sinners are implemented into the podcast adding to the excitement of the show!",
        "language": "en",
        "author_name": "Secret Sinners Productions ",
        "slug": "sinnerspodcast",
        "cover": "20220623_110653_2028526011402fda633f556d9d6b1793.jpg"
    },
    {
        "podcast_id": 137075,
        "title": "The Dirty Toy Box",
        "description": "(MA) Mature Audience..... A Mature podcast where two men talk about obscene topics that could lead to persecutions. If you are easily disturbed or offended by these topics please do not listen to this podcast. -Good Day",
        "language": "en",
        "author_name": "Sir Johnny and Mr. Cash",
        "slug": "thedirtytoybox",
        "cover": "20220718_040705_afbe16d11cf41d92e29dd27e0b07a8f1.jpg"
    },
    {
        "podcast_id": 137504,
        "title": "Agua Radial",
        "description": "Entrevistas tocando temas postmodernos",
        "language": "es",
        "author_name": "Andrea Hernandez",
        "slug": "aguaradial",
        "cover": "20220629_040651_a74494b1f4f32d326b51e744cccb4867.jpg"
    },
    {
        "podcast_id": 137666,
        "title": "The Open Conversation Podcast",
        "description": "This is a place for me to open up conversations around things we as humans all struggle with.\n\nI want to normalise our struggles and all the things we feel we have to hide from the world through fear of rejection so that we can all come together and fully embrace ALL of our humanity,\n\nFrom our mess to our beauty.\n\nWe are all one!\n\nMuch love,\nDan.",
        "language": "en",
        "author_name": "Daniel Reader",
        "slug": "theopenconversationpodcast",
        "cover": "20221110_111134_2fd916615638202bf96b7b50fbef0121.jpg"
    },
    {
        "podcast_id": 138160,
        "title": "Lace and Debauchery",
        "description": "Two hopeful-romantic romance booksellers get together to talk the trendiest tropes and the spiciest smut. Join Piper Dodds Lewis & Taylor Capizola as they catch you up on the best in love stories.",
        "language": "en",
        "author_name": "Lace and Debauchery",
        "slug": "laceanddebauchery",
        "cover": "20220702_070724_18d7a1f49d0318581f58b688eab290fb.jpg"
    },
    {
        "podcast_id": 138563,
        "title": "New Wave Relationships Podcast",
        "description": "Join Dale Sparage, the Love & Relationship Coach, on the podcast New Wave Relationships; about all things relationships! Dale will be joined by her podcast producer and co-host Sunny Hibbits, to discuss various topics on relationships in our new evolving paradigm. Dale and Sunny from different generations, sharing commonalities and differences in their perspectives on dating, creating a creative and active relationship dialogue. They will be discussing relationship to self, others, couples, singles, break-ups, dating, how relationships are changing and evolving: Post Covid, Post Digital, Post Me Too, Post no Roe versus Wade, finding love, losing love, creating lasting love, and lifestyle and much more! What’s new in relationships?\nThe NWR podcast is similar to a forum for relationships and we are open to having guests for discussion topics, along with answering questions from the audience, and even public coaching sessions on our show for others to benefit. Please email Sunny at sunny.nwrpodcast@gmail.com . Catch us on all our platforms via our Linktr.ee: https://linktr.ee/newwaverelationships\n",
        "language": "en",
        "author_name": "Dale Sparage & Sunny Hibbits",
        "slug": "newwaverelationships",
        "cover": "20220704_110734_157b505f4662ebb4ee333789db45069f.jpg"
    },
    {
        "podcast_id": 139574,
        "title": "Freunde der Nacht ",
        "description": "58 und kein bisschen weise.\nDepressiv und lebens(liebes)hungrig. \nNicht immer ernstgemeinte Erlebnisse aus meinem Leben. ",
        "language": "de",
        "author_name": "Bräsal",
        "slug": "freundedernacht",
        "cover": "20220711_120755_22e7b6d28aa84a9edccb5ff38c01c90a.jpg"
    },
    {
        "podcast_id": 139817,
        "title": "Ovarieasy ",
        "description": "Two chatty chicks talking about female topics from period poops to feminism. ",
        "language": "en",
        "author_name": "Yazi and Megan",
        "slug": "ovarieasy",
        "cover": "20220711_070740_9de24e6b16968e66931577938d90b05e.jpg"
    },
    {
        "podcast_id": 140526,
        "title": "Gay Converse with Gabe Kanae",
        "description": "OCD, ADHD and Anxiety riddled young-adult Gabe Kanae dumps his mentally exhausting conversations right into your ears with his new (and first) episodic podcast!",
        "language": "en",
        "author_name": "Gabriel Kanae",
        "slug": "gayconversegk",
        "cover": "20220921_070953_bb503281b414c22baa43ce5f0dfda4ab.jpg"
    },
    {
        "podcast_id": 140791,
        "title": "Not4Society",
        "description": "Not4Society is weekly Podcast, Produce by PIsmeProduction Hosted by Peter, Bidd and SeanBlex. We talk about pretty much anything that's happening in the world, anything that's trending on the internet, we speak a lot about relationship, marriage in general our podcast is about life.",
        "language": "en",
        "author_name": "Not4SocietyPodcast",
        "slug": "not4societypodcast",
        "cover": "20220716_060740_20f52a4c27b0f41268bab34657e75922.jpg"
    },
    {
        "podcast_id": 141263,
        "title": "The Girlo Group Chat",
        "description": "Conversations between 2 sisters, 1 in Ireland and 1 in Aotearoa New Zealand. We talk about all things you'd find in your Girls Group Chats so listen along and join us on socials! \nInstagram: TheGirloGroupChat\nEmail us on: thegirlogroupchat@gmail.com\n\nOur theme music is Heat Waves by Cloud System",
        "language": "en",
        "author_name": "Áine and Clare",
        "slug": "thegirlogroupchat",
        "cover": "20220719_100716_398917efbf4d30b3e95819fb2a689200.jpg"
    },
    {
        "podcast_id": 141428,
        "title": "Ej and the Caucacity ",
        "description": "Join my friends and I on fun, totally inappropriate would\nyou rather scenarios! Also follow us @EjandtheCaucacity\non Instagram feel free to Dm your would you rather\nscenarios or topics and they might get brought up on the\npod! Or email Ejandthecaucacity@gmail.com",
        "language": "en",
        "author_name": "Ej ",
        "slug": "ejandthecaucacity",
        "cover": "20220720_120707_5da455b88585ccae4ef1655e5082b3d5.jpg"
    },
    {
        "podcast_id": 142693,
        "title": "Ex BestFriends",
        "description": "Ex BestFriends is an unconventional podcast hosted by exes turned back into besties, Emily and Joseph. Each episode will dive headfirst into not only the dynamic of their relationship but various topics that are... a little all over the place - just like them. From their history together to past experiences and even people that came after their relationship, they will comically and openly give their insight. While this may be full of laughs and innuendos, it will also explore some deep and personal topics and touch on all the ways relationships can develop, grow and change over time and everything in between. Ex BestFriends will either leave you in deep thought or trying to make sure nobody can tell you're listening to two people talk about their sex lives - just depends on the episode! So, buckle up buttercup, we're about to bring you along for the ride. ",
        "language": "en",
        "author_name": "Joseph and Emily ",
        "slug": "exbestfriends",
        "cover": "20220818_050840_2c1d6a8b62c86b33cd54245f818224ec.jpg"
    },
    {
        "podcast_id": 143021,
        "title": "A Penny For Your Thoughts",
        "description": "You guys asked for it, so here it is. A podcast where I give my opinion on the most random topics, and hopefully get you to laugh too.",
        "language": "en",
        "author_name": "Penny Kimani",
        "slug": "apennyforyourthoughts",
        "cover": "20220731_030758_d03952be162ed9b74617e23aa3d0cb58.jpg"
    },
    {
        "podcast_id": 143188,
        "title": "Kinks and Chaos",
        "description": "2 crazy b!tches who love to talk books,sex & kinks!\ndark romance-forbidden-contemporary-taboo - all books welcome, nothing is off the table! \nSpecial guest authors, bdsm coaches, kink experts, spicy discussions, sex myth busting, hilarious stories and heaps of chaos! \n\n*Disclaimer*\n\nAll thoughts and opinions expressed during the podcast are that of the individual.\n\nWe aim to educate and open the discussion around bdsm, kinks and safe play however anyone wishing to explore further should always research thoroughly. \n",
        "language": "en",
        "author_name": " Kiki and Simone",
        "slug": "kinksandchaos",
        "cover": "20220728_110753_f4d5042bb699cd1784e40e5b52f9bf24.jpg"
    },
    {
        "podcast_id": 143548,
        "title": "Who wants to fit in anyway?",
        "description": "Hello, My name is Bec and welcome to my podcast - Who wants to fit in anyway? This podcast was birthed from a really special place, in a moment of complete surrender and transformation. It comes from a place of pure love for all that is in this wild world we live in. \n\nThe title for me represents a change in thinking, a change in being. Until not long ago I spent my life carrying around this feeling of never fitting in, self isolating, keeping my vulnerable side silent and afraid of completely owning who I am, rejecting myself before someone else could reject me. Mind you I didn't realise I was doing any of this in the moment. Self reflection and awareness what a beautiful thing! \n\nFor so long I craved that feeling of being accepted, of fitting in but what I didn't realise was that it was me who needed to accept myself all along. My intention for this podcast is to help people find their sense of peace, love, sexuality, pleasure and purpose as well as wholeness and appreciation for all that is.\n\nEveryone is welcome here. You are welcomed, love and accepted here. \n\nThis podcast is going to be fun, random, chaotic and full of #livelaughlove energy because thats who I am. \n\nConnect with me on my instagram @whowantstofitinanyway\n\nCant wait to connect.\n\nLater lovers,\nBec x\n\n",
        "language": "en",
        "author_name": "Rebecca McLaren-Stoddart",
        "slug": "who-wants-to-fit-in-anyway",
        "cover": "20221031_051030_f9bdf2682f54e3fcf9e13991e6d5c193.jpg"
    },
    {
        "podcast_id": 144040,
        "title": "Sex Therapy with Ms.Vicky",
        "description": "A podcast about sex, relationships, marriage & everyday life. Ms. Vicky & J.O The King’s advice is both hilarious & effective. It doesn’t matter where you are on your sexual path; whether you are a virgin, curious or a self proclaimed sexpert, this podcast will give you some amazing ideas to try with a partner...or at least a sex story to laugh at. If you want to hear an inclusive, open minded conversation from a young married polyamorous couple. This is for you. You are invited to step into their living room & hear everything from wild sexual endeavors to defining your marriage. Ms. Vicky & J.O The King want to help your relationship & sex life one orgasm at a time!",
        "language": "en",
        "author_name": "Sextherapywithmsvicky",
        "slug": "sextherapywithmsvicky",
        "cover": "20220802_010842_362e578c7b4cb092e6015bb19b8ffec8.jpg"
    },
    {
        "podcast_id": 144150,
        "title": "Vibe Talkin",
        "description": "An exciting new podcast about films with off the charts vibes - films from the Golden Age of Adult Cinema. Turn down the lights, turn up the vibes, and get down with your hosts Vic Terry & Manny Velazquez as they take you on a journey through some of the hottest films of all time. This is no ordinary podcast, this is Vibe Talkin!",
        "language": "en",
        "author_name": "Good Vibe Cinema",
        "slug": "vibetalkin",
        "cover": "20220803_020811_f169f8191e632d175e76938bc02e0417.jpg"
    },
    {
        "podcast_id": 146206,
        "title": "Bad B*tch Therapy",
        "description": "Follow Kimmy Tan and her bff Fanny in their daily conversations about love, dating relationships and so much more. Everybody needs therapy and sometimes that comes in the form of talking to people you love. Follow their journey as they navigate life's challenges and have fun doing it.",
        "language": "en",
        "author_name": "Kimmy Tan",
        "slug": "badbitchtherapy",
        "cover": "20220913_050944_87b6acfbf6b26b43a8d1f53f6083b005.jpg"
    },
    {
        "podcast_id": 146947,
        "title": "Fiction, Fan, and Otherwise",
        "description": "Longtime best friends discuss their recent and historic media, fan content, and pop culture obsessions. ",
        "language": "en",
        "author_name": "Chris and Crystal",
        "slug": "fictionfanandotherwise",
        "cover": "20220816_110834_6bd3b73ff99cff051128af617842e9d4.jpg"
    },
    {
        "podcast_id": 147542,
        "title": "podkastero kinkii",
        "description": "chupapimuñañimuniunmuninumu",
        "language": "es",
        "author_name": "Max",
        "slug": "elalfaeljefe",
        "cover": "20220819_040807_60f1006c5aea96a58b2cf41f5b327c2e.jpg"
    },
    {
        "podcast_id": 148125,
        "title": "The Wives Table",
        "description": "A couple of wives sitting down over food and drinks discussing all things marriage, kids, love and everything in between. No one really talks about the other parts of marriage that happens after the wedding, so here we are. Discussing the taboo things of marriage and life.",
        "language": "en",
        "author_name": "KCM MAE",
        "slug": "thewivestable",
        "cover": "20220822_030849_23ef3f3d87b45f641077a25b78ec3132.jpg"
    },
    {
        "podcast_id": 148277,
        "title": "It's Cool",
        "description": "Hey! My name is Jazmine Cool, and in this podcast, I talk about queer things, mental health things, music things, political things, and whatever other things may come to my mind.",
        "language": "en",
        "author_name": "Jazmine Cool",
        "slug": "itscool",
        "cover": "20220823_060849_eacb62268e897b054ab69c6026982b27.jpg"
    },
    {
        "podcast_id": 149004,
        "title": "lieben",
        "description": "Ein Podcast rund um Lieben. Eine menschliche Fähigkeit, die wir wieder lernen dürfen. Sex kann auch reduziert werden - auf ein paar Körperzentimeter, auf ein heißes Abenteuer. Liebe kann nicht gebunden werden, sie ist frei. Nur wie können wir beides leben? Dr. Miriam Pobitzer, Psychologin, Mutter, Sexualtherapeutin formuliert für gesammeltes Wissen in kurzen Texten.",
        "language": "de",
        "author_name": "Miriam Pobitzer",
        "slug": "lieben",
        "cover": "20220826_100851_28b43d61b285c63886e155305e3db2fa.jpg"
    },
    {
        "podcast_id": 149816,
        "title": "The Vibe Project",
        "description": "<p>The vibez</p>",
        "language": "en",
        "author_name": "The Vibez",
        "slug": "halfnhalf",
        "cover": "20230112_030140_6df9c234bed9a1f6faa1ae9ee391cd04.jpg"
    },
    {
        "podcast_id": 150066,
        "title": "Ruff: kink & polyamory",
        "description": "It's ruff! kink & polyamory.\n\nJoin @penny_fool, @birdbrat, @puppeegirl + guests to talk about the highest quality munches, the lowest quality cheap meats, and the (weird and) wonderful world of relationship anarchy",
        "language": "en",
        "author_name": "Pennyfool",
        "slug": "ruff",
        "cover": "20220831_050858_5d9ab7c526d4687b42c8b48ae63711ce.jpg"
    },
    {
        "podcast_id": 150906,
        "title": "The Boy Becomes a Baby",
        "description": "This is a story about an orphan and midget that is taken in by a rich woman that turns him into her sweet baby girl on the pretext of him modelling her range of exclusive baby girl dresses. This is only the first episode of what will be a weekly story.",
        "language": "en",
        "author_name": "bABy Bunnykins",
        "slug": "thaiadultbabynursery-com",
        "cover": "20220903_090939_fa82bbc614c0284cd2b0b6da2cd1eb96.jpg"
    },
    {
        "podcast_id": 151065,
        "title": "Skeeping Camgirls ",
        "description": "Skeeping Camgirls è una divertente sbirciatina dietro le quinte del mondo della cam e delle performer di Skeeping! Ascolta le storie intriganti di cosa significa essere una cam girl.",
        "language": "it",
        "author_name": "Skeeping Model Coach",
        "slug": "skeepingcam",
        "cover": "20220904_050940_7a87d7fda4167b171e308cce49884460.jpg"
    },
    {
        "podcast_id": 151465,
        "title": "Love & Its Discontents",
        "description": "Love & Its Discontents is a podcast on the topic of LOVE and LOVE STORIES. \n\nStarting with Jeffrey Eugenides's claim, in My Mistress Sparrow is Dead, “Love stories, nearly without exception, give love a bad name,” the podcast will take you on a journey through literature from antiquity to contemporary stories, wrestling with notions such as romantic love and altruism, deep diving into ecstatic love and solidarity. It asks, Can love be examined like an object? What on earth is love? Where in the world is love? Are we born to love, born with a natural sense of certain things like goodness, and beauty? Is love, like Rumi said, perfect thirst? But most importantly it will follow the question: can there be love without love stories?\n\nThe host, Adnan Mahmutović is a Bosnian-Swedish writer and lecturer in English literature and creative writing at Stockholm University.\n\nIf you have a particular story you want to talk about send us your pitch to: lovediscontents@gmail.com.",
        "language": "en",
        "author_name": "Adnan Mahmutovic",
        "slug": "lovediscontent",
        "cover": "20220906_060918_1878a22a4765b6161cb172581d240b0f.jpg"
    },
    {
        "podcast_id": 151760,
        "title": "Das isch mini Stimm",
        "description": "Ich (Elio, trans / non-binary) nehme jeden Monat meine Stimme auf um meine Transition festzuhalten. Jede Folge ist in zwei Teile gegliedert. Im ersten spreche ich über meine durch Testosteron verursachten Veränderungen (nicht nur die Stimme) und im zweiten Teil über ein queeres Thema, welches mich zurzeit beschäftigt. Dabei möchte ich auch andere Personen, die Teil der LGBTQIA+ Community sind, zu Wort kommen lassen.\nIch spreche über meine eigene Transition und persönlichen Erfahrungen und nicht für alle trans Personen.",
        "language": "de-ch",
        "author_name": "Elio",
        "slug": "dasischministimm",
        "cover": "20220907_120916_a15d70ce26c7dd6a33e8a3ade932a6d0.jpg"
    },
    {
        "podcast_id": 151874,
        "title": "Queer Theory",
        "description": "This podcast is for Queer people by a Queer person, Bryn Brakeley. The host, Bryn, wants to bring a seat to the table for queer-identifying individuals. By reclaiming the slur, queer folks announce their presence in the LGBT+ community. Bryn aims to speak on what it means to be queer, queer vocabulary, and how to find your place in this world as a queer individual. Topics of discussion include honest and open coverage of pop culture, sex, therapy, and Bryn’s first hand experiences. \n",
        "language": "en",
        "author_name": "Bryn Brakeley",
        "slug": "thequeertheory",
        "cover": "20221228_071215_2ff3a17685256d9cd43d57717e4bd83a.jpg"
    },
    {
        "podcast_id": 152061,
        "title": "Undressed With Katie Moore",
        "description": "Welcome to Undressed with me Katie Moore. \n\nI marry the dirty with the divine to educate and empower vulva owners from across the world to come home to their bodies and reclaim the power of soulful sexuality. \n\nThis is the space where we spill the taboo tea on all things pleasure, intimacy, sex, healing and absolutely everything in-between! \n\nIt is through this podcast that you will start to unapologetically live an embodied, empowered, and erotic life. \n\nOh and the title speaks for itself, we will of course be naked! \n\nYou can find me @iamkatieemoore or reach out to info@katiemoore.co \n",
        "language": "en",
        "author_name": "Katie Moore",
        "slug": "undressed",
        "cover": "20220908_030903_40f21f42d98c0f9d4332687397d0b1e6.jpg"
    },
    {
        "podcast_id": 153294,
        "title": "Rigid Roosters",
        "description": "Rigid Roosters Podcast is a Lifestyle (Swinger/Poly) podcast, where the hosts, Cody and Chris, discuss all things lifestyle, mental health, comedy, and every other topic that is available for two guys to talk about!",
        "language": "en",
        "author_name": "Cody McCaskill and Chris Wariner",
        "slug": "rigidroosters",
        "cover": "20230131_090151_327d7d668d984ca05255e7a35ae6e454.jpg"
    },
    {
        "podcast_id": 153926,
        "title": "The Doctor The Therapist and The Coach",
        "description": "Anything goes in this unique podcast series from YO1 Radio as we bring together our host and lifestyle coach, Gemma Taylor, together with Dr Angela Wright and Therapist Colette Safhill for a no-holds-barred conversation on a whole range of topics and how they impact on our lives.\n\nIf you’d like to get involved with a contribution, comment or feedback on any of the episodes – or if you’d like to suggest a topic for a future episode, just send the team an email to dtc@yo1radio.co.uk",
        "language": "en",
        "author_name": "YO1 Radio",
        "slug": "yo1radio",
        "cover": "20220916_060937_1b42a0a9fd27c6679a3ed6e9d54b101a.jpg"
    },
    {
        "podcast_id": 154535,
        "title": "GGTV | GLITZ GLAM TV",
        "description": "<p>WELCOME TO #GGTV FROM | THE CHURCH OF GLAM. Glitz Glam TV, Is A Live Studio Audience Podcast From The Main Stage of The World Famous Urban MO's Bar &amp; Grill In The LGBTQAI District of San Diego | HILLCREST. A Vibrant Show With A Panel of Cast That Rocks. Entertainment, Local Events, Shows &amp; News To Wellness, Politics &amp; Simply What Rocking Social Media. With International Stars From Rupaul's Drag Race To The Mayor of San Diego Dropping In. Local Business Nightlife Owners, Mangers, Business Owners &amp; The Hottest San Diego Talent!</p>",
        "language": "en",
        "author_name": "Glitz Glam",
        "slug": "churchofglam",
        "cover": "20230206_040225_64cc08e903a80614e88a951401b2b3e1.jpg"
    },
    {
        "podcast_id": 155230,
        "title": "The Milf and Me",
        "description": "Join two lifelong friends who spent their primes of life as single parents stuck in the cesspool of online dating.  One got out, the other is still swimming. It's The Milf and Me Podcast!  Each week we bring you stories of Dating App disasters, casual encounters, and commentary on so-called \"love gurus\".  Check it out!",
        "language": "en",
        "author_name": "Antonio Palacios",
        "slug": "themilfandme",
        "cover": "20221116_051142_2ce117c5416a0188136c62ba2854e355.jpg"
    },
    {
        "podcast_id": 155298,
        "title": "You Like That?",
        "description": "We’re Claire and Catie, and we want to talk to you about old smut. Claire is a Golden Age skin flick enthusiast, and Catie is naughty film newbie. Each episode, Claire will make Catie discuss an old-but-new-to-her f*ck film, while Claire provides historical context and anecdotes.",
        "language": "en",
        "author_name": "Heavy Ghost Media",
        "slug": "youlikethat",
        "cover": "20220922_090928_b1fc7f345cba9c07939edfe551d81327.jpg"
    },
    {
        "podcast_id": 155626,
        "title": "Hypospadias Conversations",
        "description": "Were you or your child born with the urological birth defect hypospaidas? It is so common that one in 200 male babies are born with it—yet no one talks about it. Why? Because of the shame and stigma associated with its physical effects. It is time to end that stigma now! Learn how to you can live an emotionally positive life with hypospadias, whether you/your child has had repair surgery or not. Hear from advocates, parents and men about how they're living with hypospadias. Hosted by an adult man and a mom of a son born with the condition.",
        "language": "en",
        "author_name": "John and Bonnie",
        "slug": "hypospadiasconversations",
        "cover": "20221029_061034_768cb734bd6f000e188fc9d574ad95d8.jpg"
    },
    {
        "podcast_id": 155728,
        "title": "ברוכים הבאים לשיחת הטלפון שלנו",
        "description": "<p> </p>",
        "language": "he",
        "author_name": "hadass mizrahi",
        "slug": "welcome-to-our-phonecall",
        "cover": "20230607_040659_7d4414fd324ce355d171b7070102b780.jpg"
    },
    {
        "podcast_id": 157099,
        "title": "Reflexiones",
        "description": "Reflexiones que llegan a tu mente, sanan tu corazón y tu alma.\nLecciones de vida que le harán sonreír, reflexionar e inspirarse.\nCitas inspiradoras y motivadoras que te ayudan a ser mejor cada día.",
        "language": "es-mx",
        "author_name": "Magdalena Palafox Oficial",
        "slug": "magdalenapalafoxoficial",
        "cover": "20220930_060933_bd39a9629841c83f9a9858ed902145c3.jpg"
    },
    {
        "podcast_id": 157191,
        "title": "Sazón For The Soul",
        "description": "Naturally, sazón is a mixture you use to make your cooking better. This podcast is a mixture of everything to make your life better. I'll be talking about mental health, bringing in guests, and share my life and experiences. Hopefully this podcast makes you laugh, cry and even cry and laugh at the same time. This is me bringing a little sazón in your life, enjoy.  ",
        "language": "en",
        "author_name": "Lissette ",
        "slug": "sazonforthesoul",
        "cover": "20221005_101003_8a8df2bff239b6a30ef4d81f4fb1b76d.jpg"
    },
    {
        "podcast_id": 158688,
        "title": "Relove Podcasts",
        "description": "https://www.relove.com/",
        "language": "en",
        "author_name": "Relove Team",
        "slug": "relove",
        "cover": "20221008_051057_62666cb90431a99a5542ebd92a145c32.jpg"
    },
    {
        "podcast_id": 159026,
        "title": "Dayfacto",
        "description": "Look at moiii look at moiii it's Kate and Nicolette here bringing you a podcast literally no one asked for, Dayfacto: a 9 till 5 kind of relationship. \n\nUploading every Monday so settle down after the weekend with a glass of chardonnay and enjoy!\n",
        "language": "en",
        "author_name": "Kate and Nicolette ",
        "slug": "dayfacto",
        "cover": "20221009_051054_bc0353c6c3aef36156f3ff60c091f948.jpg"
    },
    {
        "podcast_id": 161043,
        "title": "את חשובה",
        "description": "את חשובה ואת משמעותית, ורגשות שלך חשובים ומשמעותיים. \nלפעמים אין לנו עם לחלוק את השאלות שמגיעות אלינו לראש - שאלות פילוסופיות, שאלות שמוגדרות כ \"טיפשיות\", שאלות אישיות... אנחנו מפחדות מביקורת, מזה שאדם אחר יגיד ששאלה שלנו זה \"בולשיט\", מפחדות מ \"עונש\" על זה ששאלנו. \nאבל כל שאלה שלך חשובה ומגיע לך למצוא תשובה לשאלה שלך. \nבפודקאסט הזה אני אעלה שאלות שלקוחות שלי שואלות אותי, שאלות שמגיעות אליי לראש, שאלות פילוסופיות ושאלות מרפאות. אנחנו ניגע בנושאים כמו: התפתחות אישית, מיניות, נשיות, יחסים עם גברים, נוודות בעולם, רוחניות, טיפול ועוד'\n\nשמי אנסטסיה שמידט, אני מאמנת, מטפלת ומנטורית עבור נשים. \nבכל הפרוייקטים שלי אני פונה במין נקבה, אבל גם גברים יכולים למצוא פה תשובות לשאלות שלהם, כי לפני הכל אנחנו בני אדם. \n\nאתר שלי: https://www.shmidtanastasia.com/\nאינסטגרם: https://www.instagram.com/coach_anastasia_shmidt/",
        "language": "he",
        "author_name": "אנסטסיה שמידט",
        "slug": "athashuva",
        "cover": "20221017_081019_589500b9247b0b2a2d13909cc2598e46.jpg"
    },
    {
        "podcast_id": 161465,
        "title": "Women With Microphones",
        "description": "Jenn & Brynn (A.K.A Women With Microphones) are long time friends with a lot to say. In this podcast, they dive deep into everything from hot topic issues to their embarrassing lives, sharing the opinions of two women in today's world. ",
        "language": "en",
        "author_name": "Jenn DeVault & Brynn Karolyi",
        "slug": "womenwithmicrophones",
        "cover": "20221024_071034_f2679958278a66ac7f25d082cb165379.jpg"
    },
    {
        "podcast_id": 161672,
        "title": "Sexualidad Holística",
        "description": "Hola, soy Claudia terapeuta sexual, y te invito a conocer un nuevo estilo sobre\nsexualidad.\n\nQuiero contarte que en nuestra cultura occidental nos han educado y transmitido una sexualidad muy deficiente y por eso nos vemos con problemas emocionales en este plano que nos afecta a nuestra vida sexual.\n\nSexualidad Holística es la unión de nuestro cuerpo físico, mental, emocional,\nenergético y espiritual.\n\nCon este nuevo conocimiento podrás hacer sanación y disfrutar de nuevas herramientas con una mirada de autoconsciencia y así poder evolucionar tu propia sexualidad.\n\nPor eso te invito a que este podcast pueda guiarte en el proceso de la mejor manera en tu vida sexual y emocional, para que logres sanar y liberar tus dolores y traumas, con una mirada amorosa, respetuosa y plena.",
        "language": "es",
        "author_name": "Fundación Newen",
        "slug": "newen",
        "cover": "20221019_041053_fb2d7ce5c9ed42a3a624527de01ef332.jpg"
    },
    {
        "podcast_id": 161781,
        "title": "Rock Your Girl Power",
        "description": "Rock Your Girl Power Merch: https://www.pinkladycouture.com/rockyourgirlpower\n\nWelcome to Girl Power. We are the bad and Boujeè Boss Ladies on a phenomenal journey to help you discover your power passion and purpose at the convergence of love romance and finance. I’m your host, Keci Monique along with my co-host Curtiesha, Cherie, and Christian.\n\nGirl Power is a movement to EmpowHER women and emancipate their minds from old to new through The ABC's of self-love.\n\nAbstinence: abstaining from behaviors that keep you in repeating cycles of relationships and life. Genesis 50:20\nBeauty: WOMAN, know thyself, take care of thyself, and protect thyself from predators of life. Jeremiah 29:11 & Isaiah 61:1-3\nConfidence: Build your confidence so that you build self-equity and value to who you are. Ephesians 3:20 \n\nJoin us every Sunday at 9 AM Eastern daylight time for a half hour a Girl Power staring June 19th. Be sure to SUBSCRIBE, LIKE & SHARE Empowered to Be Her! #podcast #podcasting #love #romance #finance #girlpower #NovaeMoney #marriage #dating #divorce #ApplePodcasts #Spotify",
        "language": "en",
        "author_name": "Keci Moniquè",
        "slug": "rockyourgirlpower",
        "cover": "20221020_121007_ac7e4d7daa9881a35dee71b44d1248ef.jpg"
    },
    {
        "podcast_id": 162076,
        "title": "The Pineapple Links Swinger Podcast",
        "description": "Are you interested in the swinger lifestyle? The Pineapple Links podcast is a backstage pass into the swinging lifestyle, exploring ethical non monogamy (ENM) and educating couples about this honest, open, and fun lifestyle! ",
        "language": "en",
        "author_name": "Mr. and Mrs. A",
        "slug": "pineapplelinks",
        "cover": "20221027_111036_40ce9a8fd47dc460b3d184da300b5fb7.jpg"
    },
    {
        "podcast_id": 162456,
        "title": "Capturando La Salud",
        "description": "Somos estudiantes de la licenciatura de salud pública pública, este es un espacio en el cual se compartirán y se expondrán temas de relevancia",
        "language": "es",
        "author_name": "Salud Publica UACH",
        "slug": "spcomunicando",
        "cover": "20221023_121055_cb0a15994b43f340d238bf93e26d1800.jpg"
    },
    {
        "podcast_id": 162835,
        "title": "Let's Talk About It with Lisa",
        "description": "<p>Listen to me talk some real shit that most people DON'T want to talk about because it's either, controversial or just too honest. In true Capricorn style, that's what I am here for. Your Welcome. </p>",
        "language": "en",
        "author_name": "Lisa Contreras",
        "slug": "letstalkaboutitwithlisa",
        "cover": "20221024_081013_b6fef78c78ceea9a4fb178879db32baf.jpg"
    },
    {
        "podcast_id": 162858,
        "title": "Straight No Chaser by Mya Mehmi",
        "description": "A podcast by Mya Mehmi in which she explores her relationships and interactions with the world and people around her as a (bad af) British-Punjabi Transwoman. Artwork by TOXIC GF &lt;3",
        "language": "en",
        "author_name": "Mya Mehmi",
        "slug": "straightnochaserbymyamehmi",
        "cover": "20221024_071006_4e20479fe42d5ac1553924e0d645d2ec.jpg"
    },
    {
        "podcast_id": 163443,
        "title": "Tearapy ",
        "description": "<p>\"I don't need a therapist I got my bestie.\" Welcome to your new unpaid Tearapy!</p>",
        "language": "en",
        "author_name": "Valthielen Klesczcz",
        "slug": "tearapy",
        "cover": "20230821_100843_24e21473d313ac1725406ab71ce3cf71.jpg"
    },
    {
        "podcast_id": 164448,
        "title": "Radically, Rachael",
        "description": "<p><strong>Radically, Rachael \"The Modern Mystic\" is an Intuitive Life Coach and Spiritual practitioner in the Chicagoland Suburbs.</strong></p><p>Once upon a time, Rachael was a bullied child from a dysfunctional home. A former Christian who spent the first decade of her adult career as an elementary school educator. After coming out in her early 20’s, marriage, and a divorce - her life today looks Radically different.</p><p></p><p></p><p>In a modern Cinderella story, Rachael “Fairy Godmother-ed” herself and took charge of the storyline. Laugh, cry and cringe along with Rachael and her friends to stories that are sure to make your jaw drop. As she awakens to some major themes throughout her life, you will hear and see the way that SPIRIT has been present all along.</p><p></p><p></p><p>Radically, Rachael the Podcast begins as the story of a woman's journey unraveling church camp \"purity culture\" and embraces \"Sex and the Suburbs\" as a Divorcee. Rachael explores it all! From Sex to Spirituality....her LGBTQ coming out experience, purity culture, deconstruction, relationships, and co-parenting as a bonus \"mom\" character.</p><p></p><p></p><p><em>The Radically, Rachael podcast features narrative stories, raw conversations with special guests, guided meditations &amp; affirmations, and even excerpts from Rachael's diary.</em></p><p></p><p></p><p>Follow Rachael on<strong> Instagram and TikTok</strong> @RadicallyRachael or visit her website www.radicallyrachael.com to connect!</p><p></p><p></p><p>If you are a #justagirlfriend or Bonus \"Mom\" Character yourself, check out the Just a Girlfriend Club - Bonus Character Welcome Facebook Group.</p><p><a href=\"https://www.facebook.com/groups/2452256038262018/\">https://www.facebook.com/groups/2452256038262018/</a></p><p></p><p></p><p><strong>rad·i·cal - adj: especially of change or action, relating to or affecting the fundamental nature of something; far-reaching or thorough.</strong></p>",
        "language": "en",
        "author_name": "Rachael Wilde",
        "slug": "radicallyrachael",
        "cover": "20221230_041247_39c7071cc0aa830c2bec8c25a161a0b7.jpg"
    },
    {
        "podcast_id": 164927,
        "title": "Sous-Silence Podcast",
        "description": "La première saison du Sous-Silence podcast produit par Les Bavardes sera officiellement en ligne dès novembre 2022!\nLe Sous-Silence Podcast est une série de dix épisodes qui permet la discussion, l'argumentation et le développement de connaissances face à certains sujets très peu parlé dans notre société. \n\nVoici nos 10 épisodes pour la saison 1:\n1.  Les relations toxiques et violence conjugale\n2. La parentalité positive\n3. Les dépendances\n4. Le travail du sex\n5. Les troubles anxieux\n6. La situation d'itinérance\n7. Les troubles du comportement alimentaire\n8. Le trouble de la personnalité limite\n9. La personnalité narcissique\n10. LGBTQIA+\n\nSur chaque épisode nous avons reçu une ou deux personnes qui vivent ces réalités au quotidien. Ce podcast a pour but de déceler les tabous rattachés à ces sujets et d'offrir un discours authentique et vrai sur les réalités vécues.\n\nAu plaisir de partager cette grande aventure avec vous !!\n\nLes Bavardes\nJulie et Corine \n",
        "language": "fr",
        "author_name": "Les Bavardes",
        "slug": "sous-silence",
        "cover": "20221102_061103_25d156442e15980aff8a5cb14b78746e.jpg"
    },
    {
        "podcast_id": 165235,
        "title": "Stjernehimmel",
        "description": "<p>Har du nogensinde kigget op på nattehimlen og blevet opslugt af tusinder stjerner og pludselig fundet dig selv i at tænke over alt mellem himmel og jord. Det har jeg, det er det en smuk stjernehimmel kan gøre. Velkommen til mit podcast stjerne himmel. Jeg er Anne-Sofie Stentoft Torsting, en 19 årig pige der tit fanger sig selv i at stirre op på natte himlen og tænke hele mit liv igennem. I denne podcast bliver du lukket ind i mit hoved, mine tanker og mine følelser. Jeg snakker om alt fra at droppe ud af gymnasiet, ADHD, Angst, nattearbejde, Venskaber, Kærlighed, selvtillid en helt masse andet. Jeg håber i har lyst til at høre med og følge med i mit liv, mine oplevelser og mine tanker. </p>",
        "language": "da",
        "author_name": "Anne-Sofie Stentoft Torsting ",
        "slug": "stjernehimmel",
        "cover": "20221103_101136_3eb02e0b76a95a9a43ab18fb57d4d606.jpg"
    },
    {
        "podcast_id": 166725,
        "title": "H.O.T TEA with PLEAZURES",
        "description": "While collaborating on the production and manufacturing of a sexual lubricant, through the encouragement of many, Hilary and T'resa brings conversations from their meetings and health issues to a podcast. These two women have incredibly candid conversations about everything around sexuality, relationships and empowerment, \"that lubricates your life\" and keeping it \"raw and real!\" This best friends duo, covers everything imaginable you'd ever need to hear about from a realistic standpoint. Both on an entrepreneurial journey, come together to chat about kinks, sex, mortality, shame, trauma, masturbation, abuse, and more. Catch them every Saturday, 8pm est.\n\nRemember to LIKE, COMMENT & SUBSCRIBE here or on your favourite listening provider.  You can also watch each episode on our YouTube channel!\nhttps://www.youtube.com/@HotTeaWithPleazures ",
        "language": "en",
        "author_name": "Hilary + T'resa",
        "slug": "hotteawithpleazures",
        "cover": "20221109_091153_7a486a5038f4c978ba5216a2a3a3826b.jpg"
    },
    {
        "podcast_id": 166846,
        "title": "Speak Out",
        "description": "<p>Speak Out is the radio show/podcast made by OutWrite Newsmagazine, the oldest queer college publication in the nation established in 1979 at the University of California, Los Angeles. A mix of talk, interviews, and advice, Speak Out is a deep dive into queer community in all its forms.</p>",
        "language": "en",
        "author_name": "OutWrite Newsmagazine",
        "slug": "speak-out-outwrite",
        "cover": "20221110_081110_466666082e80c52e5e55f9af1048a083.jpg"
    },
    {
        "podcast_id": 167046,
        "title": "The Cozy Holistic Witch",
        "description": "Hey! Come listen as we dive into channeling our feminine energy, heal our bodies with holistic and natural remedies, and of course add a bit of witchy flare into the mix! ",
        "language": "en",
        "author_name": "the cozy holistic witch",
        "slug": "thecozyholisticwitch",
        "cover": "20221113_051148_44b02e1d269c4729bbee30b659a32be1.jpg"
    },
    {
        "podcast_id": 167485,
        "title": "The LoveLink Show",
        "description": "<p>Welcome to The LoveLink Show Podcast. We are a weekly Sunday night show aired on https://www.thesignal284.com/ that consists of a very opinionated panel of hosts who seek to shine light on topics that are considered extremely taboo in our small BVI community. We have juicy conversations on all things love and relationships; God, family, your significant other, friendships, and of course yourself. While we want you to listen and enjoy our exciting banter, our desire is for you to walk away educated and to see things in a different light. Hey, it doesn’t hurt to self-reflect, it’s good for the soul. Listeners' discretion is advised.</p>",
        "language": "en",
        "author_name": "The Signal 284",
        "slug": "thelovelinkshow",
        "cover": "20230623_030603_8577f6adc85e89982670935c0b959990.jpg"
    },
    {
        "podcast_id": 168208,
        "title": "(Dé)faire",
        "description": "Podcast sur la sexualité sous toutes ses formes, pour déconstruire les préjugés, les stéréotypes et les idées reçues. ",
        "language": "fr",
        "author_name": "Mélodie Campeau",
        "slug": "defaire",
        "cover": "20221115_081127_2520a115fbb77f07d820ce4867071e17.jpg"
    },
    {
        "podcast_id": 169424,
        "title": "The Love Witch Podcast",
        "description": "<p>Conversations on sexuality, spirituality, and more, hosted by Gwen Walsh (@gwenwalsh on Instagram).</p>",
        "language": "en",
        "author_name": "Gwen Walsh",
        "slug": "thelovewitchpodcast",
        "cover": "20230817_020805_c6ec15558795f5ee14f75cdbb265ede8.jpg"
    },
    {
        "podcast_id": 169766,
        "title": "The FIGO podcast",
        "description": "<p>The FIGO podcast, hosted by the International Federation of Gynecology and Obstetrics (FIGO), aims to disseminate clinical recommendations to obstetricians, gynaecologists and other health care professionals to help improve women and girls’ health outcomes around the globe. FIGO has a vision that women of the world achieve the highest possible standards of physical, mental, reproductive and sexual health and wellbeing throughout their lives. FIGO is dedicated to the reduction of disparities in healthcare available to women and newborns, as well as to advancing the science and practice of obstetrics and gynaecology. In this podcast, we often use the terms “woman”, “girl” and “women and girls”. We recognise that not all people who require access to gynaecological and obstetric services identify as a woman or girl. All individuals, regardless of gender identity, must be provided with access to appropriate, inclusive and sensitive services and care.</p>",
        "language": "en",
        "author_name": "International Federation of Gynecology and Obstetrics (FIGO)",
        "slug": "figo",
        "cover": "20230426_080448_02d71194bc98529ec26b3cc519ad566f.jpg"
    },
    {
        "podcast_id": 169890,
        "title": "Thot Leader ",
        "description": "<p>Conversations with industry thought leaders about their relationships to culture, technology, and s*x. Hosted by SX NOIR</p>",
        "language": "en",
        "author_name": "Sx Noir",
        "slug": "thotleader",
        "cover": "20230711_080759_505b4eb955d5ba47d7aadd5d2d47d863.jpg"
    },
    {
        "podcast_id": 170575,
        "title": "Wprost nie wprost - Seksuologia Dziecięca",
        "description": "Cykl bezpłatnych webinarów. Raz w miesiącu rozmawiamy o rozwoju seksualnym dzieci bez tabu.",
        "language": "pl",
        "author_name": "Katarzyna Kierzek",
        "slug": "wprost-nie-wprost",
        "cover": "20221126_011132_95c8dc0e7cd779a503b2b77755c79e35.jpg"
    },
    {
        "podcast_id": 171529,
        "title": "Rebellische Conversations",
        "description": "A conversation where it is important to for listeners to listen to understand and not listen to respond. Its about normalizing 'NORMAL SHXT' and being open to others opinions and experiences. Have a glass of wine and sit back whilst we engage in a stimulating conversation with Host Ni & Friends..",
        "language": "en",
        "author_name": "Rebellische Seele",
        "slug": "rebellischeconversations",
        "cover": "20230117_080147_d26e15485bec794f1644ac71da266ef4.jpg"
    },
    {
        "podcast_id": 171715,
        "title": "Strange For Change ",
        "description": "Long time adult content creators and BFFs Donny and Little Jess interview main stream adult stars and OnlyFans creators. Want to hear your favorite adult star talk about their most embarrassing moments? What turns them on? Join us on some awkward, hilarious, and STRANGE fun!! \n\nDid we mention that Little Jess is 4’7 with DD’s? \n\nEvery episode ends with some sort of NSFW game, challenge, or surprise! Full uncensored video episodes can be found at StrangeforChangePodcast.com ",
        "language": "en",
        "author_name": "Donny & Little Jess",
        "slug": "strangeforchange",
        "cover": "20221201_021256_96efa3d5dda4638588ad54afdd884e45.jpg"
    },
    {
        "podcast_id": 171761,
        "title": "Madame House Podcast",
        "description": "A queer-focused podcast that touches on everything under the umbrella of the LGBTQIA+ community. Our guests include people from all walks of life from the straight community, queer community, drag queens, lesbians, gays, transgender men, transgender women, and everything in between. There are facts, opinions, questions, answers, unknowns, laughter, tears, tea, shade, Esmerelda's accent, and much more. \n\nHosted by Canned Tina, Esmerelda Vergara, and Sarah Problem.\n@the_t_queens_official\n@canned.tina\n@the_esmerelda_life\n@umsarahproblem",
        "language": "en",
        "author_name": "T-Queens",
        "slug": "madamehouse",
        "cover": "20221201_051207_b56f62879c5ec52b842992b91b7ebfc9.jpg"
    },
    {
        "podcast_id": 172121,
        "title": "Therapy Thots",
        "description": "Being an ethical slut takes work. Practicing open communication, empathy, and vulnerability is hard, especially when we come from different backgrounds. We all seek connection and love, and it can be tough to find partners who support and care for us in healthy ways. What works for one person may not work for another, as there is no one-size-fits-all solution. In this podcast, Therapy Thots, Abbie and Antonio discuss the challenges they've faced and how they've worked to overcome them, covering topics such as sexuality and mental health.",
        "language": "en",
        "author_name": "Antonio Ayala and Abbie",
        "slug": "therapythots",
        "cover": "20221213_101258_8bfad9eb2a53f87b6b95209ec177405d.jpg"
    },
    {
        "podcast_id": 173257,
        "title": "没人听No One's Listening",
        "description": "欢迎来到这档突发奇想产生的播客 - 《没人听 No One's Listening》\n\n这是一档从都市情感聊到宇宙生死的“夜话”栏目\n\n我们关注 都市/情感/女性成长/生活方式\n\n",
        "language": "zh",
        "author_name": "Phiphi",
        "slug": "phiphi",
        "cover": "20221208_041242_098a17ec47acf37b1f03b61172316c45.jpg"
    },
    {
        "podcast_id": 174653,
        "title": "Por casa",
        "description": "Por casa es un podcast de Frysantes y Domidigasnada, donde cada semana narran cómo está siendo el proceso de abrir su relación.",
        "language": "es",
        "author_name": "Boira Productions",
        "slug": "porcasa",
        "cover": "20221215_071228_1255c659ad387ef1041ece22974e0dcb.jpg"
    },
    {
        "podcast_id": 175354,
        "title": "Brain Frog",
        "description": "Brain Frog is a diary log of the dizzying journey that is figuring out life in your twenties, hosted by your fearless leaders Gabi and Mahf. We dive into conversations about mental health, queerness, pop culture, and growing up, but never without a few tangents along the way (it’s literally in the name). ",
        "language": "en",
        "author_name": "Brain Frog",
        "slug": "brainfrog",
        "cover": "20221219_091205_fb4418b18456a749635b3101e3e881c9.jpg"
    },
    {
        "podcast_id": 175786,
        "title": "Indecent Tea Time",
        "description": "Where two besties talk about all the best parts of our spicy reading habit! ",
        "language": "en",
        "author_name": "Jessie and Christin",
        "slug": "indecentteatime",
        "cover": "20221222_041224_82544d1621c6ca28d05616f961e3dde0.jpg"
    },
    {
        "podcast_id": 176748,
        "title": "Soul Magic Podcast",
        "description": "<p>Tauche mit Sandra Carmen in die tiefsten Empfindungen deines Seins ein und befreie dich von Blockaden, die durch Kopflastigkeit und äußeren Druck entstehen. In diesem Podcast erfährst du, wie Hingabe in intimer Verbundenheit zur gesteigerten Erfahrung wird. Mit ihrer sanften Stimme führt Sandra dich auf den Pfad der Selbstakzeptanz und Integration, um im Einklang mit deinem wahren Wesen zu sein. </p><p>Entdecke die wundervollen Nebeneffekte, die energetische Verbindungen, gesteigerte Orgasmen, gestärktes Selbstvertrauen und tiefere sexuelle Ekstase mit sich bringen können. Erlaube dir, deinem natürlichen Fluss zu folgen, der dich in eine erfüllende Sinnlichkeit führt.</p><p>Lass dich einladen, tiefer zu gehen und eine neue Dimension der sexuellen Erfüllung zu erleben. Besuche jetzt <a href=\"http://www.mysoulmagic.com\"><strong>www.mysoulmagic.com</strong></a> oder Instagram @mysoulmagic um die Tür zu deiner eigenen sexuellen Magie zu öffnen.</p>",
        "language": "de",
        "author_name": "Sandra Carmen",
        "slug": "mysoulmagic",
        "cover": "20230621_070651_068102974df53a578389bd749f2a0520.jpg"
    },
    {
        "podcast_id": 177047,
        "title": "Shadow Talk: Mga Lihim na Usapin",
        "description": "<p>NAKAKAHIYA! Ito ang inaasahan nating reaksyon ng mga tao kapag tayo ay may gustong ibahaging karanasan na hindi naaayon sa konbensyon ng lipunan. Dahil dito, ninanais na lamang natin na ikubli ang mga istoryang ito ng ating buhay bilang lihim. But these stories are a part of us and to keep them in the shadows is to be disconnected from parts of ourselves. This channel aims to connect us once again to these disowned narratives of our life, helping us to embrace our full humanity. This is the place for you to explore your body, sexuality, your desires, your darkest fantasies, your weaknesses, your fears, your failures and disappointments, and everything that you've kept in the shadow. This is Mario (my creative persona), a Depth Psychotherapist/Depth Psychologist from the United States of America and I am here to help you find your way back to your self.</p>",
        "language": "tl",
        "author_name": "Mario Ng Palad",
        "slug": "conversationswith-mario",
        "cover": "20230131_020110_10e98e6dae7db1dc7d88a59e49ff04b4.jpg"
    },
    {
        "podcast_id": 177579,
        "title": "Naked Sunday",
        "description": "Former blogger turned YouTuber and now author. I wrote a book on how to give an amazing blow job. \nOn this podcast I’ll be discussing love sex and everything in between with my friends ",
        "language": "en",
        "author_name": "Kissyface454 ",
        "slug": "nakedsunday",
        "cover": "20230102_020118_6411cabbbe5b2836326ea4df8bc46e12.jpg"
    },
    {
        "podcast_id": 177961,
        "title": "Bearded After Dark",
        "description": "Bearded After Dark Podcast talks about a variety of topics including Relationships, Sexuality and Kink & BDSM Lifestyles.",
        "language": "en",
        "author_name": "Bearded",
        "slug": "beardedafterdark",
        "cover": "20230103_070126_60f94fc212a939f4300bb80a3188acc4.jpg"
    },
    {
        "podcast_id": 178020,
        "title": "Goor met Floor ",
        "description": "<p>Goor met Floor, dé podcast van 2023. Het jaar van de geile, lekkere, intieme momenten met een ander.. maar zeker ook met jezelf!! Elke eerste vrijdag van de maand ga ik het met een sexy tafelgast hebben over verschillende seksspeeltjes, toys, verwennerijen, fetisjen, seksverhalen en nog zo veel meer om vrouwen (en mannen) van jong en oud te inspireren op seksueel gebied. Op de hoogte blijven? Volg dan de instagram @goormetfloor </p>",
        "language": "nl",
        "author_name": "Floor",
        "slug": "goormetfleurenfloor",
        "cover": "20230303_110353_6fdbaf76dec8d3f306bf03271b9e506d.jpg"
    },
    {
        "podcast_id": 179276,
        "title": "Dale Una Vuelta MX",
        "description": "Un podcast en defensa de la mujer, la sexualidad sana, asertiva, afectiva, libre e informada.\n\nBuscamos ayudar al que quiera dejar el consumo perjudicial de pornografía a través de información, testimonios y acompañamiento psicológico.",
        "language": "es",
        "author_name": "Dale Una Vuelta MX",
        "slug": "daleunavueltamx",
        "cover": "20230109_040138_3df6a4026c404495b2b03147e8f1bb01.jpg"
    },
    {
        "podcast_id": 179760,
        "title": "BYNK Podcast Network",
        "description": "<p>This is the feed where you can find podcast exclusives Sex with Friends and We Watched This podcast from BYNK Podcast Network.</p>",
        "language": "en",
        "author_name": "BYNK Media LLC",
        "slug": "bynk-podcast-network",
        "cover": "20230117_040111_2b0076c40cbadaa613df9b93b00aa393.jpg"
    },
    {
        "podcast_id": 179994,
        "title": "Descosiendo Labios ",
        "description": "<p>Un podcast de dos chicas muy divertidas y lindas sobre todo, dedicadas a hablar sobre los tabúes sexuales, chismes, experiencias y anecdotas personales que podrían encajar contigo, te invitamos a pasar una charla con nosotras.</p>",
        "language": "es-mx",
        "author_name": "DESCOSIENDO LABIOS",
        "slug": "descosiendolabios",
        "cover": "20230112_080102_bace0997300b9aeffb1aeb09784b6ff9.jpg"
    },
    {
        "podcast_id": 183285,
        "title": "Love and Lit Love",
        "description": "To smut, or not to smut? That is the question. \n\nListen as two self-proclaimed smut experts discuss the ins and outs of the world's greatest literary genre: [redacted]. From sexy history lessons to musings on feminist theory to laugh-out-loud segments, Love and Lit Love is not your mother's podcast. \nOr maybe it is. \n\nNew episodes once a month. ",
        "language": "en",
        "author_name": "Alaire & Sophia",
        "slug": "loveandlitlove",
        "cover": "20230124_080159_eb832789ce735e3627b4f92d0044c2d1.jpg"
    },
    {
        "podcast_id": 183542,
        "title": "Podcast intymny LOVA",
        "description": "<p>Edukatorka seksualna Kamila Raczyńska i dziennikarka Aga Kozak spotykają się z inspirującymi kobietami, po to, by zainspirować inne kobiety do samoczułosci i samomiłości. Posłuchaj Podcastu Intymnego i wejdź do swobodnej, kobiecej przestrzeni, w której toczą się intymne rozmowy i zakulisowe opowieści. Gdzie rzetelna wiedza o seksualności i edukacja spotykają się z obalaniem mitów i przełamywaniem tabu. Dołącz do grona świadomych kobiet, które pragną więcej. Podcast Intymny sponsorowany przez markę LOVA.</p>",
        "language": "pl",
        "author_name": "LOVA",
        "slug": "podcastintymny",
        "cover": "20230830_110859_4b00be44b502d7803c2494897eb94034.jpg"
    },
    {
        "podcast_id": 184739,
        "title": "Wait, I've Been Queer this Whole Time?",
        "description": "Welcome to Wait, I've Been Queer this Whole Time, a podcast for those of you who are queer-identifying or someone who wants to learn more. In this podcast we will talk about coming out later in life, dating, the stigma behind being gay and the church, and many more topics!",
        "language": "en",
        "author_name": "Hal Lutz",
        "slug": "waitiwasqueerthiswholetime",
        "cover": "20230130_010150_8c8b449228cc5a91c76fdbf31380dbf8.jpg"
    },
    {
        "podcast_id": 184799,
        "title": "Las Locuras Del Amor",
        "description": "<p>Programa donde el amor y la locura van de la mano, temas interesantes y calientes donde la información y el bien humor no quedarán atrás. De la mano de la voz de Omar Garcia Jaz Rivera y Daniel Horta no te puedes perder \"Las Locuras Del Amor\"</p>",
        "language": "es",
        "author_name": "Omar Alejandro García Candelas ",
        "slug": "laslocurasdelamor",
        "cover": "20230406_060419_5917089b39ed7dda8a9c1ffc50c88f4b.jpg"
    },
    {
        "podcast_id": 184958,
        "title": "Calientes y Conscientes",
        "description": "<p>Zhann y David te llevan en un viaje para descubrir la sexualidad.</p>",
        "language": "es-MX",
        "author_name": "Vandi media",
        "slug": "calientesyconscientes",
        "cover": "20230403_050436_13d3fb01d30d17df17035afce95da86a.jpg"
    },
    {
        "podcast_id": 185060,
        "title": "Courtney Nolan - The Podcast ",
        "description": "<p>I'm a <strong>Former Police Officer &amp; now a Sex Coach &amp; Educator,</strong> not new to controversy; I shatter taboos &amp; coach businesswomen to live freely &amp; authentically.</p><p>I left the Police Force after feeling the heaviness of having to hide my sexual side or have it used as a target - my femininity was often perceived as a weakness however now I Coach Women to use it to their business advantage.</p><p>There's nothing saucier or more controversial than the topic of Sex, i joined this industry after leaving the Police Force and I am loving bring a whole new wave of sexual liberation and conversations to Business Women across the Nation.</p><p>I joined the Police Force with the intention to help people, I actually wanted to help people in the way more people cannot, hence why I decided a career in Policing was for me. After having kids and realising there was actually more politics involved that conflicted with my values I decided to make the change to become a Coach.</p><p>I studied NLP &amp; started Mindset Coaching for Women, butttt I kept feeling a pull back to sex, relationships, intimacy and feminine power. Everything about sexuality &amp; sensual living appealed to me, i'd always been interested in tantra and the taboo topics so it felt completely natural for me to seek out a way i could incorporate this into my Coaching.</p><p>Becoming an Entrepreneur couldn't be further from a career as a Police Officer where all the rules and regulations were set out for you, regardless of whether or not you agreed with them - you had to follow them and enforce them. Working for myself and growing a business required the complete opposite of this, I taught myself to push back against \"norms\" that didn't suit me and found a new way to do business - a feminine way.</p><p>I have structures in place to support how I like to flow in my business, this lets me be more creative and intuitive where it suits me. As a Mum I also need flexibility in my work and want to live a life i'm proud of, which as a parent seems to be my most honourable role yet.</p><p>I swear, I talk about sex like it's the most casual thing in the world because to me it is. I want everyone to feel into the power of their sexuality which really encompasses all things, it's NOT just what happens in the bedroom but also in your daily life. It's where you find pleasure, how you convey your opinions in conversations and how you hold space for others to show up as their unique selves as well.</p><p>The topic of Sex within the Police Force really does bring some heat, as the industry is male dominated I felt i had to suppress this sexual side of. myself otherwise it would be misinterpreted as an invitation i wanted to sleep with whoever was around.. Not the case. Suppressing this side of me was not something I every thought i'd have to do.</p><p>I love my sexual side and find it POWERS my business to the heights it's growing, I want listeners to hear my story and feel enlightened, empowered and excited to use their sexual energy to unlock new levels of business success. I want listeners to hear how magnetic you become when you honour your sexual energy and how you deepen all your relationship when you do, it's an energy you cannot replicate any other way.</p><p>I'm fiercely passionate about breaking free some societal norms that are outdated and do not support an honest version of who a person wants to be.</p><p>I liberate Women to feel confident in their bodies, sensuality &amp; desire for more out of life which when fully accepted we become a truely formidable force in both a personal capacity &amp; a professional one.</p><p>I am open to all the conversations about sex, empowerment, and success, encouraging Women to make their own rules and choose a path that suits them - inspiring them to embark on a truly extraordinary journey of self-discovery.</p>",
        "language": "en",
        "author_name": "Courtney Nolan",
        "slug": "courtneynolanpodcast",
        "cover": "20230626_100613_07bc9f6606600b08903e099067fa8d1b.jpg"
    },
    {
        "podcast_id": 185213,
        "title": "Pitipausa",
        "description": "<p>Un podcast a manos de Lucia aroca y Laia Rodriguez donde hablaremos de temas tabú, salud mental y, de vez en cuando, de cotilleos.</p>",
        "language": "es",
        "author_name": "Lucia Aroca y Laia Rodriguez",
        "slug": "pitipausa",
        "cover": "20230201_060224_a70bb61718c9add8facfbd4523485b21.jpg"
    },
    {
        "podcast_id": 185813,
        "title": "In the same boat",
        "description": "Seattle-based, boat-dwelling, brain-science nerds share relatable stories from their awkward journeys of self discovery during their 20s. Welcome aboard 🌈",
        "language": "en",
        "author_name": "Em & Xana",
        "slug": "inthesameboat",
        "cover": "20230202_030202_0ce4bc286d65ea4f964e4385598a962e.jpg"
    },
    {
        "podcast_id": 186769,
        "title": "Lez Unpack That",
        "description": "The Lez Unpack That Podcast is dedicated to giving a voice to the LGBTQ+ community and discussing a wide range of topics that allow others the opportunity to share their voice and story.",
        "language": "en",
        "author_name": "Lianna, Brianna, and Chuck",
        "slug": "lezunpackthat",
        "cover": "20230205_060216_c0f04ae7ee46b5aeac2b53cc34007bdf.jpg"
    },
    {
        "podcast_id": 186948,
        "title": "Stephanie & Cristina",
        "description": "just two best friends talking out of their asses !\n",
        "language": "en",
        "author_name": "Stephanie",
        "slug": "lukewarmfairy",
        "cover": "20230214_010257_c42ad50b0e27b011df35cbfd6f8ea614.jpg"
    },
    {
        "podcast_id": 187235,
        "title": "Young Guidance",
        "description": "We're trying to figure our way through life while trying to help you do the same! Let's see how it goes! ",
        "language": "en",
        "author_name": "Kaleigh Lewis",
        "slug": "youngguidance",
        "cover": "20230213_070254_961c21c39b7859de0105eae0d5a8d5ef.jpg"
    },
    {
        "podcast_id": 187256,
        "title": "Unnatural To Some",
        "description": "<p>Take a deep dive with Jay Weiler, Nikki Sapphire, and Jenny Bangz as they discuss current and historical topics in LGBTQ+, Polyamory, BDSM, the adult industry, and anything else that would be Unnatural To Some.</p>",
        "language": "en",
        "author_name": "Unnatural To Some",
        "slug": "unnaturaltosome",
        "cover": "20230609_040626_faa6729284efa1d7dda2d776150a5941.jpg"
    },
    {
        "podcast_id": 187495,
        "title": "The Sex Ed Series",
        "description": "<p>Did you have sex education in school? If you were lucky enough to HAVE had it, you may still have hundreds of questions like I always did. And I promise you're not alone — I heard from almost 100 people about their sex education experiences in the United States and across the world, and only a few of them said the education they received left them feeling smarter about their sexual wellbeing. In this short series, I speak with folks from all walks of life, including those who have researched sex education, taught sex education, criticized sex education, praised it, and those who did not have it at all. In order to destigmatize this topic, we need to talk about it. And if that's too scary, we can at least listen to others talk about it, because I learned more than I ever thought I would by doing just that. Sit down, relax, and take a listen. I'm sure you'll learn something too. xox Susie Fordi</p>",
        "language": "en",
        "author_name": "Susanna Fordi",
        "slug": "the-sex-ed-series-by-susie-fordi",
        "cover": "20230207_090201_96d10da445eba8ee75080eff6d6463d4.jpg"
    },
    {
        "podcast_id": 188117,
        "title": "Them, All Magazine: poetry, code & writing with a focus on reproduction and sexuality.",
        "description": "<p>A selection of readings from poets, coders and writers from each issue - with accessibility in mind.  </p><p><em>Them, All</em> supports feminist, queer and antiracist derivations and deviations of reproductive labour AT THE LEVEL OF the word, sentence, string, command line, stanza, interface and page. Designed and edited by Rebecca Close: <a href=\"http://www.them-all-magazine.com/about\">http://www.them-all-magazine.com/about</a> for more.</p><p>The project derives from research around historiesof Queer Net Art works and maga/zines that have addressedquestions of access to reproductive resources and medical technologies.For example, <a href=\"https://womenslibrary.org.uk/2022/10/14/reassembling-the-network-after-the-internet/\">the 1970s magazine <em>Sappho</em> in the UK </a>who published poetry and operated as a network for resource sharing across disability, sexuality, race and class struggles, and who used a form of sexuality and gender non-conformity as an expansive mode of collective action. </p><p>The title also comes from the project <a href=\"https://the-wife-of-them-all.glitch.me/\">The Wife of Them All</a>, an animated spoken opera film that follows a number of characters navigating the intersections of waged and unwaged reproductive work, inspired by Gertrude Stein's 1947 libretto <em>The Mother of Us All.</em> <em>Them, All</em> also thinks with proponents of Black Feminist and Marxist Feminist thought, who have emphasised the critique of a totality (“All”) from situated knowledge(s) (“Them”). \"Them, All\" from this perspective means specific standpoints <em>and </em>total transformation. </p><p>This online project is hosted with <a href=\"https://systerserver.net/\">Systerserver</a>, a server run by feminists using free and open source software (FOSS). It acts as a place to learn system administration skills, host services and inspire others to do the same. </p><p>What is <em>reproduced </em>at the level of the word, sentence, string, command line, stanza, interface and page? What can be <em>non-reproduced</em> or <em>reproduced otherwise</em>?</p><p></p>",
        "language": "en",
        "author_name": "Rebecca Close",
        "slug": "them-all-magazine",
        "cover": "20230822_100849_06d3a06254c674255e0a58930935506b.jpg"
    },
    {
        "podcast_id": 189134,
        "title": "Hilos de sangre: historias y memorias del vih/sida en Colombia",
        "description": "<p><strong>Hilos de sangre: historias y memorias del vih/sida en Colombia</strong> recupera historias y experiencias del vih y el sida, a partir de conversaciones con docenas de personas que han trabajado activamente en el tema desde distintos campos de los años 80 hasta el presente y en diferentes regiones del país. Concebido y creado por el historiador Pablo Bedoya y por el artista Carlos Motta—en colaboración con: David Alejandro Velásquez, Valentina Trujillo, Simonne Montoya González y Victor Alfonso Esteban Amórtegui—este archivo de historia oral ofrece una perspectiva interseccional del vih y el sida en Colombia en las últimas cuatro décadas.</p><p><a href=\"https://hilosdesangre.co\">https://hilosdesangre.co</a></p><p><strong>Apoyo: </strong>Proyecto Futuros Justos - Penn Mellon Foundation; Museo de Arte Moderno de Bogotá - MAMBO; Grupo de Investigación en Intervención Social, Universidad de Antioquia</p><p><strong>Edición de audio:</strong> Juan Camilo Ortíz</p>",
        "language": "es",
        "author_name": "Carlos Motta y Pablo Bedoya",
        "slug": "hilosdesangre",
        "cover": "20230303_050337_b0a1864c7ffe479fd6e3c41b555c7ee3.jpg"
    },
    {
        "podcast_id": 189373,
        "title": "the love fiXXX",
        "description": "<p>Love: it’s complicated and can hurt so good. Brother and Sister duo, Hot mama and Uncle Miggy, bring you a weekly dose of the love fiXXX where they cover sex, dating and all things in between. Join them as they follow the dating lives of three recurring guests searching for love.</p>",
        "language": "en",
        "author_name": "Uncle Miggy & Hot Mama",
        "slug": "thelovefixx",
        "cover": "20230324_010329_a67a88d8c269f4c2ae55bd2414ee1deb.jpg"
    },
    {
        "podcast_id": 189498,
        "title": "Permission To Be Human",
        "description": "Conversations about God, life, sexuality, the Bible, Jesus, failure. Insecurities. Goals, ideas. Relationships. Shame. Trauma.  Betrayal.  Attachment theory. Healing. Family. Pretty much anything I feel like discussing. ",
        "language": "en",
        "author_name": "Autumn Joyce",
        "slug": "permissiontobehuman",
        "cover": "20230215_050241_aab727aa68d2d03ab995feba6aaa477e.jpg"
    },
    {
        "podcast_id": 189993,
        "title": "Breaking Taboos",
        "description": "<p>In Indian culture, things such as being homosexual, transgender, having a mental illness, having an interracial marriage, and skin color are all stigmatized. The mission of Breaking Taboos is to create a community, with which we can break these stigmas</p>",
        "language": "en",
        "author_name": "Rhea Krishnan",
        "slug": "breaking-taboos",
        "cover": "20230218_060249_de7cbb9ba0c08ec15bfa85dfa22c18e2.jpg"
    },
    {
        "podcast_id": 190035,
        "title": "Mad Existers",
        "description": "Welcome, this is Kyra & Steph.\nWe are two twenty-somethings navigating life and all that comes with that. We both understand how mad it truly is to exist and want to talk about it. \n",
        "language": "en",
        "author_name": "Mad Existers",
        "slug": "madexisters",
        "cover": "20230216_030243_521eae7e652c7040c65b87b44eb98f8e.jpg"
    },
    {
        "podcast_id": 190696,
        "title": "The Sexperts",
        "description": "<p>A newly married man and a virgin talk about sex. What is it? And where will it take you? Find out here with Thomas and Joseph.</p>",
        "language": "en",
        "author_name": "Thomas and Joseph",
        "slug": "thesexperts",
        "cover": "20230220_080244_8161574407df624c5943a77f05d47b0e.jpg"
    },
    {
        "podcast_id": 191958,
        "title": "The Queer Agenda",
        "description": "<p>Discussions about everything queer! History, social issues, culture, and more. Join Queer Agenda's founder, Madeline English, as she works through the beauty of queerness and helps connect us to our lost history.</p>",
        "language": "en",
        "author_name": "Madeline English",
        "slug": "thequeeragenda",
        "cover": "20230225_020257_581573fc144a7e5d6f3c7decd3c171fd.jpg"
    },
    {
        "podcast_id": 192789,
        "title": "Unqualified Queerists ",
        "description": "<p>Chatting Nonsensical Tea 🎙️ </p>",
        "language": "en",
        "author_name": "Prav & Rita",
        "slug": "unqaulifiedqueerists",
        "cover": "20230227_060236_049ff19f75c95e374c27c887231a7700.jpg"
    },
    {
        "podcast_id": 195722,
        "title": "The GetsNatty Podcast",
        "description": "<p>Tiktok and Instagram creator Natty Eats Junk interviews Internet personalities and other super interesting people.</p>",
        "language": "en",
        "author_name": "Natty Eats Junk",
        "slug": "getsnattypodcast",
        "cover": "20230309_040348_8c6c948b3b1d068e3f223f2b5aad459d.jpg"
    },
    {
        "podcast_id": 195738,
        "title": "SEXO SOBRE LA MESA",
        "description": "<p>Tres educadoras sexuales certificadas Yahira Reyes, Sheela Huertas y Vivian Roque, explorando y conversando temas de la sexualidad humana, desde lo “convencional” hasta esos temas controversiales y prohibidos de los que nadie quiere hablar.</p>",
        "language": "es",
        "author_name": "Yahira Reyes Melendez ,Sheela Huertas and Vivian Roque",
        "slug": "sexosobrelamesa",
        "cover": "20230309_050303_b9888cffea1bac9950cdd660e2616ef5.jpg"
    },
    {
        "podcast_id": 195824,
        "title": "The unfit heroes ",
        "description": "<p>Join host Chris Bohannon, and long time friend and co-host Danielle bring comedic humor to everyday life. Enjoy sit downs with special guest as we get know the person on a more personal level. Located in the small state of Vermont we bring fun, games, news and real talk.</p>",
        "language": "en",
        "author_name": "Chris Bohannon",
        "slug": "unfitheroespod",
        "cover": "20230313_120350_2fee48825344530aff62d83e8f7ef209.jpg"
    },
    {
        "podcast_id": 195868,
        "title": "Riding on top with Raven",
        "description": "<p>Sit down with Raven to indulge in storytimes of a working girl from Sydney, Australia.</p><p>Furthermore exploring what is helpful relationship advice and realistic expectations in modern love life.</p><p>Spiritually, sex advice, psychological harm/changes and more.</p><p>Follow, hit the bell and share.</p>",
        "language": "en",
        "author_name": "Raven",
        "slug": "rotwraven",
        "cover": "20230310_070300_783fda8f3dadf8940ae18c6f72a19ffd.jpg"
    },
    {
        "podcast_id": 195922,
        "title": "Soft Boiled w/ Ramen Raiders",
        "description": "<p>When it comes to love, life, and everything spicy, the Ramen Raiders bring a new spin with some familiar faces. Come get soft with us.</p>",
        "language": "en",
        "author_name": "Ramen Raiders",
        "slug": "softboiled",
        "cover": "20230310_010330_d317b2eb270ed3f0132a6e01c6d13a3d.jpg"
    },
    {
        "podcast_id": 195928,
        "title": "AbiertaMente - Kotex por Todas",
        "description": "<p>Hablemos AbiertaMente de sororidad, ciclos, sexualidad, relaciones y desarrollo individual. Te invitamos a escuchar a líderes de opinión y especialistas que impulsan el vuelo de las mujeres mexicanas. Un podcast de Kotex por Todas.</p>",
        "language": "es",
        "author_name": "Kotex® por Todas",
        "slug": "abiertamente",
        "cover": "20230310_020310_b939746565f01f768798daa2fce5e9aa.jpg"
    },
    {
        "podcast_id": 198308,
        "title": "I AM Tipsy Tea",
        "description": "<p>Bienvenidos a I AM Tipsy Tea, un podcast hecho por dos mejores amigas platicando sobre las bajas, las altas, y todo lo de el medio que nos da la vida. Sin miedo a decir lo que estamos pensando, y manteniendo un ambiente de zero juzgas. Este es nuestro lugar seguro para compartir nuestras experiencias con una pisca de humor, con la esperanza de hacerte reir y dar nuestro consejo.</p>",
        "language": "es-mx",
        "author_name": "Andrea & Marina",
        "slug": "iamtipsytea",
        "cover": "20230321_040316_4d6198533a510e975160c4570dae1565.jpg"
    },
    {
        "podcast_id": 199750,
        "title": "Lesbian Takeback",
        "description": "<p>2 lesbians calling out the bullshit. Casual conversations and personal opinions on topics such as women's issues, lesbian issues and other pop culture. </p>",
        "language": "en",
        "author_name": "Lesbian Takeback",
        "slug": "lesbiantakeback",
        "cover": "20230328_120345_3a371dad2be165829aea5a9a5eef473e.jpg"
    },
    {
        "podcast_id": 200568,
        "title": "HOLY EROS",
        "description": "<p>THE PODCAST FOR THE PLEASURE MAKERS OF THE NEW EARTH:</p><p>HOLY EROS features evocative discussions on the evolution of Sacred Sexuality that will transform the world as we know it.</p><p>We’re here to delve deep into the power of Holy Eros, the aspects of devotion, intimacy, passion and love, where the transformational medicine of our Soul, Sex &amp; Art intersects and transforms ourselves and the world…enjoy today’s episode. Featuring experts, professionals and interviews with people speakers with a diversity of backgrounds on the intersection between sacred sexuality, spirituality, and art means for transformational healing in a world aching for sensual medicine and HOLY EROS.</p><p>Join us for convos and confessions on: Sacred Sexuality + Conscious Kink + Sacred BDSM + Erotic Expression &amp; Artmaking + Closing the Orgasm Gap + Erotic Group Experiences + How to Curate, Attend and the etiquette of erotic space + Initiating your Lover into Sacred Sexual Union + Embodiment practices to amplify your pleasure, deepen your intimacy and open your heart + Overcoming Porn Addiction + and many more topics.</p>",
        "language": "en",
        "author_name": "Phoenix Amara",
        "slug": "holyeros",
        "cover": "20230725_070757_5329ae82445c6ee56f56ff5d55ea009a.jpg"
    },
    {
        "podcast_id": 205325,
        "title": "WTF Is My Wife Reading?",
        "description": "<p>Joe learns what happens in those romance books that Issy reads and has lots of thoughts about it.</p>",
        "language": "en",
        "author_name": "Joe and Issy Rodriguez",
        "slug": "wtfismywifereading",
        "cover": "20230425_020408_d29c9f9fa1c3ab01f49759d71bc55be8.jpg"
    },
    {
        "podcast_id": 205399,
        "title": "Not Just a Rainbow",
        "description": "<p>The LGBTQ+ community has had to grapple with the social and legal difficulties of being I am still fortunate enough to have some of the most influential LGBTQ+ figures alive today. This inspired me to create this podcast. I am Catherine Cager who explores the true meaning of being LGBTQ+ in a world that is rapidly changing.</p>",
        "language": "en",
        "author_name": "Catherine Cager",
        "slug": "not-just-a-rainbow",
        "cover": "20230425_010430_77598041951acc8f2df22593ecb51ca3.jpg"
    },
    {
        "podcast_id": 205673,
        "title": "El podcast de la FIGO",
        "description": "<p>El podcast de la FIGO, organizado por la Federación Internacional de Ginecología y Obstetricia (FIGO), tiene como objetivo difundir recomendaciones clínicas a obstetras, ginecólogos y otros profesionales de la salud para ayudar a mejorar los resultados de salud de las mujeres y las niñas en todo el mundo. La FIGO tiene la visión de que las mujeres del mundo alcancen los niveles más altos posibles de salud y bienestar físico, mental, reproductivo y sexual durante toda su vida. La FIGO se dedica a la reducción de las disparidades en la atención sanitaria disponible para las mujeres y los recién nacidos, así como al avance de la ciencia y la práctica de la obstetricia y la ginecología. En este podcast utilizamos a menudo los términos \"mujer\", \"niña\" y \"mujeres y niñas\". Reconocemos que no todas las personas que necesitan acceder a los servicios ginecológicos y obstétricos se identifican como mujer o niña. Todas las personas, independientemente de su identidad de género, deben tener acceso a servicios y cuidados adecuados, inclusivos y sensibles.</p>",
        "language": "es",
        "author_name": "Federación Internacional de Ginecología y Obstetricia (FIGO)",
        "slug": "figo-espanol",
        "cover": "20230426_030406_af91efaba28af585d2b2b8cd55033e31.jpg"
    },
    {
        "podcast_id": 205674,
        "title": "Le podcast de la FIGO",
        "description": "<p>Le Podcast FIGO, organisé par la Fédération internationale de gynécologie et d'obstétrique (FIGO), vise à diffuser des recommandations cliniques aux obstétriciens, gynécologues et autres professionnels de la santé afin d'améliorer la santé des femmes et des jeunes filles dans le monde entier. La vision de la FIGO est que les femmes du monde entier atteignent le plus haut niveau possible de santé et de bien-être physique, mental, reproductif et sexuel tout au long de leur vie. La FIGO se consacre à la réduction des disparités dans les soins de santé offerts aux femmes et aux nouveau-nés, ainsi qu'à l'avancement de la science et de la pratique de l'obstétrique et de la gynécologie. Dans ce podcast, nous utilisons souvent les termes \"femmes\", \"filles\" et \"femmes et filles\". Nous reconnaissons que toutes les personnes qui ont besoin d'accéder à des services d'obstétrique et de gynécologie ne s'identifient pas comme des femmes ou des filles. Toutes les personnes, quelle que soit leur identité de genre, devraient avoir accès à des services et des soins appropriés, inclusifs et sensibles.</p>",
        "language": "fr",
        "author_name": "Fédération Internationale de Gynécologie et d'Obstétrique (FIGO)",
        "slug": "figo-francais",
        "cover": "20230426_040439_f981862d28c35c70757d7d8964e27386.jpg"
    },
    {
        "podcast_id": 205882,
        "title": "Interviste Nude",
        "description": "<p>Interviste nude per esplorare la sessualità umana</p>",
        "language": "it",
        "author_name": "Le Sex en Rose",
        "slug": "intervistenude",
        "cover": "20230427_020439_162b791050c2b1f8dbadcd754aca755c.jpg"
    },
    {
        "podcast_id": 206725,
        "title": "Pridefinder: The Rainbow Road Trip Podcast",
        "description": "<p>Pridefinder – The Rainbow Road Trip was a travelling podcast project commissioned during the 2023 Midsumma Festival as part of the State Government's initiative, Victoria’s Pride.</p><p>Helene Thomas; an award winning creative audio producer, journalist, and queer ally, developed a mobile story studio with the purpose of encouraging connection, cultivating empathy and preserving peoples experiences.</p><p>As much of Victoria’s queer history relies on verbal recount, Midsumma, Helene and the Pridefinder connected with regionally living LGBTQIA+ Victorians to help capture their unique stories.</p><p>Throughout this series you will hear first-hand, the successes, hopes, dreams, fears and struggles of diverse members of the community.</p>",
        "language": "en",
        "author_name": "Victoria's Pride - Midsumma Festival",
        "slug": "pridefinder",
        "cover": "20230502_120559_4feabe169fcec2256dd679319c7e47a4.jpg"
    },
    {
        "podcast_id": 208190,
        "title": "Rainbow Tea Time",
        "description": "<p>Hello! We wanted to create a podcast for anyone to listen, and to have fun with. We will talk about pretty much any topic. This is a safe place for us to vent and to talk about issues that we couldn't normally talk about in our day-to-day lives. Please enjoy!</p>",
        "language": "en",
        "author_name": "Jade and Sage",
        "slug": "rainbowteatime",
        "cover": "20230603_040621_de682a79b1b5295413a47118d154c867.jpg"
    },
    {
        "podcast_id": 208821,
        "title": "Intimacy Meditations",
        "description": "<p>Meditations for yourself and lovers. Breathe deeply. Love intentionally.</p><p>All are welcome in this space and I am grateful to share time with you. Please use these meditations as a guide to set your intentions for love. Prime your mind, body, and soul by giving yourself time to create purposeful love. Curiously explore yourself and/or your partner(s) with patience. When we love with intention, our connection intensifies, deepens, and allows us to recognize our true needs for true fulfillment. There is no judgement, only love my friends.</p><p><a href>www.intimacymeditations.com</a></p>",
        "language": "en",
        "author_name": "Quietly Confident",
        "slug": "intimacymeditations",
        "cover": "20230512_040507_e59bddea04b984bd3e9d6bee32dd7f9e.jpg"
    },
    {
        "podcast_id": 208961,
        "title": "Xena Made Me Gay",
        "description": "<p>Two \"Xena: Warrior Princess\" super-fans recap each episode, diving deep into nostalgia, television tropes, and an escalating queerness of our favorite 90s show.</p>",
        "language": "en",
        "author_name": "Alisa Kasiliauskaite",
        "slug": "xenamademegay",
        "cover": "20230513_110511_e1fdd0da36d27c93e28d47b20af7dfe6.jpg"
    },
    {
        "podcast_id": 210583,
        "title": "Gritty Gays ",
        "description": "<p>A Show featuring two POC queer people, discussing the way they navigate life as poc queer people in a world full of surprises.</p>",
        "language": "en",
        "author_name": "Frank Einboden and Nick Anderson",
        "slug": "grittygays",
        "cover": "20230601_070611_0980dc8f708a11884d5cdb80db754c9d.jpg"
    },
    {
        "podcast_id": 211492,
        "title": "Direct Golden Hours Podcast",
        "description": "<p>Hello this is the official Direct Golden Hours Podcast! Hosted by Mimi and Meg. We talk about almost everything and anything. Some segments we have are AITA, spooky encounters and stories, interviews, and entertainment and media. If you would like to get in contact with us please use our link <a href=\"https://linktr.ee/directgoldenhours\">https://linktr.ee/directgoldenhours</a> Art credit goes to Reya Lanot-Manuel</p>",
        "language": "en",
        "author_name": "Megan Rosener and Marie Newell",
        "slug": "dghpodcast",
        "cover": "20230601_080653_31d73b061a32e4c8999f4ec8744150a9.jpg"
    },
    {
        "podcast_id": 211550,
        "title": "Taboo Talks Hotline ",
        "description": "<p>Thank you for calling the Taboo Talks Hotline - this is Melissa Speaking. How may I help you? Can we all agree that the human experience can get pretty lonely? Somehow you've convinced yourself you're the only one in the universe dealing with said problem? If it brings you comfort, I assure you are not the first guest to walk that path. Don't believe me? Listen for yourself by tuning into the TABOO TALKS HOTLINE. Join the call to find ways to break down outdated societal parameters.  </p>",
        "language": "en",
        "author_name": "Melissa James ",
        "slug": "taboo-talks-hotline",
        "cover": "20230526_100504_9942ba6ac4ed980a74ad59d9fe4e8a4d.jpg"
    },
    {
        "podcast_id": 212066,
        "title": "Feminine Power Podcast",
        "description": "<p>This podcast delves into the captivating realm of sexuality, sexual creative energy, sensuality, feminine energy, embodiment, and the wondrous impact a genuine connection with your body can have on your life.</p><p>You can also access the audio-guided practices that are designed to awaken your feminine power and help you integrate sexuality and intimacy practices into your life. Practice them every day to experience transformative results.</p><p>Visit <a href=\"http://feelapp.co\">feelapp.co</a> for more information and to join our community.</p>",
        "language": "en",
        "author_name": "Mariya Grinina",
        "slug": "feelfemininepower",
        "cover": "20230702_050745_27ccc5ba010cae869c14e4d3ddc95bf1.jpg"
    },
    {
        "podcast_id": 212503,
        "title": "Peasant Party Podcast",
        "description": "<p>Hosted by dating tiktoker, Charlotte Warren aka @welcometothepeasantparty, this podcast explores all things modern dating and relationships... Peasant style, and not without a party! We talk dating for the average joes &amp; jills who don't take themselves too seriously and just want to find a genuine connection, while having a lot of fun and being a good person along the way. So, join us for the (peasant) party!</p>",
        "language": "en",
        "author_name": "Charlotte Warren",
        "slug": "peasantpartypod",
        "cover": "20230605_060658_a8fba5fbe063b40faebd036adb00510f.jpg"
    },
    {
        "podcast_id": 212714,
        "title": "Queer Focus ",
        "description": "<p>“It is not our differences that divide us. It is our inability to recognize, accept, and celebrate those differences.” - Audre Lorde</p><p>“The purpose of art is to lay bare the questions that have been hidden by the answers.” -James Baldwin</p><p>Crystal, Tsunami, Darrin and Ayanna of Collective Focus in Bushwick/Bedstuy continue the living history record of Queer Brooklyn in this weekly podcast series of conversations with Queer Brooklyn Artists, each influential as they are unique. </p>",
        "language": "en",
        "author_name": "Crystal Hart ",
        "slug": "queerfocus",
        "cover": "20230602_020636_4b8a138461970d0ddb0c88878c728c8c.jpg"
    },
    {
        "podcast_id": 212762,
        "title": "Why watch porn? Just read it!",
        "description": "<p>Once you go down the Smut and romance novel rabbit hole theirs no escape. Luckily for Cassie and Raiiley, they have no intentions of leaving. Join them as the talk about some of their favorite spicy books!</p>",
        "language": "en",
        "author_name": "Cassie, Raiiley",
        "slug": "wwpjrt",
        "cover": "20230909_020924_9704c2ebfe91062e6127c66d1698386a.jpg"
    },
    {
        "podcast_id": 213690,
        "title": "PSST... Poetry, Songwriting, Storytelling,Theatre with Ri Baroche",
        "description": "<p>Psst....have you heard about ‘PSST...’? It’s a podcast series showcasing and celebrating queer voices in conversation with writer and performer Ri Baroche, produced by ArtfulScribe.</p><p>Four of Ri's favourite queer writers working in the SW regions to sit down and talk about all things queer and all things joy. The four writers are Jayne Ede (poetry), Beck Lombardi of Hunting Hearts (songwriting), Thorn (storytelling), and CJ Turner-Macmullan (theatre).</p><p>These artists talk about their approaches to writing, what it means to write as a queer person and how this contributes to their work, their advice to young queer writers, and how joy shines on the page. While we cover some of the essential topics of the difficulties continually faced by queer folx in UK society, this is very much a celebration of queer people coming together to talk in joyfulness about writing and queer stories.</p><p>Episodes are released every Wednesday in June 2023 to celebrate Pride Month. This series is supported by Arts Council England.</p>",
        "language": "en",
        "author_name": "ArtfulScribe",
        "slug": "artfulscribe",
        "cover": "20230614_070627_efac136e4c135ab3efd6e847967e7d5b.jpg"
    },
    {
        "podcast_id": 213766,
        "title": "Its Just ForPlay Podcast",
        "description": "<p>Its Just ForPlay Podcast is a platform where friends discuss raw and uncut-rated R topics where NOTHING is off limits.🔞</p>",
        "language": "en",
        "author_name": "Jasmine Thomas",
        "slug": "itsjustforplaypodcast",
        "cover": "20230607_080630_dcc94dc4b5c39564e909ac55a96fea49.jpg"
    },
    {
        "podcast_id": 214275,
        "title": "Nathy Peluso Report",
        "description": "<p>Shadow tranny honey gang, we love sucking and fucking</p>",
        "language": "en",
        "author_name": "Anna Taylor",
        "slug": "nprpod",
        "cover": "20230627_020654_4ce594f36f6209ea45a386a52054e5cf.jpg"
    },
    {
        "podcast_id": 214367,
        "title": "Struck by Cupid",
        "description": "<p><strong><em>Struck By Cupid</em> is a side-project created by Sacredhyacinth! Two protagonists Juliet Spears and Andrew Welton struggle to confess to one another—and with the school year ending, they almost give up, but fate finds a way for both of them.</strong></p><p><strong>The <em>CUPID</em> Radio show is meant to be an interactive media, where fans can submit confessions or questions, and Andrew Welton (the canonical host) can answer!</strong></p><p><strong>Form link: </strong><a href=\"https://forms.gle/RQk23S4is9aFvsEY8\"><strong>https://forms.gle/RQk23S4is9aFvsEY8</strong></a></p>",
        "language": "en",
        "author_name": "Andrew Welton",
        "slug": "cupid",
        "cover": "20230610_050609_9bc7ea374fd6ea16000694ad3573479d.jpg"
    },
    {
        "podcast_id": 215726,
        "title": "Women's World Podcast by Irmina Galdikaite",
        "description": "<p>Here we cover topics that are very important to all women, from health to wealth, sensuality and sexuality. I am Irmina, a dancer and femininity mentor. Here I share all my tips and tricks on how to feel amazing in your own skin. Enjoy! </p>",
        "language": "en",
        "author_name": "Irmina Galdikaite",
        "slug": "sensuality",
        "cover": "20230618_090603_ba8659087f446de3c5204fe846473084.jpg"
    },
    {
        "podcast_id": 215733,
        "title": "CULTIV8",
        "description": "<p>Welcome to Cultiv8, the ultimate LGBTQIA+ fitness podcast hosted by Lucinda Livingstone. Get ready to embark on a transformative journey as Lucinda, a trans-masc, non-binary online coach and personal trainer, guides you towards unlocking your inner strength and embracing your authentic self. From inspiring interviews and expert tips, Cultiv8 is your dedicated space for inclusive fitness, empowering the LGBTQIA+ community to build physical strength, confidence, and a vibrant sense of self. Join the community and cultivate a stronger, liberated, and prouder you!</p><p><a href=\"https://instagram.com/fuzzcultureclub\">@fuzzcultureclub</a></p><p><a href=\"https://fuzzcultureclub.com\">fuzzcultureclub.com</a></p>",
        "language": "en",
        "author_name": "Lucinda Livingstone",
        "slug": "cultiv8",
        "cover": "20230618_020626_9a2179888d8e6e5a6de0411af6dff329.jpg"
    },
    {
        "podcast_id": 216879,
        "title": "HEAUXsum Tlk",
        "description": "<p>Welcome heauxs! You’re not here by mistake. We are two friends, with two different opinions. We are gonna dive into everything from sex, love, relationship, and entertainment. So sit back, relax, and make sure the kids not in the room.</p>",
        "language": "en",
        "author_name": "Latrelle & Nique ",
        "slug": "heauxsumtlk",
        "cover": "20230626_030652_6c21eca6c9dda8001f94f9c4e6f79cc2.jpg"
    },
    {
        "podcast_id": 217692,
        "title": "Menopause Help - short and sweet, do not suffer in silence.  Symptoms and Solutions.",
        "description": "<p>Menopause Help - short and sweet, do not suffer in silence.</p><p>Symptoms and Solutions.</p><p><a href=\"https://www.buymeacoffee.com/boiltheocean\"><strong><em>Please donate if you found the podcast helpful </em></strong>https://www.buymeacoffee.com/boiltheocean</a></p>",
        "language": "en",
        "author_name": "MMM",
        "slug": "menopause-help",
        "cover": "20230702_100705_2fbb2fa4e34c55788c101173dd8d3fd7.jpg"
    },
    {
        "podcast_id": 217701,
        "title": "Les' Ka Ba?",
        "description": "<p>Hello mga Ka-Les\". Ang Podcast na eto ay pawang pagpapatunay na hindi kayo nag-iisa sa journey ninyo bilang miyembro ng LGBTQIA+. </p><p>By the way-isa akong Expat (OFW) na nakikipagsapalaran para supportahan ang mga mahal natin sa buhay- nais ko lang mgbahagi ng kwento ko, kwento nio, at kapwa naten mga Ka-Les'.Upang magabayan naten ang isat' isa, sa pamamagitan ng pag-bahagi ng inyong personal experiences at opinyon na maari nating talakayin dito sa aking Podcast every Friday -Midnight at 11PM (GMT Time). </p><p>Mag-send lamang ng email sa <a href=\"mailto:leskabapodcast@gmail.com\">leskabapodcast@gmail.com</a>.Follow us on twitter @leskabapodcast.</p>",
        "language": "tl",
        "author_name": "Les' Ka Ba?",
        "slug": "e4b7eeec",
        "cover": "20230702_120717_d40acb7b9f75e6f06619a5d513565cb0.jpg"
    },
    {
        "podcast_id": 218145,
        "title": "equida de genero 2022020393",
        "description": "<p>este es un podcast informativo con una opinion y experiencia del servidor</p>",
        "language": "es-mx",
        "author_name": "Espinoza Romero Juan Pablo",
        "slug": "erjp-2iv04-2022020393",
        "cover": "20230705_050746_b2da74e493c84040a6c87e0e365d4583.jpg"
    },
    {
        "podcast_id": 218687,
        "title": "Derechos Humanos",
        "description": "<p>Hola! Te comparto un poco de conocimiento. </p>",
        "language": "es-mx",
        "author_name": "Lluvia Estañon",
        "slug": "derechos-sexuales-y-reproductivos",
        "cover": "20230709_100746_9fb873de14a20abaf45eafd58c82ba41.jpg"
    },
    {
        "podcast_id": 218805,
        "title": "In Bed With The Right",
        "description": "<p>Welcome to In Bed With the Right, the new podcast from the Clayman Institute for Gender Research. Hosts Moira Donegan and Adrian Daub welcome a range of scholars and critics to analyze right wing ideas about gender, sex and sexuality – and to plumb the ways in which these ideas persist in and shape our present moment.</p>",
        "language": "en",
        "author_name": "The Clayman Institute for Gender Research",
        "slug": "inbedwiththeright",
        "cover": "20230710_050749_253b91d643f829018a2edba52bbf657b.jpg"
    },
    {
        "podcast_id": 219024,
        "title": "Normal is Boring",
        "description": "<p>Normal is Boring, the podcast that delves into self-improvement, empowerment, and sexuality. Join us as we redefine the concept of living an authentic life and embracing who you truly are without apologies.</p><p>Presented by ELVT365 Academy and hosted by the insightful Johnathan Marshall, each episode of Normal is Boring brings you thought-provoking discussions and practical tips to help you navigate your journey of personal growth and self-discovery. Whether you're seeking inspiration, guidance, or simply a reminder that normalcy is overrated, this podcast is here to empower you on your path toward living your best life.</p><p>Get ready for a captivating exploration of self-expression, wellness practices, and the power of authenticity. Remember, normal is boring, and it's time to step into a life that celebrates your true self.</p><p>\"Normal is Boring,\" brought to you by ELVT365 Academy and hosted by Johnathan Marshall, is the podcast that inspires you to live a life that defies convention and celebrates the extraordinary within you.</p>",
        "language": "en",
        "author_name": "Johnathan Marshall",
        "slug": "normalisboring",
        "cover": "20230904_110912_f29c67a5e54066c40cd2052230687cfd.jpg"
    },
    {
        "podcast_id": 219581,
        "title": "2 girls 1 braincell ",
        "description": "<p>t0x and Pheonix are here to talk your ears off! Subscribe to us on youtube or pateron! Chaos ensues when we're together! We are going to focus on all things Geeky, Goofy and Ghoulish with a dash of sexuality!</p><p><a href=\"https://www.youtube.com/watch?v=gRMbfwQDVx0&amp;t=3s\">Watch on Youtube!</a></p>",
        "language": "en",
        "author_name": "2 girls: t0xictia and Pheonix",
        "slug": "2g1b",
        "cover": "20230715_030723_9d3aecd2da0ead861df815e8e479686c.jpg"
    },
    {
        "podcast_id": 219885,
        "title": "Tantra con Romina Madrid ",
        "description": "<p>Fundadora de Tantra Vitalidad, Escuela de Tantra y Artes Corporales con base en Argentina y con alcance a todas partes del mundo. Formadora de Maestros Tantra, creó el método Tantra Body Techniques.</p><p>Su especialidad es la transmutación de la energía sexual y la regeneración vital del cuerpo. Con experiencia de más de 20 años investigando la conexión cuerpo, mente y espíritu en profundidad ha alcanzado el despertar espiritual y busca transmitirlo con el mundo de manera práctica y cotidiana.</p>",
        "language": "es",
        "author_name": "Romina Madrid",
        "slug": "d8c899b0",
        "cover": "20230717_070736_d0155981294b5c87d5c732d6115c2523.jpg"
    },
    {
        "podcast_id": 220083,
        "title": "The Pied Piper Podcast ",
        "description": "<p>Welcome to the “Pied Piper Podcast” A podcast that takes you on a journey beyond the stage  and into the world of professional exotic dancers. Join me   Piper, your host, as we explore the lives of the dancers and other industry professionals who work tirelessly to bring you into their world of excitement day after day, night after night. In each episode, we'll delve into both the challenges and rewards of the job, as well as some of the personal stories that shape the lives of these talented and sexy individuals. Get ready to be inspired, entertained, and enlightened as we look past the music, lights, pole and stage, to reveal the magic that happens behind the scenes, and get a peak like never before, into the lives of exotic dancers.</p>",
        "language": "en",
        "author_name": "Piper",
        "slug": "thepiedpiperpodcast",
        "cover": "20230718_090708_992524bca10be7dcc34c5da3ac06d5ee.jpg"
    },
    {
        "podcast_id": 220143,
        "title": "shitting out our intestines",
        "description": "<p>doing this because we love the tea and I love natalie towns</p>",
        "language": "en",
        "author_name": "Clara and sophia",
        "slug": "962-kimberton-ct",
        "cover": "20230719_030716_d0733ae2ab90a056ddb13b5b377968ae.jpg"
    },
    {
        "podcast_id": 220279,
        "title": "Dear Darla Weekly",
        "description": "<p><strong>Hey Friendships!! The long awaited podcast by Kaye, Angie and Ron is finally here! Get to know them, their lives and the randomness that comes with knowing the 3 of them! Have fun listening!</strong></p><p><strong>Follow us on Instagram </strong></p><p><strong>@mmmmkaye</strong></p><p><strong>@cookieforgoodluck</strong></p><p><strong>@ron_cruz</strong></p><p><strong>@deardarlaweekly</strong></p>",
        "language": "en",
        "author_name": "Dear Darla",
        "slug": "deardarlaweekly",
        "cover": "20230719_090708_38cbfd685b582e1e385c7fcaa0cb0871.jpg"
    },
    {
        "podcast_id": 221328,
        "title": "Shot of Culture : Queer Tales over Kava and Tequila Sips",
        "description": "<p>Join two long-time friends, Peelo G. and Pratibha every week as they dive into queer culture with an intersectional Latine / AANHPI twist.</p>",
        "language": "en",
        "author_name": "Pratihba and Peelo G. ",
        "slug": "shotofculturepodcast",
        "cover": "20230727_010742_56886b17c4b90572aff59ff9dbf4b583.jpg"
    },
    {
        "podcast_id": 223103,
        "title": "GroupifyHub",
        "description": "<p><strong>GroupifyHub is an incredible platform to connect, engage, and share with like-minded individuals from all around the world. Whether you're a tech enthusiast, a fitness aficionado, a creative soul, or simply seeking to expand your horizons, we've got something special in store for you!</strong></p>",
        "language": "en",
        "author_name": "GroupifyHub",
        "slug": "groupifyhub",
        "cover": "20230808_110803_f7aad4bd51f25acfc9828ac2487762a1.jpg"
    },
    {
        "podcast_id": 223381,
        "title": "Keirazeye",
        "description": "<p>Keirazeye takes you through the eyes of a young black queer woman who struggles to navigate love, sex, friendships, relationships, self discovery, and much more. Each episode brings upon new challenges that she tries to overcome. Every now and then her friends will come along as they talk through their experiences as young adults.</p>",
        "language": "en",
        "author_name": "Tykeira Robinson ",
        "slug": "keirazeye",
        "cover": "20230810_030806_0ad1a0ed63ff3c93df789475b7082e82.jpg"
    },
    {
        "podcast_id": 223655,
        "title": "Sweet Release",
        "description": "<p>Welcome to Sweet Release, the podcast where we dive into the delectable world of pleasure, self-love, healing, kink, intimacy, and non traditional style relationships. I’m your host, Barbie Jean, and each week, we’ll embark on a journey to uncover the secrets of sheer satisfaction and enticing exploration. Get ready to unleash your desires, challenge norms, and embrace every facet of your authentic self. This is Sweet Release, where the sweetest pleasures await.</p><p>Video Episodes available on Spotify &amp; Youtube. </p>",
        "language": "en",
        "author_name": "Barbie Jean",
        "slug": "sweetreleasepod",
        "cover": "20230811_090830_fd32e05472bd5668b21ff51bf38ac290.jpg"
    },
    {
        "podcast_id": 223789,
        "title": "Spicy Gems",
        "description": "<p>Dropping Gems about Relationships, Life, and Sex</p>",
        "language": "en",
        "author_name": "Jhix and Sam",
        "slug": "spicygemspodcast",
        "cover": "20230812_100803_1a2f364e3d7790954379db99e56b209b.jpg"
    },
    {
        "podcast_id": 224430,
        "title": "Les Indomptables",
        "description": "<p>Découvrez notre podcast captivant et engagé qui explore les méandres des sujets sociaux à travers une lentille féministe intersectionnelle. Rejoignez-nous pour des conversations stimulantes, des analyses approfondies et des récits inspirants, alors que nous examinons les enjeux qui touchent notre société sous des angles variés. Notre objectif est de divertir tout en éduquant, en mettant en lumière les voix marginalisées, en remettant en question les normes établies et en favorisant la réflexion critique. Rejoignez-nous pour une immersion enrichissante dans les questions sociales d'aujourd'hui, avec une touche de légèreté et de bonne humeur.</p>",
        "language": "fr",
        "author_name": "Marie-Christine et Amély",
        "slug": "lesindomptables",
        "cover": "20230816_110811_93b561bc0ae985b3942a68aea074820b.jpg"
    },
    {
        "podcast_id": 224516,
        "title": "Wouldn't You Like To Know",
        "description": "<p>An intriguing podcast where we provide different perspectives on culturally relevant topics, focusing on being sex-positive moms and businesswomen.</p>",
        "language": "en",
        "author_name": "MJ²",
        "slug": "wouldnt-you-like-to-know",
        "cover": "20230817_060829_94073338b23df7cabd87f98bda5d56ed.jpg"
    },
    {
        "podcast_id": 224764,
        "title": "The Whore House",
        "description": "<p>Welcome to The Whore House! Where there's no judgment and no subject is off limits. Tune in and buckle up as me and my co-hosts get more personal than ever. Every episode is packed with deeply relatable topics, hilarious commentary, compelling conversations, and inspiration you need to find your happy.</p>",
        "language": "en",
        "author_name": "Shae",
        "slug": "fiftyshaesdarker",
        "cover": "20230913_050926_133c4442b6f2fffc5354f05e67a6733c.jpg"
    },
    {
        "podcast_id": 225028,
        "title": "Get Intimate with the EJ's",
        "description": "<p>Step into the warm world of intimacy with the EJ's. Hosted by the real-life duo, Easy and Mer, this podcast is your haven for candid conversations and heartfelt insights. Picture cozy chats with your favorite warm beverage, where we share personal journeys, explore essential topics through a progressive lens, and embrace the beauty within life's messiness. Join us in our comfortable corner as we laugh, learn, and connect. Let's navigate this journey together with open hearts and curious minds. Welcome to the cozy embrace of \"Get Intimate with Easy and Mer.\"</p>",
        "language": "en",
        "author_name": "Easy and Mer",
        "slug": "getintimatewiththeejs",
        "cover": "20230821_020817_f3be6828a1c767f931dc595368821150.jpg"
    },
    {
        "podcast_id": 225233,
        "title": "The Sweet Side Of Life",
        "description": "<p>Come join us on our journey into the lifestyle as a longtime married couple living in Southern California!</p><p>Contact us:</p><p><a href=\"mailto:TheSweetSideOfLifePodcast@outlook.com\">TheSweetSideOfLifePodcast@outlook.com</a></p><p>TikTok:</p><p><a href=\"https://www.tiktok.com/@sweetsideoflifepodcast?_t=8f44ltzMqMA&amp;_r=1\">https://www.tiktok.com/@sweetsideoflifepodcast?_t=8f44ltzMqMA&amp;_r=1</a></p><p>Twitter(X):</p><p>@SweetSidePod</p>",
        "language": "en",
        "author_name": "The Sweets",
        "slug": "thesweetsideoflifepodcast",
        "cover": "20230822_030849_d855d8e75ef076386dceb0e03ada94c6.jpg"
    },
    {
        "podcast_id": 225344,
        "title": "The Strategy Podcast",
        "description": "<p>This podcast is like no other. Created by Joshua Williams “J.WiLL” and Dupre Falls “Pre” they wanted to create a platform where they can talk about the ups and downs in the dating/relationship world. With Cohost Ashley Rayé “Rayé” the crew gets to learn, hear and discuss the different views and perspectives of our guest. This show isn’t about which gender is to blame but to hold each gender accountable. So stop playing games and let The Strategy crew put you on game. Have ave drink and let the laughters take you away.</p>",
        "language": "en",
        "author_name": "The Strategy Podcast",
        "slug": "thestrategypodcast",
        "cover": "20230822_060818_4017286740d47d911167b8e3158a7386.jpg"
    },
    {
        "podcast_id": 225950,
        "title": "Le Contexte Podcast",
        "description": "<p>Bienvenue dans #LeContexte, le podcast des relations humaines.</p><p>Le Contexte c'est toi, c'est moi, c'est nos histoires et expériences similaires et en même temps distinctes. Elles sont amoureuses, amicales, professionnelles...</p><p>Nous allons partager des histoires afin de s'en inspirer et de tirer des leçons.</p>",
        "language": "fr",
        "author_name": "SaFir",
        "slug": "lecontexte",
        "cover": "20230826_040859_7853ed161611b947aa5780cdba1c4479.jpg"
    },
    {
        "podcast_id": 226600,
        "title": "Time and Place with Scott and Sunil",
        "description": "<p>two gay boys talkin unedited</p>",
        "language": "en",
        "author_name": "Sirvere",
        "slug": "withscottandsunil",
        "cover": "20230902_060918_ab0b8b598a314b3a541f93e2cce46042.jpg"
    },
    {
        "podcast_id": 226621,
        "title": "En mi cuerpo y en mi corazón, yo tomo la decisión ",
        "description": "<p>Una producción radiofónica de Mano Vuelta A.C.</p>",
        "language": "es",
        "author_name": "Mano Vuelta AC",
        "slug": "yotomoladecision",
        "cover": "20230830_100825_c3f53c945d05387626955b98d64a74a1.jpg"
    },
    {
        "podcast_id": 226671,
        "title": "F*cking Disabled",
        "description": "<p>Join Ryan Reigns XXX and Avalon After Dark as they talk about their experiences with sex, disability and all the nuances that come with it.</p><p>Ryan and Avalon are both Australian sex workers and Onlyfans creators that have grown up with various forms of disability. Both have made adjustments to their own sex lives to accommodate themselves, and both have worked with clients that have a wide variety of sexual capacities.</p><p>Queer and disability friendly podcast between two hotties who f*ck each other and others for work!</p><p>See us on Only fans with a podcast exclusive 3 day free trial!</p><p>Avalon - <a href=\"https://onlyfans.com/action/trial/5lkqicds2votakzcnnqidf9ipyeqblf\">https://onlyfans.com/action/trial/5lkqicds2votakzcnnqidf9ipyeqblf</a></p><p>Ryan - <a href=\"https://onlyfans.com/action/trial/o1lfvsf4jwlropsqcmyuqbrujuovw4tu\">https://onlyfans.com/action/trial/o1lfvsf4jwlropsqcmyuqbrujuovw4tu</a></p>",
        "language": "en",
        "author_name": "Ryan Reigns XXX and Avalon After Dark ",
        "slug": "fckingdisabled",
        "cover": "20230831_050826_28253d27973925410cf8c0b7171251ad.jpg"
    },
    {
        "podcast_id": 227309,
        "title": "Cumarádi",
        "description": "<p>První a možná poslední díl podcastu o vztazích, sexu a intimitě inspirovaný naším oblíbeným podcastem Vyhonit ďábla. Tentokrát ale z mužského pohledu.</p>",
        "language": "cs",
        "author_name": "Augustýn",
        "slug": "cumaradi",
        "cover": "20230905_010925_814bb17685e974458dc805bc604dd13c.jpg"
    },
    {
        "podcast_id": 227396,
        "title": "The Kitchen Table | Queer Conversations",
        "description": "<p>Welcome to \"The Kitchen Table; Queer Conversations,\" where the warmth of heartfelt discussions meets the power of vulnerability. Join couple Jasper (they/them) and Rae (she/her) as we pull up a chair and create a safe, inviting space for candid, fearless and sometimes <em>spicy</em> conversations about all things queer.</p><p>Around our metaphorical kitchen table, we explore the diverse tapestry of queer stories, identities, and experiences. From love, sex and relationships to spirituality, self-discovery, and everything in between, our podcast is a place where challenges become catalysts for growth and where laughter and love reign supreme.</p><p>Each episode invites you to join us in stirring the pot, setting the table for dialogue that matters, and embracing authenticity. Our guests share their unique journeys, revealing the beauty, resilience, and transformation that can emerge from the power of storytelling.</p><p>Whether you identify as LGBTQ+ or as an ally, \"The Kitchen Table; Queer Conversations\" is a space for everyone to learn, connect, and find inspiration in the shared experiences of our diverse community. Join us as we explore the ever-evolving landscape of queerness, one heartfelt conversation at a time.</p><p>Subscribe, pull up a chair, and let's embark on this journey together. Because around our kitchen table, everyone's story is welcome, and every voice matters.</p>",
        "language": "en",
        "author_name": "Jasper Jones and Rae Wright",
        "slug": "thekitchentablepodcast",
        "cover": "20230906_010901_286238b095d401198ceb29c225c2a300.jpg"
    },
    {
        "podcast_id": 227439,
        "title": "Who is She?",
        "description": "<p>Growing up in a home riddled with domestic abuse and a mother fighting her own body image demons, I learned to see myself through a distorted lens. From being put on a diet at the tender age of nine, to a lifetime of navigating the constant reminders of my size, will you believe it took me twelve grueling years to get a much-needed medical diagnosis?</p><p>Join me on this journey as I recount a path marked by societal norms, self-doubt, and a hard-fought battle with self-acceptance. In this episode, I lay bare the raw truth about my personal experiences with fatphobia, the impact it had on my interactions with medical professionals, and the backlash of being a visibly happy and fat person. Listen in, as we navigate through the pain, the misconceptions, and ultimately, the triumph to self-love and acceptance. Discover how these experiences have shaped my identity and fueled my mission to help others struggling with body image and self-acceptance. This conversation might be raw, but it's real and resonates with a reality many shy away from. Let's delve into the heart of self-acceptance and body image together.</p><p><strong>Follow me on Instagram: </strong><a href=\"https://www.instagram.com/chayla.photographer/\">https://www.instagram.com/chayla.photographer/</a></p><p><strong>Join the VIP Facebook Group: </strong><a href=\"https://www.facebook.com/groups/908154196476775?_rdc=2&amp;_rdr\">https://www.facebook.com/groups/908154196476775?_rdc=2&amp;_rdr</a></p><p><strong>Book a free call or join my mailing list</strong>: <a href=\"https://linktr.ee/chaylataylor\">https://linktr.ee/chaylataylor</a></p>",
        "language": "en",
        "author_name": "Chayla Taylor ",
        "slug": "whoisshepodcast",
        "cover": "20230906_090915_b719738949fe8ca6fcb1db6dbe563735.jpg"
    },
    {
        "podcast_id": 227539,
        "title": "Departure",
        "description": "<p>Departure from Final Fantasy XV</p>",
        "language": "en",
        "author_name": "Departure - FFXV",
        "slug": "departure-ffxv",
        "cover": "20230906_110940_8980b86166faaabb246f53e03fddf564.jpg"
    },
    {
        "podcast_id": 228221,
        "title": "Be FR the Podcast",
        "description": "<p>Two young black Miami girls! Two different walks of life. Navigating the world as we see it! Discussing hot topics, the attacks we face daily as black women and digging deep into situations in our lives that make us who we are today, the dating scene (or lack thereof), childhood traumas, new-age issues and more! Just a little bit of everything! This is what girls actually talk about daily. We are introducing a few guests appearances to get other views on popular topics. Dig in to our open and honest dialogue!</p>",
        "language": "en",
        "author_name": "Amber S",
        "slug": "befrthepodcast",
        "cover": "20230911_060909_1e1dd1a66505ac8e1ed948288f9deeda.jpg"
    },
    {
        "podcast_id": 228228,
        "title": "test 1,2 test 1,2",
        "description": "<p>this is a test</p>",
        "language": "en",
        "author_name": "anonymous",
        "slug": "test12test12",
        "cover": "20230911_070926_4f1bd70b31a48d19d4c71bd217c602ea.jpg"
    },
    {
        "podcast_id": 229185,
        "title": "Blush",
        "description": "<p>We enjoy and rate your favorite wines and smutty books, all while getting tipsy and exploring and celebrating sexual empowerment, feminism, and probably some new sex tips or moves we've picked up from our reading. Not for those who easily blush!</p>",
        "language": "en",
        "author_name": "Kelly and Penny",
        "slug": "blushthepodcast",
        "cover": "20230918_030946_f5df34d7a7fb38ddd3da78c2bfe6769b.jpg"
    }
]