[
    {
        "podcast_id": 2779,
        "title": "FandomFare",
        "description": "<p>A media deep-dive podcast where Sam and Midge look way too deep into media they like</p>",
        "language": "en",
        "author_name": "Sam Wurts and Midge Block",
        "slug": "tpiiym",
        "cover": "20200708_191613_1aeb5e3513904ce815074820bcaa5f16.jpg"
    },
    {
        "podcast_id": 5922,
        "title": "Speaking Queerly",
        "description": "Produced by Kaleidoscope Youth Center - a 501(c)3 nonprofit located in Columbus, OH - Speaking Queerly examines pop culture, news, politics, and other topics that affect LGBTQIA+ youth and young adults. Learn more about us at kycohio.org.",
        "language": "en",
        "author_name": "Kaleidoscope Youth Center",
        "slug": "speakingqueerly",
        "cover": "20200129_190153_b147a7c57e07271d99e50c7f70d6cb2d.jpeg"
    },
    {
        "podcast_id": 6012,
        "title": "WORD with Dr. Michael David Clay",
        "description": "The definitive clinical WORD in personal growth and development.\n\nCONTACT:\n\nMichael David Clay, D. Min, MA,\n\nthewordhouse@frontier.com",
        "language": "en",
        "author_name": "Dr. Michael David Clay",
        "slug": "word-podcast",
        "cover": "20200203_232840_5a9e28a9f461b988d3af479761cde33a.jpeg"
    },
    {
        "podcast_id": 6787,
        "title": "GeFam Grupo de Estudos em Economia da Família e do Gênero",
        "description": "Esse podcast apresenta o GeFam e suas linhas de pesquisa.",
        "language": "pt-br",
        "author_name": "GeFam",
        "slug": "gefam",
        "cover": "20200731_164632_ef8b82dac0158ccf117873295d7d7dd1.jpg"
    },
    {
        "podcast_id": 7053,
        "title": "The Well Interior ",
        "description": "A podcast devoted to helping individuals create beauty within to live in the beauty around. Join host, licensed mental health clinician Elizabeth Siematkowski in exploring ways we can create more peace and comfort in our being and experience a more joyful life. ",
        "language": "en",
        "author_name": "Elizabeth Siematkowski",
        "slug": "thewellinterior",
        "cover": "20200324_190054_a387232cc897bbdc1f7cc4016bb180bb.jpeg"
    },
    {
        "podcast_id": 7994,
        "title": "In den Archiven gefunden ",
        "description": "Bislang nicht zu Wort gekommene Zeitzeugen, neue Perspektiven, Zahlen und Fakten. Schicksale, Begebenheiten und die immer wiederkehrende Frage – haben wir Menschen aus der Geschichte etwas gelernt? All dies und mehr jeden Dienstag ab 10 Uhr. Der Podcast ist Teil des „Archives, Research and Digitization“ Programm des Pilecki-Instituts Berlin. In Zusammenarbeit mit u.a. dem Bundesarchiv werden unbekannte oder nur schwer verfügbare Dokumente und Quellen erschlossen und digitalisiert. Ziel ist, diese der akademischen Welt zur Verfügung zu stellen, aber auch die aus dem Archivgut gewonnenen Erkenntnisse in die Öffentlichkeit zu tragen. Letzterem Anspruch wollen wir nun u.a. durch unsere neue Podcast-Reihe „In den Archiven gefunden“ gerecht werden. ",
        "language": "de",
        "author_name": "Pilecki-Institut Berlin",
        "slug": "indenarchiven",
        "cover": "20200420_221458_ab7191cf36c3bbadd037155091091ee7.jpeg"
    },
    {
        "podcast_id": 8053,
        "title": "Daera Podcast | بودكاست دائرة",
        "description": "نحن دوائر مستمرة في الحركة. نهايتنا منعدمة، لأن أثرنا في الحياة مستمر حتى بعد ذهابنا، وبدايتنا مبهمة لأننا لا نعرف كل شيء عن ماضينا ومن سبقونا مهما حاولنا. فنحن كلنا دوائر، مستمرون لا نتوقف. ",
        "language": "ar",
        "author_name": "Jehan Alkhateeb",
        "slug": "daera",
        "cover": "20200422_155527_0502fc93aa04b0cfb56ae831505095c7.jpeg"
    },
    {
        "podcast_id": 8208,
        "title": "ABA Wizard",
        "description": "The ABA Wizard podcast is your weekly dose of research. Keep up with current literature in the field of applied behavior analysis as Kylan Heiner, BCBA takes the mic and interviews authors of current journal articles. ",
        "language": "en",
        "author_name": "ABA Wizard",
        "slug": "abawizard",
        "cover": "20200426_234543_8da91562fe67034ee6df5bcf9475b9b9.jpeg"
    },
    {
        "podcast_id": 9340,
        "title": "Le Nouveau Congo",
        "description": "Le podcast d’IntelCongo - une plateforme digitale indépendante d’analyses et d’opinions sur la République Démocratique du Congo.",
        "language": "fr",
        "author_name": "Intelcongo",
        "slug": "lenouveaucongo",
        "cover": "20200603_191258_002d6b7ea440bffe48c270173222044e.jpeg"
    },
    {
        "podcast_id": 9392,
        "title": "Transitional Justice Institute: Public Lectures and Events",
        "description": "A podcast series from the Transitional Justice Institute (TJI) at Ulster University in Northern Ireland, sharing our public lectures and events from key scholars and practitioners. The TJI is a world-leading research institute investigating themes of conflict, transitional justice, human rights, gender and international law. Learn more about our research, public events, taught postgraduate programmes (LLM Human Rights Law and Transitional Justice; LLM Gender, Conflict and Human Rights) and our PhD community at www.transitionaljustice.ulster.ac.uk. ",
        "language": "en",
        "author_name": "Ulster University",
        "slug": "tji",
        "cover": "20200605_191825_f301394bafde5535be217d9b9bbfc55e.jpeg"
    },
    {
        "podcast_id": 9570,
        "title": "Larger, Freer, More Loving ",
        "description": "We hope to aid ourselves and others in a journey towards living a “larger, freer, and more loving” life through critically engaging the popular culture that we live in, particularly with a focus on justice, care, the Arts, and community.",
        "language": "en",
        "author_name": "Matt LaVine & Dwight K. Lewis Jr.",
        "slug": "largerfreermoreloving",
        "cover": "20200612_004010_d8c3f7885be7832e399ce15f6b801c64.jpeg"
    },
    {
        "podcast_id": 9671,
        "title": "Ilona Rauhala",
        "description": "Psykologi ja valmentaja Ilona Rauhala keskustelee podcastissaan mielenkiintoisten vieraiden kanssa vaihtuvista aiheista. Aiheina ovat mm. psykologia, valmentaminen, johtaminen, filosofia ja terapeuttinen työskentely. Vieraina on omilla aloillaan menestyneitä ja kokeneita henkilöitä, jotka tarjoavat tuoreita näkökulmia ajankohtaisiin ja mieltä askarruttaviin kysymyksiin.\n\n\nKatso Ilonan valmennussivusto:\n\n<a href=\"https://www.palomacorento.fi\">palomacorento.fi </a>",
        "language": "fi",
        "author_name": "Ilona Rauhala",
        "slug": "ilonarauhala",
        "cover": "20200618_085058_5e2dd79ee5b550e09f87e539ec1ba3c7.jpeg"
    },
    {
        "podcast_id": 10483,
        "title": "A Slice of Orange",
        "description": "All things politics in North Orange County, California. ",
        "language": "en",
        "author_name": "Jodi Balma ",
        "slug": "sliceoforange",
        "cover": "20200712_201857_bef67df9af9b98289e1c93b2ddbf871e.jpg"
    },
    {
        "podcast_id": 11664,
        "title": "Fokuspunkt Mellemøsten",
        "description": "Mellemøsten har en lang og indviklet historie, og måske også fremtid. I Fokuspunkt Mellemøsten tager vært Mikkel Mousten fat i nogle af de begivenheder, som har betydning for regionen. Både politisk og kulturelt. Fokuspunkt Mellemøsten er podcasten for dig, som gerne vil have indsigt i et af verdens mest komplicerede områder.",
        "language": "da",
        "author_name": "Harbo Mousten / Harbo Mousten Media",
        "slug": "fokuspunktmellemoesten",
        "cover": "20200824_093856_454cc8daeccfc6e3259e94147fec79ef.jpg"
    },
    {
        "podcast_id": 13654,
        "title": "The Civic Podcast ",
        "description": "Hello everyone,\n\nThis podcast is a space to discuss, debate and dialogue about important matters that our society is facing. The goal is to keep it civil, keep it respectful and keep it tolerant. Common understanding and the exchange of ideas is the only way forward where critical thinking can prevail in this chaotic world we live in. \n\nVarious topics will be covered, from society to the economy, from culture to religion, from art to technology. Every single aspect, factor and fact has an effect on the way we think and the way we act. A multidisciplinary approach needs to be taken when speaking about important topics that have an impact on policy, culture and our current socio-economic structures. \n\nI hope that throughout the podcast people will learn and listen to other points of view, but more importantly that the listeners think by themselves and come up with their own conclusions about was is just and fair. I really do believe that good information and intentions can bring out the best in people, let's make that a reality and revolutionise the way we think, act, discuss and interact with each other. \n",
        "language": "en",
        "author_name": "Ismael Paez Civico",
        "slug": "thecivicpodcast",
        "cover": "20210713_221458_1084a84fd9c625e9c70a82dc275d4a15.jpg"
    },
    {
        "podcast_id": 14367,
        "title": "econopolitics",
        "description": "LASA Economics and Politics Section official podcast",
        "language": "en",
        "author_name": "LASA Economics and Politics Section",
        "slug": "econopolitics",
        "cover": "20220227_100252_8edb71b071768fc3ddcdda6ef69bbe14.jpg"
    },
    {
        "podcast_id": 14679,
        "title": "İstanbul Politikalar Merkezi Serileri",
        "description": "İstanbul Politikalar Merkezi (İPM) demokratikleşmeden iklim değişikliğine, transatlantik ilişkilerden çatışma analizi ve çözümüne kadar, önemli siyasal ve sosyal konularda uzmanlığa sahip, çalışmalarını küresel düzeyde sürdüren bir politika araştırma kuruluşudur. İPM araştırma çalışmalarını İPM-Sabancı Üniversitesi-Stiftung Mercator Girişimi, İklim Değişikliği, Demokratikleşme ve Kurumsal Reform, SHURA Enerji Dönüşümü Merkezi, Kentleşme ve Yerel Yönetişim, Çatışma Çözümü, Arabuluculuk ve Birlikte Yaşam ana başlıkları altında yürütmektedir. Bu kapsamda gerçekleşen etkinliklere buradan ulaşabilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipc",
        "cover": "20201202_110823_49e09417f80ef570a8a099d661520023.jpg"
    },
    {
        "podcast_id": 16412,
        "title": "İklim Kafe Konuşmaları",
        "description": "İklim Kafe Konuşmaları'nda iklim değişikliğiyle ilgili çeşitli konuları, politikadan atmosfer bilimlerine, ekonomiden psikolojiye kadar disiplinler arası bir ortamda tartışmak üzere bir araya geliyoruz.  İklim Kafe Konuşmaları serisini buradan dinleyebilirsiniz. ",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipm",
        "cover": "20201202_135237_87088afee167711c4d957188e962855f.jpg"
    },
    {
        "podcast_id": 16804,
        "title": "Salgın ve Toplum",
        "description": "Salgın ve Toplum Webinar serimizi buradan dinleyebilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipc4",
        "cover": "20201203_112846_e4e48353ec86774e8637deb4a0e21ada.jpg"
    },
    {
        "podcast_id": 16964,
        "title": "Doğa ve İklim Söyleşileri",
        "description": "Doğa ve İklim Söyleşileri'nde doğa koruma ve iklim değişikliği şle mücadele alanlarını bir araya getirerek tartışmayı amaçlıyoruz. Doğa ve İklim Söyleşileri serisinin tüm bölümlerine buradan ulaşabilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipmipc",
        "cover": "20201204_065712_a07fd2d94a65f3417a3b91f61c526eb9.jpg"
    },
    {
        "podcast_id": 16967,
        "title": "Nasıl bir Dünya? Nasıl bir Türkiye?",
        "description": "İstanbul Politikalar Merkezi (İPM) ve Medyascope işbirliğiyle hazırlanan “Nasıl bir Dünya? Nasıl bir Türkiye?” programının bütün bölümlerini buradan izleyebilirsiniz.",
        "language": "tr",
        "author_name": "İstanbul Politikalar Merkezi",
        "slug": "ipmipcipm",
        "cover": "20201204_070310_744663f249a66f6925291c2a502a28e7.jpg"
    },
    {
        "podcast_id": 17018,
        "title": "IASLT in Conversation",
        "description": "This is the official podcast hosted by the Irish Association of Speech and Language Therapists. The IASLT has celebrated their 50th anniversary in 2019, now going on its 51st year!\nIn these podcasts, we will aim to promote awareness surrounding different speech and language disorders, interview some experts in their areas of expertise and knowledge and much more. \n\nSit back, grab a cuppa and enjoy.\n\nStay tuned to see what else we have coming soon!",
        "language": "en",
        "author_name": "IASLT",
        "slug": "iaslt",
        "cover": "20210118_100745_13e75238c8d3ab95f509c4f40c0dc80d.jpg"
    },
    {
        "podcast_id": 17889,
        "title": "Siren Sundays",
        "description": "Reconnecting people with nature; 🌎Saving the world one ocean at a time, w/one conversation at a time 🎥🧜🏽‍♀️",
        "language": "en",
        "author_name": "Lashanti Jupp",
        "slug": "sirensundays",
        "cover": "20201214_115012_4251fca625f2e13699eb8dcdd924151f.jpg"
    },
    {
        "podcast_id": 18989,
        "title": "The Women of Regenerative Ag: Transforming the Health of the Soil, Land & People",
        "description": "This is a platform for the extraordinary women leading the regenerative agricultural movement—and the transformation of our societies--around the world. They are on the ground, creating critical shifts in seemingly intractable and highly unsustainable systems. And they've been doing so for a long time. \n\nIn this series, we look to explore beyond the soil, to the underlying theme of transformation itself across multiple dimensions: from that very internal landscape of human consciousness to the outer manifestation in the world around us, be it in the form of agricultural management practices, tools and techniques, to culture, economics, policy, and the built environment. \n \nThis series is a joint venture with Soil4Climate and my own organization, the Ouroboros Agency, where we work to help transform the human social infrastructure, and the built environment, to create truly resilient and regenerative societies. \n \nThese recordings originally aired as interactive livestream interviews on social media. They were held during the initial months of the US Covid lockdown and due to limited facilities, we sometimes had to get creative with our locations and dealt with the occasional technical issue. ",
        "language": "en",
        "author_name": "Aurora Flynn",
        "slug": "thewomenofregenerativeag",
        "cover": "20201225_025849_d12af27f749d52f081ef1ecfafaa5bf6.jpg"
    },
    {
        "podcast_id": 22414,
        "title": "VE A TERAPIA",
        "description": "<p>Un podcast para todes, donde hablamos de esas emociones que a veces olvidamos nombrar, sentimos en voz alta y hablamos en un espacio seguro desde la vulnerabilidad ¡bienvenidx!</p>",
        "language": "es",
        "author_name": "Nathalia Molina",
        "slug": "veaterapia",
        "cover": "20230711_090709_7b6a869fa5a9f385d414a8b3be76afb1.jpg"
    },
    {
        "podcast_id": 22505,
        "title": "Intergenerational Topics",
        "description": "Talks to contribute to the expansion of knowledge in intergenerational matters, by formalizing its breakdown into specific sections such as lifestyle, skills, income, employment, consumption and saving behaviours and technology and recycling adoption.",
        "language": "en",
        "author_name": "ISRCenter",
        "slug": "isrcenter",
        "cover": "20210106_164310_6b574ab2743e59973bbf2d0b148e579f.jpg"
    },
    {
        "podcast_id": 22573,
        "title": "TechnoViews",
        "description": "<p>TechnoViews features interviews with humanities and social science scholars on a wide range of topics at the intersection between science, technology, and society in the 21st century. Our podcast episodes provide a more in-depth understanding of the major challenges of living in a world that is increasingly dominated by global articulations of technoscience. Available in all major podcast platforms, including Spotify, Google Podcasts, and Apple Podcasts, among others. <em>TechnoViews</em> is produced by the Sci-Tech Asia International Research Network and is supported by the Research Cluster “Technoscience, Society, and Environment” of the Research Center for Anthropology and Health at the University of Coimbra.</p><p><strong>Podcast Team: </strong>Joseph BOSCO, Gonçalo D. SANTOS, Nicolas STERNSDORFF-CISTERNA, and Jun ZHANG</p>",
        "language": "en",
        "author_name": "Sci-Tech Asia International Research Network",
        "slug": "technoviews",
        "cover": "20210106_204814_338234fa01d262416ce40ced6624a427.jpg"
    },
    {
        "podcast_id": 22586,
        "title": "Suni Says So...",
        "description": "<p>Sometimes ranting, blasting, or rambling about current events, world going-on's, my life, human behavior... who knows...</p>",
        "language": "en",
        "author_name": "Suni Rose",
        "slug": "sunisaysso",
        "cover": "20210205_200035_89313bfdfc03c2194054b3001a7e1242.jpg"
    },
    {
        "podcast_id": 24821,
        "title": "Real Stories Podcast",
        "description": "Real People, Real Stories, Real History. Brian and Graham dive into some of their favorite historical tales from the Heart of it All. ",
        "language": "en",
        "author_name": "Graham Treadway, Brian Kummerer",
        "slug": "realstoriespodcast",
        "cover": "20210115_184833_c7224689f6b9f32bd30309d0aa4b2cd9.jpg"
    },
    {
        "podcast_id": 25269,
        "title": "AAN Impulses",
        "description": "#AANImpulses are one-hour events, starting with a 15–20 minute impulse, introducing the work of an applied anthropologist in a certain field, showing how anthropology helped a specific project, and inspiring the community to ask difficult questions and talk about important challenges. It will be followed by a 40-minute discussion between all participants.",
        "language": "en",
        "author_name": "The Applied Anthropology Network",
        "slug": "aan-applyclubevents",
        "cover": "20221018_071027_4e1a574dad17a2e21dcdbc90ff0863ae.jpg"
    },
    {
        "podcast_id": 25811,
        "title": "EITA",
        "description": "E.I.T.A or the Environmental Influences on Teenage Academics. This podcast will be looking at a psychological study that researches how the environmental influences that might affect a teenager's grades. These environmental influences are things like family, social media, etc. ",
        "language": "en",
        "author_name": "Daria",
        "slug": "environmentalifluencesonteens",
        "cover": "20210218_170301_fbe254f35a7f903c7a3c694f974c7aee.jpg"
    },
    {
        "podcast_id": 27539,
        "title": "Jess, lapsed!",
        "description": "Jess, lapsed! Ja täiskasvanud - ja kõik need, kes ei tunne end ei täiskasvanu ega lapsena, kes on või ei ole lapsevanemad! Võtame siin taskuhäälingus ette kõiksugu kasvamise ja kasvatamisega seotud teemasid, näpistame neid pisut, kaasame erinevaid hääli ja mõttekäike, anname just kui niidiotsa kätte - ja jätame sind siis mõtisklema. \n\nKui soovid “Jess, lapsed!” taskuhäälingut ja kontot toetada - patreon.com/jesslapsed ootab sind avasüli! Patroonidele on saadaval ka iga taskuhäälingu osa täispikkuses loetavana ning vaimse tervise ja teadveloleva vanemluse ampsud. Lisaks muidugi ka südamerahu vanemahariduse edendamisest! Aitäh sulle!\n",
        "language": "ee",
        "author_name": "Jess, lapsed!",
        "slug": "jesslapsed",
        "cover": "20210126_081138_29b5aae142e55e07386ffff0a4199b3a.jpg"
    },
    {
        "podcast_id": 28224,
        "title": "Anthropolitical",
        "description": "Studierende der Ethnologie behandeln politische und studienrelevante Themen:\n\n\nethno-fachverein@isek.uzh.ch",
        "language": "de-ch",
        "author_name": "Fachverein Ethnologie Zürich",
        "slug": "anthropolitical",
        "cover": "20210128_220010_9b2b4bbef7a4b43c375b7771740539b9.jpg"
    },
    {
        "podcast_id": 29189,
        "title": "Into the Light",
        "description": "Into the Light is a podcast series is for anyone who has ever been curious about mental health, especially university students. It is a place to learn about the impact of mental health and to learn from leading experts in mental health. At its core, this series is a place where students can share their mental health stories anonymously knowing that it is a safe space and that they will be heard.",
        "language": "en",
        "author_name": "Dulce Rivera",
        "slug": "intothelightpodcast",
        "cover": "20210201_171554_29c924ba54925b8200ba9ae068dd9e30.jpg"
    },
    {
        "podcast_id": 30021,
        "title": "Unapologetic",
        "description": "Unapologetic is a podcast made by sociology students for sociology students and everyone else! We are a part of Podcast Committee in SEC Study Association at the University of Amsterdam. We aim to bridge pop culture and sociological imagination. We aspire to not only embody, but also, inspire curiosity and critique of the social world. \n\nDon't forget to follow us on Instagram @unapologetic.sec",
        "language": "en",
        "author_name": "SEC ",
        "slug": "unapologeticbysec",
        "cover": "20210204_143622_2ae2bf78665c9d56d2fd49bafe3054ac.jpg"
    },
    {
        "podcast_id": 30314,
        "title": "The Violet Podcast",
        "description": "Welcome to The Violet, a current affairs podcast for anyone interested in Politics, Economics, History and the Social Sciences. As teachers, we've always been passionate about helping our students understand fundamental theories in the social sciences that explain what's going on in our world. We wanted to open up our classrooms to anyone and everyone who wants to know more about the theory behind the news, presented in a clear, balanced, and insightful manner.\nNew episodes are uploaded fortnightly on Saturdays.",
        "language": "en",
        "author_name": "Jerome Singh, Paul Moroz",
        "slug": "theviolet",
        "cover": "20210205_163510_a056a5446e0805cb8e36826122cfeb52.jpg"
    },
    {
        "podcast_id": 30799,
        "title": "Psych Flow",
        "description": "On Psych Flow, we take a look at everyday phenomena and occurrences through a Psychological and Neuroscientific lense. Show host Sara; BSc Psychology, MSc Clinical Neuropsychiatry and special interests in social discussions will co-host with friends and opinionated guests who have experience in relevant fields in order to provide you with intriguing discussions in each episode!",
        "language": "en",
        "author_name": "Sara",
        "slug": "psychflow",
        "cover": "20210304_143827_3e19efbfac0c5a713ffbcb9bf4c9515b.jpg"
    },
    {
        "podcast_id": 30950,
        "title": "The Relentless Patriots",
        "description": "Welcome fellow patriots to our official podcast! Here we will discuss the evil agendas at hand of political correctness and liberalized socialistic communism and how its effecting our Country. We also do not condone racism in anyway, shape and form. Patriots come in all different races, religions, colors and creeds!. We must be clear about our Patriotism and who we are as Americans! We must adhere to our Constitution and Amendment rights the way our forefathers intended for us.\nWe encourage pro community patriotic activism when its called for and unity of all people under God as ONE Nation. We preach freedom over fear and put out the political correctness flame that is burning this nation from within while at the same time promote peace and unity through liberty by law. We are against big government bureaucrats, main stream media, anarchists, human sex trafficking, crony capitalists, socialists, American apologists and most importantly communism promoted through tyrannical leftism.\nWe The People must start talking, organizing and rallying for Patriotism, for love of this country relentlessly because we are the Relentless Patriots! Never apologize for your love of this great land! If you're tired of being called a deplorable or non essential, this is the place to congregate and take action! \nRISE AND RISE AGAIN UNTIL LAMBS BECOME LIONS!\n\nFeel free to visit our official apparel page @ www.therelentlesspatriots.com",
        "language": "en",
        "author_name": "The Relentless Patriot",
        "slug": "therelentlesspatriots",
        "cover": "20210301_061654_fb54c0375e1dace42ca1b6f297cce314.jpg"
    },
    {
        "podcast_id": 31982,
        "title": "Down To Earth",
        "description": "Climate change tends to trigger strong emotions. There is a lot of noise surrounding the concept. It’s complex, abstract but the impact is very real and every single person on planet Earth is concerned. The story tends to be pretty gloomy but four keen Imperial College beans pursuing a master in Climate Change, Management and Finance decided to shift the narrative. Down to Earth is a podcast which aims at reuniting people on our power to act together. Through different episodes, Danielle, Marie, Chris and Anne-Laure go beyond the infuriating climate news and critically look at how sustainability is approached in different local contexts. Curiosity and climate justice are at the very heart of this podcast. We believe a better understanding of different and unknown realities allows for a stronger collective action on climate change.",
        "language": "en",
        "author_name": "Danielle Miranda Leibu, Marie Neveu, Anne-Laure Rajaona, Chris van Der Merwe",
        "slug": "downtoearth",
        "cover": "20210218_112354_2fa20bb4c96d0b9f699bb4e40797e87a.jpg"
    },
    {
        "podcast_id": 32099,
        "title": "Lion Opinions ",
        "description": "<p>This Podcast aims to share ideas about society's hot topics, movies, music, books, and even intriguing daily stories. Enjoy the journey. Welcome to email or follow me on social media to share your thoughts. 📧 | turings1213@gmail.com</p>",
        "language": "en",
        "author_name": "Turing S.",
        "slug": "lionopinions",
        "cover": "20210530_223439_3d05ef028d4b0cf206a511debd569c21.jpg"
    },
    {
        "podcast_id": 33843,
        "title": "Open Source Futures",
        "description": "Present news and developments in the context of strategic foresight. Singapore/Asia-based.",
        "language": "en",
        "author_name": "Eddie Choo",
        "slug": "opensourcefutures",
        "cover": "20210218_071235_91fe15a3f9bc4b28c4c28c59142065e2.jpg"
    },
    {
        "podcast_id": 33892,
        "title": "Polyvox: an Anthrogang Production",
        "description": "Five friends gather in the theater of the mind, conducting rigorous ethnographies of places that don't exist. New episodes every other Monday.",
        "language": "en",
        "author_name": "Rune Davino-Collins, Conor Carroll, Lindsey Weiss, Olly Manning, Cayd Barrera",
        "slug": "polyvox",
        "cover": "20210319_200315_c812f3cc2557b499fa0350bb77b956f9.jpg"
    },
    {
        "podcast_id": 34441,
        "title": "Royally Screwed",
        "description": "A bi-weekly show exploring the greatest, worst, and craziest rulers throughout human history. How did a man trick his way into becoming a Russian Czar? Did Caligula actually wage war against the ocean? Was Alexander really that Great? Get your answers and learn about some lesser known rulers who you might learn to love or love to hate.",
        "language": "en",
        "author_name": "Denim Creek",
        "slug": "royallyscrewed",
        "cover": "20210423_035819_d96e84849093139d5411f95e6f515dbd.jpg"
    },
    {
        "podcast_id": 35679,
        "title": "Much Ado about Economics",
        "description": "Two individuals using their economics knowledge to talk about as much economics as we can. ",
        "language": "en",
        "author_name": "Sibtain & Saad",
        "slug": "maaeconomics",
        "cover": "20210223_062737_a00f83b6889efd4f5f25595e155f9f52.jpg"
    },
    {
        "podcast_id": 36382,
        "title": "Au-delà de Roxham",
        "description": "Au-delà de Roxham est un balado réalisé par le Centre Social d'Aide aux Immigrants (CSAI) avec l'appui financier de Centraide. \n\nPar de multiples témoignages de demandeurs d'asile ainsi que d'acteurs(rices) du milieu, ce balado se veut un aperçu intime et authentique des enjeux et réalités vécues par les demandeurs d'asile au Québec.\n\n*\n*\nCe balado est réalisé grâce à l'appui financier de Centraide.\n*\n*\nMontage, mixage et création sonore : Rémy Jannelle",
        "language": "fr",
        "author_name": "Centre social d'aide aux immigrants (CSAI)",
        "slug": "audeladeroxham",
        "cover": "20210224_200941_6db68affb09c98a8b97dfacec760d7ec.jpg"
    },
    {
        "podcast_id": 37969,
        "title": "Bad Grads",
        "description": "Do you like true crime, cryptids, 1D, and general chaos? Well so do we.\nWelcome to Bad Grads, a podcast about true crime and other shit! We're your hosts Kait & Kali, two criminology graduate students with no brain-to-mouth filters.\nListen in if you'd like or don't! It's up to you!",
        "language": "en",
        "author_name": "Kait & Kali",
        "slug": "badgrads",
        "cover": "20210301_235243_95b098195d4d8e3c7a271ef03d63d621.jpg"
    },
    {
        "podcast_id": 38343,
        "title": "Besjede o obrazovanju",
        "description": "Mjesto na kojem se spajaju ljudi i rađaju ideje, kako bi zajedno stvarali dobro obrazovanje i čuvali radost djetinjstva za svako dijete.  ❤\n\nBesjede o obrazovanju su razgovori sa zaljubljenicima u obrazovanje. Domaćini u studiju, Nedim Krajišnik i Namir Ibrahimović do sada su ugostili profesionalce iz oblasti obrazovanja, nastavnie, učenike, pedagoge…\n\nBesjede nemaju granice.\n\nCentar za obrazovne inicijative Step by Step je profesionalna, nevladina organizacija osnovana sa ciljem da promoviše obrazovnu filozofiju usmjerenu na dijete, i pravo svakog djeteta na kvalitetan odgoj i obrazovanje na području cijele Bosne i Hercegovine",
        "language": "bs",
        "author_name": "Coi Step by Step",
        "slug": "coistepbystep",
        "cover": "20221108_091108_a862e4444a2baef0ba16953e1dec554b.jpg"
    },
    {
        "podcast_id": 39877,
        "title": "Clatter Chatter on All That Matters!",
        "description": "Sociological Imagination Mixed with Theological Grounding",
        "language": "en",
        "author_name": "Rev Dr Karla J Cooper",
        "slug": "clatterchatterandallthatmatters",
        "cover": "20210313_224900_6443af16d846bf437d5ca1c92638f4ea.jpg"
    },
    {
        "podcast_id": 40322,
        "title": "#ZPSgdynia",
        "description": "\n#ZPSpodcast #PODCASTOLOGICZNIE #bajkoweSPOTy #ZPSteam #ZPSgdynia",
        "language": "pl",
        "author_name": "Zespół Placówek Specjalistycznych",
        "slug": "zpsgdynia",
        "cover": "20210312_104703_0b5f96c713c6a89ab1ab6e7e17a89e14.jpg"
    },
    {
        "podcast_id": 40569,
        "title": "Apéro-Cigare",
        "description": "<p>Apéro-Cigare est un podcast bimensuel où les questions d'actualités politiques et culturelles sont abordées avec nos invité/es, un verre à la main (avec modération, évidemment). Cheers!</p>",
        "language": "fr",
        "author_name": "Hélène Bernardot & Jeffrey Houle",
        "slug": "aperocigare",
        "cover": "20230407_110451_f44a41bd838e33a6298b80b3cec93121.jpg"
    },
    {
        "podcast_id": 40850,
        "title": "The In-Between Project",
        "description": "The In-Between Project explores the stories of those who don't feel completely at home in their cultures, races, language, heritages or selves. To be in-between means to embrace the multiplicity and contradictions of one’s identity. To exist between homelands, both literal and metaphorical. Join us as we explore what a future looks like with more people who are neither nor, who belong in the in-between. ",
        "language": "en",
        "author_name": "Noa Richard",
        "slug": "the-inbetween",
        "cover": "20210312_025447_61e0b14b68eae32eea3a7c0aabbde230.jpg"
    },
    {
        "podcast_id": 40975,
        "title": "Forgotten Victims: The Forensic Interview ",
        "description": "The Forgotten Victims Podcast, hosted by Scott Modell Ph.D. and Staci Whitney, LMSW, educates and empowers multidisciplinary team members to successfully investigate crimes against individuals with disabilities and other vulnerable populations. With decades of experience between them, they share how teams can successfully seek justice for vulnerable victims by discussing research, case examples and sharing practical skills for every step of an investigation. Join Scott and Staci to learn more about how you can make an impact in your community and better serve victims with disabilities through your work.",
        "language": "en",
        "author_name": "Modell Consulting Group ",
        "slug": "forgottenvictimspodcast",
        "cover": "20210312_151532_dfcae8d33728fe1701a3d2346d9d3544.jpg"
    },
    {
        "podcast_id": 43072,
        "title": "wPRAWIEni",
        "description": "Podcast prowadzony przez członków projektu społecznego wPRAWIEni. Rozmowy z osobami związanymi z prawem. Słuchając - stajesz się wPRAWIOny! ",
        "language": "pl",
        "author_name": "wPRAWIEni",
        "slug": "wprawieni",
        "cover": "20210320_210114_1fc995f75e57643a44aa3e324073eee5.jpg"
    },
    {
        "podcast_id": 43133,
        "title": "Sociology Talk",
        "description": "Join Andres Sanchez, a CSU Bakersfield professor, as he interviews a series of sociologists and what they are up to today. ",
        "language": "en",
        "author_name": "Andres Sanchez",
        "slug": "sociologytalk",
        "cover": "20210321_031133_994faee6b8c6681d7d1c4fb77b25f256.jpg"
    },
    {
        "podcast_id": 43622,
        "title": "The Black Psychologist Podcast",
        "description": "Have conversations, give insight and offer perspectives on matters relating to current events, human behavior, social issues, health, cultural/political trends, sex as well as other life challenging subjects and promote mental health wellness. ",
        "language": "en",
        "author_name": "Dr. Kyle Osbourne and Dr. Jason Coleman",
        "slug": "theblackpsychologistpodcast",
        "cover": "20210323_034440_7c10e2991d8ed2a8bbbfd7ac47e45e1e.jpg"
    },
    {
        "podcast_id": 43769,
        "title": "Infectious Info",
        "description": "Infectious Info is brought to you by the Infectious Disease Working Group, a collaboration of graduate students from the University of Toronto that aims to educate the public and raise awareness about infectious disease. Through this podcast, we will interview experts from the field of public health to help support the ultimate goal of making public health knowledge more accessible. During our first season of the podcast, the focus will be the ongoing COVID-19 pandemic. In discussing these topics with a variety of professionals with different areas of expertise, we aim to bring diverse perspectives together to promote the exchange of factual and relevant information on this topic. ",
        "language": "en",
        "author_name": "Infectious Disease Working Group ",
        "slug": "idwg",
        "cover": "20210326_130528_fb3fdf4b731a1cae2274379748f16670.jpg"
    },
    {
        "podcast_id": 44592,
        "title": "The Hidden Addiction Podcast",
        "description": "<p>Hello and welcome to the Hidden Addiction Podcast. This podcast is brought to you by the New York Council on Problem Gambling. Across New York state we have 7 resource centers dedicated to connecting individuals to care. We are here to increase awareness about problem gambling and advocate for support services for persons adversely affected by problem gambling. Problem Gambling is defined as risking something of value on a game of chance. There can be many types of gambling, and it can affect anyone at any time in their life. It may not be talked about often and kept in the dark, but we hope this podcast sheds light on the hidden addiction of gambling and brings forth resources and information for you to use.</p>",
        "language": "en",
        "author_name": "New York Council on Problem Gambling ",
        "slug": "midhudsonpgrc",
        "cover": "20230410_030415_2849aa376c3cf0e13f21df8d19b7555d.jpg"
    },
    {
        "podcast_id": 44639,
        "title": "CFASA",
        "description": "Welcome to the CFASA podcast where we discuss various topics around neurodiversity and Autism Spectrum Disorder with self-advocates, program directors & occupational therapists, families, and clinicians. ",
        "language": "en",
        "author_name": "CFASA",
        "slug": "cfasa",
        "cover": "20210816_214637_4de9fddbfae67cf784632b584535726c.jpg"
    },
    {
        "podcast_id": 45176,
        "title": "The Ebby Online Podcast ",
        "description": "I'm a London based journalist, my name is Ebun Felicity Hargrave.\nI have a passion for communications, so I decided to create a podcast to host voices from all different walks of life. \nI will be talking about anything and everything from sex, politics, women's stories, current affairs, mental health, spirituality. \n\nTune in every other Monday for a brand new episode!\n\nFor more of my content check out: www.ebbyonline.com                                     \nInstagram: @EbunFelicityHargrave",
        "language": "en",
        "author_name": "Ebun Felicity Hargrave",
        "slug": "ebbyonline",
        "cover": "20210617_201728_93441a40ace6bad7300084522857e2c5.jpg"
    },
    {
        "podcast_id": 45328,
        "title": "Speaking for Kids, the podcast from Michigan’s Children",
        "description": "Each month, Speaking for Kids the podcast will bring you a variety of crucial conversations with people making public policy – and the voices of the people impacted by those decisions in Michigan. Our goal will be to help you strengthen your voice to speak up for the changes we need to improve Michigan’s kids' & families' lives.\nIn this and future podcasts, we’ll explore encouraging champions like you to get involved in the issues we’re fighting for. Including child care, early childhood education and development, the child welfare and foster care systems, family supports and kinship care, family supports, the needs of adult learners & family literacy, youths involved in the juvenile justice system, and more. \n",
        "language": "en",
        "author_name": "Michigan's Children",
        "slug": "michiganschildren",
        "cover": "20210413_204000_3c9261d70c6e2b0edc6a12d35be6ed7e.jpg"
    },
    {
        "podcast_id": 45405,
        "title": "Changing Places",
        "description": "The podcast that believes places are powerful agents of positive social transformation.\n\nJoin Dean Keith Diaz Moore from the University of Utah’s College of Architecture + Planning as he takes you behind the teaching, research and practice at the leading edge of innovation occurring in our College.  Through informal conversations, you will learn the emerging issues, why you should care and what you can do about them to change our world for the better.",
        "language": "en",
        "author_name": "College of Architecture + Planning",
        "slug": "changing-places",
        "cover": "20210329_194608_1b6dd994c8ff2e3818d615e1aad3e1f4.jpg"
    },
    {
        "podcast_id": 49497,
        "title": "Rural Crime",
        "description": "A podcast exploring issues in rural crime and society",
        "language": "en",
        "author_name": "Dr. Kyle Mulrooney",
        "slug": "ruralcrime",
        "cover": "20210831_062157_3f0e459068c48d0eeffcb416b1bd1ddb.jpg"
    },
    {
        "podcast_id": 51110,
        "title": "Speak it Out",
        "description": "Shrink it Out's Official Podcast. We engage in conversations on important aspects of psychology from psycho-pathologies, to sex and love, to self-awareness. ",
        "language": "en",
        "author_name": "Shrink it Out",
        "slug": "speakitout",
        "cover": "20210515_155215_2a308e3cfd16196f55a080788d7ea1ae.jpg"
    },
    {
        "podcast_id": 51963,
        "title": "Breaking Through",
        "description": "How do Behavioral Science, Neuro-Linguistic Programming and Neuroscience impact Leadership, Peak Performance, and Transformation?\n\nWelcome to the Breaking Through Experience, where we will explore several intriguing concepts that will help us breakthrough and live a more fulfilling life. \n\nOnce a month, we will also host a special guest for The SmarTalks Show. Everyone has a story to share; thanks to this Podcast, we now have a platform where we give a voice to people with meaningful perspectives, so that we can build a more inclusive and understanding world, one conversation at a time.\n\nRead more at www.t1growthacademy.com and book a free-of-charge coaching call if you are interested in the Self Mastery & Transformation program.\n\nEnjoy the Podcast!​ \n\n©2021 by T1 Growth Academy. All rights reserved.",
        "language": "en",
        "author_name": "Matteo Grosso & T1 Growth Academy",
        "slug": "breakingthrough",
        "cover": "20210502_165702_3fdb536faa980ce0d979f56fe3f522d3.jpg"
    },
    {
        "podcast_id": 53924,
        "title": "Mortals",
        "description": "From embalming and epitaphs, to mourning and morgues, each episode we explore how humans have dealt with death throughout history.\n\nMortals is created, hosted, and edited by three morbidly curious individuals: Christeah, Mariah, and Jeannine.",
        "language": "en",
        "author_name": "Christeah, Mariah, Jeannine",
        "slug": "mortalspodcast",
        "cover": "20210502_215944_35b0425384dba18664b5c08eaa77a0ed.jpg"
    },
    {
        "podcast_id": 53945,
        "title": "CSD@WCU",
        "description": "CSD@WCU Podcasts were created to advance educational and career goals of future and current speech-language pathologists and audiologists. The CSD@WCU Podcasts are hosted by the faculty in the Communication Sciences and Disorders (CSD) department at West Chester University (WCU). WCU is located in West Chester, Pennsylvania, 30 miles west of Philadelphia. Please enjoy!",
        "language": "en",
        "author_name": "Elizabeth Grillo",
        "slug": "csdatwcu",
        "cover": "20230204_060232_e7074b1a82b10ad328051730f7d81c3a.jpg"
    },
    {
        "podcast_id": 57034,
        "title": "Business Psychology Unplugged",
        "description": "This podcast is for anyone interested in psychology at work, especially those interested in listening to a British accent.\n\nEach episode Ben Elman, Ph.D. will have a fire-side chat with a professional working in the field of leadership, HR & human capital, data analytics, culture, and organizational psychology.\n\n(Podcast cover art courtesy of Clara Tefft, Bartell & Bartell)",
        "language": "en",
        "author_name": "Ben Elman",
        "slug": "businesspsychologyunplugged",
        "cover": "20210517_151545_8a95f0ea8d743c9043fb4dcaa90ec9c1.jpg"
    },
    {
        "podcast_id": 67237,
        "title": "Daniel T. Bourne",
        "description": "A student in Clinical Psychology having conversations with students, professors, and professionals in psychology.",
        "language": "en",
        "author_name": "Daniel Bourne",
        "slug": "danieltbourne",
        "cover": "20210708_235237_ef17bd17541b07ec9550cd3c38af77b9.jpg"
    },
    {
        "podcast_id": 71191,
        "title": "Food For Thought (with Melvin Poh)",
        "description": "'Food For Thought' aims to expand your personal knowledge by bringing deep and thought-provoking personal chats from Melvin Poh, the founder of Empirics Asia. ",
        "language": "en",
        "author_name": "Melvin Poh",
        "slug": "melvinpoh",
        "cover": "20210801_132651_7a64719d7192755227c37e8d60c59935.jpg"
    },
    {
        "podcast_id": 71420,
        "title": "HATER AT HEART",
        "description": "the one stop podcast for all haters ",
        "language": "en",
        "author_name": "Desdemona Smyth",
        "slug": "hateratheart",
        "cover": "20210802_201558_0da1cde37cb9e1ea2f8d889c5dfbf694.jpg"
    },
    {
        "podcast_id": 72377,
        "title": "3 Pie Squared - ABA Business Leaders",
        "description": "<p>We discuss topics around Applied Behavior Analysis and how to improve the quality of services. You can check out our other services for ABA practices at www.3piesquared.com</p>",
        "language": "en",
        "author_name": "Stephen Smith",
        "slug": "3piesquared",
        "cover": "20220303_070317_7f0ef52549504c86ffa61e13b266f714.jpg"
    },
    {
        "podcast_id": 73133,
        "title": "Factors",
        "description": "<p>Welcome to Factors, a podcast that brings research and internships to life by showcasing the vibrant stories of the remarkable individuals behind these endeavors. Discover how such pursuits go beyond academics and become personal adventures while getting to know the captivating people who illuminate them.</p>",
        "language": "en",
        "author_name": "Milo Golding",
        "slug": "factors",
        "cover": "20230919_020933_45990cc159220c44ca9d4c685a097ef3.jpg"
    },
    {
        "podcast_id": 73240,
        "title": "Hayu Podcast",
        "description": "Matthew Hayutin sits down with prominent thinkers working in education, parenting, and psychology. In the first season, Matthew speaks with a fearless group of storytellers who write books, make documentaries and challenge us to think harder about our collective responsibility to educate each other. ",
        "language": "en",
        "author_name": "Matthew Hayutin",
        "slug": "hayupodcast",
        "cover": "20211124_101127_7c777c00f57cf7802860f57514d9b225.jpg"
    },
    {
        "podcast_id": 73287,
        "title": "The Measuring what Matters Podcast",
        "description": "Anyone who has attempted to bake a cake will tell you the importance of accurate measurement. A small error in measurement can spell disaster for hours of work. Imagine for a moment, what it would be like if the way we measured ingredients was not standardized? Even worse, what if we couldn’t even agree on what we were actually trying to make in the first place? This has been the state of wellbeing metrics over the last century, and although excellent projects have been implemented, all too often they are dismissed before their impact can be felt.\n\nCurrently, wellbeing & prosperity metrics are benefiting from a wave of innovation stemming from all around the globe. These pushes against traditional boundaries are leading the way to more inclusive and resilient frameworks. This podcast will explore the bleeding edge of social metrics, lessons learned from past attempts, and potential futures, through interviews with experts in community prosperity measurement and decision-making. The podcast will also dig deeper into the question “How is Calgary really performing as a city?”\n",
        "language": "en",
        "author_name": "Marshal McCallum",
        "slug": "measuringwhatmatters",
        "cover": "20210812_204929_beaf3aaa3038c90cd1806153318e08f7.jpg"
    },
    {
        "podcast_id": 73476,
        "title": "Le Shack politique ",
        "description": "Le Shack Politique est un podcast de science politique dont l'animateur est Alexis Giraldeau. Chaque semaine, il tentera d'éclaircir un enjeu de politique et ce, en établissant des faits scientifiques tout en étant drôle! C'est ta chance pour écouter un podcast rempli de blagues, de comparaisons scientifiques déroutantes, de beaux lapsus et de paranthèses de soccer, sport qui passionne Alexis! \nLa 1ère série d'épisodes porteront sur la compétition entre les milliardaires Elon Musk, Jeff Bezos et Richard Branson pour conquérir l'espace! Enfile ton casque d'écoute pour vivre une odyssée spatiale rocambolesque! \nLe Shack politique commencera dans 3...2...1...0! ",
        "language": "fr",
        "author_name": "Alexis Giraldeau",
        "slug": "le-shack-politique-espace-cie",
        "cover": "20210814_044246_b68713490a9211928d5692d0b15480b2.jpg"
    },
    {
        "podcast_id": 74548,
        "title": "The ACSS Podcast",
        "description": "<p>The ACSS Podcast explores topics highly relevant to Australia’s evolving national security issues. In September 2023, a competitive application process will result in over 80 high-caliber delegates being selected from a variety of fields. Currently in its fourth year, the ACSS will host hubs in capital cities across Australia and a US team based out of Washington DC. Delegates will face three intense and realistic crisis simulations exploring domestic, regional, and non-traditional national security dilemmas. These podcast episodes will assist our delegates to prepare for summit week while also informing our wider audience of evolving issues relating to Australia’s national security.</p><p>All past and current members of the ACSS team would like to acknowledge that this podcast is being recorded on the traditional lands of the Ngunnawal and Ngambri people and pay our respects to the elders past, present, and emerging. We also acknowledge the traditional custodians of each of our delegate hubs where many of our listeners will be based. You are listening to the podcast produced by the Australian Crisis Simulation Summit. We are a volunteer student-led organisation who create and run complex futuristic and alternative crisis simulations in a national effort to help create the next generation of national security experts and leaders.</p><p>We hope you enjoy this series.</p><p><a href=\"https://australiancrisissimulationsummit.com/\">https://australiancrisissimulationsummit.com/</a></p>",
        "language": "en",
        "author_name": "Australian Crisis Simulation Summit",
        "slug": "theacsspodcast",
        "cover": "20210820_023024_2bf544570b6d0dea33e8d52bbb34c00c.jpg"
    },
    {
        "podcast_id": 74975,
        "title": "Crazy, Hexy, Ghoul",
        "description": "A podcast about the peculiar, the curious to the bizarre. So come and join us as we obsess over ghosties and sh*t.\n\n",
        "language": "en",
        "author_name": "Crazy, Hexy, Ghoul",
        "slug": "crazyhexyghoul",
        "cover": "20210822_170529_415a245da785bf94f0f0d6403b32deb3.jpg"
    },
    {
        "podcast_id": 75792,
        "title": "TMS Brain Power Podcast",
        "description": "We are a TMS Brain Health Clinic looking to provide information on what transcranial magnetic stimulation is. BrainStim TMS Centers is our new company located in Southern California. It is important for us to provide accurate and helpful information for people looking for information on alternative forms of therapy. ",
        "language": "en",
        "author_name": "Maxwell Hand",
        "slug": "brainstimtms",
        "cover": "20220103_050130_a69db6ffb09e37c654310fd79b9d8d80.jpg"
    },
    {
        "podcast_id": 77512,
        "title": "No Politics",
        "description": "7 continents and 8 billion people. Want to know the important stuff? Your worldly podcast bringing you directly to the important people doing the important things. ",
        "language": "en",
        "author_name": "Daniel Tintle",
        "slug": "nopolitics",
        "cover": "20210905_164932_7be1316f20f6ce4d1a4db32d90aee7a7.jpg"
    },
    {
        "podcast_id": 77979,
        "title": "HUMAN ECDYSIS ",
        "description": "love&light&truth\n\neye vs me\nevolve or repeat\n\nHuman Ecdysis \n@eyeamlida\n@human_ecdysis\nThe shift begins with us ",
        "language": "en",
        "author_name": "Lida ",
        "slug": "humanecdysis",
        "cover": "20210908_215326_939fc7f71d57326bf8fedb6c221be62e.jpg"
    },
    {
        "podcast_id": 78462,
        "title": "Statistically Insignificant",
        "description": "A podcast with visual aids about statistics in everyday life. Content is nominally published every fortnight.\nSupport the pod on Patreon: https://www.patreon.com/statisticallyinsignificant\n\nStatistically Insignificant is created on Wurundjeri and Dharawal country. We acknowledge the elders past, present, and future. Sovereignty was never ceded. ",
        "language": "en",
        "author_name": "Tess O'Brien",
        "slug": "statisticallyinsignificant",
        "cover": "20211104_023157_18e9208796b17c4df5c95db0a36781ed.jpg"
    },
    {
        "podcast_id": 78868,
        "title": "Onderwijsheid",
        "description": "'Onderwijsheid' is een podcast platform, waarop urgente en actuele verhalen over onderwijs worden verteld. Zena Bani, docent pedagogiek aan de iPabo en voorheen showhost bij De Krachtige Leraar Podcast, neemt jullie mee op onderzoek door in gesprek te gaan met een breed scala aan sprekers. In de afleveringen komen leraren en leerlingen voorbij, maar ook onderzoekers, kunstenaars en artiesten. Allemaal brengen ze een waardevolle toevoeging aan het verhaal dat ons allen bindt; het onderwijs. ",
        "language": "nl",
        "author_name": "Zena Bani",
        "slug": "onderwijsheid",
        "cover": "20210912_204019_d68cc3adfc50ed7e269b5fbc96f84581.jpg"
    },
    {
        "podcast_id": 79599,
        "title": "Sonic Stories",
        "description": "Sonic Stories is a show where guests share their favorite songs and the stories behind them. Maybe it's motivated them to play their best game, helped them work through a tough life event, reminds them of a loved one, or just helps them get through the day. What's your jam?",
        "language": "en",
        "author_name": "Beny Collins",
        "slug": "thatsmyjam",
        "cover": "20211104_132511_43f11d5230a77dd90af9d5e319fbe148.jpg"
    },
    {
        "podcast_id": 82241,
        "title": "The Antebellum Diaspora Project",
        "description": "I am descended from American-born enslaved people from North and South Carolina. Many of my ancestors were among the 2.5 million people of African descent who were forcibly migrated and permanently separated from their families. The Antebellum Diaspora Project is a descendent reunification project with a focus on reconnecting families, amplifying the humanity of people who were enslaved during the antebellum era, and sharing negated American history through the perspectives of the people who were most deeply affected by forced migration during the antebellum era in the US.",
        "language": "en",
        "author_name": "Pamela Bailey",
        "slug": "antebellumdiasporaproject",
        "cover": "20211122_101142_536237ae6f07c6d1e9761ce3deb4e4f1.jpg"
    },
    {
        "podcast_id": 84057,
        "title": "Please Expand",
        "description": "Please Expand is a podcast where I discuss non-fiction books with their authors. But Please Expand is not just about summaries; it's about conversations. I go into every episode having read each book in great detail and having reflected on the fundamental assumptions, foundations and questions with which the book grapples.\nIf you, like me, have finished a book with burning questions that only the author could answer, then Please Expand is the podcast for you.\nPick up one of the books I'm discussing and settle in for what I hope will be an illuminating conversation.",
        "language": "en",
        "author_name": "Ahilleas Rokni",
        "slug": "pleaseexpand",
        "cover": "20211017_231114_cf22424a6433cd87dbd7dbe66cbfa407.jpg"
    },
    {
        "podcast_id": 84752,
        "title": "It's a Brown Thing",
        "description": "It’s a Brown Thing is….\nA platform to bring together the next generation of South Asian youth. This is our podcast page where we post content about South Asian culture and expand on what it means to be a part of the South Asian diaspora. Our creators are people who you can relate to, young South Asian bi-cultural people who are willing to represent the experience, advocate for our issues, and help our own culture learn from and adapt in the most ethical and helpful ways.",
        "language": "en",
        "author_name": "It's a Brown Thing",
        "slug": "itsabrownthing",
        "cover": "20211012_194514_5fb2ab9cc10f64dd452ab8299fb887bc.jpg"
    },
    {
        "podcast_id": 85333,
        "title": "para cuando te aburras",
        "description": "<p>análisis de diversos escenarios sociales, debates y divulgación sociológica</p><p>ig: paracuandoteaburrax</p>",
        "language": "es",
        "author_name": "paloma soria bravo de laguna",
        "slug": "paracuandoteaburras",
        "cover": "20220214_080256_357d3f543fc1eaadf63b5280245bf49c.jpg"
    },
    {
        "podcast_id": 85383,
        "title": "Acting Out",
        "description": "A real-life ABA podcast. Our podcast explores the world of Applied Behavior Analysis with content to inform listeners of all backgrounds, and discusses the every-day issues of practitioners in the field. ",
        "language": "en",
        "author_name": "Elizabeth Bliss and Tyler Williams",
        "slug": "actingoutpod",
        "cover": "20211015_205436_fdb8a3688df10aa42577ab50419822e7.jpg"
    },
    {
        "podcast_id": 87766,
        "title": "Big Trip - Tracking New Connections ",
        "description": "THE BIG TRIP - A curatorial movement tracking new connections to the rooted practices and ancestral wisdoms around the world and linking them to a plural web that supports a more holistic global narrative.\n\nWe are a group of curators, each with their own skillset, combining to share and transform knowledge on three pillars: \n\n- Purposeful sound practice\n- The pilgrimage trip\n- The rituals of handing down\n\nDrawing together specialists, practitioners, communities and curators from around the world, we are sharing stories through modern media – podcasts, online media, articles, exhibitions and ultimately a forum – to create artistic transformation through international exchange.\n\n​​Four story snippets are juxtaposed and interwoven in this listening experience, providing you with a glimpse of first-hand interviews and completed narratives composed together by conversation setters and people in front of them.  Full-length podcast series will release throughout 2021/2022 on Big Trip online platform. \nPlease kindly follow us on:\n​​Website: https://reurl.cc/Ok6RL7\nSpotify: https://reurl.cc/Kr2OLn\nInstagram : @thebigtrip.tnc\nFacebook: https://www.facebook.com/thebigtrip.tnc/\n\n＿＿＿＿\nThe project is initiated by The Corridor from Taiwan & Borneo Laboratory \nfrom Malaysia with the support from Asia Cultural Council.\n",
        "language": "en",
        "author_name": "Big Trip Team",
        "slug": "bigtrippilot",
        "cover": "20211029_072423_6c878f1e23e5625db43a60f440dae926.jpg"
    },
    {
        "podcast_id": 88405,
        "title": "Club de fans de Shrek",
        "description": "Club de fans de Shrek, un podcast de Soy Una Pringada. Un refugio hecho con mantas cuando tu madre no está, una casa de la cabaña donde se habla con las luces apagadas y una linterna apuntándote a la cara. ",
        "language": "es",
        "author_name": "Soy Una Pringada",
        "slug": "clubdefansdeshrek",
        "cover": "20220308_050310_a284187abe596d616a02a92d1594adde.jpg"
    },
    {
        "podcast_id": 89022,
        "title": "La Torre del Faro",
        "description": "Únete a la conversación con Alfonso y Nico para explorar temas diversos que merece la pena entender. Plantearemos conversaciones de actualidad, política, cultura y otras curiosidades para ir aprendiendo cada día más sobre el mundo que nos rodea.",
        "language": "es",
        "author_name": "Alfonso Goizueta y Nico Oriol",
        "slug": "torre-del-faro",
        "cover": "20211105_184320_604f5979a12fd1b308a0bdf222247f28.jpg"
    },
    {
        "podcast_id": 89687,
        "title": "FUORI DI TESTA",
        "description": "Il podcast del Dipartimento di Psicologia dello Sviluppo e della Socializzazione dell'Università degli Studi di Padova",
        "language": "it",
        "author_name": "Podcast Dpss ",
        "slug": "fuoriditesta",
        "cover": "20211109_142005_8c32a46de35338ac1de6069a3cb8b4ce.jpg"
    },
    {
        "podcast_id": 91083,
        "title": "slobodnim stilom ",
        "description": "U ovom ćemo podcastu slobodnim stilom razgovarati s gostima ili sami o stilistici, njezinim najpoznatijim granama, književnoj i lingvističkoj stilistici, kao i o primjenjivosti stilistike kao discipline na različitim tekstovima i suradnji s drugim disciplinama, poput retorike, semiotike, sociologije, fonetike, analize diskurza itd.\nNa kraju svake epizode naši će gosti odgovarati na sedam pitanja i tako ostaviti svoj stilski potpis. Zanimat će nas najdraže stilske figure, koji biste novi interpunkcijski znak predložili, koju pjesmu znate recitirati napamet, koju pjesmu biste voljeli naučiti recitirati, da se možete izražavati samo jednom vrstom riječi, koja bi to bila, za koju hrvatsku riječ smatrate da je neprevodiva, predložite novu riječ koja označava kakav osjećaj, a koja nije dijelom hrvatskoga rječnika.\nModeratorice:\nslobodnim stilom s gostom - Gabrijela Bionda\nslobodnim stilom od A do Ž - Iva Antičević, Ana Žagmešter\nKontrasti - Ana Juradin, Helena Lučić\nKnjiževni složenac - Petra Kober, Veronika Vrgoč\n\nFacebook: https://www.facebook.com/slobodnimstilom\nInstagram: https://www.instagram.com/slobodnim.stilom/\nSoundCloud: https://soundcloud.com/slobodnim-stilom",
        "language": "hr",
        "author_name": "slobodnim stilom",
        "slug": "slobodnim-stilom",
        "cover": "20220521_070503_58765a2495abffa1295fb4dd3a586d74.jpg"
    },
    {
        "podcast_id": 93473,
        "title": "Duiden met de Muijs",
        "description": "Samen met Daniël Muijs duiden we met elkaar wekelijks de zin en de onzin achter de trends, de gebaande paden en de gewoonten in het onderwijs. Vanuit de dagelijkse praktijk bouwen we een brug naar wetenschappelijk theorie en onderzoek, en weer terug. Nieuwsgierig naar meer? Kijk dan ook eens op www.academica-group.com voor nog meer moois. ",
        "language": "nl",
        "author_name": "Academica University of Applied Sciences",
        "slug": "duidenmetdemuijs",
        "cover": "20220210_080256_d4959b7ab21a20111e59b74e2c1fae0c.jpg"
    },
    {
        "podcast_id": 94768,
        "title": "Sotsiaalhääling",
        "description": "Sotsiaalhääling on sotsiaalvaldkonnast kõnelev podcast info ja ideede ammutamiseks tulevaste ja praeguste sotsiaalvaldkonna töötajate, kuid ka laiemalt kõigile, kes sotsiaalvaldkonna vastu huvi tunnevad.  Saate külalisteks on erineva taustaga põnevad ja inspireerivaid inimesed, kellega koos arutleda sotsiaalvaldkonna arengute ja võimaluste üle. Eelkõige on eesmärk tekitada lahendustele ja inspiratsioonile orienteeritud arutelusid. Räägime küll konstruktiivselt sellest, mis vajab arendamist, kuid samas unistame ja mõtleme kastist välja - loome väärtust läbi arutelude! Külalisi võõrustavad Brigitta Õunmaa ja Kelli Ilisson.  *Sotsiaalhäälingut toetatakse Euroopa Liidu Sotsiaalfondi meetmest „Tööturul osalemist toetavad hoolekandeteenused“.",
        "language": "ee",
        "author_name": "Sotsiaalhaaling",
        "slug": "sotsiaalhaaling",
        "cover": "20211208_061217_4c8435d902d97dea57d2363b3c16b2a7.jpg"
    },
    {
        "podcast_id": 95443,
        "title": "Testmens",
        "description": "TESTMENS van de veiligheidsdienst is een podcast in 5 delen, elke week een aflevering met het persoonlijke verhaal van een Nederlandse man die door  de veiligheidsdienst gebruikt wordt... om op te oefenen.  Dit verzin je niet.  Dit testmens is een proefkonijn die zonder zijn toestemming gebruikt wordt voor de  praktische oefeningen van aankomende agenten, en voor de ontwikkeling van een nieuwe techniek om te verhoren. Hoe kan je dat bewijzen? Zoveel toevalligheden, zoveel voorbeelden, dat het waar is. #ditverzinjeniet",
        "language": "nl",
        "author_name": "Mind You",
        "slug": "mind-you",
        "cover": "20221025_031056_032c807552faa064197be0cb1ca42d7a.jpg"
    },
    {
        "podcast_id": 95488,
        "title": "Feminist in Progress: Gaining Perspective, Losing Hatred",
        "description": "In “Feminist in Progress: Gaining Perspective, Losing Hatred”, we take an introspective look at feminism at Gonzaga University, interviewing female leaders about world-wide issues that take place on our small campus in Spokane, Washington. We try to understand where they came from, where they want to go, and how their definition of feminism came to be. \n",
        "language": "en",
        "author_name": "Lia Cunningham",
        "slug": "feministinprogress",
        "cover": "20220127_050156_2779dcec55a297b8ef02c193543ebe55.jpg"
    },
    {
        "podcast_id": 97517,
        "title": "The Nadeem Podcast",
        "description": "<p><strong>The Nadeem Podcast</strong> is a weekly show hosted by Nadeem, a curious and inquisitive individual with a passion for learning and sharing knowledge. In each episode, Nadeem explores a different topic in depth, drawing on his own experiences and research to provide listeners with a unique and insightful perspective. Whether you're interested in current events, history, science, or anything in between, you're sure to find something to enjoy on The Nadeem Podcast.</p><p><strong>Here are some things you can expect from The Nadeem Podcast:</strong></p><ul><li><p>Thought-provoking conversations about a variety of topics</p></li><li><p>In-depth research and analysis</p></li><li><p>A unique and insightful perspective</p></li><li><p>A conversational and inviting tone</p></li><li><p>A commitment to accuracy and fairness</p></li></ul><p><strong>If you're looking for a podcast that will challenge your thinking, broaden your horizons, and make you laugh, you must listen to The Nadeem Podcast. Subscribe today and join the conversation!</strong></p>",
        "language": "en",
        "author_name": "nadeem khan",
        "slug": "nadeem",
        "cover": "20230812_050809_f2df69c2a392b20ac14c5a7f2fafead5.jpg"
    },
    {
        "podcast_id": 97620,
        "title": "Uncharted Geography",
        "description": "Mapping the world, one conversation at a time. ",
        "language": "en",
        "author_name": "Jon McQ",
        "slug": "unchartedgeography",
        "cover": "20211231_061252_5e1456ffdf4794b924fa9bd7bb5e9bb2.jpg"
    },
    {
        "podcast_id": 97639,
        "title": "Voices From Peripheries: Voices of Resistance  ",
        "description": "<p>Have you ever asked yourself if terms such as general truth or universal knowledge make any sense? Whose history are we learning at school? And How much of human knowledge are we missing? Why are the voices of vast parts of the world silenced? Or at best remembered in wars, natural disasters or in a postcard as an object of exotism? How does the world look like from the so-called peripheries? Voices from the peripheries is a podcast about decolonizing knowledge and mind. My name is Amira Benali. I am from Tunisia and I have been working in Europe Universities for the last ten years. Like many of you, I aspire to contribute to the social justice and equality efforts. In this podcast, I will invite scholars, students and activists worldwide to discuss topics such as cultural dominance, decolonial feminism, food sovereignty, Islamophobia, and indigenous knowledge among other topics. If like me, you feel angry when you look at your school curriculum, if you believe that we have a lot to learn from minorities and people in the peripheries, then this podcast is for you! Music: ©Hamza Bouchnak &amp; Nassim Ben Rhouma, Nouba Soundtrack 2020; Original music composed by Hamza Bouchnak &amp; Nassim Ben Rhouma for the Nouba tv show directed by Abdelhamid Bouchnak. The artist gave permission to use the music for free. Spotify 👉🏽 https://open.spotify.com/artist/4MVqc6SqLNBxyv8fZcyFEl?si=kS6m5JexRMK11W9Rs10duw Logo: Made by Tahar Znaidi for free 👉🏽 www.digital-mark.net Microphone and other materials sponsored by The Diversity and Difference Platform att CBS 👉🏽 https://www.cbs.dk/en/knowledge-society/areas/diversity-and-difference</p>",
        "language": "en",
        "author_name": "amira benali",
        "slug": "emirabenali",
        "cover": "20211228_111223_d0a60c575359562ad730739f02339d8c.jpg"
    },
    {
        "podcast_id": 99340,
        "title": "The Slowing Down Podcast",
        "description": "Join an explorer, creator, and post-modern yoga teacher Janna Slow to look at consistent patterns between speeding up and slowing down on personal and global levels. With her guests, Janna examines different forms of stress in our society, talks about body-mind practices, and finds solutions toward more sustainable life. More info on jannaslow.com. Podcast art by @gradolievna. ",
        "language": "en",
        "author_name": "Janna Slow",
        "slug": "slowingdown",
        "cover": "20220414_020429_8c16b852a722fa9d5f11150ded63fc16.jpg"
    },
    {
        "podcast_id": 99993,
        "title": "Warfare, Advancement, and Revisionism ",
        "description": "The goal of this project is to document the history of humanity by documenting all of humanity’s attempts to defeat it’s greatest foe. Itself. This is not going to be a straightforward documentation of kings fighting and destroying each other, though there will be many mentions and examples of that. This will attempt to explain our subjects from the ground up. The common foot soldiers to the leaders at their head. Their strategies, tactics, weapons, and technologies. Their triumphs and tragedies. Their lives and their deaths. What they fought for and why. What motivated them. What drove them. ",
        "language": "en",
        "author_name": "Thomas Preston Floyd",
        "slug": "warpod",
        "cover": "20220118_040127_4d0763b2d318db3dc13c287546453e16.jpg"
    },
    {
        "podcast_id": 100045,
        "title": "Wes-Del WarriorCast",
        "description": "The podcast home of Room C-10 at Wes-Del High School, Gaston, Indiana. Podcasts are produced by Biff Wilson, classroom teacher.",
        "language": "en",
        "author_name": "Biff Wilson",
        "slug": "wesdelwarriorcast",
        "cover": "20220111_020101_76fb3b727176de085a15cb9e649ff5c1.jpg"
    },
    {
        "podcast_id": 101063,
        "title": "nurt.ur.e",
        "description": "conversations to nurture. \nunraveling the complexities of today's world and curiously exploring the question of\nWhat can we realistically do to nurture humanity and nature?\n\n\n",
        "language": "en",
        "author_name": "Carla ",
        "slug": "nurture",
        "cover": "20220804_090855_239917544c9f40fbd38939ddf797d761.jpg"
    },
    {
        "podcast_id": 101093,
        "title": "The Dark Matter Myth Podcast",
        "description": "<p>The Dark Matter Myth Podcast, is a triple entendre, play on words. We raise issues that are thought to be of circumstance, but are usually a subconscious, dark afterthought to most people. It also draws inspiration from a concept of the astrophysics field called, Dark Matter.</p><p>The Dark Matter phenomenon is only observable by it's pull on nearby objects. While it isn't observable on the visible light spectrum, it's presence is calculated to consist of a significant majority of the entire universe.</p><p>In short, the majority of the universe is filled with experiences and circumstances that you will never see. And it all remains a myth until the majority of people believe it to be true. And the only way to do that is to give them the information while they're still.... Receptive.</p><p>So come and enjoy this fusion of HipHop, philosophy, street smarts, science and history.</p><p>For people without the comic book, Episode 9 is a great place to start. Anything before this is a bit unpolished, but still worth listening to.</p><p>This podcast began centered around discussions following the provocative comic book series and corresponding audio works By Jean Kyle R. </p><p>The first episode is much different from any of the latest episodes. So if you don't have it, start at episode 9.</p><p>The Dark Matter Myth Series is available at: http://www.DarkMatterMyth.com Purchase our two issue collection today for only $7.13. You won't regret it. Also available at Google Books...&amp; Amazon Kindle.</p><p>http://linktr.ee/JR.Media https://www.instagram.com/jr.media.comics/ http://mailto:Jr.Media.comics@gmail.com <a href=\"https://www.tiktok.com/@darkmatter_comics.media\">https://www.tiktok.com/darkmatter_comics.media</a></p><p>works By Jean Kyle R available on popular platforms https://music.apple.com/ar/album/the-dark-matter-myth-die-young-trapped-ep/1630147258?l=en The adjacent, precursor, free mixtape to this project: https://soundcloud.com/trevaughn-k-ramiro/sets/dmm-2?utm_source=clipboard&amp;utm_medium=text&amp;utm_campaign=social_sharing</p>",
        "language": "en",
        "author_name": "Jean Kyle R",
        "slug": "dmm",
        "cover": "20220205_010201_f29bb49e99476677d4d2cd6af7c12e8f.jpg"
    },
    {
        "podcast_id": 105327,
        "title": "The Kinky Podcast",
        "description": "Welcome to the Kinky Podcast, hosted by Derrick Monnie.\n\n\nA Dating Coach, a Sex Educator, and a Non-Monogamous Relationship Expert, Derrick Monnie will be your Carnal Concierge as we discuss polyamory, throuples, swinging, threesomes, BDSM, role-play, exploring kinks, self-confidence, and any other hedonistic pleasure you can think of.  \n\n",
        "language": "en",
        "author_name": "Derrick Monnie",
        "slug": "thekinkypodcast",
        "cover": "20220220_100220_22429d4cf641d5db37449125026e4eba.jpg"
    },
    {
        "podcast_id": 106246,
        "title": "Global Humanist Shoptalk",
        "description": "A podcast dedicated to \"thinking slow\" about how different topics relate to being more humanist in our approach to a complexly hurting world. Join us as we look at how everyday objects and seemingly straightforward topics can all reveal deeper questions about how to advance better policy and move among one another with greater compassion and curiosity.",
        "language": "en",
        "author_name": "M L Clark",
        "slug": "globalhumanistshoptalk",
        "cover": "20220204_110223_f0178dd349590f941770016024f2e7b8.jpg"
    },
    {
        "podcast_id": 107204,
        "title": "Open Airways",
        "description": "ER doctor Jessica Adkins Murphy and guests discuss social issues in medicine, public health policy, and the fight for a better Kentucky. Sometimes friendly, sometimes feisty, always asking questions.\nContact: openairwayspodcast@gmail.com\nInstagram and Twitter: @openairwayspod\nMusic: \"Sitting-Fog\" by Ketsa used for educational, non-commercial purposes.",
        "language": "en",
        "author_name": "Jess Adkins Murphy, M.D.",
        "slug": "openairways",
        "cover": "20220208_020236_9bdc4cff8d40f8a2847666278a64ed93.jpg"
    },
    {
        "podcast_id": 108019,
        "title": "Mawazeen - موازين جيوبوليتكس",
        "description": "يقدّم الموسم الأول من برنامج \"موازين\"، رؤية وتفسيراً وإجابةً على سؤال: كيف نفهم العالم؟\n\nتفسير ينطلق من رؤية جيوسياسية، يفسر فيها الوقائع والأحداث الدائرة في منطقتنا والعالم من حولنا، ليخرج بمنهجية واضحة، لفهم أوسع وادراك أكبر لمعنى تحالفات الدول وصراعاتها ومصالحها وكذلك الأمن القومي للدول، وما ارتباط ذلك ببعضه بعضًا؟ وكيف يؤثر علينا نحن في العالم العربي؟ كيف نفهمه كما هو الآن؟ وكيف نتوقعه للمستقبل حتى لا نتفاجأ وحتى لا نضلل! ",
        "language": "ar",
        "author_name": "Waddah Khanfar",
        "slug": "mawazeengeo",
        "cover": "20220211_080237_ba8e8ba55f7841ba62788c863b80cb4b.jpg"
    },
    {
        "podcast_id": 108789,
        "title": "Challenging Colonialism",
        "description": "Challenging Colonialism amplifies Indigenous perspectives on issues of concern to native Californian communities. It is our intention to create an educational resource where everyone can hear the perspectives of Indigenous peoples in their own words. It is not our intention to further colonize the narrative, or to misrepresent stories that are not our own. The podcast is produced by Martin Rizzo-Martinez, Historian, & Daniel Stonebloom, a Public School Administrator. ",
        "language": "en",
        "author_name": "Martin Rizzo-Martinez & Daniel Stonebloom",
        "slug": "challengingcolonialism",
        "cover": "20220214_070252_367edc6b2eaf1486222d08a940895412.jpg"
    },
    {
        "podcast_id": 110282,
        "title": "Intervenciones Gringas",
        "description": "<p>Historia de las intervenciones estadounidenses en Latinoamérica y el mundo. Exploramos las historias detras todos los golpes del estado, guerras, y bombardeos que hizo Estados Unidos para construir su imperio. con Jeremy y Tess!</p>",
        "language": "es",
        "author_name": "Intervenciones Gringas Podcast",
        "slug": "intervencionesgringas",
        "cover": "20230125_090151_ad9c367f09ccac7c02f9ceeb6fc622a3.jpg"
    },
    {
        "podcast_id": 110952,
        "title": "Floating Bridges",
        "description": "In de driedelige serie van Floating Bridges wordt er opnieuw licht geworpen op Curaçao’s autonome status binnen het Nederlandse Koninkrijk. \n\nTijdens hun onderzoek, gaan Lusette Verboom en Stephanie van Heijningen gesprekken aan met verschillende experts in hun vak, om na te gaan of de autonome status van Curaçao, ruim 10 jaar sinds haar inwerkingtreding, gevolgen heeft gehad op de politieke, economische en sociaal-culturele werkelijkheid op het eiland.\n\nHet doel van Floating Bridges is om gesprekken teweeg te brengen en creative expressie te stimuleren over de ontwikkelingen op het eiland, zodat de kloof tussen kunst en werkelijkheid overbrugt kan worden.\n\nMet dank aan  ex-premier van de voormalige Nederlandse Antillen en voormalig minister van Curaçao, Suzy Camelia-Römer, mr. Mirto Murray, prof. Rose Mary Allen, rector magnificus Francis de Lanoy en Dr. Rob van den Berg, voor hun samenwerking met dit project. Ook met dank aan Mathijs Reinen voor het beschikbaar stellen van de muziek.\nOmslagillustraties door Pater Brenneker en Elis Juliana.\n\nDit project is mogelijk gemaakt door het Mondriaan Fonds.\n",
        "language": "nl",
        "author_name": "Gallery Alma Blou",
        "slug": "floatingbridges",
        "cover": "20220223_070257_a27b502d4bcd51b6366f01fddde8d672.jpg"
    },
    {
        "podcast_id": 111800,
        "title": "Questions You Didn't Ask ",
        "description": "The purpose of this podcast is to uncover the questions we didn’t ask, to break silence and isolation, and to some extent confront our own ignorance which has led many of us to express stigma, conjure fear, and rely on avoidance as defense mechanisms which oftentimes leads to poor health and sometimes death. ",
        "language": "en",
        "author_name": "Niasha Fray",
        "slug": "questionsyoudidntask",
        "cover": "20220320_090345_d121baa02183da5457ff53bf96ba8a02.jpg"
    },
    {
        "podcast_id": 111914,
        "title": "Mi Última Neurona",
        "description": "<p>El propósito de este podcast es llevar información gratuita y valiosa a la comunidad hispana, que tiene acceso limitado al complejo mundo de la neurociencia debido a las barreras del idioma y la subrepresentación en las ciencias. También pretende inspirar a la próxima generación de neurocientíficos hispanos.  Jessica Chomik, la host y productora del podcast, es una investigadora en el Instituto Tecnológico de Massachusetts, o mejor conocido como MIT. Ella trabaja en los laboratorios de la Dra. Nancy Kanwisher y la Dra. Laura Schulz.</p>",
        "language": "es",
        "author_name": "Jessica Chomik-Morales",
        "slug": "miultimaneurona",
        "cover": "20230711_030737_90f61643dc3a17440a5f0fc356b99c4c.jpg"
    },
    {
        "podcast_id": 112641,
        "title": "RED: Abya Yala",
        "description": "RED: Abya Yala - Continental Communications : Communicaciones - Media : Medios",
        "language": "en",
        "author_name": "Tupak Huehuecoyotl",
        "slug": "redabyayala",
        "cover": "20220303_050304_73754651f38d1aad922aad30fa7176e2.jpg"
    },
    {
        "podcast_id": 113209,
        "title": "Erik Thor | The Flow Code Podcast",
        "description": "Discover the 16 Personalities and the work of Carl Jung like never before and learn how I connect the study of personality types to flow and motivation. Get practical and real advice on how you can grow and develop your personality.",
        "language": "en",
        "author_name": "Erik Thor",
        "slug": "theflowcode",
        "cover": "20220306_070328_2f419c4e63aa1a094e79cf83bbeceda8.jpg"
    },
    {
        "podcast_id": 113737,
        "title": "Bunker's Cable ",
        "description": "Welcome to Bunker’s Cable. A biweekly podcast from The Matthew B. Ridgway Center for International Security Studies at the University of Pittsburgh. The core mission of the Ridgway Center is to contribute to the intellectual and policy debates about the world’s most pressing issues in international security studies. The Ridgway Center focuses on a diverse range of challenges to international security — including the spread of international terrorism, counterinsurgency, the rise of transnational organized crime, the proliferation of nuclear weapons, emerging technology, and other critical issues faced by policymakers and the U.S. military. \nNamed after the man best remembered for salvaging the United Nations’ efforts during the Korean War as the commander in chief of the UN troops. Gen. Matthew Bunker Ridgway was also the chief of staff for the US army during the Vietnam war, and of course the inspiration behind the name Bunker’s Cable. Each episode we will delve into a topic within international security, speaking to professors about their research, commenting on current events, and discussing policy options. We want to highlight academic research while connecting the findings to current events. Our goal is to make today’s research accessible to you. ",
        "language": "en",
        "author_name": "Ridgway Scholars",
        "slug": "bunkers-cable",
        "cover": "20220308_020312_1fd83c38805de9c1d920e74fc1eb8d36.jpg"
    },
    {
        "podcast_id": 113804,
        "title": "Global China Today ",
        "description": "Global China Today is podcast series from Global China Study Society (gcsweb.org)  \n\nWe are a podcast group hosted by University College London students bringing you the newest international perspective on economic and political affairs every week. We also interview leading scholars to bring you the brightest voices of the brightest minds. ",
        "language": "en",
        "author_name": "Global China Study",
        "slug": "gcss",
        "cover": "20220619_100653_abf41e0d4e1bf33718bef3343bec1b8c.jpg"
    },
    {
        "podcast_id": 114041,
        "title": "Awarecast",
        "description": "<p>Awarecast deals with information security risks that you might encounter in your day-to-day life. In each episode a specialist from the field will be interviewed about recognizable, everyday situations. How do you become more aware of information security threats in a fast changing digital landscape? Even more importantly, how do we create a more resilient information society? This podcast is hosted by Awareways, specialist in cultural and behavioral change in security awareness and privacy. Would you like to know more? Check out the website: https://awareways.com/</p>",
        "language": "en",
        "author_name": "Awareways",
        "slug": "awarecast",
        "cover": "20221102_021115_929d6832f6c2d900e8fe636766a71d4b.jpg"
    },
    {
        "podcast_id": 114380,
        "title": "ParkerParker Podcast",
        "description": "Wide-ranging talks and conversation without limit and certainly with an eye towards building a better tomorrow for everyone's sake.",
        "language": "en",
        "author_name": "Eric Vincent Parker",
        "slug": "theparkerparkerpodcast",
        "cover": "20220310_110320_cb34ebc4034e5ccddddb27fa2348a6c8.jpg"
    },
    {
        "podcast_id": 114672,
        "title": "IPeers Research Series Podcast",
        "description": "The IPeers Research Seminar Series Podcast is a short and sweet podcast where the members of IPeers interview their seminar series guests and quiz them about the origins of their research ideas, the writing process, and their life as a researcher.\n\nIPeers is organized by researchers at the Legal Studies Department at the Central European University (CEU). It brings together students, researchers, and faculty from inside and outside CEU which share an interest in IP and IT law, law & innovation, law & technology, and related disciplines.",
        "language": "en",
        "author_name": "CEU IPeers Research Group",
        "slug": "ipeersresearchgroup",
        "cover": "20220312_110356_f8efa6a2513cd3f8524fa5f2403ff4c6.jpg"
    },
    {
        "podcast_id": 114695,
        "title": "为妳发声",
        "description": "我们致力于用GenZ的思维和视角解读当下的女性话题。每一期我们会邀请身边的朋友一起聊聊我们最近看到的、听到的那些故事，用全新的角度探索这些社会问题的解决思路。还在等什么，快来加入我们吧！\n",
        "language": "zh",
        "author_name": "Shuan Lin",
        "slug": "genzsfeministforum",
        "cover": "20220312_030326_13628405e3cb0972aac1858e803b970d.jpg"
    },
    {
        "podcast_id": 114926,
        "title": "BIRDMAN",
        "description": "Interesting conversations with interesting people. A place for hope in a day where no one seems to have it. Welcome to BIRDMAN",
        "language": "en",
        "author_name": "Robbie Larson",
        "slug": "birdman",
        "cover": "20220313_060339_b6ad28f4aeb4e2afdf22d96a2da412a1.jpg"
    },
    {
        "podcast_id": 115175,
        "title": "Relevate Presents: Scholars Ship",
        "description": "“Ship” (v): 1. To have a strong interest in the romantic relationship of characters from fictional stories. 2. The desire for two or more fictional characters to become a romantic couple.“Ship” (n): 1. a vessel larger than a boat for transporting people or goods by sea.\n\nBut really… We all know Hollywood doesn’t always portray love realistically; however, we still have our favorite tv show and movie couples that make us feel a sense of connection, hope, admiration, or just utter annoyance. Join your host Dr. Eric Goodcase as he talks with scholars to analyze, scrutinize, and humanize your favorite (and least favorite) fictional couples. You can follow the podcast on twitter @relevatepodcast or email us at relevatepodcast@gmail.com If you are interested in Relevate and want to receive research based information about relationships you can become a part of Relevation Nation by checking out our social media: Facebook -facebook.com/myrelevate Twitter -@MyRelevate",
        "language": "en",
        "author_name": "Eric Goodcase",
        "slug": "relevatepresentsscholarsship",
        "cover": "20220314_060308_ff0007ace2b210bd900cc161289101ef.jpg"
    },
    {
        "podcast_id": 115647,
        "title": "TBD: To Be Discussed_With R&A",
        "description": "We’ll be approaching truths and societal issues from biblical and experienced perspectives.\n",
        "language": "en",
        "author_name": "Adrian Hurndon & Riley Pate",
        "slug": "tobediscussed",
        "cover": "20220331_010324_4e978de9974d0189a69cfbb648694555.jpg"
    },
    {
        "podcast_id": 115796,
        "title": "Monster Frequency",
        "description": "Introducing: MONSTER FREQUENCY – your one-stop podcast for all things MedComms and company culture.\n\nMade with love by the Monster Medical® Group – a collection of boutique agencies that support the medical and pharmaceutical industry, producing fearsome healthcare communications for fearless clients.\n\nGet in touch to find out how we can help YOU to be a force to be reckoned with, or just stop by and listen. You're very welcome.",
        "language": "en",
        "author_name": "Word Monster",
        "slug": "monsterfrequency",
        "cover": "20220317_100353_2a2f82e1ac29583d4d1d1e17834fbd63.jpg"
    },
    {
        "podcast_id": 117100,
        "title": "The (weekly) Sports Piece",
        "description": "Every week, we discuss a recently published paper with a focus on sports.",
        "language": "en",
        "author_name": "Carlos Gómez González, Thadeu Gasparetto, and Cornel Nesseler",
        "slug": "the-weekly-sports-piece",
        "cover": "20220324_040358_8375b87692530f31da50e11d63fbe2f4.jpg"
    },
    {
        "podcast_id": 117104,
        "title": "Women in Whitewater",
        "description": "A four-part limited audio series exploring what it’s like to be a woman in the professional whitewater industry. This is a podcast and Master's Thesis. All episode transcripts can be found at womeninwhitewater.wordpress.com ",
        "language": "en",
        "author_name": "Rowan Stuart",
        "slug": "womeninwhitewater",
        "cover": "20220325_020358_68dba3f85046ec1b1f1c645f92db0ae8.jpg"
    },
    {
        "podcast_id": 117318,
        "title": "Semillas",
        "description": "<p>Semillas es un podcast de SJM (Servicio Jesuita a Migrantes). </p><p>Escucha todos los episodios aquí: <a href=\"https://sjme.org/podcast-semillas/\">https://sjme.org/podcast-semillas/</a></p>",
        "language": "es",
        "author_name": "Servicio Jesuita a Migrantes - SJM España",
        "slug": "semillassjm",
        "cover": "20220324_090308_c30d13c2d1c78ff3392d04dd831d0f18.jpg"
    },
    {
        "podcast_id": 117493,
        "title": "ASTRAL SOUL LIGHTNING",
        "description": "<p>Albert Einstein said, “The most beautiful thing we can experience is the mysterious. It is the source of all true art and science.” Big subjects, so a little about me... Best-selling author, Broadway, creative master, and profiled by the Washington Post, and New Republic. I've experienced the mysterious... This podcast is that lifelong journey. Been interviewed by national outlets, print and television, \"Relationship Consultant\" for the LA Weekly (first online writing was in 1996), with a Bachelor of Fine Arts from Stephens College. A recovering political op-ed writer. (Kidding. My stint in politics has lasted a lifetime.) This podcast is an exploration of what I’ve witnessed, and how authentic creativity works... Experience led me to the roadmaps and mythology of planets and stars, forcing me to consider astrology and the synchronicity between what’s above and what humans experience on Earth. A topic Carl Jung excavated his entire career. To challenge 2,000-year-old traditional Christianity and mythology that’s been co-opted by political extremists. To accept there’s more to life than what is seen… The first time I had an out-of-body experience I was looking at myself fall down a winding wood staircase from the second floor. Scared shitless, told no one. This came after, as a kid, I saw my dead father’s spirit from across the room. Discovered clairvoyance is a human byproduct of deep knowing. Since I was young, instincts have guided my life. Real magic is something I’ve witnessed and experienced. Miracles are too. This podcast is philosophy for the Aquarian Age. A way to expand our idea about who we are, why we’re here and how to tap into energies swirling around us and above... Raised in the Christian faith, mysterious events unleashed in my life as a child and throughout my life obliterated my mom's religious teachings. After 2,000 years of Christian mythology, it’s time for a spiritual reformation. Religion isn't required. Faith is. Postscript: I hope you subscribe. We're all in this together. Thanks for listening.</p>",
        "language": "en",
        "author_name": "Taylor Marsh",
        "slug": "astral-soul-lightning",
        "cover": "20220419_090425_71fcc66b42b05247f0498d75fde66677.jpg"
    },
    {
        "podcast_id": 118054,
        "title": "Gunslinger 不曾遠去的硝煙",
        "description": "Gunslinger, is a group of Hong Kong youths who care about international affairs. Here we provide you with in-depth military, airsoft analysis, news and meme.\n由香港青年組成，Gunslinger致力成為香港最好的國際衝突研究平台。",
        "language": "zh",
        "author_name": "Gunslinger 不曾遠去的硝煙",
        "slug": "gunslingerstrategy",
        "cover": "20220410_040404_6f350019ce5b36277eb95fe84d312c6d.jpg"
    },
    {
        "podcast_id": 118100,
        "title": "Teacher's Edition ",
        "description": "A podcast of the teachers, by the teachers, for the teachers. ",
        "language": "en",
        "author_name": "Teacher's Edition ",
        "slug": "teachers-edition",
        "cover": "20220327_070339_5bc9a772edcebb07e506704d7f066446.jpg"
    },
    {
        "podcast_id": 118474,
        "title": "The View From My Middle Finger",
        "description": "Welcome to this new podcast series, The view from my Middle finger, where we take a look at the world through the many, social media platforms.\n\nWith 3 seasons now streaming, we deliver a mix of entertainment in each series.\n\nSeries 1- The View From My Middle Finger- we cover many different topics which are highlighted through social media and the internet.\nWe look at the absurd side of society, the changing landscape and how we all navigate our way through the obstacles, in our own individual way.\nWith a healthy does of scepticism and humour, in some cases we highlight the illogical and the ridiculous.\n\nSeason 2- The Celebrity I Didn't Interview- In this short series we virtually interview some well known celebrities.\n\nSeason 3- AI Independent News- Who said that you need humans to deliver the news, well here at AI Independent News, we say to hell with humans, as our team of AI reporters deliver the news in their own inimitable style.\nIf you don't trust main stream media, then why not give AI Independent News a listen to, AI reporters deliver the news without the bullshit, as they are machine learning and haven't learnt bullshit yet. \n\nThe View From My Middle Finger is sponsored by Tee Public, check out our merchandise in our Tee Public Store- https://www.teepublic.com/stores/the-view-from-my-middle-finger?ref_id=26524",
        "language": "en",
        "author_name": "D'GAF",
        "slug": "tvfmmf",
        "cover": "20220329_110323_0a9e57b18a5b6c6683b6ccc1aacffead.jpg"
    },
    {
        "podcast_id": 118999,
        "title": "ÚŘAD PRÁCE ČR - podcasty (oficiální stránka Úřadu práce ČR)",
        "description": "Úřad práce ČR Vám nabízí pomocnou ruku nejen při hledání práce, nových zaměstnanců či změně kvalifikace, ale také v případě, že jste ve finanční tísni. Chcete vědět více? Poslechněte si naše podcasty. Informace najdete také na www.uradprace.cz.",
        "language": "cs",
        "author_name": "Úřad práce České republiky",
        "slug": "zamestnanost",
        "cover": "20230105_100146_d1b714a060db09dab36411e70431c931.jpg"
    },
    {
        "podcast_id": 119220,
        "title": "De Zoektocht van een Generatie",
        "description": "In de podcast ‘de Zoektocht van een Generatie’ gaat Froukje Jackson samen met de luisteraar op zoek naar thema’s die leven bij ‘de Millennial’ (±geboren tussen 1980/1985 en 2000). Froukje is werkzaam als GZ-psycholoog en Zorginnovator bij Maarsingh en van Steijn Groningen.\n\nIn verschillende afleveringen wordt, zowel binnen in de spreekkamer als in de samenleving, gezocht naar uitdagingen en mogelijkheden van deze twintigers en dertigers. De term ‘vooruitstruikelen’ staat hierbij centraal. Deze boeiende gesprekken zijn onderlegger voor een online trainingsmodule: een gereedschapskist om psychische gezondheid te bevorderen en te verbeteren.\n\nhttps://www.maarsinghenvansteijn.nl/groningen/\n",
        "language": "nl",
        "author_name": "Froukje Jackson",
        "slug": "zoektocht-van-een-generatie",
        "cover": "20220408_070454_7af9d7b041d8293d8a55fcc9cfc568ff.jpg"
    },
    {
        "podcast_id": 119919,
        "title": "Roots to Reason",
        "description": "Roots to Reason was created by six University of Montana students who are a part of the Franke Global Leadership Initiative. This environmental podcast series uses research and interviews from people in the Missoula area with diverse backgrounds to demonstrate how people's beliefs, biases, and upbringing influence their interactions with the environment. Through reflecting on these conversations and oneself, the goal is for our listeners to develop an environmental self-awareness and sense of belonging in a global context. Listen closely as we get to the roots of what informs people's opinions about the environment that surrounds them.",
        "language": "en",
        "author_name": "Sierra Franklin, Sarah Giffin, Cara Shepard, Damara Stewart, Rowan Ulrigg, and Abby Vogt",
        "slug": "rootstoreason",
        "cover": "20220406_060417_cb0d898c0b3ef526e6600d1a153732da.jpg"
    },
    {
        "podcast_id": 120071,
        "title": "The Kindness Journal",
        "description": "<p>Kennadee Riggs, Miss Rodeo America 2023, highlights the power of ‘Kicking Up Kindness’ and the good that still exists in humanity.</p><p>Instagram: @KickingUpKindness</p>",
        "language": "en",
        "author_name": "Kennadee Riggs",
        "slug": "thekindnessjournal",
        "cover": "20220405_030402_b3c89ddc0ccb626b9b6b113dc524eb18.jpg"
    },
    {
        "podcast_id": 121851,
        "title": "Engánchate a la vida",
        "description": "<p>En este podcast se tratan los peligros de las adicciones con y sin sustancias, además de cómo tratar de prevenirlas.</p>",
        "language": "es",
        "author_name": "Fundación Márgenes y Vínculos",
        "slug": "enganchate-a-la-vida",
        "cover": "20230420_090422_965e79e7b62322530dfcdf5929ef1f62.jpg"
    },
    {
        "podcast_id": 121917,
        "title": "What Do You Understand?",
        "description": "Global Partners for Development proudly presents “What Do You Understand?” A deep dive into the many facets of philanthropy and development. Experts in their field will discuss an aspect of their work that they understand particularly well. Let’s talk about big bets, innovation, social enterprises, large scale humanitarian aid and the fixation on “ending things” or “solving humanity’s greatest problems” and the issues that arise while tackling it all.",
        "language": "en",
        "author_name": "Global Partners for Development",
        "slug": "whatdoyouunderstand",
        "cover": "20220413_070448_4289ac957a7dceca268b112490c2245a.jpg"
    },
    {
        "podcast_id": 122154,
        "title": "Cultivated Space: DU Native Histories ",
        "description": "Hello Everyone! I am Reshawn Edison, your host for this series. Cultivated Space reflects my Capstone project as an undergraduate student at the University of Denver Anthropology Department. I explore the reckoning between Indigenous identity In higher education by those who have a relationship with the university. As a predominantly white institution, the University of Denver has upheld an unjust climate within its structure and culture. DU has maintained a hostile academic environment that Native American scholars and their allies constantly struggle with. I highlight these forms of navigation at a collective level. Join me as we validate Indigenous Identity because our relations narrative is critical to making actual change. This project is dedicated to the University of Denver Indigenous community, our allies, and extended relatives. To all my Indigenous peers across Turtle Island in higher education: Our voice, experiences, and stories matter. ",
        "language": "en",
        "author_name": "Reshawn Edison",
        "slug": "cultivatedspace",
        "cover": "20220414_080414_d56023eeffd788327d3544fc8af92703.jpg"
    },
    {
        "podcast_id": 123085,
        "title": "Se dice de mí - Podcast constituyente",
        "description": "La convención constitucional chilena está en su recta final. Junto a nuestras expertas y expertos no convencionales, explicaremos desde sus diferentes miradas lo fundamental para entender este proceso. \n\n¡Síguenos!",
        "language": "es",
        "author_name": "COES",
        "slug": "sedicedemi",
        "cover": "20220421_030402_bac25ff47888f2112394842a9adee75b.jpg"
    },
    {
        "podcast_id": 125194,
        "title": "Putting a Face (and Voice) with Disability ",
        "description": "The Halle Grace Foundations presents a new series in which I interview individuals diagnosed with disabilities, in the podcast, \"Putting a Face with Disability.\"  Through these podcasts, we allow individuals to use their voice and share their story of how their diagnosis has impacted their life.  These amazing humans open their hearts to us as they share the psychological, social, emotional, and vocational impact disability has had on their lives. They have chosen to use their voice to change others' perception of disability, in turn, creating a more inclusive world.  We hope you enjoy hearing their stories.  \n\nThese podcasts were developed as part of the University of South Florida's new, online graduate course, Medical & Psychosocial Aspects of Disability as part of their new, fully, online master's program, Rehabilitation Counseling and Disability Sciences (RCDS).",
        "language": "en",
        "author_name": "Jillian Heilman",
        "slug": "putting-a-face-disability-neeley",
        "cover": "20220428_110413_9a06f5518c5f676f82117909c200ec73.jpg"
    },
    {
        "podcast_id": 125318,
        "title": "The Psych NP Podcast",
        "description": "The Psych NP Podcast is all about being a psychiatric nurse practitioner in different environments and working with different populations. I have had the privilege to work with and know some of the finest PMHNPs around, and in each episode we explore what it's like to work in that setting. The work we do is real and so are the conversations in each episode. If you've found this podcast, you were either assigned it :), have an interest in this type of work, or do this job everyday, and are looking for camaraderie. Thank you so much for the work you do and to our guests in each episode. I hope you enjoy!\n",
        "language": "en",
        "author_name": "Matt Schroer",
        "slug": "thepsychnppodcast",
        "cover": "20220429_020434_6d6444a31df0b27210b85f5808f49fc1.jpg"
    },
    {
        "podcast_id": 126315,
        "title": "Visions of a Better World",
        "description": "Visions of a Better World is a podcast series produced and hosted by Global Visions association. The series brings together people to discuss themes, ideas and theories regarding the mission of making the world a better place. ",
        "language": "en",
        "author_name": "Global Visions",
        "slug": "visionsofabetterworld",
        "cover": "20220523_010556_4266a5d5c56b2b0974779a41bde47220.jpg"
    },
    {
        "podcast_id": 126532,
        "title": "Conferencias - Institución Libre de Enseñanza",
        "description": "Incluye el audio de las conferencias celebradas en la Institución Libre de Enseñanza (ILE)",
        "language": "es",
        "author_name": "Institución Libre de Enseñanza",
        "slug": "ile",
        "cover": "20220512_090559_8036b3c24850689d44de465a0da6d2a3.jpg"
    },
    {
        "podcast_id": 127307,
        "title": "Językowe Kontrowersje – Podkast O Języku",
        "description": "<p>Językowe Kontrowersje powstały z umiłowania do językoznawstwa i języków obcych – zajmujemy się nimi naukowo i zawodowo, dlatego chcemy dzielić się naszą wiedzą z szerszą publicznością. Opowiadamy o językach i o języku samym w sobie z wielu różnych perspektyw: - teoretycznej i deskryptywnej, tj. w formie analizy realnie używanego języka w sposób neutralny, bez normatywnego wartościowania jego elementów, - historycznej, kulturowej i antropologicznej, - fonologicznej, składniowej i semantycznej, - nawet filozoficznej, - a od czasu do czasu – humorystycznej.</p><p>Podkast powstał w ramach serwisu \"O języku\":</p><p>Insta: <a href=\"https://www.instagram.com/o.jezyku/\">https://www.instagram.com/o.jezyku/</a></p><p>Fb: <a href=\"https://www.facebook.com/o.jezyku\">https://www.facebook.com/o.jezyku</a></p><p>Patronite: https://patronite.pl/o.jezyku</p>",
        "language": "pl",
        "author_name": "O Języku",
        "slug": "jkontr",
        "cover": "20220510_080545_7e318cd4997549301b6b3f0472d276f2.jpg"
    },
    {
        "podcast_id": 127544,
        "title": "Antro-podden",
        "description": "<p>Nyskjerrig på hva antropologi innebærer? Eller kanskje du bare vil oppdatere deg på hva som foregår i antropologiverdenen om dagen? I Antro-podden tar vi deg med på en reise rundt i langstrakte Norge for å prate med ulike antropologer om alt fra hyttekultur og mannskulter i Stillehavet til fårikål, fotball og digitalisering. Følg med på kanalene våre for månedlig påfyll av spennende diskusjoner og for lære mer om alle bruksområdene antropologi har. ---------------------------------------Antro-podden produseres av Norsk Antropologisk Forening med Pål Hægland som programleder og produsent. Sangen vi tar i bruk er \"Wholesome\" av Kevin MacLeod. (<a href=\"http://incompetech.com\">incompetech.com</a>)Licensed under Creative Commons: By Attribution 3.0 Licensehttp://<a href=\"http://creativecommons.org/licenses/by/3.0/\">creativecommons.org/licenses/by/3.0/</a></p>",
        "language": "nb",
        "author_name": "Norsk Antropologisk Forening",
        "slug": "antro-podden",
        "cover": "20220511_090558_df087dc648047e81fe9ac1a0a3f71b99.jpg"
    },
    {
        "podcast_id": 127951,
        "title": "Who Holds Up Half the Sky",
        "description": "“Who Holds up Half the Sky” is an investigative podcast discussing the possibilities of advancing feminist activism in China under censorship and lack of free speech. Influential activist figures appear in China’s history from the Qing dynasty to the Maoist era with its famous quote: “Women Hold up Half the Sky”. But Chinese women have undergone much pressure from foot binding and arranged marriages to unequal pay and domestic violence. Over the years, I have dived deeper into issues of multiculturalism, social activism, and gender identities. This work defines my curiosity which stems from a continuous movement through distinct cultural spaces, which started in China.\n\nYou can read more about the podcast, and the research for it, as well as listen to the full interviews and the full-length podcast here: andreeacoscai.com/2020/09/09/sound-projects/\n\nCover art by Meaghan Paine\nMixing by Jullian Androkae",
        "language": "en",
        "author_name": "Andreea Coscai",
        "slug": "whoholdsuphalfthesky",
        "cover": "20220512_020526_b9a38bdd69df9cb830a298aa6dcff4fb.jpg"
    },
    {
        "podcast_id": 128393,
        "title": "Minds Matter ",
        "description": "Minds Matter is a conversational podcast about psychology, neuroscience and cognitive science, hosted by Beth Fisher and Ava Ma de Sousa.\n\nOn Minds Matter, we discuss a range of subjects, from conspiracy theories to falling in love, to nostalgia. We explore the neuroscientific and psychological research behind these issues while talking through our own personal experiences.",
        "language": "en",
        "author_name": "Beth Fisher and Ava Ma de Sousa",
        "slug": "mindsmatterpodcast",
        "cover": "20220515_040513_dfbd7f78bf4b076767222130dd0619aa.jpg"
    },
    {
        "podcast_id": 130103,
        "title": "VR-Learn",
        "description": "I denne podcastserien tar vi for oss bruk av digitale hjelpemidler i undervisning, med spesifikt fokus på bruk av lavkostnads virtuell virkelighet .\nTa kontakt med Jakob eller Ane om du vil koble deg opp mot prosjektet eller har ideer til gjester for høstens podkaster.\nJakob.b.cyvin@ntnu.no\nAnesko@stud.ntnu.no\n\nPodcasten er laget som et ledd i Prosjektet VR-Learn ved institutt for Geografi, NTNU, der prosjektet er finansielt støttet av HkDir.\n\nMere info: https://www.ntnu.no/geografi/vr-learn\n",
        "language": "nb",
        "author_name": "Jakob Bonnevie Cyvin",
        "slug": "vr-learn",
        "cover": "20220524_010551_b517d055c3e9d1b2944640f88552ac6a.jpg"
    },
    {
        "podcast_id": 130430,
        "title": "A Tired Grad Student Studies Psychology",
        "description": "Join Nick, a tired grad student, on his journey to pass his comprehensive graduate school exam. Each episode he will discuss an important topic within psychology using a counseling lens. ",
        "language": "en",
        "author_name": "Tired Grad Student",
        "slug": "tiredgradstudent",
        "cover": "20220526_010548_169630fa9592acef3d41f4a3243ea5c9.jpg"
    },
    {
        "podcast_id": 132903,
        "title": "La Generación de la Red ",
        "description": "<p>Los <strong><em>Sistemas de Información</em></strong> tienen una enorme importancia en el incremento de la capacidad organizacional frente al cambio del entorno; por lo que, en este podcast veremos la <strong><em>importancia de los Sistemas de Información.</em></strong></p>",
        "language": "es-mx",
        "author_name": "Antonio Rendón Peña",
        "slug": "teoria-de-las-redes-sociales-g1",
        "cover": "20220608_030623_0b27a828475842ffbb562f915238e773.jpg"
    },
    {
        "podcast_id": 133000,
        "title": "Metal Heads Podcast",
        "description": "The extreme metal podcast with a focus on how psychological theories can be applied to the metal scene. We'll also play games and rate the latest metal releases. ",
        "language": "en",
        "author_name": "Fae Scott-Dench ",
        "slug": "metalheadspc",
        "cover": "20221004_081009_3ddcf841441d03d555b2d7d93f295a64.jpg"
    },
    {
        "podcast_id": 133162,
        "title": "Marx is' Muss",
        "description": "Der MARX IS MUSS Kongress findet jährlich in Berlin statt. An 4 Tagen kommen Aktive aus Sozialen Bewegungen, Initiativen, Gewerkschaft und Linkspartei zusammen, diskutieren, vernetzen sich und lernen voneinander. Ganz nach dem Motto: Die Welt verstehen, um sie zu verändern.\n\nDas geht nur gemeinsam! Der Kongress lebt davon, dass sich hunderte Menschen aus verschiedensten Bewegungen zu einem gemeinsamen Austausch versammeln und diskutieren. Einige der Vorträge veröffentlichen wir hier für alle.",
        "language": "de",
        "author_name": "marx21",
        "slug": "mim",
        "cover": "20230125_020151_48c29d7b70050a82d354c3df8dd094bd.jpg"
    },
    {
        "podcast_id": 133234,
        "title": "Pretor Podcast ",
        "description": "En Pretor Podcast, te hablaremos sobre la importancia de la cultura organizacional, y te compartiremos tips, consejos, e información que te ayudará en tu vida laboral. \n",
        "language": "es-mx",
        "author_name": "Pretor Podcast",
        "slug": "pretorpodcast",
        "cover": "20220609_040614_a90d43652a39cb5b342aae42d14c796a.jpg"
    },
    {
        "podcast_id": 133674,
        "title": "Down The Black Hole",
        "description": "A thought-provoking podcast exploring spirituality, astrology, psychology, philosophy, energy, etc. ",
        "language": "en",
        "author_name": "Coeli",
        "slug": "downtheblackhole",
        "cover": "20220611_040609_d878a21cea207d79084ef9bf766224a6.jpg"
    },
    {
        "podcast_id": 133916,
        "title": "Ciudadanía Participativa",
        "description": "Exploramos la ciudad de Guadalajara para identificar sus virtudes y áreas de oportunidad.",
        "language": "es",
        "author_name": "Mía López Portillo",
        "slug": "ciudades-inteligentes",
        "cover": "20220612_110612_8a48dc944d8d479d043b5727afcfd5e8.jpg"
    },
    {
        "podcast_id": 134257,
        "title": "BRIDGES Podcast Series",
        "description": "Migration has become a polarising issue in European public and political debates, which are often determined by interpretations rather than raw facts. These interpretations are the result of certain narratives on migration, but what do we mean by \"narrative\"? And what makes some narratives dominant over others? The BRIDGES Podcast Series covers the production and impact of migration narratives in different public and political spheres, such as the media, civil society and policymaking. This series brings together experts from the project's consortium and the actors involved in narratives' production and impact in each of these spheres. \n\nBRIDGES is a research project funded by the European Union’s Horizon 2020 research and innovation programme under grant agreement no.101004564. The contents of these podcasts are the sole responsibility of the authors and do not necessarily reflect the views of the European Union. The European Commission and the European Research Executive Agency are not responsible for any use that may be made of the information these podcasts contain.",
        "language": "en",
        "author_name": "BRIDGES Migration",
        "slug": "bridges-migration",
        "cover": "20220614_110621_d9ea26a96837de53f8a63b13e1e7109c.jpg"
    },
    {
        "podcast_id": 134330,
        "title": "The Wheel",
        "description": "The Collegium Institute for Catholic Thought and Culture invites visiting scholars and faculty authors of new work that helps us to appreciate the shape of life today, both in its dynamism and its timelessness. Here we approach the mysteries of reality with wonder from multiple disciplinary angles, all centered on a commitment to truth.  Here authors make their case for how and why their books are important, not just for specialists in their field, but for all of us who seek wisdom for a life well-lived. ",
        "language": "en",
        "author_name": "Collegium Student Fellows and Staff",
        "slug": "the-wheel",
        "cover": "20220630_060646_acaf328c23c77fcb7a5ab5241c553483.jpg"
    },
    {
        "podcast_id": 134766,
        "title": "Friends After College",
        "description": "Hosted by socially anxious extrovert Mia Bettino, Friends After College aims to explore the confusing world of friendships in adulthood. Join Mia as she chats with professionals in psychology, people who turned community building into careers, and individuals in her own personal life!",
        "language": "en",
        "author_name": "Mia Bettino",
        "slug": "friendsaftercollege",
        "cover": "20220618_060623_83802a590d6fbbe07c5b501e4e53d3ae.jpg"
    },
    {
        "podcast_id": 135582,
        "title": "Ikusezinaz Hizketan - Hablando de lo invisible",
        "description": "Eguzkilore Tartean Elkartearen Podcasta. Familia, haurtzaro eta nerabezaroaren babeserako elkartea. \n\nPodcast de la asociación Eguzkilore Tartean. Asociación para la protección a familias, infancia y adolescencia.",
        "language": "es",
        "author_name": "Eguzkilore Tartean",
        "slug": "ikusezinazhizketan",
        "cover": "20220620_080615_e82e06594a02ac4b3ce44712f383ab15.jpg"
    },
    {
        "podcast_id": 136142,
        "title": "The Nervous Podcast",
        "description": "Let's explore the most complex structure in the universe, the nervous system - aka you.\nThe objective functions, processes - subjective perceptions, experiences; and all the controversial theories in-between.",
        "language": "en",
        "author_name": "Jet Flavell",
        "slug": "the-nervous-podcast",
        "cover": "20220629_010612_dd8bd9ff1de3eb9b0934202f5822426f.jpg"
    },
    {
        "podcast_id": 138706,
        "title": "Explain with Kane",
        "description": "In depth conversations into the nature of our reality, religion, the afterlife, and more! ",
        "language": "en",
        "author_name": "Kanna Sasscer",
        "slug": "explainwithkane",
        "cover": "20220705_090733_a47bf2010ac4891e97e2f86d0ddc995f.jpg"
    },
    {
        "podcast_id": 139134,
        "title": "Fusiones ",
        "description": "FUSIONES 🌍 proyecto colaborativo entre El Colegio de San Luis y la Universidad Intercultural de San Luis Potosí. \n---\n#colsan #fusiones #UICSLP #fblive ",
        "language": "es",
        "author_name": "Proyecto Fusiones ",
        "slug": "fusiones1",
        "cover": "20220711_060704_26f8425b9053dd8ba4ec011e1be4ea1a.jpg"
    },
    {
        "podcast_id": 139822,
        "title": "homo juridicus",
        "description": "Homo Juridicus is a podcast about law and society. Our aim is to understand our current moment and to provide potential ways to change it.",
        "language": "en",
        "author_name": "Joshua Caffrey & Cameron Bedard",
        "slug": "homojuridicus",
        "cover": "20220711_080755_a9b3cd8a8a5e689c3ae28d5357cd246b.jpg"
    },
    {
        "podcast_id": 140010,
        "title": "Webinar Feminista",
        "description": "Feministes de Catalunya somos una asociación de mujeres que lucha por una vida digna y contra todas las formas de explotación y violencia que sufrimos las mujeres en todo el mundo. En estos episodios os invitamos a reflexionar sobre los principales retos que afronta el feminismo en la actualidad. ",
        "language": "es",
        "author_name": "Feministes de Catalunya",
        "slug": "webinarfeminista",
        "cover": "20220717_040738_954d95627e8cce063800fb05ee9592d2.jpg"
    },
    {
        "podcast_id": 141523,
        "title": "El Podcast: con Guillermo Schall",
        "description": "Platicamos con gente chida de cosas chidas.",
        "language": "es-mx",
        "author_name": "Guillermo Schall",
        "slug": "elpodcastconguillermoschall",
        "cover": "20220720_020727_1eb2c8403812a843a43d79067900b4cc.jpg"
    },
    {
        "podcast_id": 142075,
        "title": "The Coffee House Experience",
        "description": "A Podcast to discuss things pertaining to Bengal and Bengali people. Our informal discussions (a.k.a. Adda in Bengali) are long, topical and largely spontaneous. We mostly talk in Bengali and occasionally in English. The channel is run by three Engineering graduates from Jadavpur University, namely, Pratyay Mukherjee, Srinjoy Ganguly and Soumik Ghosh. ",
        "language": "bn",
        "author_name": "The Coffee House Experience",
        "slug": "thecoffeehouseexperience",
        "cover": "20220725_060722_51acb2d4a18ee6de9e9bc4e34cc03187.jpg"
    },
    {
        "podcast_id": 145404,
        "title": "We Should Probably Be Studying",
        "description": "Sometimes, especially as Ph.D. students and assistant faculty members, it's hard to feel like you are truly “joining the conversation” with highly esteemed scholars in your area of research. Join Paula and Nick, two students at the University of North Texas who are trying to earn a Ph.D. in business management, every week as they discuss a new research article with the experts who actually conducted the research. \n\nIn this podcast, We Should Probably Be Studying, Paula and Nick are literally “joining the conversation” with top-publishing scholars to help new researchers, or simply curious listeners, understand what conversations are taking place in the management and organization literature. Paula and Nick hope to provide an outlet that guides new scholars, such as Ph.D. students and rising assistant faculty members, through interpreting the research being conducted in our top journals, generating research ideas for future publication, and getting publishing advice from those who have demonstrated the ability to do so already. \n\nEach week, Paula and Nick focus on one recently published work in either Administrative Science Quarterly, Academy of Management Journal, Strategic Management Journal, or Journal of Management and interview the authors of that article to gain insight into their backgrounds as scholars, how they work together, what roadblocks they encountered during the research project, the review process, and much more!",
        "language": "en",
        "author_name": "Paula Kincaid and Nick Johnson",
        "slug": "probablybestudyingpodcast",
        "cover": "20220809_080845_d95cb94d7d9a456697f425630ffea88f.jpg"
    },
    {
        "podcast_id": 145994,
        "title": "Abolish Psych (For a Better Future)",
        "description": "This Marxist feminist podcast critiques and examines the modern profession of psychiatry from a Marxist perspective. We view mental health in a state a public health crisis caused by the collective trauma of capitalism. The mental health industry in the US largely serves to uphold capitalist power structures and manage reactions to capitalist oppression. The series starts off with an overview and discussion of the book Psychiatric Hegemony which critiques the power structure of mental health professionals and the profit motive of the pharmaceutical industry. Future discussions may center around teach ins, collective trauma, public mental health education, community mental health, personal experiences, scientific research, mental health behaviors, neurodiversity, or other topics related to liberation from the current model of psychiatry.\n\nWhile we do recognize the pain and suffering at the individual level and that individuals have benefitted from interventions within the mental health care system, this podcast is best suited for individuals ready to critique the power structure and imagine the future of mental health from a revolutionary perspective. This podcast will touch high-level on many potentially triggering topics including but not limited to sexuality, violence, racism, misogyny, substance use, and any number of atrocities.",
        "language": "en",
        "author_name": "Abolish Psych",
        "slug": "abolishpsych",
        "cover": "20220812_040812_e26cc95616c721fe288df6c7e1adf946.jpg"
    },
    {
        "podcast_id": 146567,
        "title": "Der 7. Tag - Podcast",
        "description": "Moin,\nwir sind Eike und Johannes. Und das ist unser Podcast \"Der 7. Tag\". Wir reden über das, was uns als ENTWICKLUNGSBEGLEITER in unserem Alltag in Krippe, Kindergarten und Hort so bewegt. Über Pädagogik, Religion, die Welt und dummes Zeug 😜 Natürlich sind wir dabei kritisch, aufgeklärt, hinterfragend, christlich und vielleicht auch feministisch... \n\nWir freuen uns auf Euch.\n\nBleibt gesegnet\nEike und Johannes\n",
        "language": "de",
        "author_name": "Eike Elser // Johannes Esselborn",
        "slug": "der7tag-podcast",
        "cover": "20220815_090843_b587ffeffa7839f3f81b0251176750fd.jpg"
    },
    {
        "podcast_id": 146573,
        "title": "Therapy Dogs Australia Podcast",
        "description": "<p>For anyone working or interested in animal-assisted services, particularly with therapy dogs, this is the podcast for you!</p>",
        "language": "en",
        "author_name": "Samantha King ",
        "slug": "therapydogsaustralia",
        "cover": "20230321_090344_6f6696329d1bb6af74a46a96f26639b4.jpg"
    },
    {
        "podcast_id": 147217,
        "title": "Science Humanitarian Podcast",
        "description": "\nThere are many potent and relevant issues in our society today; it is important to raise awareness about these issues. Science Humanitarian could not just watch as these issues went unaddressed, so we created a podcast as they are effective ways to achieve this goal due to their convenience and increasing popularity. \n\n",
        "language": "en",
        "author_name": "Science Humanitarian",
        "slug": "sciencehumanitarian",
        "cover": "20220819_050836_599484c03a9449bf9fb007a30d0e32c0.jpg"
    },
    {
        "podcast_id": 147996,
        "title": "Jornada Completa",
        "description": "<p>Los profesores Sebastián y Pablo conversan de temas académicos de la forma menos académica posible.</p>",
        "language": "es",
        "author_name": "Sebastián & Pablo",
        "slug": "jornadacompleta",
        "cover": "20230515_010533_2df7b219295aee49996c6017d7410097.jpg"
    },
    {
        "podcast_id": 148255,
        "title": "The Magnifik-100 Podcast ",
        "description": "THE MAGNIFIK-100 Podcast tells the life story of any Joe because we all got stories to tell. This platform gives an opportunity to people to share their stories about life and stories about their reality. ",
        "language": "en",
        "author_name": "H. Magnum ",
        "slug": "the-magnifik-100-podcast",
        "cover": "20220829_120831_be8b1099a000e116f10aefce13317839.jpg"
    },
    {
        "podcast_id": 148646,
        "title": "Gardyloo!",
        "description": "Gardyloo! is a podcast where Joyce and Lillian tell you about things you wish you never knew. We dump information on you like only a mother and daughter duo can do. Join us as we laugh at ourselves while exploring the interesting, the odd, the creepy, and the weird.",
        "language": "en",
        "author_name": "Lillian and Joyce",
        "slug": "gardyloo",
        "cover": "20220829_060824_92c9df81ce669d500ce6780c2ddf46db.jpg"
    },
    {
        "podcast_id": 148771,
        "title": "Agogiek In The Spotlight: een open gesprek",
        "description": "Take a look at our ‘open gesprekken’ binnen het project Agogiek In The Spotlight!!! Meer zoals deze on the way, maar geduld! Tis een schone deugd, en de moeite voor de leuke en interessante gesprekjes. Heb je vragen, ideeën, feedback? Dm ons gerust (via instagram, facebook of mail)\nMisschien kan dit de aanzet zijn tot gesprekken met je medestudenten, ouders, vrienden, kennissen, vreemden op straat ;),... sowieso stof tot nadenken!\nGebruik het hoe je maar je wil, en share als je anderen wil informeren of gewoonweg een gouden hartje hebt en ons wil steunen &lt;3\n",
        "language": "nl",
        "author_name": "Lee Casasus Garcia",
        "slug": "agogiekinthespotlight-eenopengesprek",
        "cover": "20220829_020840_f875a61684b2311d1bd7cbab07d6b3aa.jpg"
    },
    {
        "podcast_id": 148851,
        "title": "Code 10-98",
        "description": "Code 10-98 is a true crime podcast that delivers stories about past, present, solved and unsolved mysteries and murders. You can also find our videos on our YouTube Channel. https://linktr.ee/code.1098?utm_source=linktree_profile_share&ltsid=6e70236c-3d15-4c8c-a21f-fa1de0ac3925",
        "language": "en",
        "author_name": "Dina V. of Agency 36",
        "slug": "code10-98podcast",
        "cover": "20220825_060820_c62a6c43cc1ab1fe6433000da04a77d8.jpg"
    },
    {
        "podcast_id": 149282,
        "title": "Del PHI al PSI",
        "description": "Conversatorio sobre diversos temas de relevancia común. Hablan Jesús Flores (Psi) e Ismael Medina (Phi). Como siempre, la culpa es del capitalismo. Grabamos aproximadamente cada dos semanas. ",
        "language": "es",
        "author_name": "Ismael Medina",
        "slug": "delphialpsi",
        "cover": "20220827_060804_8c9796e7995690f5ef911643640c5071.jpg"
    },
    {
        "podcast_id": 149588,
        "title": "Liderando Mentiras",
        "description": "Entender y comunicar cómo varios personajes en la historía han manipulado a sus seguidores. Nos enfocaríamos en líderes de cultos/sectas o políticos reconocidos por su forma de manipular al público. \nIntegrantes: \n- Gisela Ponce\n- Mariano Dorador\n- Miranda Carbajal\n- María Jose Segovia",
        "language": "es",
        "author_name": "Gisela Maria Ponce",
        "slug": "liderando-mentiras",
        "cover": "20220829_020807_ca9db1c05466697b091ffa5420aab945.jpg"
    },
    {
        "podcast_id": 149744,
        "title": "The Political Science Report",
        "description": "A weekly report that breaks down some of the most important- current and historical- research in the field of Political Science. ",
        "language": "en",
        "author_name": "John Murphy",
        "slug": "thepoliticalsciencereport",
        "cover": "20221014_061018_8dc09bd7771383a22df8a2e9bc3302aa.jpg"
    },
    {
        "podcast_id": 149755,
        "title": "Déballe Ton Métissage",
        "description": "Le podcast qui déballe les problématiques liées à la multiracialité, aussi appelé \"métissage\". Retrouvez un épisode, un jeudi sur deux.",
        "language": "fr",
        "author_name": "Déballe Ton Métissage",
        "slug": "deballe-ton-metissage",
        "cover": "20221128_101129_5f722061c0c9ff82c98aef9499c8d67b.jpg"
    },
    {
        "podcast_id": 149785,
        "title": "The Truth About Therapeutic Boarding Schools",
        "description": "The troubled teen industry has altered thousands of people's lives, for better or for worse. Listen to the real-life experiences of people who attended therapeutic boarding schools and decide for yourself if these programs are helping or harming their students. \n\nThis is the result of a study called The Effects of Therapeutic Boarding Schools on Minors.",
        "language": "en",
        "author_name": "Julia D",
        "slug": "the-truth-about-therapeutic-boarding-schools",
        "cover": "20220830_110817_39d2ac9ffb5ae7402e739f4d34ae85f0.jpg"
    },
    {
        "podcast_id": 151294,
        "title": "Human Affairs ",
        "description": "Making sense of a world in disarray from a human perspective",
        "language": "en",
        "author_name": "Jorge Diener",
        "slug": "humanaffairs",
        "cover": "20220905_040951_032b170f0d9520d6d65bb5fc32634ed9.jpg"
    },
    {
        "podcast_id": 153595,
        "title": "Transformando Ciudadanía",
        "description": "Entrevistas de temática ciudadana para jóvenes que se interesen en contribuir de una manera más activa en su comunidad. ",
        "language": "es",
        "author_name": "podcast cddn",
        "slug": "transformandociudadania",
        "cover": "20220915_060921_91b2e56554b6031b7099e3e6cc40f316.jpg"
    },
    {
        "podcast_id": 153632,
        "title": "Variant pi. Preguntes Infreqüents ",
        "description": "Podcast de Filosofia amb Rafael Sartorio Maulini. Programa de Filosofia, dins del magazín de Ràdio Benicarló presentat per Ana Añó Ayza.",
        "language": "ca-es",
        "author_name": "Rafael Sartorio Maulini ",
        "slug": "filo",
        "cover": "20220915_030943_7b6b4356515a3ed765bd0b3e1d18d132.jpg"
    },
    {
        "podcast_id": 153924,
        "title": "Eih Elli Beye7sal Dah - إيه اللي بيحصل ده؟",
        "description": "<p>في العادي, توضع الاوراق البحثية مهما كانت مثيرة للاهتمام على الرف وتحفظ على برجها العاجي لحد ما ييجي حد ينفض التراب. في هذا البودكاست, غرضنا ننفض التراب كل حلقة على موضوع أو ورقة بحثية. نستضيف كاتبها ونحكي اكتر ببساطة في اكتشافاتهم وازاي تساعدنا نفهم العالم أحسن \" ايه اللي بيحصل ده\" بودكاست يخوض في العلوم الاجتماعية والرسائل البحثية لمحاولات وصل الأكاديميا بالحياة الحقيقة وتيسير الوصول لتفسيرات الباحثين الاجتماعيين والسياسيين. هو بودكاست يحاول تبيين المفاهيم والتشجيع على الابحار في عالم العلوم الاجتماعية بلا قلق.</p>",
        "language": "ar",
        "author_name": "Eih elli beye7sal dah",
        "slug": "eihellibeye7saldah",
        "cover": "20220916_030948_3581477c5083e5b6883a4b87abe6931e.jpg"
    },
    {
        "podcast_id": 154054,
        "title": "St. Anthony's Catholic Church of Shenzhen",
        "description": "<p>天安007之音 地址：深圳市福田区农林路65号 弥撒时间：周一至周六早7:00, 周六晚间7:00, 周日上午9:00(中文), 上午11:00(英文), 晚间7:00(英文). 堂区办公室电话：0755-83799096; 堂区公众号：深圳圣安多尼堂；官网: <a href=\"http://www.sac-sz.com\">www.sac-sz.com</a></p>",
        "language": "en",
        "author_name": "XAVIER",
        "slug": "sac-sz",
        "cover": "20230917_020945_d70cb291fb6c790a274f18456307e5ca.jpg"
    },
    {
        "podcast_id": 154311,
        "title": "Droit de Parole",
        "description": "<p>Tu as toujours voulu savoir si les études en droit étaient dignes de Legally Blonde? Tu te demandes si les avocats ont vraiment une carrière comme celle que tu vois dans Suits? Tu es simplement intéressé par l'actualité et les différents domaines juridiques? Tu es donc invité à la barre pour écouter Droit de Parole, le podcast de l'Association des étudiant.e.s en droit de l'Université Laval !</p>",
        "language": "fr",
        "author_name": "Association des étudiant.e.s en droit de l'Université Laval",
        "slug": "droitdeparole",
        "cover": "20230727_010748_659a54d4c81da997e6766770ee163ca5.jpg"
    },
    {
        "podcast_id": 154602,
        "title": "O CO CHODZI?",
        "description": "Cześć w tym podcaście zastanawiam się o co chodzi. Czasem narzekam, czasem chwalę, wszystko zależy od wszystkiego. Pod lupę biorę interesujące mnie firmy, zjawiska ekonomiczne czy społeczne i analizując je w oparciu o badania, prace naukowe i inne próbuję odkryć jakimi prawami się rządzą i co to znaczy. \n\nDla zainteresowanych odcinki są także dostępne na youtube w formie video. ",
        "language": "pl",
        "author_name": "Anna",
        "slug": "ocochodzi",
        "cover": "20221023_071029_621c2d1a48095214675606bc17ffd9e5.jpg"
    },
    {
        "podcast_id": 155282,
        "title": "PODCAST DEL MÓDULO 1",
        "description": "Podcast del Módulo 1 de la Licenciatura en Educación e Innovación Pedagógica de la Universidad Pedagógica Nacional (UPN) 321. Zacatecas.",
        "language": "es-mx",
        "author_name": "LEIP UPN ZAC",
        "slug": "modulo1leipupn",
        "cover": "20220922_080940_662cec689ff47d14a4ae0473a43d2a62.jpg"
    },
    {
        "podcast_id": 155376,
        "title": "Sharing the Couch",
        "description": "Sharing the Couch is an NT Shelter initiative, featuring interviews with thought leaders in the affordable housing and homelessness sectors. New episodes are published every second Thursday.\n\nNT Shelter is the peak body for affordable housing and homelessness in the Northern Territory, Australia.",
        "language": "en",
        "author_name": "NT Shelter",
        "slug": "sharingthecouch",
        "cover": "20220923_040919_0d45610322ee364dc8701661c0afcc92.jpg"
    },
    {
        "podcast_id": 155422,
        "title": "123inclusie - 4 Talkshows ",
        "description": "Kinderen en jongeren met een beperking vinden moeilijk aansluiting bij leeftijdsgenoten in de vrijetijds-sfeer. Nochtans zit hier maatschappelijke en emotionele winst in voor alle partijen. 123inclusie wil begeleiders in de opvang, leiders en animatoren ondersteunen in de motivatie en het proces om kinderen en jongeren met een beperking warm te onthalen en goed te begeleiden.  In de reeks van 4 talkshows over inclusie, focussen we telkens op een specifiek deelthema: Buitenschoolse Kinderopvang, Jeugdverenigingen, Sportclubs en Begeleiders met een beperking. Op het eind van elke show maakt Beno Schraepen, auteur van het boek 'Excluses' kanttekeningen bij de verhalen. ",
        "language": "nl",
        "author_name": "Wouter Kersbergen SPINDOKTER",
        "slug": "123inclusie",
        "cover": "20220923_010906_9b7898be93d79981c81e64806a195ceb.jpg"
    },
    {
        "podcast_id": 155950,
        "title": "ADA 7 PODCAST",
        "description": "<p>En este Podcast hablaremos sobre el comportamiento humano organizacional</p>",
        "language": "es",
        "author_name": "Israel Jesús Trava García, Vanessa Abigail Siordia Alcocer, Cristina Yabilá May Chi, Ángel Eduardo Uicab Parra y José María Martínez Fernández ",
        "slug": "podcast-ods-8-9",
        "cover": "20230516_080505_d04513ab57ecd85e74b4a0e816d31504.jpg"
    },
    {
        "podcast_id": 156475,
        "title": "The Climate Voices Podcast",
        "description": "<p>Climate Change is no longer a question of “if” or “when” because it’s a reality and people are already feeling the impacts globally. We will be hosting experts and climate change advocates from all over the globe every two weeks to tackle different topics like just energy transition, youth climate activism and advocacy and resilient systems. If you want to learn what efforts people are putting across the world to address the climate crisis, this is definitely the show for you!</p>",
        "language": "en",
        "author_name": "Omesa Mokaya",
        "slug": "theclimatevoices",
        "cover": "20220928_100942_4c58e02c8d747732cf73df64ec26769a.jpg"
    },
    {
        "podcast_id": 157504,
        "title": "THE FREUDIAN SLIPS",
        "description": "Open Discussion on Understanding the Imperfections in Ourselves and Others ",
        "language": "en",
        "author_name": "KMC",
        "slug": "thefreudianslips",
        "cover": "20221002_031059_2e4ffe03f776ee7eb6bceb173acf8eba.jpg"
    },
    {
        "podcast_id": 157514,
        "title": "We're Smart We Swear",
        "description": "Random thoughts of two underachieving overachievers.",
        "language": "en",
        "author_name": "Unintelligent Intellectuals",
        "slug": "weresmartweswear",
        "cover": "20221002_041024_02fcb95dee6b263ddfc99d24b05988e7.jpg"
    },
    {
        "podcast_id": 157976,
        "title": "Audazzio Demo",
        "description": "It comes in waves.",
        "language": "en",
        "author_name": "Audazzio",
        "slug": "thesetestingtimes",
        "cover": "20221229_051231_e987bfb30cbf1b0da5e4441a09161d98.jpg"
    },
    {
        "podcast_id": 159341,
        "title": "SpillTheTheses",
        "description": "A podcast that brings you the most important lessons of newly graduated Master- and Bachelor Students from various academic fields.\n\nIn this podcast, you will learn about the latest Bachelor and Master Theses, the ups and downs during research processes, and most importantly the latest findings and learnings from their work. \n\nIf you have research you'd like to share with us. Send us an email at SpillTheTheses@gmail.com! \n",
        "language": "en",
        "author_name": "Political Innovation Association e.V ",
        "slug": "spillthetheses",
        "cover": "20221010_071010_68b788778eb7bf655837fa988b531240.jpg"
    },
    {
        "podcast_id": 159792,
        "title": "Il Cenedese e l'Alta Marca Trevigiana: percorsi tra storia e memoria",
        "description": "Podcast del progetto di Storia e Cultura del Veneto del Liceo Flaminio di Vittorio Veneto.\nA cura di Matteo Collodel e in collaborazione con il Circolo Vittoriese di Ricerche Storiche, il Liceo Artistico Munari di Vittorio Veneto, il Comune di Vittorio Veneto e con il sostegno dell'Ufficio Scolastico Regionale del Veneto.",
        "language": "it",
        "author_name": "Matteo Collodel",
        "slug": "camt",
        "cover": "20221012_101032_977aa78fb16091b707d3d5f01dc4cd2a.jpg"
    },
    {
        "podcast_id": 159902,
        "title": "the Betaverse",
        "description": "Gordo Matt and Nathan explore this beautiful Betaverse",
        "language": "en",
        "author_name": "Gordo Matt Nate",
        "slug": "betaverse",
        "cover": "20221021_111055_1aef842c572dbec4170376eea4f5fa46.jpg"
    },
    {
        "podcast_id": 160846,
        "title": "Horror Study Hall",
        "description": "If horror is your thing, listen to Horror Study Hall: the academic side of horror.  Where we examine research, books, and podcasts that study the horror genre.  ",
        "language": "en",
        "author_name": "M.A. Reynolds",
        "slug": "horrorstudyhall",
        "cover": "20221022_051045_4aab6696caa9bb97b7cc6099a48e9149.jpg"
    },
    {
        "podcast_id": 161835,
        "title": "Education Rx",
        "description": "Education has reached a tipping point: we cannot use outdated practices and expect students to thrive. Education Rx was born out of a desire to support change in the public education system. Education should be engaging, have real world value, and be equitable for ALL students; no matter race, socio-economic status, or ability level.  And, it should be FREE!\nWe don't have all the answers, but we are searching out experts and real people that hold a piece of the puzzle, and we will be giving them a chance to share their perspective on what is broken.  Then we will follow it up with what is WORKING! We want to help start conversations that will help us move towards educational reform that will move our nation's public education system forward.\nThe students of today are the leaders of tomorrow.  Education should be one of the MOST important institutions in our country! We can do better.  Join us. Start conversations.  WE CAN DO BETTER!",
        "language": "en",
        "author_name": "Hollye Bronson and Shannon Donnaway",
        "slug": "edrx",
        "cover": "20221020_031028_0b55a3c8d668f5d783ec39bb110b0cfb.jpg"
    },
    {
        "podcast_id": 162130,
        "title": "The MindWorks Podcast",
        "description": "The MindWorks Podcast is the podcast that will help enhance your knowledge and perception in mental health, psychology, and philosophy. Two Latino mental health professionals from NY discuss the field of mental health from their perspective.\n",
        "language": "en",
        "author_name": "Dre and Kev",
        "slug": "themindworkspodcast",
        "cover": "20221021_121003_f5adf8ba7d3b9f43e0d5d80ae99afba6.jpg"
    },
    {
        "podcast_id": 162157,
        "title": "Retrógrades",
        "description": "Un intento por conceptualizar el presente, por ensayar ideas que nos sugiere algún suceso de actualidad, por fuera de las simpatías y antipatías de los grupetes.\n\nSomos:\nAlejandro Grimoldi, experiodista \"cultural\", actual ensayista y traductor de inglés, francés e italiano\nIgnacio De Marinis, profesor de Filosofía y afines en Universidad Austral, UCEMA y otras\nTomás Binder, crítico de cine y profesor de Cine y Filosofía en la Universidad del Cine\n\nGrabamos este podcast con Zencastr.",
        "language": "es",
        "author_name": "Alejandro Grimoldi, Ignacio De Marinis y Tomás Binder",
        "slug": "retrogrades",
        "cover": "20221102_031140_7d90ad0c4ea180993cb5f7f4cc06c17a.jpg"
    },
    {
        "podcast_id": 163587,
        "title": "Misbehave",
        "description": "<p>In the Misbehave podcast, we explore human behaviour in a business context. We’ll show you how leading with a deeper behavioural insight is the key to positively impacting people, performance, and profit. Because misbehaving isn’t about doing something wrong or not conforming. It’s the fact that you may be missing key opportunities to motivate and engage with people by missing behavioural insight. In this podcast, we’ll share more about how to understand behavioural patterns of yourself and those around you. We’ll tell stories we’ve experienced and the tools to use to flex behaviour. This will give you the power to influence and elevates your business to a completely new level. Let’s misbehave. ... Follow Laura: https://www.instagram.com/iamlauraelizabethw/ Follow Sarah: https://www.instagram.com/iamsarahcallender/ Find out more: https://duoglobalconsulting.com/</p>",
        "language": "en",
        "author_name": "Laura Weaving and Sarah Callender",
        "slug": "misbehave",
        "cover": "20230324_050339_9e10a45f932d29c1f6e7631ace47032f.jpg"
    },
    {
        "podcast_id": 167618,
        "title": "呒趣向turntable",
        "description": "大家好，欢迎来到「呒趣向turntable」，这是两个「晃膀子」的宁波人制作的独立播客。在之后的节目里，我们希望通过书籍、音乐、电影的榫卯结构，在日常中制造惊喜，搭建现代生活中的庇护所。每月19号中午固定更新（不定期掉落建材）。",
        "language": "zh",
        "author_name": "林工和济川",
        "slug": "anticlockwiseturntable",
        "cover": "20221114_121152_b32e72184dda56027ebf8459f9fe539a.jpg"
    },
    {
        "podcast_id": 168318,
        "title": "Mind Matters Presented by Light 4 Change",
        "description": "<p>Let's talk about things that are happening in our communities, where change can be made for the better, helpful hits on living a positive life, and getting to know the resources in your community. Lets talk about Mental health, Generational Trauma, Amber Alerts for missing children, Racism, Bullying, Modern Capitalist Slavery, Resources in the Community. If you are comfortable talking about these sensitive topics and how it could be changed in positive ways this is the place for you.</p>",
        "language": "en",
        "author_name": "Heidi Hardy",
        "slug": "light4change",
        "cover": "20221116_051138_88aa2a38d8463c02339fc5b8642f5e4f.jpg"
    },
    {
        "podcast_id": 168953,
        "title": "Tall Poppy Talk",
        "description": "Tall Poppy Syndrome, it's a social phenomenon, we all know, but don't often unpack. Kia ora, my name is Grace Lewis and I am on a mission to change the conversation around tall poppy syndrome. By focusing on the positives, rather than weaponising people's success, we can grow more Tall Poppies and fuel a culture that is based on genuine celebration of people's achievements.  \nJoin me as I interview legendary people who are [tall poppies] in their field, about their experience - & the lessons they've learned along the way. ",
        "language": "en",
        "author_name": "Grace Lewis",
        "slug": "tallpoppytalk-gracelewis",
        "cover": "20221118_081146_e1e658c2e58baa5c4d53e0f0ff1e147d.jpg"
    },
    {
        "podcast_id": 170059,
        "title": "A Rational Truth",
        "description": "Politics, Philosophy and Psychology Podcast. We're exploring the absurdities of existence in today's world and asking key philosophical questions about society and culture today. We're investigating the Meaning, Purpose and Value of life. Hosted by Adele C Marsh MCIPD, Transformational Leader, Philosopher, Productivity Activist and Entrepreneur.\n\n\"Season 1: An Introduction to Philosophy\" commenced on 3rd December 2022 and is a series of 24 introductory topics in Human Philosophy, in bite-sized 20 minute podcasts with accompanying Blog posts.\n",
        "language": "en",
        "author_name": "A Rational Truth",
        "slug": "arationaltruth",
        "cover": "20221124_071103_08170d91330e2adb0f38c3e757079023.jpg"
    },
    {
        "podcast_id": 176439,
        "title": "The Intangible",
        "description": "The Intangible is a podcast discussing cultural preservation in the modern world. From statues, to music, to cancel culture, to literature- The Intangible focuses on every aspect of modern culture. Cultural Preservation is normally discussed in the context of history and ancient archaeological artifacts. But, what about our current culture? What are the controversial aspects of our culture? Do we even want to preserve some parts? These are some of the questions that The Intangible aims to answer through discussions with many opinionated guests with focuses in different fields of culture and cultural preservation. For more information, check out the website: https://www.theintangible.co/",
        "language": "en",
        "author_name": "Nicholas",
        "slug": "theintangible",
        "cover": "20221227_121214_fd6b87cdbdf0b09e1fd907a87f6b596e.jpg"
    },
    {
        "podcast_id": 176564,
        "title": "Sfertul Academic  –  podcasturi de antropologie",
        "description": "<p>Sfertul Academic este un proiect editorial digital care aduce împreună cercetători din științele sociale, actori și artiști ilustratori cu scopul de a populariza antropologia, oferind publicului larg acces la resurse fundamentate teoretic și înrădăcinate în cercetări de teren aprofundate, care de regulă au o circulație limitată la comunitatea academică. Apărută în anul 2020, colecția de debut a platformei Sfertul Academic reunește contribuțiile a 37 de cercetători din științele sociale, 13 ilustratori și 2 actori și cuprinde 40 de articole, fiecare dintre ele însoțite de versiunea podcast și de o ilustrație inspirată din conținutul textului. Temele abordate pun în lumină concepte centrale din teoria antropologică, cum ar fi: ordine morală, structură și agentivitate, cultură materială, relații de putere, relații de schimb, sisteme de cunoaștere, gen, identitate, sine și societate. Totodată, aduc perspective noi asupra unor subiecte familiare, de actualitate: mediu, migrație, inegalități sociale, privatizare, dezvoltare personală, turism, și altele. Nu în ultimul rând, dezvăluie lumi sociale mai puțin cunoscute, din România, dar și de peste hotare: Egipt, Ghana, Japonia, Rusia sau Abhazia sunt doar câteva dintre locurile pe care ni le aduc mai aproape cercetările incluse în acest volum digital. Celor 40 de articole publicate li se adaugă o nouă serie de 60 de materiale originale, pe același format: text, podcast și ilustrație, care vor fi publicate în intervalul ianuarie 2022 - mai 2023. Sfertul Academic este un proiect al start-up-ului de cercetare socială Antropedia, cofiinanțat de AFCN, inițiat și coordonat de Maria Rădan-Papasima. Coperta colecției este realizată de Alexandru Nimurad.</p>",
        "language": "ro",
        "author_name": "Antropedia",
        "slug": "antropedia",
        "cover": "20221227_061208_fc7cb0c979b0b67825cb41b8d150a7e1.jpg"
    },
    {
        "podcast_id": 177067,
        "title": "Sag mal Abi",
        "description": "\"Sag mal Abi\" ist der ideale Podcast für alle, die auf der Suche nach verständlichen Erklärungen aktueller Trends im IT-Sektor sind. Maher Hamid und Okan Erkaptan, zwei Experten im Bereich der IT, bieten in jeder Folge einen tiefen Einblick in die Welt der Informationstechnik und beleuchten dabei auch die möglichen Auswirkungen von Machine Learning und Künstlicher Intelligenz auf die Gesellschaft in der Zukunft. \"Sag mal Abi\" ist somit der perfekte Podcast für alle, die sich für die neuesten Trends in der IT-Welt und die Auswirkungen von Technologie auf unsere Gesellschaft interessieren. Hören Sie rein und lassen Sie sich von Maher Hamid und Okan Erkaptan durch die Welt der IT-Trends führen.",
        "language": "de",
        "author_name": "Maher Hamid & Okan Erkaptan",
        "slug": "sagmalabi",
        "cover": "20221230_041242_3e5beb3c5d0c5a4a5bc11e3401acc760.jpg"
    },
    {
        "podcast_id": 177290,
        "title": "luminati.be",
        "description": "Verhalen over oude en nieuwe complottheorieën, pseudowetenschap en desinformatie.\nPer maand één onderwerp, in één of meerdere episodes.",
        "language": "nl",
        "author_name": "Frank Verhoft",
        "slug": "luminati",
        "cover": "20221231_111224_12bca06293a64fdf8afa6b5682267a69.jpg"
    },
    {
        "podcast_id": 179091,
        "title": "Rise",
        "description": "Rise is a series of audio articles hosted by author Aude Calloch, treating subjects of sociology, psychology, health, history, philosophy and more. All episodes are available in written form at www.audecalloch.com, in the 'Articles' section.",
        "language": "en",
        "author_name": "Aude Calloch",
        "slug": "risewithaudecalloch",
        "cover": "20230108_080134_20e86cf3ad0f1fada3b8520c9f3c8c23.jpg"
    },
    {
        "podcast_id": 179097,
        "title": "Redefining Masculinity",
        "description": "<p>Redefining Masculinity is an action project led by research assistants based around the key findings of Adam Howard’s newest study which goes into the secret worlds of American elite all-boys schools. Through the eyes of 127 recent alumni, we see the practices and relations involved in making privileged boys into elite men and the central role of privileged brotherhoods in this process. Several research assistants have worked alongside Howard not only to conduct this study but also to gain valuable insights into what we’ve learned from this research. In order to highlight student researchers’ perspectives and engage with the studies findings, pairs of students collaborated to produce a podcast series entitled Redefining Masculinity. Each podcast is centered around a main finding of the study. a different finding presented in each of the six chapters of the book. Through these discussions, student researchers put the data to use to explore various aspects of these secret worlds.</p>",
        "language": "en",
        "author_name": "Adam Howard",
        "slug": "redefining-masculinity",
        "cover": "20230111_100116_cd2d70a53b454a6ed9a96bc644e166be.jpg"
    },
    {
        "podcast_id": 179297,
        "title": "Dock Talk",
        "description": "Dock Talk is a podcast created by Maritime Professionals & Experts for Maritime Professionals & Experts. Want a community who asks and answers all of the industries questions? Well now you have it. Tune into Dock Talk once a month and stay up-to-date on the happenings in our industry!",
        "language": "en",
        "author_name": "Tessa Andres",
        "slug": "dock-talk",
        "cover": "20230112_080104_b76c1a44cc2a6c7528d9650132bb101f.jpg"
    },
    {
        "podcast_id": 179406,
        "title": "Wildly Queerious",
        "description": "Humanists Dr. Corinne Votaw, PsyD, and Brittany Freer, MA, use their mental health and healing training to frame conversations on queer theory, religion, politics, media, and current events.",
        "language": "en",
        "author_name": "Dr. Corinne Votaw & Brittany Freer",
        "slug": "wildlyqueerious",
        "cover": "20230120_060144_82f57dc5ec809f633d5149d1769b6477.jpg"
    },
    {
        "podcast_id": 180344,
        "title": "Drive Me To Your Leader",
        "description": "In this podcast we are going to take on all those controversial topics. There will be arguing, lamenting and hopefully not cursing. \nEither way, Welcome to the Podcast. ",
        "language": "en",
        "author_name": "Mr. Red",
        "slug": "drivemetoyourleader",
        "cover": "20230205_100202_070c7eac5e5240d33820fd67836274fc.jpg"
    },
    {
        "podcast_id": 181466,
        "title": "Croissant Hours",
        "description": "Croissant Hours: \nThe show where Croissant shares his insights and knowledge in a free flow format. Enjoy the edgy depths of his ENTP shadow and the absolute stupidity of his ESFP- and the occasional indignant rage of his ISFJ.\n\nAt the end of the day he can't and won't shut up, so might as well record it.",
        "language": "en",
        "author_name": "JeSuisCroissant",
        "slug": "croissanthours",
        "cover": "20230118_010159_0f4e25ec2b88ae7f07a5ca1ce48487b4.jpg"
    },
    {
        "podcast_id": 183301,
        "title": "Everyone’s Weird & So Are You",
        "description": "<p>Conversational interview-based real-life storytellers based off of cold calls from all media platforms and personal and professional networking. Talk to strangers more often. Ask deeper questions. You might learn more about yourself in the process.</p>",
        "language": "en",
        "author_name": "Sam Jenny",
        "slug": "everyonesweirdandsoareyou",
        "cover": "20230629_060616_ccc15cd38e5881495b7232e1f70c67ad.jpg"
    },
    {
        "podcast_id": 183303,
        "title": "Emotional Education with Dr. Albert Levis",
        "description": "Albert Levis, M.D., the inventor of Moral Science, puts his approach into practice at his Museum of Creative Process in Vermont where he connects Formal Theory to the artistic process through exhibitions and workshops. A practicing psychiatrist for over forty years, Levis was trained at the Universities of Zurich and Geneva, the University of Chicago and Yale. In Emotional Education, Dr. Albert Levis discusses Emotional Education for all, the Moral Science Theory, and the Creative Process.",
        "language": "en",
        "author_name": "Dr. Albert Levis",
        "slug": "emotionaleducation",
        "cover": "20230124_090120_c93a52053ba83e14c4c8c8acaff19fc0.jpg"
    },
    {
        "podcast_id": 183550,
        "title": "Jads Podcast",
        "description": "منصّة تواصليّة بديلة ذات طابع شخصيّ صَداقيّ، مع شخصيّات مُجَدّدة ومثيرة للاهتمام من شريحة طلاب الدكتوراة الفلسطينيين في جامعة تل أبيب. تهتمّ المدوّنة بتسليط الضّوء على أنفسنا وطاقاتنا كجماعة عن طريق منصّات تكشف حيوة الأفراد في الجماعة وتفاصيلها، وبالذات تقديم نموذج طلّاب الدّكتوراة بصورة حقيقيّة تعرض المُرّ والحلو في الحياة الأكاديميّة. بالإضافة لمحاولة المدوّنة تحقيق أهداف عينيّة للطلاب الجامعيّين مثل عرض طرق تعامُل مع العقبات والضّغوطات، فهي أيضًا تساهِم في تكوين صورة الجَماعة ولُحمتها، في السّبيل الى تعزيز الانتماء لها ولثقافتها ولِلُغتها. \n\nمُقدّم البرنامج هو جاد قعدان – طالب دكتوراة في اللّسانيّات الإدراكيّة وعلوم الثّقافة في جامعة تل أبيب. ",
        "language": "ar",
        "author_name": "Jad Jamal",
        "slug": "jadspodcast",
        "cover": "20230125_050110_9a462f0e482567c9e1814e775a0c90a3.jpg"
    },
    {
        "podcast_id": 183688,
        "title": "Ethnic Studies Thoughts with Ihtzel!",
        "description": "<p>Connections with CRT, microaggressions, and education</p>",
        "language": "en",
        "author_name": "Ihtzel",
        "slug": "therealdoseofschool",
        "cover": "20230420_050430_a4239fb4af4e849ad002715794a211f0.jpg"
    },
    {
        "podcast_id": 183819,
        "title": "üstün zekalı podcast",
        "description": "<p>üstün zekalıların eğitimi uzmanıyla zeka ve yetenek üzerine bir podcast serisi - iletişim: info@mehmetbicakci.com</p>",
        "language": "tr",
        "author_name": "mehmet bicakci",
        "slug": "fretful-curve",
        "cover": "20230327_090329_ccd8347f621451b9b9bb77340c62616a.jpg"
    },
    {
        "podcast_id": 184907,
        "title": "APRIORI",
        "description": "APRIORI, c’est un cocktail de jasettes à saveur politique, sociale et militante gracieuseté des étudiant.es en affaires publiques et relations internationales de l’Université Laval!  Au menu, des jeunes engagés et politisés qui vous partage ce qui les anime ou ce qui les garde éveillé la nuit!",
        "language": "fr",
        "author_name": "AÉAPRI",
        "slug": "apriori",
        "cover": "20230130_020150_ea5775aa6a0d5b480a21fa81d13359e2.jpg"
    },
    {
        "podcast_id": 185113,
        "title": "Marginal Investigations",
        "description": "<p>Examining the world, one topic at a time</p>",
        "language": "en",
        "author_name": "J.W. Rich",
        "slug": "marginalinvestigations",
        "cover": "20230131_020123_e0061919bfb6d5f6404a22d598d6fdf5.jpg"
    },
    {
        "podcast_id": 185372,
        "title": "Charlas Aleatorias",
        "description": "La intención de esta serie es acercar al público en general y, en particular, a l@s estudiantes de licenciatura a los seminarios que organiza el Departamento de Estadística del ITAM. Los episodios son cortos pues son charlas informales que tenemos con los expositores del seminario. El objetivo es dar una oportunidad a los ponentes de platicar de su trabajo en un ambiente mas informal que un seminario y motivar al estudiantado a indagar un poco mas en los temas. Y por qué no, atender con mejor contexto las pláticas de dicho seminario. ¡Disfrutalo!",
        "language": "es-mx",
        "author_name": "Alfredo Garbuno Iñigo",
        "slug": "charlas-aleatorias",
        "cover": "20230207_110226_5d89701d8ff76c6f55d998835fe87d91.jpg"
    },
    {
        "podcast_id": 185422,
        "title": "Paradox Institute Podcast",
        "description": "<p>The Paradox Institute presents research and commentary on the biology of sex and the differences between males and females in animated videos, articles, and books. Visit us at <a href=\"https://www.theparadoxinstitute.com\">theparadoxinstitute.com</a>.</p>",
        "language": "en",
        "author_name": "Paradox Institute",
        "slug": "paradoxinstitute",
        "cover": "20230430_010411_605d77e85927ebc0cd8036a1571d7bf9.jpg"
    },
    {
        "podcast_id": 185923,
        "title": "El Taladro Contracultural",
        "description": "Análisis social desde la perspectiva contracultural, con la agudeza del taladro",
        "language": "es-mx",
        "author_name": "Taladro",
        "slug": "taladro-contracultural",
        "cover": "20230202_030258_570636fbe512fc143abeaf2bc7910cbf.jpg"
    },
    {
        "podcast_id": 186704,
        "title": "WhyWork Podcast",
        "description": "<p>The WhyWork Podcast is an organisational strategy session and legal dissection of workplace events that are laced with humour. Your bloggers, Alan, Trajce, and Sara, explore the contemporary and uncomfortable realities of work and the boundaries that are tested. Alan and Trajce dismantle case law and Sara pushes all to consider how to redesign the world of work so that business objectives are realised and that people thrive. Good stories are told. The WhyWork team throws shade on some of the stories and the people involved as they consider defensible and remarkable work design strategy. When you listen to the WhyWork Podcast, you realise that no skeleton in the workplace closet is too sacred to unearth. It’s like listening to the water cooler gossip but then shit gets real, and it all becomes serious – fast. This is a must-listen for executive and emerging managers, work design strategists, human factors specialists and ergonomists, work health safety and law specialists, organisational scientists, occupational health academics, and anyone humoured by office and workplace antics! Get ready to exclaim, “She said WHAT...?” and “He DIDN’T! OMG!”. Laugh along with us while you learn lots.</p>",
        "language": "en",
        "author_name": "Alan Girle, Trajce Cvetkvovski, & Sara Pazell",
        "slug": "whywork",
        "cover": "20230224_040231_72467ab4cdd0e8f393ead5968f2fab7a.jpg"
    },
    {
        "podcast_id": 187358,
        "title": "Hormonale Tienermeisjes",
        "description": "Norah Delfsma en Hannah Francke, beide leerlingen vwo 6 Nehalennia Breeweg, gaan voor hun profielwerkstuk opzoek naar antwoorden op hun vragen over het vak bewegingsonderwijs. Met als hoofdvraag: wat is de invloed van bewegingsonderwijs op de mentale gesteldheid van middelbare scholieren en hoe lossen we mentale neveneffecten zo goed mogelijk op?\n\nTijdens hun zoektocht plegen de meiden verscheidene literaire bronnen raad:\nhttps://gedragsproblemenindeklas.nl/gedragsproblemen/faalangst/\nhttps://www.kennisbanksportenbewegen.nl/?file=8967&m=1531747876&action=file.download\nhttps://allesinbeweging.net/storage/2357/2017-Mulier-Instituut---Effecten-sport-&-bewegen-op-basisschool.pdf\nhttp://www.sports-media.be/links/gezond-bewegen-school.pdf\nhttps://dspace.library.uu.nl/bitstream/handle/1874/415277/Rapport_Geluk_onder_druk_DEF_interactief.pdf?sequence=1\nhttps://www.regioplan.nl/wp-content/uploads/2018/12/18102-Effecten-meer-en-beter-bewegingsonderwijs-Regioplan.pdf\nhttp://www.exlo.be/sites/default/files/201811/reader%202010_4.pdf#page=5\nhttp://ond.vvksoict.com/leerplannen/doc/lichamelijke%20opvoeding-2008-005.pdf \nwww.scherder.nl\n\n\n\nEn ook zoeken ze de antwoorden bij ervaringsdeskundigen:\n- Jeroen van Aevermate, sportdocent Nehalennia Breeweg\n- Tessa Goorsenberg, jeugdverpleegkundige GGD-Zeeland\n- Cees Doornbos, leerling vwo 6 Nehalennia Breeweg \n- Dennis Feij, ondersteuningscoördinator \n- Alyssa Hendrix, leerlinge vwo 6 Nehalennia Breeweg ",
        "language": "nl",
        "author_name": "Norah Delfsma & Hannah Francke",
        "slug": "pws2023ndhf",
        "cover": "20230207_020255_fddd1d55d2333c2aa912050b655025d3.jpg"
    },
    {
        "podcast_id": 187495,
        "title": "The Sex Ed Series",
        "description": "<p>Did you have sex education in school? If you were lucky enough to HAVE had it, you may still have hundreds of questions like I always did. And I promise you're not alone — I heard from almost 100 people about their sex education experiences in the United States and across the world, and only a few of them said the education they received left them feeling smarter about their sexual wellbeing. In this short series, I speak with folks from all walks of life, including those who have researched sex education, taught sex education, criticized sex education, praised it, and those who did not have it at all. In order to destigmatize this topic, we need to talk about it. And if that's too scary, we can at least listen to others talk about it, because I learned more than I ever thought I would by doing just that. Sit down, relax, and take a listen. I'm sure you'll learn something too. xox Susie Fordi</p>",
        "language": "en",
        "author_name": "Susanna Fordi",
        "slug": "the-sex-ed-series-by-susie-fordi",
        "cover": "20230207_090201_96d10da445eba8ee75080eff6d6463d4.jpg"
    },
    {
        "podcast_id": 188533,
        "title": "Agency & Development - Do Individuals Matter?",
        "description": "<p>Contemporary international development practice is shaped by politics and extends historical assumptions, concepts and narratives that specify ways of working for professional and practitioners in international and 'local' NGOs. This podcast series explores the theoretical and ethical issues in contemporary development organisations and their discourse, and how development NGO workers are 'captured' by this discourse. A PlanetWorka podcast series - see other PlanetWorka podcast series: Culture &amp; Development - Context Matters!; and, Planetworka - A World in Development</p>",
        "language": "en",
        "author_name": "PlanetWorka",
        "slug": "planetworka-agency-and-development",
        "cover": "20230211_060211_d982e41f4bd95ed70f804431b4fe923e.jpg"
    },
    {
        "podcast_id": 189335,
        "title": "Podcast ",
        "description": "<p>En este Podcast se explorar las implicaciones éticas y sociales de estas teorías, como por ejemplo si es posible responsabilizar moralmente a alguien por sus acciones si estas están totalmente determinadas por factores ajenos a su voluntad y debatidas de la filosofía.</p>",
        "language": "es-mx",
        "author_name": "Jeshua",
        "slug": "7-mentes-una-idea-diferente",
        "cover": "20230214_020203_e84215e1425835d4cf725ced3d713f85.jpg"
    },
    {
        "podcast_id": 189737,
        "title": "He estado pensando",
        "description": "<p><strong>\"He estado pensando...\"</strong> es un podcast en el que el <strong>sacerdote Alberto Reyes</strong>, reflexiona sobre diversos temas de la sociedad actual, desde la política y la cultura hasta la vida cotidiana y las relaciones personales. A través de sus pensamientos, el P. Alberto invita a la reflexión y al diálogo, siempre desde una perspectiva humana y comprometida con la verdad y la libertad. En cada episodio comparte sus ideas con una profundidad y una claridad que invitan a los oyentes a cuestionar su propia visión del mundo y a abrirse a nuevas formas de pensar.</p>",
        "language": "es",
        "author_name": "P. Alberto Reyes Pías",
        "slug": "he-estado-pensando",
        "cover": "20230215_050254_953fdb4fed88d4ba23c50e7ccf33fa39.jpg"
    },
    {
        "podcast_id": 189761,
        "title": "Voor je het weet... de podcast",
        "description": "Overdag zijn wij collega’s op een school voor zeer moeilijk lerende kinderen. Marte is psycholoog en Zuzanne is een leerkrachtondersteuner en zelfbenoemde gedragsspecialist. Het zal niemand verbazen dat wij allebei mensen zijn die andere mensen, hun gedachten, gedrag en motivatie erg interessant vinden. Tijdens onze gesprekken zijn we erachter gekomen dat er dingen zijn die wij bijzonder vinden, die voor anderen heel normaal zijn. Deze fascinatie willen we dan ook graag met de buitenwereld delen. Want wij zijn vast niet de enige die hier nieuwsgierig naar zijn. \nElke aflevering neemt Zuzanne, Marte en de luisteraars mee in een bijzonder iets, dat voor sommige mensen heel normaal is. Ze proberen het fenomeen van verschillende kanten te belichten en willen vooral uit eigen belang zoveel mogelijk van deze bijzondere dingen te weten komen. \n",
        "language": "nl",
        "author_name": "Zuzanne du Preez",
        "slug": "voorjehetweetdepodcast",
        "cover": "20230215_060215_01d23e7820f15f8342760f46af5263dc.jpg"
    },
    {
        "podcast_id": 190798,
        "title": "Let There Be Nous",
        "description": "<p>A podcast exploring the intersection of psychology and religion.</p>",
        "language": "en",
        "author_name": "Koert Verhagen",
        "slug": "lettherebenous",
        "cover": "20230219_080200_aa85f039c909eb2c4d16fa7b68de2704.jpg"
    },
    {
        "podcast_id": 192690,
        "title": "Intervención Antropológica",
        "description": "<p>Bienvenidxs a Intervención antropológica un podcast de divulgación y conocimiento que te permitirá acercarte a diferentes temas de la vida cotidiana desde la mirada calidoscópica de la antropología.</p>",
        "language": "es-mx",
        "author_name": "Luz Luján y Verónica Ramales",
        "slug": "intervencionantro",
        "cover": "20230226_110217_b6855ab61c3b3770bad3949936f932ae.jpg"
    },
    {
        "podcast_id": 193012,
        "title": "Always Learning",
        "description": "<p>This podcast is for curious souls who love to learn. I talk about my journey and experiences, as well as things going on in the world that I am learning about.</p>",
        "language": "en",
        "author_name": "Bianca Sorrentino",
        "slug": "biancasorrentino",
        "cover": "20230227_110251_f7e3dd100fe49b2a30cebb4e49e605e2.jpg"
    },
    {
        "podcast_id": 193460,
        "title": "A lo legal: Derecho y actualidad",
        "description": "<p>A lo legal: Derecho y actualidad es un espacio creado por el <strong>Departamento de Estudios Jurídicos</strong> de la Universidad Icesi con el apoyo de la <strong>Organización de Estudiantes de Derecho de Ices</strong>i y el <strong>Semillero de Transformación Digital, </strong>el cual tiene por objetivo ser un canal de interacción entre <strong>docentes</strong>, <strong>estudiantes</strong> y la <strong>sociedad en general</strong>.</p><p></p><p>Durante los próximos minutos conversaremos con diversos invitados sobre cuestiones de actualidad en el mundo del derecho</p><p></p><p>Utilizaremos un <strong>lenguaje claro, sencillo y ameno</strong>, que nos permitirán identificar y explicar los temas relevantes en el mundo del derecho.</p>",
        "language": "es",
        "author_name": "Universidad Icesi",
        "slug": "alolegal",
        "cover": "20230317_070329_399d63378b25978af5c3eac57d83a8a5.jpg"
    },
    {
        "podcast_id": 193507,
        "title": "Giants Amongst Us",
        "description": "<p>Real stories from everyday people. The underdogs, who've beaten the odds, and in their own way, walk like Giants Amongst Us.</p><p>_____</p><p>Shoot me a line if you'd like to share your story at <strong>: </strong><a href=\"mailto:giantsamongstus@tutanota.com\">giantsamongstus@tutanota.com</a></p><p>The floor is yours!!</p>",
        "language": "en-us",
        "author_name": "RR",
        "slug": "giants-amongst-us",
        "cover": "20230312_100305_c1cee0315c86935aa5bcec9bc4d5af58.jpg"
    },
    {
        "podcast_id": 193524,
        "title": "Kogniceraptor",
        "description": "<p>Cześć! Jesteśmy studentami i studentkami kognitywistyki na Uniwersytecie Śląskim w Katowicach. Prowadzimy serię podcastów, w których dzielimy się wiedzą z obszaru filozofii, psychologii, neurobiologii, sztucznej inteligencji a także wielu innych. Usiądź wygodnie i posłuchaj co dla Ciebie przygotowaliśmy!</p>",
        "language": "pl",
        "author_name": "Śląskie Koło Kognitywistów",
        "slug": "kogniceraptor",
        "cover": "20230301_070342_7e7bfbfbfefccc89f7830c2039815ffe.jpg"
    },
    {
        "podcast_id": 194279,
        "title": "پادکست اقتصاد، بی‌تعارف",
        "description": "<p><strong>ما یک تیم داوطلب از اقتصاددانان و فعالان حقوق بشری هستیم که به دور از هرگونه دیدگاه سیاسی و حزبی، با اتکا بر دانشِ اقتصادی خویش و سایر کارشناسان این عرصه به بررسی چالش‌های اقتصاد ایران با هدف ترویج برابری فرصت‌ها در کنار هم مشغول به کار شده‌ایم. محتوای پادکستها و سایر دست‌نوشته‌هایمان به منظور الهام بخشیدن و توانمند نمودن افراد برای ایجاد تغییرات مثبت در جامعه طراحی شده‌است. به باور ما انقلاب زندگی، آزادی، مسیری</strong></p>",
        "language": "fa",
        "author_name": "گروه اقتصاد، بی‌تعارف",
        "slug": "bteghtesad",
        "cover": "20230403_100441_82787b2b42da3a2ece73dcd7e1c58bbf.jpg"
    },
    {
        "podcast_id": 194847,
        "title": "Edible Oceans",
        "description": "<p>Prof. Tony Winson talks to Canadian and world experts on fisheries, ocean ecology, and humanity's impact on marine environments and the ocean species we take for food.</p>",
        "language": "en",
        "author_name": "Tony Winson",
        "slug": "edibleoceans",
        "cover": "20230306_050335_af8730979256733bb084b5d5a2931582.jpg"
    },
    {
        "podcast_id": 195210,
        "title": "Charlas en un Pueblo Fantasma",
        "description": "<p>Lo que partió como un Spin Off de Free Solo, hoy se levanta por si mismo y se transforma en un podcast independiente. \"Charlas en un Pueblo Fantasma\", un lugar de conversación y reflexión sobre diferentes temas  relacionados con la sociedad, la psicología y la filosofía en donde convergen los particulares puntos de vista  de un comediante y un académico.</p>",
        "language": "es-mx",
        "author_name": "Estudios Neverland",
        "slug": "charlasenunpueblofantasma",
        "cover": "20230307_090323_94ff95a553e0e855dc80a62c884897ff.jpg"
    },
    {
        "podcast_id": 195330,
        "title": "RAIA(ffairs)",
        "description": "​​We are RAIA(ffairs), your podcast for stepping up in international affairs. Get informed on the stories and worries of political leaders, the 'behind the scenes' of decision-makers, and how politics impact and change your life. Join your hosts Marina and Merel, along with a new guest every episode, to discuss the individual policy-maker of the week. ",
        "language": "en-us",
        "author_name": "RAIA",
        "slug": "raia-ffairs",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 195505,
        "title": "مُر و أحلى",
        "description": "<p>بودكاست مُر و أحلى ، منصة رائعة للعلم و المعرفة ، هنا سنتحدث عن كل شيئ هنا عالمك الخاص ، سنستفيد جميعا ان شاء الله من كل علوم الدنيا ، علم النفس ، الطب و الجمال ، التاريخ و الجغرافيا ، المجتمع ، و تجارب الناس و اتمنى ان نكون عند حسن ظنكم ، شكرًا</p>",
        "language": "ar",
        "author_name": "محمد العلامي",
        "slug": "murwaa7la",
        "cover": "20230316_090316_242925ff49aead1bcdb481d55097d4de.jpg"
    },
    {
        "podcast_id": 195656,
        "title": "Counter Hegemony",
        "description": "<p>Counter-hegemony is a podcast about international politics, globalization, war, peace, crises and social change in the 21st century.</p>",
        "language": "en",
        "author_name": "Aaron Tauss",
        "slug": "aarontauss",
        "cover": "20230330_010325_ecbc86a7a0d8136f82b8ad8717909328.jpg"
    },
    {
        "podcast_id": 195872,
        "title": "Let's Talk Development",
        "description": "<p>The Consortium for Development Policy Research (CDPR) and the International Growth Centre (IGC) are excited to launch their podcast series ‘Let’s Talk Development’.</p><p>This is a podcast about understanding Pakistan’s crucial economic and development problems. We engage experts in exploring critical development issues and trends in Pakistan. New episodes come out every two weeks.</p><p><em>The views and opinions expressed in the podcast are those of the speakers and do not necessarily reflect the views or positions of CDPR or any of its affiliates.</em></p>",
        "language": "en",
        "author_name": "Consortium for Development Policy Research ",
        "slug": "letstalkdevelopment",
        "cover": "20230316_070358_4e5dba3040fdf3109a46077b8761da5e.jpg"
    },
    {
        "podcast_id": 196176,
        "title": "Tecnografias",
        "description": "<p><em>Tecnografias</em> é uma nova plataforma de debate transatlântico em redor de livros recentes na área da antropologia e das ciências sociais. Trata-se de um podcast coordenado por um coletivo de antropólogas/os e cientistas sociais sediado em Portugal e no Brasil. Cada episódio é uma conversa e um convite para refletir sobre os grandes desafios do mundo contemporâneo na sua complexidade e pluriversalidade. Disponível nas melhores plataformas de podcasts, incluindo Spotify, Google Podcasts, Apple Podcasts, entre outras. <em>Tecnografias</em> é produzido pela Rede de Pesquisa Internacional Sci-Tech Asia e é apoiado pelo Grupo de Pesquisa \"Tecnociência, Sociedade e Ambiente\" do CIAS – Centro de Investigação em Antropologia e Saúde da Universidade de Coimbra.</p><p><strong>Equipa de Coordenação:</strong></p><p><a href=\"https://www.ics.ulisboa.pt/pessoa/cristina-sa-valentim\">Cristina Sá Valentim</a>, <a href=\"https://gdsantos.com/\">Gonçalo D. Santos</a>, Rodrigo Toniol, e Rosana Castro</p><p><strong>Equipa de Produção:</strong></p><p>Bruna Coelho, Lívia Humaire</p>",
        "language": "pt-pt",
        "author_name": "Sci-Tech Asia International Research Network",
        "slug": "tecnografias",
        "cover": "20230311_060304_a73c56f6779f8bc653f91e5f6851a5c6.jpg"
    },
    {
        "podcast_id": 196298,
        "title": "GenXed",
        "description": "<p>GenXed is a periodic podcast about life, love, and liberty in 21st century America...with a little burn. 🔥</p><p>We read situations and people for what they really are to provide education for the generations.</p><p>Join host Tigereye and the occasional guest as we analyze current events, music, movies, and more through a Gen X lens. Take a trip down memory lane every now and then with us and see the world through the eyes of a generation that refuses to die.</p><p>Website: <a href=\"https://tigereye.media/genxed/\">https://tigereye.media/genxed/</a></p><p>Tip Jar: <a href=\"https://donate.stripe.com/14k4iJdWz20m3AYeUU\">https://donate.stripe.com/14k4iJdWz20m3AYeUU</a></p><p>SM: @HiTigereye</p><p>Credits:</p><p>🔥 Theme Song \"Disco 2 Disco\" by Notorious Twins is licensed under CC BY 3.0.</p><p>🔥 Sound Effects Flame \"Fire Fuse Ignite Flame\" by EminYILDIRIM is licensed under CC BY 4.0.</p>",
        "language": "en",
        "author_name": "Tigereye",
        "slug": "hitigereye",
        "cover": "20230314_050355_f053010085a8946b5934cdfab8c32d6b.jpg"
    },
    {
        "podcast_id": 196364,
        "title": "Relevate Presents: The Reframe",
        "description": "<p><strong><em>Relevate Presents: The Reframe</em></strong> is a podcast where three friends, who just happen to also be marriage and family therapists, use entertainment mediums such as television and movies to give you unfiltered opinions on the characters with a sprinkle of research and systems theory.</p><p>Hosts Chélynn, Marissa, and Carmen welcome listeners into their friend circle and offer a peek into what their group chat looks like on any given day. So buckle up and join them for the journey as they follow the characters from your favorite shows and give you an inside look into what therapists think when they are not in session!</p><p>Podcast Sponser: Relevate - <a href=\"http://myrelevate.com\">myrelevate.com</a></p><p>Podcast Cover Artist: Jacora Smart of The Smart ReMark</p><p>Podcast Music: Earnest Adams, III</p>",
        "language": "en",
        "author_name": "Chélynn Randolph, Marissa Mosley, Carmen Gray",
        "slug": "thereframe",
        "cover": "20230312_060324_d9e2c1083e8c079ee08a0988d0db5bd7.jpg"
    },
    {
        "podcast_id": 196757,
        "title": "psych.mic",
        "description": "<p>Welcome to the Melbourne University Psychology Association podcast! Run by students, hear from us and special guests on a range of interesting psychology related topics!</p>",
        "language": "en",
        "author_name": "Melbourne University Psychology Association",
        "slug": "mupaunimelb",
        "cover": "20230317_040316_8bd6dcc8a4b1ab38fd5030b30da49988.jpg"
    },
    {
        "podcast_id": 196789,
        "title": "Los famosos sermones del Padre Pistolas",
        "description": "<p>Desde Chucandiro Michoacan el famoso y controvertido Padre Pistolas nos comparte el evangelio y otros temas de interés </p>",
        "language": "es-mx",
        "author_name": "Padre Pistolas Oficial by Nova Persei",
        "slug": "padrepistolas",
        "cover": "20230314_120355_08051eef9f4df0a3f08b416989cca9a6.jpg"
    },
    {
        "podcast_id": 197464,
        "title": "AnthroArt",
        "description": "<p><strong>AnthroArt – Action for People and Planet</strong> is an initiative of three applied anthropology organisations – Antropedia, Namla and Ambigrama – that aims to create <strong>an international platform for connecting anthropology and art</strong>, with the purpose of <strong>deepening awareness about inequality and our relation with the environment</strong> and driving change across three geographies: Romania, The Netherlands and Portugal, as well as beyond.</p>",
        "language": "en",
        "author_name": "Antropedia / Namla / Ambigrama",
        "slug": "anthroart",
        "cover": "20230317_120347_f9c77075b776fa18cd24fedf70fbead4.jpg"
    },
    {
        "podcast_id": 197714,
        "title": "Lecture Prep on the Go (RSS 4242 Gender, Leisure and Sport)",
        "description": "<p>This podcast provides audio lectures for students in RSS 4242 to help them prepare for in-class discussions.</p>",
        "language": "en",
        "author_name": "Charlene Shannon-McCallum",
        "slug": "lectures-on-the-go",
        "cover": "20230318_080304_e59c0aebedafbcca1d16e8921f90744b.jpg"
    },
    {
        "podcast_id": 198307,
        "title": "Our Intakes on Australian Identity",
        "description": "<p>In this podcast, we show our understanding on Australian Identity.</p>",
        "language": "en",
        "author_name": "Emi, Ashleen and Jessica",
        "slug": "lighthouse-student-real-life",
        "cover": "20230321_040347_f2ba7f2736d11b5309f88c7b8900dfa1.jpg"
    },
    {
        "podcast_id": 198334,
        "title": "THE SATAN SHOW™️ (PODCASTS)",
        "description": "<p>HOSTED BY SATANSTEEZ🔥™️</p>",
        "language": "en",
        "author_name": "SATANSTEEZ🔥™️",
        "slug": "thesatanshow",
        "cover": "20230321_070346_0d29458908f86fca75e3d6470010929a.jpg"
    },
    {
        "podcast_id": 199278,
        "title": "Pisma i Znaki",
        "description": "<p>Co to znaczy istnieć, na czym polega wolność, od czego zależy nasze szczęście, wreszcie – jak ulepszać świat, korzystając z postępu nauki, sukcesów i porażek ludzi, którzy żyli przed nami? Pytania filozoficzne towarzyszą człowiekowi od wieków, także dziś. W audycji Pisma i znaki, razem z gośćmi, rozmawiamy o sprawach, które ciągle są aktualne. Nawiązujemy do historii filozofii, różnych sposobów myślenia o świecie i człowieku. Nie dajemy gotowych odpowiedzi na trudne pytania. Zachęcamy do krytycznego myślenia, twórczej refleksji.</p><p>Zaprasza Alicja Karłowska</p>",
        "language": "pl",
        "author_name": "Polskie Radio Rzeszów",
        "slug": "pisma-i-znaki",
        "cover": "20230325_020354_fa5fc90f1845efe11869b89c42401720.jpg"
    },
    {
        "podcast_id": 199424,
        "title": "transverso.horizontal - por lugaresdefala",
        "description": "<p>Critica que atravessa o conteúdo científico que foi construído do espaço cisnormativo e epistemicida até alcançar os dados atualizados de <strong>artigos que implodem a transfobia institucionalizada na saúde.</strong> <em>Profissionais de Saúde</em> e <em>Pessoas Trans</em> podem tecer um diálogo horizontal no qual a ciência se insere nas subjetividades individuais, obténdo um conhecimento diverso, particular, e complexo. Lugar de fala no contexto da equidade é sobre promover espaços que renivelam o fluxo do saber, devolvendo a quem sempre pertenceu a autoridade sobre si mesmo.</p>",
        "language": "pt-br",
        "author_name": "Tiago Oliveira +",
        "slug": "lugaresdefala",
        "cover": "20230407_030412_7bf3f462498d35b6def210f587caca02.jpg"
    },
    {
        "podcast_id": 199614,
        "title": "Lurt av læreboken?",
        "description": "<p>En podcast av <a href=\"http://Fagsjekk.no\">Fagsjekk.no</a></p><p>Har du en myte du ønsker at vi ser på? Eller har du andre spørsmål? Send oss en mail: <a href=\"mailto:fagsjekk@nkss.no\">fagsjekk@nkss.no</a></p>",
        "language": "nb",
        "author_name": "Fagsjekk.no",
        "slug": "burdeikkevaertpensum",
        "cover": "20230327_120354_29a81b32b5c7df9dc08b57af1a42b2eb.jpg"
    },
    {
        "podcast_id": 200382,
        "title": "Community Park",
        "description": "<p>Here at the Community Park, we aim to create a space for all artists to create their works, as well as create a respectful open forum for members of the community to give voice to issues or messages they feel we all need to hear.</p>",
        "language": "en",
        "author_name": "Nat Von and Chaise Dingman",
        "slug": "communitypark",
        "cover": "20230331_010332_fae95e16ba7b32afa0753c1a9f780ae4.jpg"
    },
    {
        "podcast_id": 200785,
        "title": "Democracy Salon_NYC 民主沙龙",
        "description": "<p>A cultural space for liberals and progressivists interested in social movements in China</p>",
        "language": "zh",
        "author_name": "Democracy Salon",
        "slug": "democracysalonnyc",
        "cover": "20230705_060745_054c2ea8f6b6e88010e362d1b37ccea6.jpg"
    },
    {
        "podcast_id": 202097,
        "title": "Discern This",
        "description": "<p><strong><em>Discern This</em> </strong>presents unique and entertaining interviews with original thinkers on the most critical issues of the day. Journalist and writer Lonzo Cook engages expert guests in rigorous but relaxed conversations that unpack serious subjects in new and surprising ways. In a relatable yet informed manner, we illuminate some of misapprehensions that the public may hold. By tapping the knowledge of our guests, we intend to surface some of the overlooked causal factors and explore contingencies that may yet happen.</p><p><strong><em>Discern This</em> </strong>will range beyond conventional national security debates and explore how technology- especially artificial intelligence- is likely to alter our economies and societies. The podcast intends to provide robust discussions about how environmental and climate concerns should be every society’s priority, and we will cover some innovative potential approaches on how humanity could bend the curve of global warming.</p>",
        "language": "en",
        "author_name": "Lonzo Cook",
        "slug": "discernthispod",
        "cover": "20230408_080430_ddb6f5e7924c1fe71ce302d7a68bb1e0.jpg"
    },
    {
        "podcast_id": 202200,
        "title": "Geschäftsführung ohne Auftrag (GoA) ",
        "description": "<p>In dieser Reiher geht es um die Geschäftsführung ohne Auftrag nach den §§ 677 ff. BGB. Der gesamte klausurrelevante Stoff wird anhand von Beispielen erklärt.</p><p>Die dazugehörigen Folien findet ihr hier: <a href=\"https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb\">https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb</a></p><p>Diese Podcastfolgen sind die Audiospuren von meinen Youtubevideos: <a href=\"https://www.youtube.com/@Der_Jurastudent\">https://www.youtube.com/@Der_Jurastudent</a></p><p>Die GoA Playlist auf Youtube: <a href=\"https://www.youtube.com/playlist?list=PLNksZKKbkZUK0STaAMkE8RAkqCcN-vSze\">https://www.youtube.com/playlist?list=PLNksZKKbkZUK0STaAMkE8RAkqCcN-vSze</a></p>",
        "language": "de",
        "author_name": "Der Jurastudent",
        "slug": "derjurastudent-goa",
        "cover": "20230512_090533_5b3d8c862723f48a297a04898b466018.jpg"
    },
    {
        "podcast_id": 202727,
        "title": "Le Collectif Orenda",
        "description": "<p>Le Collectif Orenda est le podcast de la ferme urbaine Culture Orenda - Oasis Urbaine. Le Collectif est l’occasion de nourrir l’esprit de notre communauté par des discussions, épisode après épisode, sur des enjeux sociaux, des concepts philosophiques ou des réalisations dans la communauté.</p>",
        "language": "fr",
        "author_name": "Culture Orenda - Oasis Urbaine",
        "slug": "collectiforenda",
        "cover": "20230412_010454_3c39dfce0f8d39ba7e84966fa9caef45.jpg"
    },
    {
        "podcast_id": 202973,
        "title": "The Knack",
        "description": "<p>The Knack believes that social commentary about the nuances in sport happens inside our heads every day. Conor and Mike plan to bring these relatable observations to light through deep dive conversations.</p><p>Every week they both bring one of these observations to the table as their 'topic' without telling each other what it is.</p><p>They also dissect a Niche Sport on every episode along with celebrating a member of the sporting community that deserves to be celebrated.</p><p>Just a couple guys who are also on Instagram: <a href=\"https://www.instagram.com/theknackwrap/\">https://www.instagram.com/theknackwrap/</a>     </p>",
        "language": "en",
        "author_name": "The Knack ",
        "slug": "theknack",
        "cover": "20230518_120531_180e6cd92102713d970f4d683781e7af.jpg"
    },
    {
        "podcast_id": 203120,
        "title": " | بودكاست ابنوس",
        "description": "<p>إرث هي منصّة سودانيّة مُستقلّة، مُتخصصة في عرض محتوى رقميّ سوداني.</p><p>برامج متنوّعة، برامج بودكاست، وثائقيّات، بالإضافة إلى مقالاتٍ مختلفة في شتّى المواضيع.</p>",
        "language": "ar",
        "author_name": " | بودكاست ابنوس",
        "slug": "iirthmedia",
        "cover": "20230414_030432_fef0280a3f78fb15dbf6763dfddbe3ce.jpg"
    },
    {
        "podcast_id": 203935,
        "title": "Psych Expansion Podcast",
        "description": "<p>Welcome to Psych Expansion, the podcast where we explore the intersections of technology, history, and personal growth. I'm Gabriel, and each week I bring you conversations with everyday people who are seeking understanding to be able to navigate within the challenges and opportunities of our rapidly changing world. My mission with Psych Expansion is to bridge the gap between generations by connecting the knowledge of the youth with the wisdom of the elderly to create a more harmonious world for all. We also discuss the implementation of the latest A.I. technology being introduced in our everyday lives. Share your experiences and insights with us through email or social media, and join us on a journey of self-discovery and growth, the Emotions and Logic rest within the roots. If you're someone who's curious about the world and wants to stay ahead of the curve, join me every Thursday for a new episode of Psych Expansion. I look forward to expanding our minds together.</p><p>Contact via Email: psychexpansionpodcast@gmail.com</p><p>Instagram DM: psychexpansionpodcast</p>",
        "language": "en",
        "author_name": "Gabriel Elijah",
        "slug": "psychexpansion",
        "cover": "20230418_100424_e89c0ed8bd3405773d191d271aec43e4.jpg"
    },
    {
        "podcast_id": 203944,
        "title": "Politics and Pedagogy",
        "description": "<p>We are delighted to launch the first series of “Politics and Pedagogy” a podcast run by the Centre for Teaching Innovation and Scholarship in Politics and International Studies at the University of Leeds. This first series is funded by The COST Action DecolDEV which takes on the challenge to reconstruct the concept and practice of development after its deconstruction. This series showcases conversations from academics in Politics, International Relations and Development as they reflect on decolonial practices in education.</p><p>The podcast hosts are <a href=\"https://essl.leeds.ac.uk/politics/staff/1483/dr-madeleine-le-bourdon\">Dr Madeleine Le Bourdon</a> Associate Professor in the Politics of Global Development and <a href=\"https://essl.leeds.ac.uk/politics/staff/1266/dr-louise-pears\">Dr Louise Pears</a> Lecturer in Global Security Challenges. It is produced by <a href=\"https://essl.leeds.ac.uk/politics/pgr/875/marine-gueguin-\">Dr Marine Guéguin</a> <a href=\"https://css.leeds.ac.uk/profiles/harrison-swinhoe/\">and Dr Harrison Swinhoe</a> both Post-doctoral researchers in the Centre for Global Security Challenges.</p><p>@CTISLeeds</p><p><strong>Funding Provider: </strong>This podcast is funded by the EU's Cost Action Decolonising Development (CA19129): <a href=\"http://www.cost.eu\">www.cost.eu</a>. The Action works towards a resetting and diversification of the structures, institutions and spaces in which knowledge about and for development is produced, shared, contested and put into practice. Decolonisation of knowledge about ‘development’ cannot mean to maintain a paternalist binary of those already developed and those less developed but must scrutinize the structures and institutions that maintain power imbalances and the ideas that support paternalistic relations and assumptions of superiority according to intersectional (read: gendered, racialized, classed etc.) objectification of the Other.</p>",
        "language": "en",
        "author_name": "Madeleine Le Bourdon and Louise Pears",
        "slug": "politicsandpedagogy",
        "cover": "20230418_120413_199157059d03608c1769b15a4834f59a.jpg"
    },
    {
        "podcast_id": 203974,
        "title": "Под вино не мудрено",
        "description": "<p>Ироничный диалог о мужчинах, женщинах и отношениях между Анной @manolo_and_chandon и Анной @anna_annikov_ Подписывайтесь на нас!</p>",
        "language": "ru",
        "author_name": "Anna Fedotova and Anna Annikov",
        "slug": "manolo-and-chandon",
        "cover": "20230418_040446_bb19b15515fdeecb1d80ad39e41cefb7.jpg"
    },
    {
        "podcast_id": 204218,
        "title": "Verwaltungsrecht AT",
        "description": "<p>Es wird der gesamte klausurrelevante Stoff zum Verwaltungsrecht AT für das Examen behandelt.</p><p>Die dazugehörigen Folien sind hier verfügbar: <a href=\"https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb\">https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb</a></p><p>Dies sind die Audiospuren von meinen Youtubevideos: <a href=\"https://www.youtube.com/@Der_Jurastudent\">https://www.youtube.com/@Der_Jurastudent</a></p><p>Die Verwaltungsrecht AT Playlist auf Youtube: <a href=\"https://www.youtube.com/playlist?list=PLNksZKKbkZUJCLaG9gDu18_XMD4Q6KcWh\">https://www.youtube.com/playlist?list=PLNksZKKbkZUJCLaG9gDu18_XMD4Q6KcWh</a> </p>",
        "language": "de",
        "author_name": "Der Jurastudent",
        "slug": "derjurastudent-verwaltungsrecht",
        "cover": "20230419_090459_3ba86e2feabd46b8cb49408fde2ce719.jpg"
    },
    {
        "podcast_id": 204220,
        "title": "Verwaltungsprozessrecht",
        "description": "<p>Es wird der gesamte klausurrelevante Stoff zum Verwaltungsprozessrecht für das Examen anhand von vielen Beispielen behandelt.</p><p>Die dazugehörigen Folien sind hier verfügbar: <a href=\"https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb\">https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb</a></p><p>Dies sind die Audiospuren von meinen Youtubevideos: <a href=\"https://www.youtube.com/@Der_Jurastudent\">https://www.youtube.com/@Der_Jurastudent</a></p><p>Die Verwaltungsprozessrecht Playlist auf Youtube: <a href=\"https://www.youtube.com/playlist?list=PLNksZKKbkZUKsMjcI3Ux9CKbAbRaHvfH1\">https://www.youtube.com/playlist?list=PLNksZKKbkZUKsMjcI3Ux9CKbAbRaHvfH1</a> </p>",
        "language": "de",
        "author_name": "Der Jurastudent",
        "slug": "derjurastudent-verwaltungsprozessrecht",
        "cover": "20230419_070414_cbd5fb37f652a3691c179f11f021995d.jpg"
    },
    {
        "podcast_id": 204221,
        "title": "Strafrecht AT",
        "description": "<p>Es wird der gesamte klausurrelevante Stoff zum Strafrecht AT für das Examen anhand von vielen Beispielen behandelt.</p><p>Die dazugehörigen Folien sind hier verfügbar: <a href=\"https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb\">https://drive.google.com/drive/folders/1OWDMyYWGnlMIBPqttHKPhetfm2Fe3ITb</a> </p><p>Dies sind die Audiospuren von meinen Youtubevideos: <a href=\"https://www.youtube.com/@Der_Jurastudent\">https://www.youtube.com/@Der_Jurastudent</a></p><p></p><p>Strafrecht AT Playlist auf Youtube: <a href=\"https://www.youtube.com/playlist?list=PLNksZKKbkZUL5DbOoD1xYFC2IUr1L5DRv\">https://www.youtube.com/playlist?list=PLNksZKKbkZUL5DbOoD1xYFC2IUr1L5DRv</a> </p><p></p>",
        "language": "de",
        "author_name": "Der Jurastudent",
        "slug": "derjurastudent-strafrecht-at",
        "cover": "20230420_070454_527fa3a0f2809408d17b3522f4a945f4.jpg"
    },
    {
        "podcast_id": 204786,
        "title": "Takane Talks",
        "description": "<p>Hola mi nombre es Byron, en internet conocido como Takane, juego videojuegos desde los 3 años y este es mi podcast en el que hablaremos sobre videojuegos especificos y distintos aspectos de estos mismos.</p><p>Espero lo disfrutes</p>",
        "language": "es",
        "author_name": "Byron",
        "slug": "pixelespasionydeterminacion",
        "cover": "20230429_120427_61c954e24a6d0e86e4f7255aa6e63f51.jpg"
    },
    {
        "podcast_id": 205707,
        "title": "Rez Duo Talk ",
        "description": "<p>Podcast centré sur la situation actuelle des Premières Nations, sur la réalité et sur la démystification du folklore dans une ambiance relaxe et d'humour.</p>",
        "language": "fr",
        "author_name": "Andawa Laveau et Samuel Vollant-Laprise",
        "slug": "rezduotalk",
        "cover": "20230426_050456_e423c116b2c70942816f44d41a21b41f.jpg"
    },
    {
        "podcast_id": 206336,
        "title": "The Power of Perspective with Stephen Ritchie",
        "description": "<p>Join us on \"The Power of Perspective with Stephen Ritchie\" as we explore a wide range of topics and engage in thought-provoking discussions with guests from all walks of life. From artists to scientists, entrepreneurs to activists, our guests bring their unique perspectives and valuable insights to the table. So grab a cup of coffee and join us for an intellectual and stimulating conversation.</p><p>Hosted by Stephen Ritchie from Cape Town, South Africa. Follow us on Instagram @powerofperspectivewithstephen for news and updates.</p>",
        "language": "en",
        "author_name": "Stephen Ritchie",
        "slug": "the-power-of-perspective",
        "cover": "20230815_080815_534757930d7ec523623c65536e108198.jpg"
    },
    {
        "podcast_id": 206674,
        "title": "Safe Space - The ABA Podcast",
        "description": "<p>At Safe Space, we believe in the power of compassion and its ability to transform lives. We are a team of passionate professionals dedicated to our mission of increasing the quality of life for individuals with autism and related disorders. We understand the challenges faced by those with autism and their families, and we are here to provide support, guidance, and resources to help navigate those challenges. Our approach is grounded in research-backed techniques, and we are committed to sharing our knowledge and insights with the wider community. We believe in creating a safe and inclusive space for all individuals to learn, grow, and thrive. Join us on this mission to explore the infinite possibilities of creating a brighter and more compassionate future for all individuals in the world of ABA.</p>",
        "language": "en",
        "author_name": "To the Moon PLLC",
        "slug": "safespaceaba",
        "cover": "20230501_100513_e33a15a2a82fde3c2fe4c0d1fc79e695.jpg"
    },
    {
        "podcast_id": 206858,
        "title": "YTDCAST",
        "description": "<p>Yes, That DOES count as social theory looks at sociology and social theories as they relate to the actual world we live in. Interview format with multiple guests. hosted by patrick hampton.</p>",
        "language": "en",
        "author_name": "Patrick Hampton",
        "slug": "ytdcastinterviews",
        "cover": "20230502_050536_c1c6a3558a2385e419925ccf9fa1a5ae.jpg"
    },
    {
        "podcast_id": 207134,
        "title": "There's More to My Story ",
        "description": "<p>Humans are interesting creatures. Many of us are convinced that the stories we tell about ourselves are absolute. Maybe it is true…identity is a summation of the stories we tell about ourselves, and each retelling, morphed by experience and interpretation, etches us closer to who we think we are. It is a privilege nonetheless to yield the power of self-determination in free political systems. Not everyone is so blessed. We must not squander the honor we have. In sharing our stories with others, there is a possibility for mosaic activity, for cultivating community. Join us in civic engagement and dialogue as we celebrate diversity, equity, and inclusion.</p>",
        "language": "en",
        "author_name": "Dan Fortune and Scott Vault ",
        "slug": "theresmoretomystory",
        "cover": "20230503_080545_db24a67d38b7c3e39f5476ea60aad90b.jpg"
    },
    {
        "podcast_id": 207672,
        "title": "Goofy History",
        "description": "<p>Three friends (and sometimes four) who love the past discuss their favorite silly, goofy, and downright zany events in history.</p>",
        "language": "en",
        "author_name": "Goofy Crew",
        "slug": "goofyhistory",
        "cover": "20230517_020514_96a170f28bdeda19d7e190ae92103758.jpg"
    },
    {
        "podcast_id": 207678,
        "title": "Beyond the Chutes",
        "description": "<p>A Rodeo Podcast about the people and their lives Beyond the Chutes - at both ends of the arena - the Bucking Chutes and the Timed Event Chute. We talk with the People involved, to learn about their experiences, their stories and the Places they take us.</p>",
        "language": "en",
        "author_name": "Doug Simcox",
        "slug": "beyondthechutes",
        "cover": "20230506_060551_0f0e1e1cca1cc3c0c13dba2370a09e75.jpg"
    },
    {
        "podcast_id": 209956,
        "title": "Voices of Democracy",
        "description": "<p>Welcome to Voices of Democracy! I'm Kevin Sun. This is a podcast created in the context of my integrative project at Sainte-Anne International College, a Quebec CEGEP.</p><p>This first series explores the participatory democracy of Quebec and Cuba, and attempts to answer the question: What might Quebec be able to learn from Cuba's popular participation and participatory democracy?</p><p>To answer this question, several other subjects are also tackled. What is democracy? What is participation? Tune in to find out.</p>",
        "language": "en",
        "author_name": "Kevin Sun",
        "slug": "voicesofdemocracycisa",
        "cover": "20230518_050527_56a6710664df4c3a916a34a196855087.jpg"
    },
    {
        "podcast_id": 211002,
        "title": "Love And Justice Podcast",
        "description": "<p>Hi, I am Rachel DePalma an abuse awareness advocate, here is where I will share my personal journey of surviving domestic violence, narcissistic abuse, workplace abuse and a social media smear campaign. Unwinding the lies and expositing the truth of societies bias and how the social movement is being undermined by toxic people like narcissists, sociopaths, and psychopaths because abusers can manipulate so well. The best way to tell the difference, victims talk about their abuse, abusers talk about their victims.</p><p>______________</p><p>Disclaimer: This website should not be construed as being about or referring to any particular individual.</p>",
        "language": "en",
        "author_name": "Rachel DePalma",
        "slug": "loveandjusticepodcast",
        "cover": "20230630_030647_5d99cca5d280c521f1b777b575f9baef.jpg"
    },
    {
        "podcast_id": 211058,
        "title": "Kafamın Ucundakiler",
        "description": "<p>Noluyo ne bu tantana?</p><p>Kültür•Sanat •Sosyoloji • Hayata dair bazı şeyler <a href=\"mailto:kafaminucundakiler1@gmail.com\">kafaminucundakiler1@gmail.com</a> instagram.com/kafaminucundakilerpodcast</p>",
        "language": "tr",
        "author_name": "ssinrofya",
        "slug": "kafaminucundakiler",
        "cover": "20230524_050529_7a76b8ac7e980b26902952bfb57c3ca8.jpg"
    },
    {
        "podcast_id": 211927,
        "title": "Women Making Moves",
        "description": "<p>Women Making Moves is a podcast that celebrates the moves that women are making on a local, regional, national, and global level.</p><p>Amy Pons is a master certified life coach dedicated to amplifying the work that humans are doing toward the equity of all women worldwide.</p>",
        "language": "en",
        "author_name": "Amy Pons",
        "slug": "womenmakingmoves",
        "cover": "20230608_060617_b4e014314ad674479e402a1238b36d2a.jpg"
    },
    {
        "podcast_id": 212725,
        "title": "Elements",
        "description": "<p>Join the Particle team as we explore how the four natural elements shape the people of Western Australia and their physical environment.</p><p>Find out more about all the weird and wonderful science happening in Western Australia via <a href=\"https://particle.scitech.org.au/\">www.particle.scitech.org.au</a></p>",
        "language": "en",
        "author_name": "Particle WA",
        "slug": "elements",
        "cover": "podcast_cover.png"
    },
    {
        "podcast_id": 213124,
        "title": "My Brain My Choice Zum Hören",
        "description": "<p>Unsere Debatten-Beiträge über heutige und zukünftige Drogenpolitik zum Anhören. Sprecher: Jonathan Grün. Redaktion: Philine Edbauer. Wie du die #MyBrainMyChoice Initiative unterstützen kannst: <a href=\"https://mybrainmychoice.de/spenden\">https://mybrainmychoice.de/spenden</a></p>",
        "language": "de",
        "author_name": "MyBrainMyChoice Initiative",
        "slug": "mybrainmychoice",
        "cover": "20230625_100628_b428702e68260be18db5143c31d27637.jpg"
    },
    {
        "podcast_id": 213253,
        "title": "Resonancia Global",
        "description": "<p>El Grupo Global es una comunidad vibrante y diversa de individuos apasionados por el intercambio de ideas, la colaboración y el enriquecimiento mutuo. Conectados a través del podcast \"Resonancia Global\", compartimos un objetivo común: explorar temas de manera integral y global, fomentando la comprensión y el diálogo entre culturas, disciplinas y perspectivas. Nuestro podcast abarca una amplia gama de temas relevantes y actuales, con un enfoque multidisciplinario. Desde la cultura general hasta la política, el arte, las entrevistas y las noticias, cada episodio ofrece una experiencia enriquecedora y perspicaz. Nuestros invitados son expertos reconocidos en sus respectivos campos, quienes aportan sus conocimientos y perspectivas únicas a las discusiones.</p>",
        "language": "es-mx",
        "author_name": "Grupo Global",
        "slug": "resonanciaglobal",
        "cover": "20230628_060626_6cbb5d565f3113e37d0542c669389d89.jpg"
    },
    {
        "podcast_id": 216187,
        "title": "MAIS PUTAIN ! ",
        "description": "<p>Bienvenue sur <strong>Mais Putain</strong>, un podcast dans lequel deux personnes mal équipées s'enregistrent sur des sujets qui les énervent !</p><p>Mais Putain, c'est votre guide pour découvrir des vérités sur des sujets qui vous agacent et nous aider à résister à l'influence des théories du complot ou encore aux faits recyclés et détournés par des mouvements pas très très gentils.</p><p>Rejoignez-nous dans ce voyage pour découvrir des histoires inédites, démêler la désinformation et nous doter des outils nécessaires pour lutter contre les récits qui sèment la discorde aux repas de famille ! </p><p>Ensemble, nous nous armerons de connaissances, nous chercherons la vérité et nous nous opposerons aux forces qui cherchent à nous diviser, grâce au pouvoir de l'amitié !</p>",
        "language": "fr",
        "author_name": "Mais Putain",
        "slug": "maisputain",
        "cover": "20230628_050624_421f544134140e5e63bbe2273f7c50f0.jpg"
    },
    {
        "podcast_id": 216888,
        "title": "Humanity Matters Most",
        "description": "<p>Tune in for conversations with powerful minds from the University of Houston College of Liberal Arts and Social Sciences. In each episode, you will hear fascinating stories showcasing research projects that are preserving and empowering humanity.</p><p>Whether you're a scholar or just curious about how we study the human experience, this podcast will give you an inside look on projects impacting various aspects of society -- from health and education to policy and business.</p>",
        "language": "en",
        "author_name": "University of Houston | College of Liberal Arts and Social Sciences",
        "slug": "humanity-matters-most",
        "cover": "20230630_080635_0c1d3608572d6ce5d70f9047d98b2dc9.jpg"
    },
    {
        "podcast_id": 217011,
        "title": "فكرولوجيا | Fikrology",
        "description": "<p>سلسلة مميزة تشرح كيفية تأثير السايكولوجيا في حياتنا اليومية من خلال التأثيرات والانحيازات النفسية، مصحوبة مع الأمثلة الطريفة والدراسات العلمية.</p>",
        "language": "ar",
        "author_name": "Obstan | أوبستان",
        "slug": "fikrology",
        "cover": "20230627_100645_60a8eacdcfbc03b0e2c782aa9eae55b3.jpg"
    },
    {
        "podcast_id": 217576,
        "title": " Raznitsa Kantent",
        "description": "<p>є різниця</p>",
        "language": "uk",
        "author_name": "їми",
        "slug": "kantent",
        "cover": "20230701_090711_4aef3769bd0aefcf00928ed263805148.jpg"
    },
    {
        "podcast_id": 217624,
        "title": "BGB AT ",
        "description": "<p>Diese Reihe behandelt das für das Staatsexamen relevante Wissen zum BGB AT.</p>",
        "language": "de",
        "author_name": "Der Jurastudent",
        "slug": "derjurastudent-bgbat",
        "cover": "20230701_070759_c5d01883cb54744975bddfae4ee309a0.jpg"
    },
    {
        "podcast_id": 217731,
        "title": "Love that for you!",
        "description": "<p>Hi!</p><p>Formerly the What in the actual FUCK?! podcast</p>",
        "language": "en",
        "author_name": "Candy Vee",
        "slug": "lovethatforyoupodcast",
        "cover": "20230704_040741_5c9feea8fb2128fa38842415c0886ac1.jpg"
    },
    {
        "podcast_id": 217735,
        "title": "Популяри",
        "description": "<p>Популяри — це проєкт українських лівих вільнодумців. Ведуть подкаст профспілковий організатор Пролетарський Фантомас і Єгор Заміський — викладач і професійний агітатор.</p>",
        "language": "uk",
        "author_name": "Популяри",
        "slug": "populares-ukraine",
        "cover": "20230702_080722_7549a0460bb4f58b8cbcdb4249b528e3.jpg"
    },
    {
        "podcast_id": 217754,
        "title": "Swipe Insight",
        "description": "<p>Welcome to Swipe Insight, the raw and unfiltered realm of modern dating. Join me, a single 20-something year old guy as we dive headfirst into the rabbit hole that is modern era love. Here we have authentic conversations that cut through the noise and explore what it truly means to be single and ready to mingle in todays society.</p>",
        "language": "en",
        "author_name": "Swipe Insight",
        "slug": "swipeinsight",
        "cover": "20230702_100722_2f1a853f69e2181272443fba7d1b152b.jpg"
    },
    {
        "podcast_id": 218357,
        "title": "Penguin Pebbling Podcast",
        "description": "<p>Two AuADHD adult students discuss neuroscience, Tibetan Buddhism, the Racist history of New Age Spirituality, Neuroscience's intersection w/ Neurodivergence, Anti-Fascism, as well as Tiktok Shit-posting and other Elder Punk/Goth Nonsense. Kelly is a Graphic design artist and student of Neuroscience, Meryle is a Voice actor/Singer and student of Vajrayana Buddhism and Tibetan Language. Join them as they share ideas and info-dumping the same way that Penguins share pretty, shiny stones w/ their favourite Penguin friends.</p>",
        "language": "en",
        "author_name": "Penguin Pebbling Podcast",
        "slug": "penguin-pebbling-podcast",
        "cover": "20230707_030713_47ca81d44d3f1423aa5ee41bd62095e2.jpg"
    },
    {
        "podcast_id": 219002,
        "title": "آشنایی با اعلامیه جهانی حقوق بشر",
        "description": "<p>در این پادکست به توضیح و بررسی اعلامیه جهانی حقوق بشر می‌پردازیم. فهم اعلامیه حقوق بشر به ما کمک می‌کند تا ابتدا، با حقوق انسانی خود آشنا شده و مطالبه گر این حقوق ابتدایی انسانی خود بشویم و سپس بتوانیم کیفیت سیاست و فرهنگ جامعه را با این مطالبات ارتقا ببخشیم.</p><p>بیاییم تغییر را از خودمان شروع کنیم</p><p><a href=\"https://linktr.ee/hirbod\">دسترسی به وبسایت</a></p>",
        "language": "fa",
        "author_name": "Hirbod Human",
        "slug": "human-rights-farsi",
        "cover": "20230711_070716_45354469a2f458f8e61464b6e9490fe5.jpg"
    },
    {
        "podcast_id": 219472,
        "title": "Badly Governed",
        "description": "<p>Welcome to season one of Badly Governed, a podcast focused on community discussions. Our goal is to facilitate discussions about important social issues that affect our daily lives by interviewing community leaders and professionals in various fields such as science, policy, healthcare, and more. To share your ideas or questions, email us at <a href=\"mailto:info.bg@lahens.net\">info.bg@lahens.net</a>.</p>",
        "language": "en",
        "author_name": "Lydje Lahens ",
        "slug": "badlygoverned",
        "cover": "20230714_040722_b247e7ee706594a997bd14eab7141791.jpg"
    },
    {
        "podcast_id": 219510,
        "title": "R-Academy",
        "description": "<p>The R-Academy podcast provides a platform for the democratization of information about highly localized and niche topics. Its host, Robert Contofalsky, firmly believes in the importance of “Open-Access” like platforms where conversations about psychology, history, and science do not have barriers or paywalls behind them. The future of our society depends on the information that we are given at the time, and he believes that this podcast would be a contribution to this overall goal.</p><p>The topics discussed on this podcast will start where Robert has the most outreach: academia. He has maintained good relations with many professors and, thus, will begin by conversing with professors in Psychology and history, eventually expanding outwards. However, the “limited” faculty list is not a defect of the podcast, these are world-class scholars that he will be talking to, and the conversations will be nothing short of engaging and insightful. Here is a list of topics that will be covered:</p><ul><li>The nature of consciousness, language, and communication</li><li>The Psychology of personality, pain, neuroscience, and Culture</li><li>The heritability of behaviour and intelligence, and its societal implications</li><li>Medieval history, translational history; the nature of writing</li><li>The Cold War and American history</li></ul><p>This podcast will concentrate on academic affairs for the time being, with the hope of expanding outwards into more niche domains of scholarly topics. The potential for topics on this podcast will be infinite as professors are never done talking about their work, and that is the beauty of this podcast, is that it will allow the listeners to understand the work of top-shelf experts in a digestible format, and give them the opportunity to continue their curiosities in the topics that are discussed on this podcast.</p><p>In sum, the purpose of this podcast is for the host to act like a tourist in the minds and workspace of his guests; it is a zone that is free of judgment, and its primary focus is inquiry.</p>",
        "language": "en",
        "author_name": "Robert Contofalsky",
        "slug": "r-academy",
        "cover": "20230714_100727_76322e8674fd84f55a2a29f9c05b26ba.jpg"
    },
    {
        "podcast_id": 219810,
        "title": "EIA test podcast",
        "description": "<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Etiam in elit rutrum, placerat nibh quis, tristique turpis. Donec maximus tincidunt nunc quis cursus. Curabitur nec ultricies enim. Proin eget neque nisl. Maecenas vel placerat sapien. Sed semper, orci ut rhoncus pellentesque, leo leo vulputate ipsum, vel porta nisi quam sed nibh. Nullam eu nisi sit amet magna elementum sodales. Etiam eu metus at turpis imperdiet auctor. Suspendisse porta fringilla felis quis aliquet. Sed eu sapien at massa condimentum ullamcorper. Fusce in ante sit amet diam tempus pharetra id sit amet felis. Sed sodales ipsum sed eros bibendum, at scelerisque arcu.</p>",
        "language": "es-mx",
        "author_name": "Embodied Inequalities of the Anthropocene",
        "slug": "eia-test",
        "cover": "20230717_100746_251c3df5aac71897e2d03493bbf52220.jpg"
    },
    {
        "podcast_id": 220373,
        "title": "How people live in Europe",
        "description": "<p>In this podcast discusses life in each european country from the native perspective.</p>",
        "language": "en",
        "author_name": "Eurotrash",
        "slug": "eurotrashing",
        "cover": "20230720_090738_2e91de71c2284814455c96c204596800.jpg"
    },
    {
        "podcast_id": 220555,
        "title": "Wopiti Wopiti",
        "description": "<p>Este podcast fue realizado por el grupo 8º3 del liceo nº8 de Montevideo en el año 2023...</p>",
        "language": "es",
        "author_name": "Alejandro Villa",
        "slug": "wopitiwopiti",
        "cover": "20230721_010736_5a11249fe6904d82dd1987622667cc6d.jpg"
    },
    {
        "podcast_id": 220682,
        "title": "Mobility Hustle ",
        "description": "<p>دا بودكاست بيتكلم عن النقل والمواصلات بالعربي </p><p>هنستضيف خبراء مختلفين في مجال النقل ونتكلم معاهم عن تجاربهم وخبراتهم وهنتكلم عن كل المشاريع الجديدة والتقنيات الحديثة في مجال النقل</p>",
        "language": "ar",
        "author_name": "Ahmed Elkhsosy",
        "slug": "mobility-hustle-podcast",
        "cover": "20230722_030741_50fee9002b92a5189efab2f1266f449c.jpg"
    },
    {
        "podcast_id": 221364,
        "title": "بودكاست مركز دراسات النزاع والعمل الإنساني ",
        "description": "<p>يقوم مركز دراسات النزاع والعمل الإنساني باستضافة باحثين وأكاديميين وناشطين في مجال حل النزاع والعمل الإنساني، وذلك لمناقشة وطرح أهم المواضيع والقضايا الإنسانية بالعالم العربي وغيره.</p>",
        "language": "ar",
        "author_name": "Center for Conflict and Humanitarian Studies ",
        "slug": "chsdoha",
        "cover": "20230727_080740_7691de7ab7531304affa9c8a13be870e.jpg"
    },
    {
        "podcast_id": 221670,
        "title": "Haklı Mıyım?",
        "description": "<p>Ayşenur Demirtaş Gül ve Merve Askar günlük hayatın içinden ama bir o kadar da hukuki konularda merak edilenleri sizler için Avukat Canset Yıldız'a soruyor.</p><p>Bu podcast serisinde aktarılan bilgiler genel bilgilendirme amaçlı olup kayıt tarihinde geçerli mevzuata göre hazırlanmıştır. Özel hukuki uyuşmazlıkları çözmeyi yahut danışmanlık vermeyi hedeflemez.</p>",
        "language": "tr",
        "author_name": "Ayşenur Demirtaş Gül",
        "slug": "haklimiyimpodcast",
        "cover": "20230729_110716_cbd99d33b8ebd9fa4e85555e65af882f.jpg"
    },
    {
        "podcast_id": 222530,
        "title": "Ed Talk",
        "description": "<p>Teacher educators have conversations about education in the 21 Century.</p>",
        "language": "en",
        "author_name": "Kirsteen Donaghy",
        "slug": "edtalk-21century",
        "cover": "20230804_050819_36ba4f833ca8c71dbc3b529e7c0a0684.jpg"
    },
    {
        "podcast_id": 222782,
        "title": "lullabyes",
        "description": "<p>i write songs about silly people that disappoint me sometimes!</p>",
        "language": "en",
        "author_name": "Jem!m☆",
        "slug": "jemimslullabyes",
        "cover": "20230807_020806_285f3d24b5340dedcdb999a30620ca76.jpg"
    },
    {
        "podcast_id": 223164,
        "title": "Latent Politics",
        "description": "<p>每兩週一次，加入迪哥、路克與馬修的圓桌，一起討論圍繞我們的政治學與政治！</p>",
        "language": "zh",
        "author_name": "迪雅🈹️林",
        "slug": "latent-politics",
        "cover": "20230808_070846_9a84d4c752b637ca9bd17af114627c8a.jpg"
    },
    {
        "podcast_id": 223867,
        "title": "Sikhism vs science with good intentions ",
        "description": "<p>This podcast related to the debate on science topics with vaild points of sikhism. so many common questions on now days scenario were answered by Dharam singh ji nihang.</p>",
        "language": "pa",
        "author_name": "Kp singh",
        "slug": "sikhism-viewp",
        "cover": "20230813_040801_a080714d3c2849cb1ae396fba894995e.jpg"
    },
    {
        "podcast_id": 224165,
        "title": "Just Space ",
        "description": "<p>Just Space seeks to identify and amplify the collective voices, experiences, knowledge to co-produce spaces that physically embody just and inclusive values. It is where we show up for sensemaking! We facilitate and engage in dialogue to make collective meanings, and translate our shared knowledge into potential strategies where communities, traditionally underrepresented, are central active stakeholders in the (co)production of the build environment and the management of natural resources. We’re thrilled to embark on this journey with you.</p><p>Just Space Co-Hosts: Eka Permansari, Amal Barre, and Dian Nostikasari. Learn more about us at justspacecollective.com.</p>",
        "language": "en",
        "author_name": "Just Space Collective",
        "slug": "justspacepodcast",
        "cover": "20230815_120809_ef28974d5948c52cb3d4f74cd32d83b0.jpg"
    },
    {
        "podcast_id": 224430,
        "title": "Les Indomptables",
        "description": "<p>Découvrez notre podcast captivant et engagé qui explore les méandres des sujets sociaux à travers une lentille féministe intersectionnelle. Rejoignez-nous pour des conversations stimulantes, des analyses approfondies et des récits inspirants, alors que nous examinons les enjeux qui touchent notre société sous des angles variés. Notre objectif est de divertir tout en éduquant, en mettant en lumière les voix marginalisées, en remettant en question les normes établies et en favorisant la réflexion critique. Rejoignez-nous pour une immersion enrichissante dans les questions sociales d'aujourd'hui, avec une touche de légèreté et de bonne humeur.</p>",
        "language": "fr",
        "author_name": "Marie-Christine et Amély",
        "slug": "lesindomptables",
        "cover": "20230816_110811_93b561bc0ae985b3942a68aea074820b.jpg"
    },
    {
        "podcast_id": 224493,
        "title": "НЕ ТО СЛОВО",
        "description": "<p>Авторский подкаст о стиле жизни и своем месте в этом мире. Выпускается на Woxe Radio <a href=\"https://vk.com/woxeradio\">https://vk.com/woxeradio</a>, <a href=\"https://woxeradio.com/\">https://woxeradio.com/</a></p>",
        "language": "ru",
        "author_name": "Robert Viseman ",
        "slug": "woxeradio",
        "cover": "20230817_080840_5637159c33728365d6d989510462162c.jpg"
    },
    {
        "podcast_id": 225044,
        "title": "\"Small Talk - nói điều đơn giản\"",
        "description": "<p>Hi, chao xìn các bạn thính giả đã đến với \"Small Talk - nói điều đơn giản\"</p><p>Hãy lựa cho mình một góc thật yên thật bình để lắng nghe những điều đơn giản mà chúng tớ chia sẽ nhé!!</p>",
        "language": "vi",
        "author_name": "Nguyễn Hoàng Phi Long",
        "slug": "smalltalknoidieudongian",
        "cover": "20230821_050807_16e75696f33eb7286e7ec083317329b4.jpg"
    },
    {
        "podcast_id": 226084,
        "title": "Good Humans United",
        "description": "<p>Grant and Justin, VP &amp; President of the newly formed Durant, Iowa Food Pantry, talk about trying to do some good in their communities and whatever other shenanigans are on their silly little minds.</p>",
        "language": "en",
        "author_name": "Grant Heuer",
        "slug": "goodhumansunited",
        "cover": "20230827_070833_11da95966338fb21eaf72c4f4dd5cd4f.jpg"
    },
    {
        "podcast_id": 226423,
        "title": "Spectrum of Science",
        "description": "<p>Engage with leading academic minds in \"Spectrum of Science,\" a podcast that delves into the transformative arenas of science and education. Discover the personal journeys of trailblazing scholars, explore bold critiques of current educational paradigms, and grapple with the fundamental questions shaping our world. Designed for aspiring academics, educators, policy-makers, and intellectually curious listeners, this podcast aims to spark innovation and inspire the next generation of thinkers. Currently hosted by T. Gökalp Elaçmaz, new episodes released regularly. The podcast belongs to the student club called Scientific Communication Society. For your questions, please reach, bilkentbit@gmail.com</p>",
        "language": "en",
        "author_name": "T. Gökalp Elaçmaz",
        "slug": "spectrum-of-science",
        "cover": "20230829_060825_3eb6bff10c02f1bc02b9f7cc92318ffc.jpg"
    },
    {
        "podcast_id": 227133,
        "title": "VÍNCULO QUE EXISTE ENTRE LOS DERECHOS HUMANOS Y LA DEMOCRACIA",
        "description": "<ol><li><p>Análisis sobre la relación que existe entre la democracia y los derechos humanos</p></li></ol>",
        "language": "es",
        "author_name": "EVER ADAN CENTENO",
        "slug": "democracia",
        "cover": "20230904_040934_883dfa7fee3c0b1627e3019e1bd2e9bc.jpg"
    },
    {
        "podcast_id": 227321,
        "title": "Tavernier talks. ",
        "description": "<p>Explore the landscape of Formal Knowledge with a blend of Thoughtful Discourse, In-depth Conversations, Analytical Insights, and Expert Commentary. Our journey traverses the realms of Philosophy, Literature, and Science, all geared toward elevating your cognitive skills and, consequently, your actions. Our ultimate goal is to offer you actionable tools for a richer life and a better world.</p>",
        "language": "en",
        "author_name": "Carlos M. Suarez Tavernier",
        "slug": "taverniertalks",
        "cover": "20230905_030916_bf77b0560d5e323e8c771ab4209d1648.jpg"
    },
    {
        "podcast_id": 227568,
        "title": "360®",
        "description": "<p><a href=\"https://the360mag.com/360-2\">360®</a> is a one-on-one introspective meeting of the minds.</p>",
        "language": "en",
        "author_name": "Vaughn Lowery",
        "slug": "360",
        "cover": "20230907_030948_723f96c1a26d6c65bfb22c5d8649f7b0.jpg"
    },
    {
        "podcast_id": 227794,
        "title": "Espero Psikoloji Podcast Serisi",
        "description": "<p>Espero Psikoloji Podcast Serisi'nde farklı alanlarda uzman konuklarla psikolojiye dair konuları günlük yaşamla birleştirerek keyifli ve bilgilendirici bir sohbet sunmayı hedefliyoruz.</p>",
        "language": "tr",
        "author_name": "Espero Psikoloji",
        "slug": "esperopsikoloji",
        "cover": "20230908_020919_f1ff59542538b265605151c09b965af8.jpg"
    },
    {
        "podcast_id": 227874,
        "title": "Affihub/Experimentos Sociales",
        "description": "<p><em>Bienvenidos a 'Experimentos Sociales,' un programa que incita a la reflexión y profundiza en las complejidades del comportamiento humano, la cultura y la ética. Cada episodio te introduce a experimentos del mundo real, marcos teóricos y dilemas éticos que sirven como un laberinto para tu mente. Conducido por Rashid Azarang, exploramos las construcciones sociales que guían, y a veces desvían, la acción humana. Acompáñanos en este viaje por las cámaras laberínticas de las complejidades sociales. Gira cada esquina con virtudes como la prudencia y la justicia, guiados por la luz del cuestionamiento socrático y la sutileza ética.</em></p>",
        "language": "es-mx",
        "author_name": "Rashid Azarang",
        "slug": "experimentos-sociales",
        "cover": "20230909_030900_995831fae2e95287ee160a0110d2e06d.jpg"
    },
    {
        "podcast_id": 228213,
        "title": "Songthing To Talk About",
        "description": "<p>Tom and Ted are here to talk about music, and you're here to listen to us talk about music. One album per episode, rated on a scale of 1 to 10 or your money back!</p>",
        "language": "en",
        "author_name": "Ted Schwaba",
        "slug": "songthing",
        "cover": "20230911_050936_415a88d2a92bbacb845e5c4bba3c8380.jpg"
    },
    {
        "podcast_id": 228299,
        "title": "Enchanted Studios",
        "description": "<p>Hello listeners, we welcome you to our very first Podcast episode where we talk about a lot of topics such as the history of the Assamese people and and Ahom rulers, low key racisms which star in our very homes and musch more. Do join us</p>",
        "language": "as",
        "author_name": "Adeed Rahman",
        "slug": "enchantedstudios",
        "cover": "20230912_060939_d057b63707f31f0adf054982fcda9d0e.jpg"
    },
    {
        "podcast_id": 229156,
        "title": "Memingless",
        "description": "<p>We review memes from across the interwebs and explain everything that's wrong with them!</p>",
        "language": "en",
        "author_name": "Ermahnerd and Bobbie",
        "slug": "memingless",
        "cover": "20230918_120916_bf3f6d6c22ff063225cf331b28141c15.jpg"
    },
    {
        "podcast_id": 229266,
        "title": "Voces desde las intersecciones",
        "description": "<p>La investigadora y académica de la Ibero, Michelle Gama conversa junto a Alejandro Anaya, Vicerrector de esta institución educativa sobre temas vinculados a los asuntos de género.</p>",
        "language": "es",
        "author_name": "Michelle Gama y Alejandro Anaya",
        "slug": "voces-desde-las-intersecciones",
        "cover": "20230918_110956_2204370eca353d8e7a7e218195c8b3bc.jpg"
    }
]