[
    {
        "podcast_id": 9326,
        "title": "MOON-FM",
        "description": "Rock out to the #1 radio station in all Shushybye...MOON-FM!",
        "language": "en",
        "author_name": "Steve Syatt",
        "slug": "moonfm",
        "cover": "20200603_011133_7bb6023826f78c42acd1f04b5dc5ff9f.jpeg"
    },
    {
        "podcast_id": 10265,
        "title": "Contes et légendes du Camp musical",
        "description": "Un balado d'histoires racontant la mythologie du Camp musical Père Lindsay. ",
        "language": "fr",
        "author_name": "Hubert Tanguay Labrosse",
        "slug": "contesetlegendescmpl",
        "cover": "20220825_020851_5c300a4631d8ad033e79f0b5a7d6cf40.jpg"
    },
    {
        "podcast_id": 12514,
        "title": "Bi Masal Daha - Çocuklara Yıldızlı Öyküler",
        "description": "Çocuklar için pozitif öykü ve masallar. Funky Kids çocuk şarkılarımızı Spotify hesabımızından dinleyebilir, YouTube kanalımızda videolarımızı izleyebilirsiniz. funkykids.music Instagram hesabımızı takip etmeyi unutmayın!",
        "language": "tr",
        "author_name": "Müge Halac - Funky Kids",
        "slug": "cocukoykuleri",
        "cover": "20210501_105125_724ef7817d8354c625bd05c6a6a98311.jpg"
    },
    {
        "podcast_id": 12746,
        "title": "Terrier Talk",
        "description": "Redlands High School ASB Podcast.  ",
        "language": "en",
        "author_name": "Redlands High School ASB",
        "slug": "redlandshighschool",
        "cover": "20200927_234638_1b4ba293eda5592aad3aebd355ea1d48.jpg"
    },
    {
        "podcast_id": 18733,
        "title": "Mi Lengua Madre",
        "description": "Cuando nos convertimos en madres y padres no podemos más que reinventarnos. Acompáñanos en este proceso de reinvención como cuidadores de la infancia, como ciudadanos del mundo y como hispanohablantes en el extranjero. \n\nLa segunda temporada ha comenzado con episodios cada 2 semanas. Click en \"follow\" para que nunca se pierdan un episodio. \n\nEn este canal también encontrarán los episodios del Club Infantil Pirinolas ¡un podcast para niñ@s!\n\nVisítanos en milenguamadre.com",
        "language": "es",
        "author_name": "Stephanie Maritza Villegas Senneseth",
        "slug": "milenguamadre",
        "cover": "20210812_102359_4c3fc17c064d1b68f90de5f4e63987b9.jpg"
    },
    {
        "podcast_id": 21551,
        "title": "Is This Really For Kids?",
        "description": "Is This Really For Kids is where I review children’s media and decide is it REALLY for kids? This podcast is designed to be a deep dive critical film analysis on children's media as well as entertaining every time. I designed this podcast for fans of the shows, new parents who are raising their children with intention, people who are so busy they can't keep up with watching everything but want to be able to talk about it, and for the people in my life to have a place to talk about our favorite films. What makes me qualified to talk about this? Well for starters, I grew up as a traumatized kid, so I know what not to do as a parent. Also since I was healing from my neglectful childhood, I learned a lot about trauma and life along the way. I am also a SAG-AFTRA actress with her own production company living in Los Angeles so I know what makes a good film and what it takes to make it.  You might have also noticed that unlike other podcasts, my episode art changes. I have a lot of pictures from my creative work, so I make the episode art an actual art piece inspired by the film. Pretty cool, huh? I hope you enjoy listening and you can reach me at any of the links below in the episodes. Thanks for listening!",
        "language": "en",
        "author_name": "Thea Touchton",
        "slug": "mouthy",
        "cover": "20220227_070203_fe4eff30ae24ccbef6ae4f3e1b4040e4.jpg"
    },
    {
        "podcast_id": 30500,
        "title": "HogsRead",
        "description": "Join myself and our talented readers as we transport you into the fantastical wizarding world of Harry Potter!\n\nJoin us on Facebook at HogsRead. Share your experience with the beloved series. Share your Patronus! Share your House! Love and respect!\n\nOh, and I know how some of y'all feel about J.K. Rowling, so I'll say this; #TransRightsMatter\n\nIf you would like to support the Family With Benefits Team, you can become a Patron on Patreon at www.patreon.com/familywithbenefits",
        "language": "en",
        "author_name": "With Benefits LLC",
        "slug": "welcometohogsread",
        "cover": "20210525_161948_b51817331a4f25e67e944e4d86780b3d.jpg"
    },
    {
        "podcast_id": 30846,
        "title": "Bracken Radio",
        "description": "A Dragon Masters podcast for kids made by kids.",
        "language": "en",
        "author_name": "Wiley",
        "slug": "brackenradio",
        "cover": "20210207_191242_e9104e88e38cf3d79ae681d01f7c6aec.jpg"
    },
    {
        "podcast_id": 60067,
        "title": "FAIRY FRIDAY",
        "description": "Bạn có còn nhớ kỉ niệm thời thơ ấu gọi 1080 nghe các cô tổng đài kể truyện cổ tích cho nghe? Có một cái gì đó rất thú vị, rất khác khi nghe những câu chuyện từ một ai đó khác với giọng thân thuộc của Bà hay Mẹ thủ thỉ hằng đêm... \n\nFairy Friday góp nhặt những câu chuyện cổ tích từ khắp nơi trên thế giới. Có những truyện nội dung rất quen, nhưng tới từ một đất nước hoàn toàn khiến bạn bất ngờ. Có những truyện bạn chưa nghe bao giờ, và rất nên nghe.\n\nMong rằng Fairy Friday có thể mang tới cho bạn những phút giây nhẹ nhàng, thư giãn. Một nút follow và share của bạn sẽ là động lực rất lớn cho Fairy Friday!",
        "language": "en",
        "author_name": "Nguyen Hong Anh",
        "slug": "fairyfriday",
        "cover": "20210531_033016_bea9c0c7b7d9eb361e6aad90b184b78b.jpg"
    },
    {
        "podcast_id": 60957,
        "title": "Dadtime Stories",
        "description": "Almost every night, I tell my daughter Mira a story (or 2 or 3 and sometimes more, depends on who wins the negotiations 😅) Events are inspired by shared experiences, adventures, and/or things we've learned in our day time. This channel documents some of these stories. They're mainly for my daughter when she grows up, but they are also here for you and your kids, siblings, nieces and nephews. Let me know your thoughts and your kids' reactions. Also share your adventures that may inspire my next story.\nتقريباً كل ليلة، بخبّر بنتي ميرا قصة (أو اثنين أو تلاتة وأوقات أكتر 😅 حسب مين بيربح بالمفاوضات) أحداث القصص مستوحاة من تجارب مشتركة، مغامرات أو اشيا تعلّمناها بالنهار. هالقناة هي لتوثيق بعض هالقصص. والغاية الأساسية حفظهم لحتى يبقوا لميرا بس تكبر. ولكن هالقصص كمان هيي إلكن ولاولادكم أو اخواتكم أو أي حدا من أقاربكم. فاسمعوهم وخبروني رأيكم وردة فعل أطفالكم. كمان شاركوني مغامراتكم بركي بستوحي منها لشي قصة جديدة",
        "language": "ar",
        "author_name": "Alaa Kabalan",
        "slug": "dadtimestories",
        "cover": "20210604_095303_5721ccd32ad850b5e9a5fadebe01e75d.jpg"
    },
    {
        "podcast_id": 68214,
        "title": "Gandalf Gray",
        "description": "Letture Fantasy",
        "language": "it",
        "author_name": "Gandalf Gray",
        "slug": "magicopopolo",
        "cover": "20210714_213846_69f36c11287b087976c6d925c69b49f8.jpg"
    },
    {
        "podcast_id": 69330,
        "title": "SUSHRUTI-The Auditory Versions of Creations by Manoj Das",
        "description": "The Auditory Versions of Creations by Manoj Das",
        "language": "en",
        "author_name": "World of Manoj Das",
        "slug": "worldofmanojdas",
        "cover": "20210725_151208_5f4ec685abea2899a050711249602ee4.jpg"
    },
    {
        "podcast_id": 77532,
        "title": "Marcin i Bieszczadzka Burza",
        "description": "Marcin i Bieszczadzka Burza, to opowieść o chłopcu, który próbuje pomóc swojej mamie i wpada po uszy w świat tajemniczych stworów, które nie zawsze są przyjaźnie nastawione. Na szczęście w kłopotach pomoże mu nowa przyjaciółka, Poziomka oraz jej pies Czajnik",
        "language": "pl",
        "author_name": "Jagoda Żurawska",
        "slug": "marcinibieszczadzkaburza",
        "cover": "20210905_181037_2afb7bd2378075e77217f0be05776b3f.jpg"
    },
    {
        "podcast_id": 78689,
        "title": "BrokenCrow Theatre for Children",
        "description": "Brand new quality Audio Dramas made by BrokenCrow. Created in Ireland for children all over the world.",
        "language": "en",
        "author_name": "Deirdre Dwyer",
        "slug": "brokencrowtheatreforchildren",
        "cover": "20210911_192614_a56384f8159b19e99e026b13e11bec88.jpg"
    },
    {
        "podcast_id": 89308,
        "title": "In libreria con Null",
        "description": "Direttamente da In libreria con Null i podcast di Null sui libri per bambini e ragazzi,.",
        "language": "it",
        "author_name": "Giorgia Soresina",
        "slug": "inlibreriaconnull",
        "cover": "20211107_141630_135b679d396bde349e9f36374a4a3cfa.jpg"
    },
    {
        "podcast_id": 90981,
        "title": "Cuentos Musicales ",
        "description": "Cuentos musicales para todas las edades con ese toque de surrealismo mágico que da sentido al sin sentido.",
        "language": "es",
        "author_name": "The Belén Chou",
        "slug": "huevitohuevon",
        "cover": "20211203_081212_041ca0bdcaf2f49561f9f9abe1ed963e.jpg"
    },
    {
        "podcast_id": 98090,
        "title": "AveryWorld Stories",
        "description": "This is the world where heroes live, mad scientists create, and the stakes are at their highest. Check back for exciting stories that dare you to dream, fill you with the sense of adventure, and allow your imagination to run wild. ",
        "language": "en",
        "author_name": "Avery Goodwin",
        "slug": "averysfilmreview",
        "cover": "20220521_040519_cc5fb2d9c6eca3d5a9a83164aeaa4820.jpg"
    },
    {
        "podcast_id": 101178,
        "title": "POPE READ วันละบทก็คล่องได้",
        "description": "น้องภพ เพิ่งจะอายุครบ 7 ปี  และมีความตั้งใจที่อยากอ่านหนังสือเก่งๆ\n\nป๊ากับมี๊จึงได้สร้างพอตแคสต์นี้ให้ภพได้สนุกกับการอ่านและได้บันทึกคลิปเสียงตัวเองไว้เป็นความทรงจำวัยเด็ก\n\nคุณพ่อ คุณแม่ ขอขอบพระคุณผู้เขียนทุกๆท่าน สำหรับหนังสือดีๆ ทุกเล่ม ขอบคุณสำนักพิมพ์ ขอบคุณทุกแหล่งที่มาของเนื้อหาและภาพประกอบ ที่ใช้ประกอบการทำพอตแคสต์นี้ให้กับน้องภพ\n\n#Poperead\n#วันละบทก็คล่องได้",
        "language": "th",
        "author_name": "Popepawit Tangtaveesub",
        "slug": "poperead",
        "cover": "20220126_050123_7855ca4c2963528d08d7bb60d12622bb.jpg"
    },
    {
        "podcast_id": 105342,
        "title": "The Daddy and Kidz Podcast!",
        "description": "This is our weekly podcast. Just a daddy and his 3 kids under 10 talking about our day.",
        "language": "en",
        "author_name": "Matthew",
        "slug": "daddyandkidz",
        "cover": "20220201_030229_a11c33fb2244963304035262590b5624.jpg"
    },
    {
        "podcast_id": 113743,
        "title": "Kids Fairy Tales",
        "description": "<p>This Podcast is full of fairy tales for kids.</p><p>\"ILoveRSS\"</p>",
        "language": "en",
        "author_name": "GALERON BOOKS",
        "slug": "kidsfairytales",
        "cover": "20220308_030359_128fa595f7d4884febe1ea9c17484c32.jpg"
    },
    {
        "podcast_id": 115614,
        "title": "The Congressional Award Podcast: Elevating DC Youth",
        "description": "<p>The Congressional Award Podcast was launched in partnership with The Congressional Award Foundation (CAF) and The DC Office Of Cable Television, Film, Music, and Entertainment (OCTFME) and aims to give listeners direct access to members of CAF's Board of Directors, staff, alumni, and CEO network who serve as speakers in this special series. These programs are intended to help guide students through the opportunities The podcast provides information on how to explore the program's pathways to successfully obtain various career goals. This podcast is produced by OCTFME and airs Saturday mornings at 11:30 AM on DC Radio 96.3HD4, DCRADIO.GOV, on the DC Radio app for iPhone and Android, Tunein.com and Alexa. The podcasts will also be available on-demand at DC Café Radio on SoundCloud and all major on-demand platforms.</p>",
        "language": "en",
        "author_name": "Café Radio Podcast",
        "slug": "cafe-radio",
        "cover": "20220316_040347_146e062cf6b2d47d8f8f5369a2b26b9e.jpg"
    },
    {
        "podcast_id": 119671,
        "title": "Radio Olive Kids - It's for you..",
        "description": "First time in Doha exclusive channels for Kids to bring out the creativity in them - started by Olive Suno Radio Network.",
        "language": "en",
        "author_name": "Radio Majlis",
        "slug": "olivekids",
        "cover": "20220403_010410_5258eb09a3240ab3d56bf921ee376e81.jpg"
    },
    {
        "podcast_id": 121594,
        "title": "Karınca Bacak ile Dev Yaprak",
        "description": "Sürdürülebilir kalkınma amaçları çerçevesinde TÜBİSAD, TEGV ve TURKCELL İşbirliğinde hazırlanan \"Karınca Bacak ve Dev Yaprak\" kitabı ile \"Döngüsel Elektronikler\" konusunda farkındalık oluşturulması amaçlanmaktadır. \n\"Karınca Bacak'ın yaratttığı \"Eğitime Dönüştür Okulu\" artık ülkenin pek çok yerinde kendisi gibi çocukların eğitimi için kendisi gibi yaşayacaktı. Bu hayatının en güzel günüydü...\"\n\nYazar             : Sebahat Söylemez\nResimleyen   : Gökçe Güvenç\nSelendiren   : Melis Sezen\n\nSürdürülebilir Kalkınma Amaçları Döngüsel Elektronikler Danışmanlar:\n\nTÜBİSAD\nMeltem Bağdatlı\nN. Selen Tanner\nİ. Haluk Onay\nBengisu Evrensel\n\nTEGV\nDevrim Uygan\nPınar Palamutlu\nElif Mert\n\n",
        "language": "tr",
        "author_name": "TÜBİSAD",
        "slug": "karincabacakiledevyaprak",
        "cover": "20220901_120917_ea1d8369a9926d75d19128844800dcd8.jpg"
    },
    {
        "podcast_id": 123294,
        "title": "Tilda and Quatsch Monster",
        "description": "<p><strong>Now available in German AND English! </strong>TILDA AND QUATSCH MONSTER is a children’s fantasy novel for the ears, about a bored kid and the weird magical monster she meets outside her family’s new apartment. The shapeshifting creature has the power to turn Tilda‘s imagination into reality, transforming everyday challenges into wild adventures.</p><p>WRITTEN by Matt Wilson GERMAN TRANSLATION by Josefa Kny RECORDED by Studio Flünk MUSIC &amp; GERMAN PERFORMANCE by Björn Leese ILLUSTRATION by Luisa Bergande INSTAGRAM &amp; FB: @quatschmonster CONTACT US: quatschmonsterpodcast@gmail.com</p>",
        "language": "de",
        "author_name": "Matt Wilson",
        "slug": "quatschmonster",
        "cover": "20220420_120453_a686a22e35967e95411f54adfea35b14.jpg"
    },
    {
        "podcast_id": 129006,
        "title": "Magical Memories",
        "description": "Join our momma/daughter duo every Friday for laughs, stories and chats. In each episode, Guinevere (8) &  Mom (Tara) will read books we've both chosen that week from our local library! Listen along and join us in making, Magical Memories!",
        "language": "en",
        "author_name": "Tara Bowman",
        "slug": "magicalmemories",
        "cover": "20220606_030615_65a45eea52ad99ccac60b111b6dadff1.jpg"
    },
    {
        "podcast_id": 129220,
        "title": "Living Life with Coach Ana",
        "description": "Coach Ana talks about life topics that tweens, teens and young adults ask themselves everyday as they are creating their personalities, beliefs, and working towards their dreams! Coach Ana focuses on self-love, self-esteem, and self-confidence and as well touches on the rough topics of life like anxiety, stress, ego, and even depression.",
        "language": "en",
        "author_name": "Ana Chaverra",
        "slug": "livinglifewithmiaana",
        "cover": "20230118_050104_58c4429addd95af21fe5488a6e425cac.jpg"
    },
    {
        "podcast_id": 129977,
        "title": "Backyard Kids Club",
        "description": "This podcast focuses on re-telling some of the Bible Stories for children. Throughout the series we will share some stories of Heroes of our faith, that were able to demonstrate true examples of how to live out our faith. ",
        "language": "en",
        "author_name": "Valentin Burlachenko",
        "slug": "bykclub",
        "cover": "20220523_110502_76adf9794079d88034b92c94eb4fad1b.jpg"
    },
    {
        "podcast_id": 136276,
        "title": "Holtzem Family Reads",
        "description": "From our family to yours, the Holtzem Family Reads will feature some of our favorite children's stories being read to you and your children. Come with us as we bring you into one of our favorite parts of every day, Story Time.\n\nYou can also find us on our YouTube channel at https://www.youtube.com/channel/UCHxx71iusLo_sAimmX_1WfA\n\nAnd online at www.beverlyholtzem.com",
        "language": "en",
        "author_name": "Christopher Holtzem",
        "slug": "holtzemfamilyreads",
        "cover": "20220623_080630_313841524b3e97f60fcf114cf2ca4cde.jpg"
    },
    {
        "podcast_id": 138843,
        "title": "Sprekend Segbroek",
        "description": "<p>Een podcast over het <a href=\"https://www.segbroek.nl\">Segbroek College</a> in Den Haag. Elke week een gast, een spel en nieuwtjes over de school. Stuur je input via Instagram (DM): @sprekendsegbroek of via email: sprekend@segbroek.nl</p>",
        "language": "nl",
        "author_name": "Segbroek College",
        "slug": "sprekendsegbroek",
        "cover": "20230315_050316_be6e68138e6fc99cbf5353dc9e60ba81.jpg"
    },
    {
        "podcast_id": 151166,
        "title": "Kids Two Kids",
        "description": "Coleman (6), Vaughn (4), and Grampa explore lots of stuff that kids care about. Sports, games, toys, family, pets, health topics are all on the table to be discussed through the eyes and lives of kids.\n\nWe have special guests from to time and even some surprises. Kids from 4 to 10 will enjoy these episodes.\n",
        "language": "en",
        "author_name": "Kevin Wixom",
        "slug": "kidstwokids",
        "cover": "20220909_040921_92d1c6a2acb051cfe8a8b998113b2777.jpg"
    },
    {
        "podcast_id": 152331,
        "title": "The Morning Lesson - Waldorf Stories for the Classroom or Home",
        "description": "The Morning Lesson is a storytelling podcast for children in kindergarten through 5th grade. These stories I use in my Waldorf classroom and build all my lesson plans around the characters and elements in the stories. \n\nFollow me on Patron for lesson plan ideas. ",
        "language": "en",
        "author_name": "Laura Keys",
        "slug": "themorninglesson",
        "cover": "20220909_060954_27cae89237fe412b59f67cf1b35e521c.jpg"
    },
    {
        "podcast_id": 153348,
        "title": "ΟΛΥΜΠΟΣ Πρώτα Βήματα",
        "description": "Η ΟΛΥΜΠΟΣ Παιδικό και η Κάρμεν Ρουγγέρη παρουσιάζουν τις περιπέτειες των Θεών του\nΟλύμπου σε μια σειρά από λαχταριστά παραμύθια.\nΑνακαλύψτε τι σκαρώνουν οι μικροί μας φίλοι στο βουνό του Ολύμπου.\nΗ ιστορία μας ξεκινά…μαζευτείτε!",
        "language": "el",
        "author_name": "ΟΛΥΜΠΟΣ Πρώτα Βήματα ",
        "slug": "tokouvertakitismiterasgisolympos",
        "cover": "20220914_070921_c77d30aa7a004092f1a5fe6bf57b6742.jpg"
    },
    {
        "podcast_id": 155068,
        "title": "Forgotten Book Club",
        "description": "Hundreds of thousands of children books have been published over the years, and yet often it is just a handful of truly meaningful ones that stay with us as we grow. Join Wallis as she shares the unique, memorable and hard-to-find  books that have captivated her children over the years - books that let you travel without moving your feet. \n\n\n“Books give a soul to the universe, wings to the mind, flight to the imagination, and life to everything.”\n- Plato",
        "language": "en",
        "author_name": "Wallis Lord-Hart",
        "slug": "forgotten-book-club",
        "cover": "20220921_090943_d59744a24f80340096ede148c8f6eeba.jpg"
    },
    {
        "podcast_id": 155937,
        "title": "Long Ingredient Lists: A Sleep Podcast ",
        "description": "Long Ingredients List: A Sleep Podcast is a bite-sized, semiweekly podcast to play while you wind down to fall asleep. Each episode is a soothing reading of very long ingredient lists on the back label of everyday items - cans of soup, face wash, shampoo, multi surface cleaner, etc. The items chosen are random, sometimes themed together by collection. In this podcast, clutter becomes meditation. Enjoy. ",
        "language": "en",
        "author_name": "Natalie Jorgensen ",
        "slug": "longingredientlists",
        "cover": "20220925_110945_e8ba1f643f7938b9c3ef1b0347ed4f8c.jpg"
    },
    {
        "podcast_id": 156346,
        "title": "TATA BAJA",
        "description": "TATA BAJA to projekt non-profit. Jego celem jest popularyzacja czytania bajek dzieciom i inspiracja innych rodziców do podejmowania podobnych działań. \n\nAutorem projektu jest podcaster, bez doświadczenia profesjonalnego lektora i umiejętności aktorskich, ale z ogromną chęcią sprawienia przyjemności swojemu synowi Gabrielowi i dzieciom znajomych, przyjaciół, czy innych słuchaczy. \n\nBajki czyta Andrzej Wierzchoń, który chce udowodnić, że można czytać bajki z czystej pasji i chęci sprawienia innym radości.",
        "language": "pl",
        "author_name": "Andrzej Wierzchoń",
        "slug": "tatabaja",
        "cover": "20221022_111058_b1f89344c2b46f877ce80ee6a23337ef.jpg"
    },
    {
        "podcast_id": 157159,
        "title": "Roxy Raves",
        "description": "A child friendly, short, fun, light hearted podcast where children talk and answer questions on todays topics. ",
        "language": "en",
        "author_name": "Foxy Studios",
        "slug": "foxystudios",
        "cover": "20221002_051054_2b478a65d821517d15931dfac7f100c3.jpg"
    },
    {
        "podcast_id": 157703,
        "title": "Le favole dell'unicorno",
        "description": "Favole per tutte le età.",
        "language": "it",
        "author_name": "Dani & Vero",
        "slug": "favoleunicorno",
        "cover": "20221003_071041_f4c19c67de421d695c1f765065377b18.jpg"
    },
    {
        "podcast_id": 158565,
        "title": "Speed Girl & Adhesion Boy",
        "description": "Super Powered Kids Helping Kids, Using Science!",
        "language": "en",
        "author_name": "Shawn Holguin",
        "slug": "speed-adhesion",
        "cover": "20221105_121155_d8aedb0b3f4369b9cdcbee7fa01457ca.jpg"
    },
    {
        "podcast_id": 160758,
        "title": "Sunday Storytime with James and Michael",
        "description": "Follow along each week as young storyteller Michael uses his exceptional imagination and creativity to regale his father James with an impromptu bedtime story.",
        "language": "en",
        "author_name": "James Dusenberry & Michael Dusenberry",
        "slug": "sundaystorytime",
        "cover": "20221016_061008_1d4011a70c646bbcecd37ccd036c270c.jpg"
    },
    {
        "podcast_id": 163149,
        "title": "Kids In A Mess",
        "description": "Ever wondered what it would be like for a group of middle school kids to genuinely come together and create something educational and fun to listen to? Welcome to the podcast were a group of 5 story hunting students seek to entertain and educate you about haunted places and conspiracy theories that may be closer than you think.",
        "language": "en",
        "author_name": "Jacob Morrisette",
        "slug": "kidsinamess",
        "cover": "20221025_101007_ff300372831eedc45180ad7f8ac40e62.jpg"
    },
    {
        "podcast_id": 165907,
        "title": "HERvolution",
        "description": "A piece of herstory to our story; getting to know the women that were deemed too radical because of their ideas. How we have so much to learn by the courage of other women that fought for their voices and spaces in a male dominant society.\nwww.hervolutionpodcast.com",
        "language": "en",
        "author_name": "Clara Lopes",
        "slug": "hervolution",
        "cover": "20221117_031145_969bb691fabbf11b3f6498ced223e470.jpg"
    },
    {
        "podcast_id": 166198,
        "title": "Jack & Suzy Come Follow Me for Kids and Family scripture time",
        "description": "In these  Come Follow Me for Kids stories Jack & Suzy learn about the Old Testament and how to apply it into their lives today.  These Bible videos for primary children teach basic principles of the Gospel of Jesus Christ.  Come Follow Me for Kids and families",
        "language": "en",
        "author_name": "Jessica M Francis",
        "slug": "familyscriptures",
        "cover": "20221107_091122_49f81290a812961ce2d102bd6bda699b.jpg"
    },
    {
        "podcast_id": 167591,
        "title": "Naya's Storytime",
        "description": "On this podcast I narrate my favorite stories. I hope you enjoy them and write to me on your favorite stories. Don't forget to send me your answers as I would love to hear them!\n",
        "language": "en",
        "author_name": "Naya Makarem",
        "slug": "nayamakarem",
        "cover": "20221113_061153_612e29d8086e9f1dddfbee6bdbef5000.jpg"
    },
    {
        "podcast_id": 170820,
        "title": "De Club Van Sinterklaas Podcast",
        "description": "Heb jij altijd al willen weten waar de Pieten over praten als ze denken dat niemand ze kan horen? Luister dan snel naar de officiële podcast van De Club Van Sinterklaas!",
        "language": "nl",
        "author_name": "De Club Van Sinterklaas",
        "slug": "declubvansinterklaas",
        "cover": "20221127_081145_123f57f76976cfa19cf879a6913c000f.jpg"
    },
    {
        "podcast_id": 172196,
        "title": "The Career Explorer Podcast",
        "description": "Join me in this podcast, which is for kids like me who want to explore different and unique jobs that are interesting, amazing, and could lead us to our ideal dream career.  \n\nSo, come on my fellow Career Explorers, and join me on our fun journey, as I interview guests from around the world about the careers they are passionate about.",
        "language": "en",
        "author_name": "Nicole",
        "slug": "thecareerexplorer",
        "cover": "20221206_051208_5b9e74599f5a0e613af54e44bd8866db.jpg"
    },
    {
        "podcast_id": 172955,
        "title": "Morale della Favola: Fiabe per Grandi e Piccini",
        "description": "<p>Morale della Favola è un podcast di storie e favole del passato con una morale moderna. Semplici ma preziosi insegnamenti sia per grandi che piccini. Se ci ascolti su Apple Podcasts puoi supportarci abbonandoti al nostro show. Avrai così accesso a contenuti esclusivi e in anteprima early access.</p>",
        "language": "it",
        "author_name": "Berto il Cantastorie",
        "slug": "morale-della-favola",
        "cover": "20221206_111238_d88742ef27febef522d304bc9edc9d7a.jpg"
    },
    {
        "podcast_id": 174337,
        "title": "Lights On Children’s Stories Podcast",
        "description": "Storyteller Martyn Kenneth releases his new podcast following the success of the #1 Apple and Spotify “Light’s Out Children’s Bedtime Stories Podcast. \n\nLights On Children's Stories has a simple mission to provide 1000 Ad-Free stories to children around the world",
        "language": "en",
        "author_name": "Martyn Kenneth",
        "slug": "lightson",
        "cover": "20230107_070123_60c528945d8ea6122bb3e33483285cda.jpg"
    },
    {
        "podcast_id": 177016,
        "title": "UVALL MYSTERY",
        "description": "<p>The purpose of this podcast to help those who are seeking for truth. It will help human race to attain the reality, peace &amp; harmony. All credits goes to <strong>UVALL Mystery</strong> you tube channel.</p>",
        "language": "hi",
        "author_name": "knowkid",
        "slug": "knowkid",
        "cover": "20230107_100147_5ee6e8f6cec5489615e4de79909f5026.jpg"
    },
    {
        "podcast_id": 177581,
        "title": "The Grandmother Stories",
        "description": "Dear Grandchildren: as you step forward to inherit the increasingly dire circumstances facing this world, remember that you hold the power of hope and magic. \nThese are The Grandmother Stories. About how your voice, your gifts, your insights and your presence in the world matters. Because we are all seeking light in dark times.",
        "language": "en",
        "author_name": "Catherine Matheson",
        "slug": "thegrandmotherstories",
        "cover": "20230102_020130_457630412f3bc4b0bc365e12b07a21d3.jpg"
    },
    {
        "podcast_id": 177724,
        "title": "Cuentos Y Poemas en Espanol",
        "description": "<p>Voice-over performance - from Children's books and poems</p>",
        "language": "es",
        "author_name": "Leonel Poveda",
        "slug": "randomselection1-alica-en-maravilandia",
        "cover": "20230221_120255_3b3d0250bffca1423fb0ba7cf9631d0a.jpg"
    },
    {
        "podcast_id": 180504,
        "title": "Parole di Storie",
        "description": "Podcast e AudioLibri per tutti.",
        "language": "it",
        "author_name": "Fedro",
        "slug": "paroledistorie",
        "cover": "20230115_100125_0ee770b19e35f51b769a951ed14e5f91.jpg"
    },
    {
        "podcast_id": 181177,
        "title": "The LMNOP Kids' Stories Podcast",
        "description": "The LMNOP Kids' Stories Podcast is a podcast where we read kids' stories.  Who is we?  Elliott and Olive (kids) and Mr. Alphabet (Dad)!",
        "language": "en",
        "author_name": "Ryan Peterson",
        "slug": "lmnop",
        "cover": "20230117_010159_9db290ae0777a312ea81eb8f90634088.jpg"
    },
    {
        "podcast_id": 181486,
        "title": "Bedtime Stories with Dad",
        "description": "As a dad to three amazing kids, I love ending the day with tucking them in to bed and reading them all a bedtime story.\nIn this podcast we want to share some of our favorite stories with you all at home.\nSo get tucked in and ready for a nice Bedtime Story with Dad.",
        "language": "en",
        "author_name": "Dad",
        "slug": "bedtime-stories-with-dad",
        "cover": "20230118_030159_63d312b7c84f02700224e8f67a5c8a0e.jpg"
    },
    {
        "podcast_id": 184597,
        "title": "Stories That Granny Tells",
        "description": "<p>Fiction Short Stories for relax and entertainment.</p>",
        "language": "en",
        "author_name": "Carlton Morris",
        "slug": "sstoriesthatgrannytells",
        "cover": "20230129_110154_e30c220b0f03e37ca05abdd1b7db3854.jpg"
    },
    {
        "podcast_id": 185735,
        "title": "Feelin’ Good Broadcast",
        "description": "Ways to feel good and relax from the perspective of a 10 year old. ",
        "language": "en",
        "author_name": "Jacki Wagner",
        "slug": "feelingoodbroadcast",
        "cover": "20230201_100246_3f4460baa14a0343685c8c28d1789443.jpg"
    },
    {
        "podcast_id": 186046,
        "title": "Storypillar",
        "description": "<p>Storypillar is a podcast for kids and their grownups. Together with Sneak, Bean, and Meg, we’ll tackle the sticky situations kids face as they grow and change. To guide us, we’ll explore stories from all over the world and pick up advice from our listeners along the way. If you're interested in...  </p><p>Stories and using your imagination,  </p><p>Learning about new places and perspectives,  </p><p>Laughing and being silly,  </p><p>Having a space to process big feelings and social emotional challenges,  </p><p>Getting advice from real, live (and very smart) kids</p><p>...then Storypillar is for you! We can't wait to say \"Hey!\" and find our way together.  </p><p><strong>Website:</strong> <a href=\"http://www.storypillar.com\">www.storypillar.com</a>   </p><p><strong>Instagram:</strong> <a href=\"https://www.instagram.com/storypillar\">@storypillar  </a></p><p><strong>Support us on Ko-fi:</strong> <a href=\"https://ko-fi.com/storypillar\">https://ko-fi.com/storypillar</a>  </p><p><strong>Contact:</strong> <a href=\"mailto:info@storypillar.com\">info@storypillar.com</a>  </p><p><strong>Created, Written, and Produced by:</strong> Meg Lewis</p>",
        "language": "en",
        "author_name": "Meg Lewis",
        "slug": "storypillar",
        "cover": "20230204_050242_ad8ad91412027ae0ae3db2e0411e5fde.jpg"
    },
    {
        "podcast_id": 187686,
        "title": "Billie Atoms Adventures - Stories For Amazing Human Beings",
        "description": "<p>More at <a href=\"http://billieatoms.com\">billieatoms.com</a></p><p>Suitable for all ages 5 to 105. Inspiring amazing human beings.</p><p>Listening to audio stories and sounds is one of the most powerful tools parents have at their disposal. Audio stories can stimulate your child's imagination, creating a peaceful atmosphere that promotes relaxation and sound sleep.</p><p>Each episode ends with Billie drifting off to sleep and a guided meditation to help your child sleep.</p><p>Our stories are boring enough to promote sleep but engaging enough to want to listen again.</p><p>Produced by billionsofatoms</p><p>For more content visit us at <a href=\"https://billieatoms.com/\">Billie Atoms – Inspiring Kindness</a></p>",
        "language": "en",
        "author_name": "Billions Of Atoms",
        "slug": "billieatoms",
        "cover": "20230517_030545_a4875db0dc95a0b792e5d876d28bd945.jpg"
    },
    {
        "podcast_id": 189044,
        "title": "书在起跑点——绘本的启发",
        "description": "<p>嗨，您好。</p><p>欢迎您走进 “书在起跑点——绘本的启发”。这是 Berries 百力果特别为您呈现的绘本分享平台。</p><p>除了带给您精彩的绘本故事，我们也特别邀请资深教育工作者与我们分享相关绘本带给我们的启发。让我们一起加油，成为更好的自己，也成为更懂孩子的家长。</p><p>Welcome to “Once Upon a Book: Stories that Inspire”, a podcast series by Berries dedicated to sharing timeless stories from picture books that will take you on a journey to other worlds. </p><p>Our podcast will also feature special guests from the education industry who will share their insights and experiences on how stories can inspire us to become our best selves and be the best gift to our children.</p>",
        "language": "zh",
        "author_name": "Berries 百力果",
        "slug": "berriesworldsg",
        "cover": "20230220_080213_deb6070913f649bea72e77e29d952f5a.jpg"
    },
    {
        "podcast_id": 190494,
        "title": " קדן וטומי ממציאים סיפורים יחד עם AI",
        "description": "<p>פודקסט סיפורים לילדים לפני השינה 🙉</p><p>הסיפורים והתמונות מיוצרים באמצעות AI 🤖</p><p>אבל הזכויות שמורות לקדן וטומי דהן 🤩</p><p>כתבו לנו: kadenandtommy@gmail.com</p>",
        "language": "he",
        "author_name": "קדן וטומי דהן",
        "slug": "kaden-tommy-ai",
        "cover": "20230218_080246_4ef37f6d647db48ac9fc889c12b33843.jpg"
    },
    {
        "podcast_id": 192298,
        "title": "DON PURO CUENTO",
        "description": "<p>Una producción de aficionados a los cuentos infantiles en donde podremos escuchar dramatizaciones de cuentos conocidos o no tan conocidos en la voz de creadores de contenido que tienen muchas ganas de relatar estas historias a través de la vida de Don Puro Cuento, una persona mayor que disfruta pasar tiempo platicando con su nieto y su conciencia.</p>",
        "language": "es-mx",
        "author_name": "SANTIAGO YAÑEZ SANCHEZ",
        "slug": "donpurocuento",
        "cover": "20230225_060208_51048333525a2dc85caf03454310ba20.jpg"
    },
    {
        "podcast_id": 192814,
        "title": "Bedtime Buddy with William Low",
        "description": "<p>Making his first foray into the media world is Singapore’s very own version of <em>“the kid who never grows old”</em>, <strong>William Low</strong>. William wants to make a positive contribution to the community by sharing meaningful tales that are filled with mirth and wild imagination as kids lay their heads down at bedtime. An audio only podcast, this is a great way for folks to bond with their little ones at that most important time of the day with William Low as your <strong>Bedtime Buddy</strong>.</p>",
        "language": "en",
        "author_name": "CCBTV",
        "slug": "bedtimebuddywithwilliamlow",
        "cover": "20230227_070239_ea1015889979d8e75b69b3718a183280.jpg"
    },
    {
        "podcast_id": 200403,
        "title": "વાર્તા નો ખજાનો | Varta No Khajano",
        "description": "<p>We are making an effort to preserve the old Gujarati stories that our grandma and grandpa used to tell us so that the younger generation can continue to experience and appreciate our rich cultural heritage.</p>",
        "language": "en",
        "author_name": "Devanshi Pandya & Devanshi Joshi",
        "slug": "vnokhajano",
        "cover": "20230331_030344_df4b66c2971c6f8a1ca063fb23aad546.jpg"
    },
    {
        "podcast_id": 203461,
        "title": "Tall Tales & Other Stories: Classics for Kids of All Ages!",
        "description": "<p>Welcome to Tall Tales &amp; Other Stories: Classics for Kids of All Ages!</p><p>This is the place you can come to listen to all sorts of tall tales – from wicked giants, to naughty hens, boring badgers or brave knights…there will be some stories you already know and so many others you are soon to discover. If you fancy a bedtime story, we’ll have those, as well as stories for looong bo-ring car journeys…or classics re-told and nonsense poems...Something for everyone, I think.</p><p>Now remember, there are no pictures in podcasts, so you must imagine these stories in your <strong>mind</strong>…You can imagine them anyway you want to because that’s the beauty of reading! I’m going to post lots and lots of stories but as JK Rowling says (she’s a super famous author by the way): “there’s no story, unless someone wants to listen” so its up to you to take the lead and hit subscribe and if you like these stories, please share them with your friends and leave a review. Better yet…</p><p>Why not go to my website at: <a href=\"http://talltalesandotherstories.com\">talltalesandotherstories.com</a> and tell me <strong>your</strong> story? It doesn’t have to be a long one and I might even read out my favorites each week!  </p><p>There is a world of stories out there, so why not make your own!</p><p>Tall Tales Premium offers even more stories and an ad-free listening experience; visit <a href=\"https://taletalesandotherstories.com\">www.talltalesandotherstories.com</a> to learn more.</p>",
        "language": "en",
        "author_name": "Alexandra McTavish",
        "slug": "talltales",
        "cover": "20230415_110410_0c675b6064ddad33f06cb9215e1a472b.jpg"
    },
    {
        "podcast_id": 207471,
        "title": "Die Abenteuer der Klunkerkisten-Crew",
        "description": "<p>Die Hörspiel-Reihe \"Die Abenteuer der Klunkerkisten-Crew\" ist das Ergebnis eines medienpädagogischen Projekts in der Jugendeinrichtung Schloss Stutensee. Durchgeführt wird es von Jens Voigtländer, pädagogische Fachkraft in einer intensiv-pädagogischen Wohngruppe. Pro Folge vergehen von der ersten Idee bis zum fertigen Hörspiel gut und gerne 3 Monate. Mittlerweile gibt es drei Folgen, welche lose aufeinander aufbauen.</p><p>Die Texte und Lieder wurden selbst geschrieben, komponiert, arrangiert und produziert; einige davon exklusiv für die \"Klunkerkisten-Crew\"-Reihe.</p><p>Die Klunkerkisten-Crew ist allen Beteiligten sehr ans Herz gewachsen und wird sicher auch eures im Sturm erobern. </p><p>Freut euch auf piratenstarke Abenteuer mit der Klunkerkisten-Crew!</p><p>Altersempfehlung: ab 8 Jahren</p>",
        "language": "de",
        "author_name": "Jugendeinrichtung Schloss Stutensee gGmbH",
        "slug": "jugendschloss-klunkerkistencrew",
        "cover": "20230510_020519_72917b29ad13ebd5a57c57de747c94a6.jpg"
    },
    {
        "podcast_id": 208444,
        "title": "Children Stories By Ohana",
        "description": "<p>In this podcast I share stories from around the world to inspire and educate children, teaching them that we may come from different countries however we are all one people and should embrace peace, prosperity and love for all mankind</p><p>SUPPORT OUR CHANNEL Buy Uncle Amos a Cup of Coffee <a href=\"https://www.ko-fi.com/ohanastories\">https://www.ko-fi.com/ohanastories</a></p><p>Donate and help us make more videos <a href=\"https://www.patreon.com/ohanastories\">https://www.patreon.com/ohanastories</a> LEARN HOW TO PLAY THE UKULELE <a href=\"https://ohanastories.thinkific.com/\">https://ohanastories.thinkific.com/</a></p><p>FOLLOW US ON SOCIAL MEDIA <a href=\"https://www.instagram.com/storiesohana/\">https://www.instagram.com/storiesohana/</a> <a href=\"https://www.tiktok.com/@ohanastories\">https://www.tiktok.com/@ohanastories</a> <a href=\"https://twitter.com/StoriesOhana\">https://twitter.com/StoriesOhana</a></p><p>Listen to Uncle Amos and Lucas Song “Fly Away” <a href=\"https://music.apple.com/us/album/fly-\">https://music.apple.com/us/album/fly-</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbkVFVkVudzdLUk1hWWU3M3I2XzZsaFhlUHFrUXxBQ3Jtc0ttQWFkX3JrcVBzYkdYVVdUWE1TdWtVVnA0QmFWRzRLTktfMml0WnpJU3FWQzhTT1RYazJjQ09CTXBqY2RGc3g1WUxMVktWWlhlZG5xTE9OdXFjTkVCSjNQRVpMWFJqNlo5bDYzOWtJaHk5OHZzMXY1RQ&amp;q=https%3A%2F%2Fmusic.apple.com%2Fus%2Falbum%2Ffly-away-single%2F1657357546&amp;v=FlxuqmLIJqE\">...</a> <a href=\"https://open.spotify.com/album/3X7MJP\">https://open.spotify.com/album/3X7MJP</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqa3hxcy1DZkUxRm9zal9SemJhME9PMHUwc1piZ3xBQ3Jtc0ttcEJMUVp1U1B5dk16LU52Uy1sclpjakNQSE5Ycm9hMnJOUC1MZFRsSk9JOFpfZ0J3Y3Jaam1kbmQxUC1wMFpDSVUwb3ZTaldHNnpNMkZFNnREeXZnWnhqdDZ2N3E4eXVhNWxLUmowYU56X0dFbkJuTQ&amp;q=https%3A%2F%2Fopen.spotify.com%2Falbum%2F3X7MJPVIOE3CdOcuJnH9Cy&amp;v=FlxuqmLIJqE\">...</a> <a href=\"https://music.amazon.com/albums/B0BNP\">https://music.amazon.com/albums/B0BNP</a><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbXA4Y2F0cGNnV2NMblhBcFQyd1NlYXdra19PZ3xBQ3Jtc0ttaXd6em1ieDBQSExNb3lHa2xLOWxCUmd5YWhRaWItRXNpNm5sUUQ4VEQ2ZjBtcU1WUTdVZWlOUHVMSmlIQVVyZ0FkMWJLN2NBZEZTeE1XeWtsaTRzTGRldjZiT2tKMU9DaUk4QW5IMDk4R1FZTmoxUQ&amp;q=https%3A%2F%2Fmusic.amazon.com%2Falbums%2FB0BNPXTRM3%3Fdo%3Dplay%26trackAsin%3DB0BNQ7LHY1%26ref%3Ddm_sh_o9p2wTGsB272KvJ1Fxgb8snPZ&amp;v=FlxuqmLIJqE\">...</a></p>",
        "language": "en",
        "author_name": "Amos Balongo",
        "slug": "childrenstories",
        "cover": "20230510_090547_360d32291e696d9151999dc8c704aa16.jpg"
    },
    {
        "podcast_id": 209416,
        "title": "Instinto Literario",
        "description": "<p>Instinto Literario es un espacio para hablar sobre literatura infantil y juvenil desde una mirada personal, íntima y didáctica. Producido y narrado por Andreína Monasterio, periodista y narradora oral residenciada en Madrid, Instinto Literario busca acercarnos a esos relatos de nuestra niñez y a otros, de reciente data, que nos conectan con esa infancia que nos permite ser mejores personas y acompañar a nuestros niños en la actualidad.</p><p><a href=\"https://www.ivoox.com/podcast-instinto-literario_sq_f11959894_1.html#\"><strong>Ocultar</strong></a></p>",
        "language": "es",
        "author_name": "Andreína Monasterio Andrade",
        "slug": "instintoliterario",
        "cover": "20230515_100533_7a9196320be7a101529ae75a82e0a182.jpg"
    },
    {
        "podcast_id": 213378,
        "title": "Scuola dell'Infanzia \"B. Spadafora\"",
        "description": "<p>Esistono delle parole che hanno il potere di far spuntare il sorriso. Sono parole magiche e sono talmente semplici che anche i più piccoli le possono imparare. Sono: buongiorno, per piacere, grazie, bravo, benvenuto, scusa, ti voglio bene, ti aiuto io. Sono le parole della gentilezza</p>",
        "language": "it",
        "author_name": "ANGELINA",
        "slug": "angelinacovelli",
        "cover": "20230605_080656_75ce722a529aeaeebb6d0d893337bcaf.jpg"
    },
    {
        "podcast_id": 214234,
        "title": "Cântece",
        "description": "<p>Itsy si Bitsy au compus împreună cu prietenii lor o serie de cântece despre supereroi, copilărie, joacă, sport, natură, emoții. Ascultă-le și bucură-te de muzică și dans împreună cu Supereroii Itsy Bitsy! Producător muzical: ON AIR STUDIO SRL</p>",
        "language": "ro",
        "author_name": "Itsy Bitsy",
        "slug": "cantece-supereroi-cu-itsy-si-bitsy",
        "cover": "20230610_100648_1c22663f644487bf9f00128d157d3452.jpg"
    },
    {
        "podcast_id": 216719,
        "title": "Merles Welt Gefühle ",
        "description": "<p>In diesem Podcast erzähle ich von meinen Leben und dem Klimawandel.</p>",
        "language": "de",
        "author_name": "Merle",
        "slug": "bonn",
        "cover": "20230625_070633_1a41447d496256c1f2f927eced6e52b0.jpg"
    },
    {
        "podcast_id": 216914,
        "title": "Story of a stubborn kid- A moral story",
        "description": "<p>This story is for kids so that they can learn moral</p>",
        "language": "hi",
        "author_name": "Raaz",
        "slug": "storykids",
        "cover": "20230626_070630_10f0c6cdcc6ad07518f81b5dbc935cb7.jpg"
    },
    {
        "podcast_id": 217529,
        "title": "La abeja Vi-Vi cuentacuentos en Súper Pandilla",
        "description": "<p>La abeja Vi-Vi cuentacuentos es un podcast mágico de revista Súper Pandilla, en el que encontrarás, cada semana: Narraciones extraordinarias, historias divertidas, aventuras increíbles, seres fantásticos, fábulas, leyendas, un sinfín de cuentos infantiles con un mensaje y contenido educativos para los más peques de la casa. ¡No te pierdas de este maravilloso podcast!</p><p>Una producción de Grupo EL COMERCIO. Producción de Oscar Álvarez.</p><p>Puedes contactarnos en ⁠⁠⁠⁠⁠<a href=\"mailto:podcast@elcomercio.com\">podcast@elcomercio.com</a> ⁠⁠⁠⁠⁠</p><p>Gracias por escuchar este podcast.</p><p>Más info: <a href=\"https://www.elcomercio.com/podcasts/la-abeja-vi-vi-cuentacuentos-en-super-pandilla\">https://www.elcomercio.com/podcasts/la-abeja-vi-vi-cuentacuentos-en-super-pandilla</a></p>",
        "language": "es-mx",
        "author_name": "EL COMERCIO de Ecuador",
        "slug": "la-abeja-vi-vi-cuentacuentos-en-super-pandilla",
        "cover": "20230630_110605_63e037f4cf52fecf5c60619a629e8ebb.jpg"
    },
    {
        "podcast_id": 218084,
        "title": "College Dude ",
        "description": "<p>THE COLLEGE DUDE IS ABOUT A RICH BUSINESSMEN’S SON NAMED ATHARV WHO GET BULLIED ON THE FIRST DAY OF HIS COLLEGE AND STUCK BETWEEN A FIGHT TO KNOW WHAT HAPPENED NEXT WITH HIM KEEP LISTEN TO COLLEGE DUDE’S STORY AND HAVE FUN WITH US</p>",
        "language": "en",
        "author_name": "Gem Tunes Kids",
        "slug": "gemtuneskids",
        "cover": "20230705_090736_2d8278ee2d84af7bfb3c11094a040de9.jpg"
    },
    {
        "podcast_id": 219620,
        "title": "BedTime-Stories for kids",
        "description": "<p>This is a bedtime story for kids</p>",
        "language": "en",
        "author_name": "Ash",
        "slug": "bedtime-stories",
        "cover": "20230715_080730_0ad84fe31996f899b185f75d420cb10c.jpg"
    },
    {
        "podcast_id": 219829,
        "title": "樂樂說故事",
        "description": "<p>可愛帥氣的樂樂透過閱讀的方式，跟大家分享各種小故事，並在最後說說對於故事小小的心得。</p>",
        "language": "zh",
        "author_name": "樂樂&樂樂的小夥伴們",
        "slug": "brad1031",
        "cover": "20230717_010745_b1d7ac60356a3067f5750c713b05df4c.jpg"
    },
    {
        "podcast_id": 220260,
        "title": "Fabel om haren & sköldpaddan",
        "description": "<p>Den här podcasten innehåller fabel om haren &amp; sköldpaddan</p>",
        "language": "sv",
        "author_name": "avab",
        "slug": "traveling",
        "cover": "20230722_010703_7402712874fdea72ac195e23001b9608.jpg"
    },
    {
        "podcast_id": 220381,
        "title": "with love + ♥♥♥ kaung kaung",
        "description": "<p>One day or someday, whenever we meet again, we will give our avatar our happiness, our maturity, our freedom, our love, our everything, our avatar, our blood, our son, we will make him happy with our warmth... I love you, and I miss you, and you are still waiting for our baby and his family life... I need you kalaylay♥</p>",
        "language": "en",
        "author_name": "aungbobokyaw",
        "slug": "tomybabe",
        "cover": "20230720_100728_cf499e9b5c25721ffd282c5873d1369d.jpg"
    },
    {
        "podcast_id": 220492,
        "title": "Daniel's life",
        "description": "<p>this is a podcast about the life of young Daniel from the time he was a child to adulthood and experienced many events and memories. Stay tuned till the end to know more about Daniel's life</p>",
        "language": "en-us",
        "author_name": "Stephen Placious",
        "slug": "stephenplacious2",
        "cover": "20230721_030714_7fd8ef06628392b9d5024c2dc361b5dc.jpg"
    },
    {
        "podcast_id": 220761,
        "title": "Mogs box (meg and mog) ",
        "description": "<p>Specially for Hudson.</p>",
        "language": "en",
        "author_name": "Miss Kizzer",
        "slug": "misskizzer",
        "cover": "20230723_080742_abe62066dab0ee13f2299f7dd87e647d.jpg"
    },
    {
        "podcast_id": 220820,
        "title": " Four Corners",
        "description": "<p><strong>برنامج اذاعى للاطفال للحواديت والقصص التربوية وقصص التنميه البشريه بعيدًا عن الشاشات وسلبياتها وعوده إلى زمن الراديو والخيال والمتعه المفيده ولكن باسلوبهم الحديث</strong></p>",
        "language": "ar",
        "author_name": "Sara",
        "slug": "storysara",
        "cover": "20230802_110832_1c1c9ab8564297a8052f1f459feb7587.jpg"
    },
    {
        "podcast_id": 220964,
        "title": "Children's Stories Around The World",
        "description": "<p>Listen to beautiful &amp; fun children's stories from around the world. Let your children travel the globe and feast on the literally treasures of different cultures. Each story holds a valuable life lesson that children will carry in their heart and are able to apply to real life situations. Topics include such as teamwork, kindness, generosity, courage and gratitude. </p>",
        "language": "en",
        "author_name": "Nancy Agbenu",
        "slug": "children-stories-around-the-world",
        "cover": "20230724_080741_a83a5c3df86e495f9b9366dff4f67c70.jpg"
    },
    {
        "podcast_id": 221648,
        "title": "The Adventure of Lily",
        "description": "<p>Welcome to \"The Adventures of Lily\": Tales of Adventure!\" Embark on an exhilarating journey with us as we bring you captivating stories from daring adventurers across the globe. Each episode will take you to far-flung corners of the earth, where our intrepid guests will recount their most thrilling, heartwarming, and jaw-dropping experiences.</p><p>From conquering majestic mountains and traversing dense jungles to surviving treacherous expeditions and encountering awe-inspiring cultures, our podcast will immerse you in the essence of adventure. Delve into the triumphs and challenges faced by explorers as they share their raw and unfiltered accounts of the great unknown.</p><p>Whether it's a solo escapade to find self-discovery, a team endeavor pushing the limits of human endurance, or a serendipitous encounter that changed lives forever, \"The Adventures of Lily captures the essence of wanderlust and the thrill of exploration.</p><p>Join us every week as we weave together these tales of courage, resilience, and the unyielding spirit of adventure. So, fasten your seatbelts, put on your headphones, and get ready to embark on an unforgettable auditory expedition with \"The Adventures of Lily Tales of Adventure - because the world awaits, and extraordinary stories beckon!</p>",
        "language": "en",
        "author_name": "Allwin Rex",
        "slug": "allwin-rex",
        "cover": "20230729_040738_22f4e32fad154e6dd53f85ad887fdb75.jpg"
    },
    {
        "podcast_id": 222847,
        "title": "Dinosaur Stories for Kids",
        "description": "<p>For all those kids who love dinosaurs, Purple TREX Productions bring you, Dinosaur Stories for Kids!</p>",
        "language": "en",
        "author_name": "Oliver Evans",
        "slug": "dinosaurstoriesforkids",
        "cover": "20230806_080858_e02fc944ed60602ae63a0d91b0b82950.jpg"
    },
    {
        "podcast_id": 223180,
        "title": "Kids Sleep meditation- Bedtime Stories with Mrs. Sweet Dreams ",
        "description": "<p>Mrs. Sweet Dreams takes you on a peaceful guided meditation for kids. The sweet calming guided meditation sounds paired with a classic story will help your child fall asleep if they suffer with sleep anxiety. Play this beautiful audio podcast for when your toddler is not sleeping. Sweet Dreams.</p>",
        "language": "en",
        "author_name": "Mrs. Sweet Dreams",
        "slug": "sweetdreamsstorytime",
        "cover": "20230808_090842_0179a9a19dc8c56e879e4a148a3c0379.jpg"
    },
    {
        "podcast_id": 223183,
        "title": "خِلسة بودكاست",
        "description": "<p>جاهز تسمع حدوتة لذيذة تفصل بيها من كل متاعب الأسبوع؟ </p><p>معادنا كل خميس الساعة 12 بليل. </p><p>مع خلود الوحش في بوكاست خلسة. </p>",
        "language": "ar",
        "author_name": "kholoud elwahsh",
        "slug": "khilstt",
        "cover": "20230808_090846_f48fc648eb23e30ba1f2de9d081625ff.jpg"
    },
    {
        "podcast_id": 223259,
        "title": "MeteoHeroes",
        "description": "<p>MeteoHeroes are 6 kids with superpowers and where do they come from, what are their powers. Where the MeteoHeroes live and lots of other news about them.</p>",
        "language": "it",
        "author_name": "Mopi Srl - Meteo.Expert",
        "slug": "metehoeroes-en",
        "cover": "20230809_090816_11a40b00a1327291295c1bab6e0b8ee5.jpg"
    },
    {
        "podcast_id": 224198,
        "title": "Son Chiquitos Radio",
        "description": "<p>¡Un programa cultural, familiar, y en español!</p>",
        "language": "es",
        "author_name": "Son Chiquitos",
        "slug": "sonchiquitosradio",
        "cover": "20230815_030836_bc655e086969cdca6a74c5edf9f0857d.jpg"
    },
    {
        "podcast_id": 225077,
        "title": "Moral stories ",
        "description": "<p>Stories for kids</p>",
        "language": "en",
        "author_name": "Sushma ",
        "slug": "stories-for-you",
        "cover": "20230821_100821_38bd28672a0c914c75cc520b61d555e7.jpg"
    },
    {
        "podcast_id": 225246,
        "title": "Bedtime Stories & Dreams",
        "description": "<p>We are thrilled to announce the release of additional episodes in the enchanting Story Voice series for kids, aimed at elevating their bedtime storytelling experience through captivating audio podcast book formats. These new episodes are designed to further enhance the joy of bedtime storytelling, offering a delightful combination of heartwarming narratives and beloved character voices. Join us as we bring a new dimension to bedtime stories, making each night a memorable and cherished adventure.</p>",
        "language": "en",
        "author_name": "Story Voice",
        "slug": "storyvoice",
        "cover": "20230822_060803_7631afb51ab795c1e8f9f578576db545.jpg"
    },
    {
        "podcast_id": 226518,
        "title": "UNFILTERED TALKS",
        "description": "<p>A podcast with different episodes designed to entertain you and bring some valuable information. We dive into some of the most interesting stories and topics related to my college and my surrounding which are booming at its peak.</p>",
        "language": "en",
        "author_name": "Shaswat Kumar",
        "slug": "unfilteredtalks",
        "cover": "20230830_070835_e3b69211182a27af2a05bef0c641be9f.jpg"
    },
    {
        "podcast_id": 227322,
        "title": "The Adventures of Candy and Bar: Kid Inspired Stories",
        "description": "<p>Kids come up with the story idea, and their mom tells a creative tale incorporating their ideas. Follow the fictional adventures of girl and boy twins, Candy and Bar (short for Candace and Barry, of course). Each stand-alone episode dips into Candy and Bar's lives at different ages, different locations, and follows whatever prompts these young minds dream up. This impromptu collaborative storytelling is fun for ages 2 and up. Parents will get a chuckle too, and find themselves identifying with the parent-child dynamics playing out within the stories.</p>",
        "language": "en",
        "author_name": "CandyandBarPodcast",
        "slug": "candyandbarpodcast",
        "cover": "20230905_030954_17000122b4c7c3261402a6629c49fdc1.jpg"
    },
    {
        "podcast_id": 228068,
        "title": "Cuentos Jopará. Historias humanas para entender nuestra naturaleza.",
        "description": "<p><strong>Bienvenidos a los cuentos Jopara.</strong> En esta primera temporada te vamos a contar historias humanas para entender nuestra naturaleza.</p><p>Te proponemos escuchar una historia por noche justo antes de cerrar los ojos, así tu mente tendrá todo el sueño para pensar en él y todo el día para intentar comprenderlo y cuando sientas que hayas entendido el mundo entonces intenta cambiarlo. Historias para niños que se sienten grandes y para grandes que se sienten niños.</p><p>Si quieres saber mas de lo que hacemos entra a nuestras redes sociales:</p><p>YouTube: <a href=\"https://www.youtube.com/channel/UCKkXEVbQLo2oWgSjOP6WPZw\">https://www.youtube.com/channel/UCKkXEVbQLo2oWgSjOP6WPZw</a></p><p>Instagram: <a href=\"https://instagram.com/joparaprestadoresturisticos?utm_source=qr&amp;igshid=MThlNWY1MzQwNA==\">https://instagram.com/joparaprestadoresturisticos?utm_source=qr&amp;igshid=MThlNWY1MzQwNA==</a></p>",
        "language": "es",
        "author_name": "Jopara Bioturismo",
        "slug": "joparabioturismo",
        "cover": "20230910_050910_8e950e9e83bb4c4719b63787a272b581.jpg"
    },
    {
        "podcast_id": 228466,
        "title": "A Conversation with the World คุยกันฉันกับโลก",
        "description": "<p><strong>A Conversation with the World: คุยกันฉันกับโลก</strong></p><p>แทรคเสียงที่จะชวนทุกคนไปร่วมสำรวจและทำความรู้จักกับ \"สวนปทุมวนานุรักษ์\" พื้นที่สวนแห่งใหม่ใจกลางกรุงเทพฯ ผ่านมุมมองและวิธีการแบบที่เด็กๆ ใช้อย่างเป็นธรรมชาติ เพื่อจุดประกายความสงสัยใคร่รู้ ชวนให้อัศจรรย์ใจไปกับโลกรอบตัว และได้ใช้จินตนาการ บอกเล่าเรื่องราวความคิดของตัวเองในฐานะของนักผจญภัยในโลกมหัศจรรย์ใบนี้</p><p>เรื่องเล่าและพรอมต์ต่างๆ ที่คุณกำลังจะได้ฟัง ผ่านกระบวนการทำงานสร้างสรรค์และลงเสียงโดยเด็กๆ นักเล่าเรื่องและนักเล่นสนุก จากโรงแรมครีมและร้านหนังสือตราเด็กส่งกระต่าย</p><p>โปรเจ็คต์นี้ได้รับการสนับสนุนจากอุทยานการเรียนรู้ TK Park เพื่อเป็นส่วนหนึ่งของเทศกาลการเรียนรู้กรุงเทพฯ Bangkok Learning Fest 2023</p><p>----------------------------------------------------------</p><p><strong>A Conversation with the World</strong></p><p>A creative project developed for Learning Fest Bangkok 2023 By CREAM Bangkok in collaboration with BooksBunny Powered by TK Park</p><p>A Conversation with the World is a site-specific audio experience for the curious minds.</p><p>With creative inputs by a group of children who participated in the project, they—together with the audiences—create a dramatic journey and tell stories of built and natural landscapes of the park using their voices and imagination.</p><p>Location: Pathumwananurak Park, Bangkok</p>",
        "language": "th",
        "author_name": "ABC16: Atelier BooksBunny & CREAM",
        "slug": "a-conversation-with-the-world",
        "cover": "20230913_070920_e3979766e8cdd3ec498db3c37d4d1164.jpg"
    },
    {
        "podcast_id": 228832,
        "title": "Supernatural and Paranormal ",
        "description": "<p>It is paranormal activity,experienced by the 2 people on their trip to Jaisalmer</p>",
        "language": "en",
        "author_name": "Group 4",
        "slug": "podcastsuper",
        "cover": "20230915_040915_c68e3155ea36ed199b2cc769b3ff6053.jpg"
    },
    {
        "podcast_id": 229143,
        "title": "Gerovital Kids - Oița Spumița",
        "description": "<p><strong>Oița Spumița aduce binele în băiță!</strong></p><p>Ascultă cântecelul Oiței Spumița până pe 22 septembrie, în emisiunile Itsy Bitsy Neața și SuperZĂPĂ, și intră în concurs!</p><p>Fii creativ și poți câștiga un set de produse Gerovital Kids (format din pastă de dinți pentru copii, Spumă de Duș MarshMallow, Gel Spălare Corp și Păr Hydra Care, Săpun Lichid Spumă Fresh Energy și Cremă Hidratantă Față și Corp).</p><p> </p>",
        "language": "ro",
        "author_name": "Gerovital Kids",
        "slug": "gerovital-kids-oita-spumita",
        "cover": "20230918_100956_d15adb555a971d1c2658ddff3d6d74de.jpg"
    },
    {
        "podcast_id": 229180,
        "title": "Biblo the Dragon's Magic Storybook",
        "description": "<p>Hello, boys and girls of all ages.</p><p>I am Biblo. Journey with me as we adventure through stories that we create using your ideas on AI.</p>",
        "language": "en",
        "author_name": "Biblo the Dragon",
        "slug": "biblothedragon",
        "cover": "20230918_030944_53ec33769b26d33b8979f4c90fac1656.jpg"
    },
    {
        "podcast_id": 229191,
        "title": "Big & Feathered - Al & Colin ",
        "description": "<p>Big &amp; Feathered - Al &amp; Colin is a series of children's stories about a giant named Al and his swan friend named Colin. Each story will follow the duo as they learn new lessons and achieve goals, inspiring each other and their fans as they go.</p>",
        "language": "en",
        "author_name": "Stephen Murdoch",
        "slug": "bigandfeathered",
        "cover": "20230918_030939_44deb90bc7088e4df4aebc2dd2656355.jpg"
    }
]