[
    {
        "podcast_id": 482,
        "title": "Flux Capacitor",
        "description": "The Flux Capacitor podcast features discussions with business and thought leaders of the electricity industry on the future of the business of electricity. The discussions touch on how we create, move, trade, and use energy, with each guest adding their own expertise and perspective to the conversation. What will be the impacts of technological change? How will markets and customer demands respond to new technology? What will change, both social and technological, mean for regulators, society and the electricity industry? CEA invites you to join in the conversation.",
        "language": "en",
        "author_name": "Francis Bradley",
        "slug": "fluxcapacitor",
        "cover": "20220104_020101_84ec5ef428f977894a07acfd6815db62.jpg"
    },
    {
        "podcast_id": 850,
        "title": "The Control Performance podcast series",
        "description": "A typical plant is losing millions annually from poorly-performing control systems.  Typically, 20-30% of controls are in manual mode.  Up to 85% of control loops have sub-optimal settings.  20-40% of controllers are oscillating, adding to plant variability, and hurting reliability.  With so many issues, it can be hard to monitor, prioritize, and resolve issues.",
        "language": "en",
        "author_name": "Control performance at Valmet",
        "slug": "controlperformancepodcasts",
        "cover": "20220404_070448_e793ac8a257578ec718c5860af29d279.jpg"
    },
    {
        "podcast_id": 1223,
        "title": "Music Vibration",
        "description": "Music is a vibration before a language",
        "language": "en",
        "author_name": "DJ Mike Z & Guest",
        "slug": "musicvibration",
        "cover": "20210908_072900_d1af3242fdb32c068cf3d7ac027fdf8f.jpg"
    },
    {
        "podcast_id": 4113,
        "title": "Listen to Cedric Seay",
        "description": "Mobile Industry News and Reviews",
        "language": "en",
        "author_name": "Cedric M Seay",
        "slug": "mobiletechtalk",
        "cover": "5dd7d2678f0cd.jpg"
    },
    {
        "podcast_id": 4855,
        "title": "Another Destiny Podcast",
        "description": "Just some Canadian Bois chatting about Destiny, eh?\nJoin us on Fridays at 8pm PST.\nhttp://twitch.tv/anotherdestinypodcast",
        "language": "en",
        "author_name": "Another Destiny Podcast",
        "slug": "adpodcast",
        "cover": "5e0eb290e1ab2.jpg"
    },
    {
        "podcast_id": 6567,
        "title": "Actindo Commerce Innovation Talks",
        "description": "Hier teilen Experten Ihre Ansichten und Erfahrungen aus der sich immer verändernden Welt des eCommerce.\n\nJeden Monat wechselnde Gäste mit neuen Themen.",
        "language": "de",
        "author_name": "Actindo AG",
        "slug": "actindo",
        "cover": "20200323_102208_dde815e62d295a92c05a7d7405bdcf11.jpeg"
    },
    {
        "podcast_id": 6882,
        "title": "DCA Commerce Code",
        "description": "Stay connected and get the latest insights, analysis and news from the leading fin-tech companies, merchants and payments including Microsoft, Mastercard, Samsung, LVMH, Hilton and more. The podcast features insights and interviews from Digital Commerce Alliance (formerly CardLinx) members around the world. Stay connected and subscribe to DCA's Commerce Code Podcast",
        "language": "en",
        "author_name": "Digital Commerce Alliance",
        "slug": "fintechfriday",
        "cover": "20210128_183459_ba441d95938ea3b058002d7442e7ce0a.jpg"
    },
    {
        "podcast_id": 7689,
        "title": "Blerd Lines",
        "description": "Braven The Grown Up Kid and a series of guests take their unique perspectives on technology, movies, games and television.",
        "language": "en",
        "author_name": "Braven Carlsen",
        "slug": "blerdlines",
        "cover": "20200422_050601_ba383a547f3fd52d53cdc0402e5b027a.jpeg"
    },
    {
        "podcast_id": 7920,
        "title": "Tony's Game Lounge",
        "description": "Join Tony every week with a new guest in the Game Lounge. Meet Gamers from all over the world as they discuss your weekly recap of gaming news, TCG updates, whats happening in the world of board games, and upcoming game releases. Hear about a plethora of gaming topics from speed-runs to personal experiences with games, to the hard hitting controversies with games and game companies. Wrap it up with some listener interaction that you can be apart of. It's always a good time in the Game Lounge!\nNew Episodes Every Monday. (unless he's on a monthly hiatus)",
        "language": "en",
        "author_name": "Tony Eriksen",
        "slug": "tonysgamelounge",
        "cover": "20210617_061853_2bd3ff0b5e3617feebef3cb74ae410b8.jpg"
    },
    {
        "podcast_id": 8241,
        "title": "SatNuts, the Podcast",
        "description": "Who are the SatNuts?  \nSatNuts are the rich characters from the Space & SATCOM industry. \nSatNuts, the Podcast casually discusses satellite technology, space exploration, Broadband Internet to anywhere and High-Tech from everywhere.  \nHosted by Drew Klein.\t\t\t\t\t\t\t\t\t\t\t",
        "language": "en",
        "author_name": "Drew Klein",
        "slug": "satnutspodcast",
        "cover": "20200519_131809_1d23c7c878e09906fb38fd7e2c44392a.jpeg"
    },
    {
        "podcast_id": 8364,
        "title": "The G2 on 5G Podcast by Moor Insights & Strategy",
        "description": "A 5G podcast about the latest inside info on what's going on in the 5G industry by two of the 5G industry's leading analysts, Anshel Sag and Will Townsend.",
        "language": "en",
        "author_name": "Anshel Sag and Will Townsend",
        "slug": "g2on5g",
        "cover": "20200702_055010_645a79149e9a42aa48cc2b7afae95ecb.jpg"
    },
    {
        "podcast_id": 9999,
        "title": "CASE Studies - an automotive technology podcast",
        "description": "A CASE-technologies podcast for automotive OEMs and suppliers, presented by SBD.  \n\nStay up-to-date on connected cars, autonomous technology, shared mobility and electric vehicles.\n\nwww.sbdautomotive.com",
        "language": "en",
        "author_name": "SBD Automotive",
        "slug": "sbd",
        "cover": "20200625_115339_50349acd5d958b270550e25bdb6b214c.jpeg"
    },
    {
        "podcast_id": 10202,
        "title": "Top Shelf Tech",
        "description": "Providing industry insights and expert commentary to kiwi businesses and suppliers with market leaders in tech and beyond.",
        "language": "en",
        "author_name": "The Instillery",
        "slug": "topshelftech",
        "cover": "20200728_014011_264abe9f8fb153e0930aeb48cc0cf28c.jpg"
    },
    {
        "podcast_id": 11272,
        "title": "Gaming Talk",
        "description": "Turbe videoludiche di Valerio Graglia a.k.a. Merendina, per The Gaming Closet.\n\nInformazione, approfondimenti, critica videoludica. Per ora. Seguici su YouTube, Twitch, Instagram, Twitter e TikTok!",
        "language": "it",
        "author_name": "Merendina",
        "slug": "gamingcloset",
        "cover": "20210831_153047_9f73f9820c654db8d840d8d8d22bebd4.jpg"
    },
    {
        "podcast_id": 11467,
        "title": "Partners in Digital Health",
        "description": "Partners in Digital Health (PDH) is a forward-reaching media and communications company, catalyzing strategic thoughts-leaders, and new era thinkers that champion the acceleration of healthcare transformation. The portfolio converges leading academics, pragmatic innovators, and practitioners around the globe to assist in the acceleration of healthcare transformation, and better outcomes for health consumers presenting evidence based fact. PDH continuously pushes the boundaries of technology innovation in scholarly publication and ecosystem practices to bring trust, transparency, and truth to its audience, publishing the peer review journals Blockchain in Healthcare Today and Telehealth and Medicine Today.",
        "language": "en",
        "author_name": "Tory Cenaj",
        "slug": "partnersindigitalhealth",
        "cover": "20220420_050405_d5788f5d9cfcf636af688c2570e86f81.jpg"
    },
    {
        "podcast_id": 11725,
        "title": "All Night Gamers Podcast",
        "description": "Welcome to the All Night Gamers Podcast! We are a group of Nintendo loving Gamers and just wanted a place to talk and discuss things going on in the world of Videogaming! We will cover weekly news, including rumors and announcements, as well as some more personal things, such as our currently playing games and any recent collector pickups! We will post weekly podcasts on Wednesday at 7AM CST. Find us where ever you listen to your podcasts. ",
        "language": "en",
        "author_name": "Grant Darling",
        "slug": "angcast",
        "cover": "20200825_214717_14baf77a32c372c7e5e53bcac1e07226.jpg"
    },
    {
        "podcast_id": 11807,
        "title": "Solv-podden",
        "description": "En podkast hvor vi prater med kule mennesker vi møter i hverdagen, både kunder og ansatte, om tema som vi synes er spennende, alt fra teknologi til personlighetsprofiler. Av selskapet Solv med Kristina Renberg og Stephan Wetaas. ",
        "language": "nb",
        "author_name": "Solv",
        "slug": "solv-podden",
        "cover": "20200828_075430_ecf4fe73f48bdcf7188b81c147f40a27.jpg"
    },
    {
        "podcast_id": 12108,
        "title": "Desktops in the Cloud",
        "description": "“Your new TechTalk with people from Microsoft Engineering and the world-wide virtual desktop community!” Website: www.desktopsinthecloud.com Twitter: @desktopscloud",
        "language": "en",
        "author_name": "Christiaan Brinkhoff and Dean Cefola",
        "slug": "desktops-in-the-cloud",
        "cover": "20200906_132702_50bee90207aa2aa3da7548e0fb05925d.jpg"
    },
    {
        "podcast_id": 13448,
        "title": "BPA UNIVERSITY PODCAST",
        "description": "BPA Worldwide, the global provider of assurance, brings you BPA UNIVERSITY podcasts, a collection of interviews and Q&As with media industry experts on a variety of topics that are important to you. Check them out and let us know what you think.",
        "language": "en",
        "author_name": "Glenn Hansen",
        "slug": "bpauniversity",
        "cover": "20201014_153218_f1db244d11756390804f814231d73e75.jpg"
    },
    {
        "podcast_id": 13486,
        "title": "CoinCash Hodler Magazin  ",
        "description": "A CoinCash Hodler Magazin úgy épül fel, hogy megkapj minden hasznos információt, amit egy kripto piacon jártas befektetőnek kell. A bitcoin árfolyamot, macro elemzést, az elmúlt időszak legfontosabb projektjeit és témáit, a magyar kriptoközösség legismertebb szakértőivel hozzuk el neked. 📈 \n\n",
        "language": "hu",
        "author_name": "CoinCash",
        "slug": "coincashweekly",
        "cover": "20220918_120952_872eb30096bfb5ee2743a99d385446ba.jpg"
    },
    {
        "podcast_id": 14144,
        "title": "The Road We Travel",
        "description": "The Road We Travel, presented by DRIVE SMART Virginia, is an interview-format podcast focused on driver behavior, traffic laws, and emerging transportation technology. Email topic suggestions to info@drivesmartva.org. The opinions of the guests are their own and do not necessarily reflect those of DRIVE SMART Virginia or its board or employees. ",
        "language": "en",
        "author_name": "DRIVE SMART Virginia",
        "slug": "drivesmartva",
        "cover": "20201102_005030_bff9ea54891372fca56548ab01adc89a.jpg"
    },
    {
        "podcast_id": 15282,
        "title": "Mystify",
        "description": "This is a podcast about anything and everything. Virtual Reality will certainly come up as a topic more than once. If you are interested in listening to some hardcore conversations go down, come join us.",
        "language": "en",
        "author_name": "TheMysticle",
        "slug": "mystify",
        "cover": "20201123_102645_f8b24aecb4da7b27276f122a6c668ee6.jpg"
    },
    {
        "podcast_id": 15391,
        "title": "Brand Safety Exchange",
        "description": "Hear unique perspectives from experts and leaders within the world of brand and user safety. Brand Safety Exchange is hosted by Oasis Consortium, a think tank to unite stakeholders and create actionable, measurable standards for the protection of online brand safety.  Each episode contains a deep discussion into a specific topic, providing listeners with valuable insight into the evolving problems, solutions, and market forces that influence brand and user safety every day.",
        "language": "en",
        "author_name": "Oasis Consortium",
        "slug": "brandsafetyexchange",
        "cover": "20201124_034946_de131715690d03822b7963690f27bb9f.jpg"
    },
    {
        "podcast_id": 19337,
        "title": "The L0WL1F3 Podcast",
        "description": "<p>Dystopia? Check. Every episode is either about some fresh new hell that was probably predicted in a cyberpunk story, or some topic that could be viewed through a cyberpunk lens. Produced in affiliation with neondystopia.com</p>",
        "language": "en",
        "author_name": "Coinops, Scum, Xero, and Shadowlink",
        "slug": "l0wl1f3podcast",
        "cover": "20210330_171548_9439520657e79fa66643a77c8fd26b14.jpg"
    },
    {
        "podcast_id": 20017,
        "title": "The EcoCAR Podcast presented by AVTCs",
        "description": "The EcoCAR Podcast gives you a look under the hood of the EcoCAR Mobility Challenge - the latest U.S. Department of Energy Advanced Vehicle Technology Competition series. \n\nStay up to date with the competition, sponsors, industry news and much more with host, Lucas Shoults, and an array of special guests and moderators. \n\nBe sure to follow us on socials at @ecocarchallenge and learn more at https://avtcseries.org/",
        "language": "en",
        "author_name": "EcoCAR Mobility Challenge",
        "slug": "avtcpodcast",
        "cover": "20210128_221637_7a4fa89e3bbbc390a75e337312ec0810.jpg"
    },
    {
        "podcast_id": 20578,
        "title": "Spacepodden",
        "description": "Spacepodden - romsnakk i sofakroken. \n\nEn podcast laget av Space NTNU som er en student-dreven paraplyorganisasjon for space-relaterte aktiviteter på NTNU. Her snakker vi om interessante romrelaterte temaer og selskaper, gjør dem lett tilgjengelig, lett å lytte til og lett å forstå. Vi nevner også det vi selv driver med, det som skjer med våre medlemsorganisasjoner og våre sponsorer. \n",
        "language": "nb",
        "author_name": "Space NTNU",
        "slug": "spacepodden",
        "cover": "20220322_100343_7e33d7cbc55f2f8924f0b539c779408b.jpg"
    },
    {
        "podcast_id": 24921,
        "title": "TexTalk.news: The BBS and Textmode Computing News Show",
        "description": "The premier news radio show about the BBS scene and textmode computing",
        "language": "en",
        "author_name": "PHATstar Society",
        "slug": "textalknews",
        "cover": "20210116_213555_62be4ace59a6697caafa549183718ae7.jpg"
    },
    {
        "podcast_id": 27568,
        "title": "SiGMA Spotify",
        "description": "SiGMA Spotify brings you all of our most engaging interviews in an easy-to-listen to format. Whether you are driving, working, walking or relaxing, the SiGMA podcast will bring you the most engaging interviews with the best of the best in the industry. Our podcast stream covers interviews from Executive Interviews, iGaming, Block Chain, Crypto, Deep Tech and Med Tech from all around the world. ",
        "language": "en",
        "author_name": "SiGMA Group",
        "slug": "sigma",
        "cover": "20210126_123653_a9425b88677e419be620b8aaf4c8cf75.jpg"
    },
    {
        "podcast_id": 31003,
        "title": "Simplify Complexity",
        "description": "This podcast explores technology, business and people.",
        "language": "en",
        "author_name": "DTP Group",
        "slug": "dtpgroup",
        "cover": "20210520_103825_2064a7f38d9ef130114f5a700ae00252.jpg"
    },
    {
        "podcast_id": 32402,
        "title": "The Future is Ow ",
        "description": "A show where we tug at the the tangled tendrils of technology, politics, the internet, and the future of Having Fun on the Computer. Techno-optimists need not apply, unless you mean the Detroit kind. ",
        "language": "en",
        "author_name": "The Future Is Ow ",
        "slug": "thefutureisow",
        "cover": "20220125_010122_120c44049f26e9845baf345bee46a3d7.jpg"
    },
    {
        "podcast_id": 32484,
        "title": "Crypto Ulagam - கிரிப்டோ உலகம் ",
        "description": "A native tamil channel with all pros and cons of blockchain, crypto world to give elegant layman explanations for every tamil people to understand what Crypto is, what block chain is, how to be safe in crypto space, dangers, good way of trading and to embrace a new revolution and landscape.\n\nLogo cover Courtsey: Rishi.",
        "language": "en",
        "author_name": "JVR",
        "slug": "jvrtalks",
        "cover": "20210216_025035_e43dfaf1e8ed5a3e5e4c1606d84ecc23.jpg"
    },
    {
        "podcast_id": 41473,
        "title": "Clockwork Cantina Podcast",
        "description": "Hosted By DTIII and Josh902 we do this as a live recording on twitch, we talk about all the video gaming, movie, and television news for the week as well as what we have been up to. We try to pick the main topic for each episode such as a movie to review or some of our favorite heroes and villains. We are also big into Dungeons and Dragons and this also gets discussed quite a bit.",
        "language": "en",
        "author_name": "Josh902",
        "slug": "clockworkcantinapodcast",
        "cover": "20210314_201832_8a42aa56dbfeefd2eb070d3ab5f052f9.jpg"
    },
    {
        "podcast_id": 46909,
        "title": "Digital Marketing Intelligence for Shopify: Ask the Experts ",
        "description": "Produced and published bi-weekly by NGAGGE, the world's easiest to use, full-featured, completely automated SMS  list building, sales and support tools for Shopify, complete with bots. \n\nThis podcast interviews experts who answer questions from e-commerce store owners and Shopify Partners like you in real time providing actionable insights, strategies, news and trends in the complex and ever changing world of e-commerce digital marketing.",
        "language": "en",
        "author_name": "NGAGGE",
        "slug": "digital-marketing-intelligence",
        "cover": "20210405_085123_70f99ab4b32603e1b3cac94f3a2b136c.jpg"
    },
    {
        "podcast_id": 48009,
        "title": "The Digital Forester",
        "description": "Foresters that have embraced digital technologies to transform the business of forestry share their experiences and lessons learned in this podcast.",
        "language": "en",
        "author_name": "Kevin Lim",
        "slug": "thedigitalforester",
        "cover": "20210419_023352_f458ccf699b79b8365e1730e975960e7.jpg"
    },
    {
        "podcast_id": 48796,
        "title": "Digital Gastronomy Talks",
        "description": "Digital Gastronomy Talks, nace con la vocación de difundir contenidos relacionados con nuevos desarrollos tecnológicos orientados al sector HORECA. \n\nDesde LABe Digital Gastronomy Lab, identificamos constantemente soluciones tecnológicas que emergen y se adaptan en respuesta a los problemas inmediatos que pueden tener gestores y operarios en el sector. Sin embargo, pueden haber muchas opciones y poco tiempo para poder analizar sus funcionalidades y potenciales ventajas con calma. Digital Gastronomy Talks, es un espacio para dar visibilidad a los proveedores de nuevas soluciones tecnológicas y al mismo tiempo, conectar con una audiencia interesada que pueda generar un debate en torno a las mismas. \n\nPara ello en cada sesión se busca invitar a uno o más expertos en diferentes materias para contar sus experiencias bajo una temática en concreto. Se trata de webinars de una duración promedio de una hora, en la cual se alternan ponentes, se realizan preguntas a los invitados, así como las que pueda tener la audiencia a través del chat. \n",
        "language": "es",
        "author_name": "LABe Digital Gastronomy Lab",
        "slug": "digitalgastronomytalks",
        "cover": "20210412_144246_87353620407f9b70fcb17f4d02d8a44a.jpg"
    },
    {
        "podcast_id": 53093,
        "title": "Responsible Tech Podcast",
        "description": "Ka Wing Falkena en Joas van Ham bespreken iedere maand de meest interessante onderwerpen uit de wereld van technologie, data en privacy. Dit doen zij samen met hun Considerati-collega's en met aansprekende gasten. Vanwege de uiteenlopende expertises die we hebben bij Considerati bespreken we deze actualiteiten vanuit een juridisch, ethisch, politiek en sociaal-maatschappelijk perspectief. ",
        "language": "nl",
        "author_name": "Considerati",
        "slug": "rtpodcast",
        "cover": "20210505_055218_3edd7e44f45c32c1b49133af73e1c439.jpg"
    },
    {
        "podcast_id": 53346,
        "title": "Moor XR Podcast - A Moor Insights & Strategy Podcast",
        "description": "The Moor XR Podcast is a podcast that looks to inform people about the latest technologies and developments happening in AR, VR, the Metaverse and more! The Moor XR Podcast will also periodically have industry leaders to explain the latest technologies and is hosted by Moor Insights & Strategy's Senior Analyst, Anshel Sag.",
        "language": "en",
        "author_name": "Anshel Sag",
        "slug": "moorxr",
        "cover": "20210503_011533_ac5944ef78d9d1ea2f83e139703ebd56.jpg"
    },
    {
        "podcast_id": 54337,
        "title": "Insights from the Shed - Marketing, Digital & Design Podcast",
        "description": "Marketing, design & digital podcast from ads creative solutions, a full service marketing agency based in Oxford. ",
        "language": "en",
        "author_name": "ads creative solutions",
        "slug": "adscreativesolutions",
        "cover": "20210504_160527_475736a87e7cceb4150fb1d12a59c718.jpg"
    },
    {
        "podcast_id": 55066,
        "title": "Azure Security Podcast - Spanish",
        "description": "Podcast mensual dedicado a temas relacionados con la Seguridad, Cumplimiento e Identitdad en Microsoft Azure, presentado por expertos de ciberseguridad de Microsoft David Sanchez Rodriguez, Gladys Rodriguez, Javier Soriano y Marcelo di Iorio. Presentaremos contenido tecnico como las ultimas novedades de ciberseguridad en Azure, casos de uso, mejores practicas y experiencia en proyectos reales https://azsecuritypodcast.net/es",
        "language": "es",
        "author_name": "David Sanchez Rodriguez",
        "slug": "azuresecpodcastspanish",
        "cover": "20210527_155503_d59940f8b9014917ef020598702bfe4c.jpg"
    },
    {
        "podcast_id": 55874,
        "title": "Good Morning Tarkov - NoiceGuy Tarkov",
        "description": "The full recording of the morning streams where I hang out with you guys to discuss anything and everything Escape from Tarkov.",
        "language": "en",
        "author_name": "Nolan \"NoiceGuy\"",
        "slug": "goodmorningtarkov",
        "cover": "20210510_213908_d7e96f8ac4200ae2c32e252bc445c23d.jpg"
    },
    {
        "podcast_id": 57667,
        "title": "Ritchie Bros. Inside Edge",
        "description": "If your business involves heavy equipment and trucks, don’t miss our Inside Edge podcasts. You’ll get the inside scoop from industry experts and influencers about equipment trends, pricing, demand & macro trends impacting the construction, transportation & farming industries. Hosted by Ritchie Bros., a global leader in heavy equipment & truck management and disposition.",
        "language": "en",
        "author_name": "Ritchie Bros.",
        "slug": "ritchiebrosinsideedge",
        "cover": "20220906_020935_4fda7782df9df9f6870c170b9edbaa70.jpg"
    },
    {
        "podcast_id": 58066,
        "title": "Drink Hub",
        "description": "<p>Three longtime friends discussing current events, personal stories and hot topics while having a drink.</p>",
        "language": "en",
        "author_name": "On The Rocks",
        "slug": "ontherockspc",
        "cover": "20230417_120437_a82b55b4bf44cf39569746ce4542281d.jpg"
    },
    {
        "podcast_id": 58401,
        "title": "Cheeky Crypto ",
        "description": "Cheeky Crypto \n\nCrypto audio stream looking at the latest crypto news and see what has been happening in the Crypto space.\n\nWe are NOT financial advisers. None of what we have communicated verbally or in writing here should be considered as financial advice; it is NOT. Do your own research before investing in any digital asset, and understand that investing in any crypto is risky. If you do, you need to be prepared to lose your entire investment.\n\n⚠ This video is for information / entertainment purposes only ⚠\nAll our videos are strictly personal opinions. Please make sure to do your own research and never take our opinions for financial guidance. There are multiple strategies and not all strategies fit all people. Our videos ARE NOT financial advice.",
        "language": "en",
        "author_name": "Cheeky Crypto",
        "slug": "cheekycryptovol1",
        "cover": "20220610_090632_a3a75f814321c1308ca4133242ef0dc2.jpg"
    },
    {
        "podcast_id": 61825,
        "title": "The Tech Tidbits Podcast",
        "description": "An exploration of the most cutting-edge applications of technology spanning Artificial Intelligence, Quantum Computing, AR/VR and more in engaging, insightful conversations with industry professionals. Hosted by John Cameron. Cover art by Cindy Wen.",
        "language": "en",
        "author_name": "John Cameron",
        "slug": "techtidbits",
        "cover": "20220724_010720_9ca954686b247cb8eec0a20dbb1f124b.jpg"
    },
    {
        "podcast_id": 63353,
        "title": "Le Sketch Podcast",
        "description": "Podcast sur le marketing, les outils technologiques et les stratégies numériques afin de démystifier le Web et de profiter pleinement des opportunités qu'il offre aux entrepreneurs! Avec Jean-François Goulet de GoGoulet et Michel Bouchard de REmédia.",
        "language": "fr",
        "author_name": "Michel Bouchard",
        "slug": "le-sketch",
        "cover": "20210812_152446_aa76ebba68f93fd32bf90293ab3e7454.jpg"
    },
    {
        "podcast_id": 64929,
        "title": "The Perfect Storm",
        "description": "In this bi-weekly podcast for business executives and information security professionals, industry veterans Michael Markulec and Matthew Webster chat with guests about the latest cyber news, threats, and trends impacting small and medium businesses.\n\nHarbor’s proactive rather than reactive solutions help our clients develop the cybersecurity program necessary to take their organization to the next level. Harbor's innovative processes are based on industry-standard frameworks that are tailored to meet the needs of small and medium-sized businesses.",
        "language": "en",
        "author_name": "Michael Markulec and Matthew Webster",
        "slug": "harbortg",
        "cover": "20210625_154943_d27f6c8100c50d8c0daf58b71b299a3f.jpg"
    },
    {
        "podcast_id": 64997,
        "title": "LabTalks: The Non-Fungible Podcast",
        "description": "Introducing the new and improved (formally #WeAreAlkimists) LabTalks: The Non-Fungible Podcast!\n\nWe have had a total revamp to bring you regular new and exciting content that stretches from the world of Web3 and absolutely everything to do with advertising. We will be hosting special guests, our traditional founder's questions, educational content and so much more... \n\nBad ads broke the internet - Fix the internet with $ADS\n",
        "language": "en",
        "author_name": "Alkimi Exchange",
        "slug": "wearealkimists",
        "cover": "20221027_121059_05d4b61915d8a5881a752aad0e7c711b.jpg"
    },
    {
        "podcast_id": 65337,
        "title": "ShuttlePod Cast // Space and Astronomy",
        "description": "Follow along with Nic and Echo as they share their love for astronomy and all things space-y! On this podcast, you will find space facts, astronomy news, and general banter about space-esque topics.",
        "language": "en",
        "author_name": "Nic and Echo",
        "slug": "shuttlepodcast",
        "cover": "20210628_020050_2ea589e9ac36ab33d6647790be36a52f.jpg"
    },
    {
        "podcast_id": 65348,
        "title": "Sound of Imagery",
        "description": "Sound of Imagery ignites a weekly conversation on photography and videography tech with a smattering of news. Join Leigh Diprose, Lee Herbet and Greg Cromie as they share their unscripted viewpoints on the industry with a hint of merriment.",
        "language": "en",
        "author_name": "Leigh Diprose",
        "slug": "soundofimagery",
        "cover": "20210628_033941_e4b4c5a0ac677470799fc9bbcf95756b.jpg"
    },
    {
        "podcast_id": 66595,
        "title": "RubiCast",
        "description": "Podcasts van onze Microsoft cloud specialisten. Over onze passie voor digitaal innoveren en de nieuwste cloud technologieën. ​",
        "language": "nl",
        "author_name": "Rubicon Microsoft Cloud Experts",
        "slug": "rubicast",
        "cover": "20210705_143124_e204e539c6eb93ecd0c45dda439ba28b.jpg"
    },
    {
        "podcast_id": 69031,
        "title": "ASCM NYC-LI presents Supply Chain Briefs -  with Joseph Moretta",
        "description": "ASCM NYC LI Podcaster, Joe Moretta, interviews Supply Chain professionals on current news and views in the current world of Supply Chain Management as it pertains to the business world around us - risks, challenges and along with technological changes that are making this world move bigger, better and faster. ",
        "language": "en",
        "author_name": "Joseph Moretta",
        "slug": "nycli-ascm-supply-chain-briefs",
        "cover": "20211007_194017_e8d048809d8b3a0fd995628bca0af9cc.jpg"
    },
    {
        "podcast_id": 71356,
        "title": "The Tech Podcast",
        "description": "Bringing Tech into everyday conversations",
        "language": "en",
        "author_name": "Lydia Igoche",
        "slug": "thetechpodcast",
        "cover": "20211030_224946_b1ddfe22af31e8e547049934850e0382.jpg"
    },
    {
        "podcast_id": 71966,
        "title": "Tuesday Talks",
        "description": "<p>Join Numeracle's Rebekah Johnson, Founder &amp; CEO, Anis Jaffer, Chief Product Officer, Pierce Gorman, Distinguished Member of Numeracle's Technical Staff, and new regular host, Numeracle's VP of Trust Solutions, Sarah Delphey, as we bring you the highest level of expertise and innovation in the communications industry.</p><p>Season 3 is all about IDENTITY— building, managing, and protecting it. Our expert hosts are joined by leaders and trailblazers who all have their fingers on the pulse of the industry to bring you the latest insights and trends. </p><p>Numeracle provides actionable solutions for legal call originators to improve contact rates and restore trust in customer communications. Join us live, or listen on the go.</p>",
        "language": "en",
        "author_name": "Numeracle",
        "slug": "tuesday-talks-podcast-with-numeracle",
        "cover": "20210805_161019_f8ff4c03c09b5c3452d2ea3de745c21b.jpg"
    },
    {
        "podcast_id": 71974,
        "title": "Pabs & Charles Talk Design",
        "description": "It's Pablo Stanley & Charles Patterson talking about design with their friends (you!)",
        "language": "en",
        "author_name": "Pabs & Charles Talk Design",
        "slug": "talkdesign",
        "cover": "20210805_165002_3d285450ee6ee90caa0e4755244b94a2.jpg"
    },
    {
        "podcast_id": 73769,
        "title": "DevOps Diversity Podcast",
        "description": "The DevOps Diversity Podcast is the all-inclusive place to talk people, process and technology for enterprise transformation and modernization. Hosted by Conor Delanbanque, CEO & Founder @ Strategio and Forbes 30 Under 30. \n\nStrategio is dedicated to improving diversity, equity and inclusion for underrepresented and underserved groups, within enterprise IT. ",
        "language": "en",
        "author_name": "Conor Delanbanque",
        "slug": "devopsdiversity",
        "cover": "20220307_060321_eca95f8728b0144aaabe8fd10265534d.jpg"
    },
    {
        "podcast_id": 74228,
        "title": "BlockSec Journal",
        "description": "Talks with Guest about Blockchain related Breaches and how to Secure the Eco-System",
        "language": "en",
        "author_name": "Laurent Strauss",
        "slug": "secureblocksdiaries",
        "cover": "20211114_220003_7c09f97d5be04c68d2597f7314d5a25d.jpg"
    },
    {
        "podcast_id": 74760,
        "title": "The Novum Insightful",
        "description": "Join Toby Lewis - CEO of Novum Insights in discussion with industry leaders for a deep-dive into the world of DeFi. ",
        "language": "en",
        "author_name": "Novum Insights",
        "slug": "thenovuminsightful",
        "cover": "20210826_190908_f45059515dd41fa97b5b1c96cf7f0552.jpg"
    },
    {
        "podcast_id": 77786,
        "title": "The Qubit Guy's Podcast",
        "description": "The Qubit Guy (Yuval Boger) hosts thought leaders in quantum computing to discuss business and technical questions that impact the quantum computing ecosystem.",
        "language": "en",
        "author_name": "Yuval Boger",
        "slug": "qubit",
        "cover": "20210906_214813_d13b15e3fec57fbcc6e1546e711d14a5.jpg"
    },
    {
        "podcast_id": 78675,
        "title": "DigiBeter",
        "description": "Digibeter is de podcast die kennis en actualiteit samenbrengt om jouw digitale vaardigheden en kennis te verbreden. Zo worden we samen allemaal digitaal. \niKennis, iVaardigheid, iVakmanschap, allemaaldigitaal",
        "language": "nl",
        "author_name": "Jurriaan Raaijmakers",
        "slug": "digibeter",
        "cover": "20210928_081148_8c57c6a7ca8f34a5907be4babab2115e.jpg"
    },
    {
        "podcast_id": 78999,
        "title": "Coin Talk with Crypto Slim, Wallz & Tee Crypto",
        "description": "We talk Bitcoin, cryptocurrencies and current events surrounding businesses, athletes & artists in the cryptocurrency community.\n\nWE DO NOT GIVE FINANCIAL ADVICE.\nDO YOUR OWN RESEARCH (DYOR)\nHOLD YOUR OWN KEYS (HYOK)\n\n",
        "language": "en",
        "author_name": "Crypto Slim, Wallz & Tee Crypto",
        "slug": "cointalk",
        "cover": "20210915_020442_a26b7d2aae7c0de1beb7392d5830ab4b.jpg"
    },
    {
        "podcast_id": 80756,
        "title": "Civic Sparks with Brent Messer",
        "description": "Join Brent Messer and his guests as they dig into the core topics in civic advancement with deep conversations and interviews with civic leaders from all over the world on all things civic tech and civic advancement.",
        "language": "en",
        "author_name": "Brent Messer",
        "slug": "civicsparks",
        "cover": "20210922_054252_c5d628136c029a1ea9d8cdc2a9e9d5c0.jpg"
    },
    {
        "podcast_id": 82365,
        "title": "Nickel For Your Thoughts",
        "description": "AMPS Entertainment brings you Nickel For Your Thoughts podcast. A show of four guys just trying to figure things out as they navigate through life! Join Anthony, Mike, Pat, and Sourav every week! \nFollow us on Instagram @NFYT_pod",
        "language": "en",
        "author_name": "Mike, Anthony, Patrick, and Sourav",
        "slug": "nfyt",
        "cover": "20220805_120819_98165acb0a0c11bf41f5566bf4c85128.jpg"
    },
    {
        "podcast_id": 83172,
        "title": "Coltech's Tech Leader Series",
        "description": "Every week Patrick Waites, Director and Co-founder of Coltech Global, will interview a successful leader within the tech industry and ask them to provide the Coltech community with insights, information and advice needed to grow and thrive within the tech industry.\n\nOur ATL shines a light on the latest trends in the market. The ATL looks to be a unifying voice of technology and will speak to some of the main thought leaders from enterprise organizations to tech start-ups.",
        "language": "en",
        "author_name": "Coltech Global",
        "slug": "coltechatl",
        "cover": "20211004_082227_1cc7a6d75c20db74904397810eb9e1b3.jpg"
    },
    {
        "podcast_id": 83833,
        "title": "Disrupting PFAS",
        "description": "The Disrupting PFAS Podcast highlights cutting-edge PFAS innovations and innovators in a compact, digestible, and entertaining format for Environmental Managers and Technologists responsible for confronting the intractable problem of PFAS. ",
        "language": "en",
        "author_name": "Woodard & Curran",
        "slug": "disrupting-pfas",
        "cover": "20220503_060516_b64b036b0cc3ee594ce83717edeeef27.jpg"
    },
    {
        "podcast_id": 85730,
        "title": "Gen Z Speaks ",
        "description": "Informative and engaging conversations on business, technology and politics from a Gen Z perspective.\n\n",
        "language": "en",
        "author_name": "Ibrahim Ahmed, Matthew Gutierrez, Jenish Thanki",
        "slug": "genzspeakspodcast",
        "cover": "20211018_064714_964c606c000bd555d327deb2f3f23d90.jpg"
    },
    {
        "podcast_id": 86930,
        "title": "Keeping You In the Know on Technology's Newest Manifestations ",
        "description": "Siddhant Vyas, Devco Industrial Fund's Junior Analyst, walks you through what's coming down the crypto, emerging tech, AI, pipeline. Taking an easy, laid back approach he makes complex and innovative concepts understandable and allows you to make your own predictions on what the future will hold. ",
        "language": "en",
        "author_name": "Siddhant Vyas",
        "slug": "devcoindustrialfund",
        "cover": "20211026_014947_00a8fd588a0d334856fdb249b01f9b5c.jpg"
    },
    {
        "podcast_id": 87789,
        "title": "UNYQ",
        "description": "Welcome to the UNYQ podcast! In this series, we will be having conversations with inspiring human beings about their amputee journeys, body image, mental health and the prosthetic industry. We hope to encourage, educate, make you laugh, and open you up to new reflections. Grab a cup, and join in on these thought-provoking, open conversations. ",
        "language": "en",
        "author_name": "Eythor Bender",
        "slug": "unyq",
        "cover": "20220408_120413_9d78144db299d4888420408cf4825270.jpg"
    },
    {
        "podcast_id": 88246,
        "title": "MORNING SHOW CRYPTO 357",
        "description": "<p>Aqui você encontra as notícias mais relevantes do mercado de criptoativos de forma prática! Trazemos tudo sobre Bitcoin, Ethereum, Solana entre outras moedas, para que você comece seu dia informado e preparado para grandes lucros!</p>",
        "language": "pt-br",
        "author_name": "Crypto 357",
        "slug": "sb-morning-call",
        "cover": "20230623_070626_1a1e09ce9e190ec0ceeda6148e2a571d.jpg"
    },
    {
        "podcast_id": 88302,
        "title": "69.420 FM",
        "description": "Where Shion and Antzzz wont stop talking :>",
        "language": "en",
        "author_name": "Shion",
        "slug": "69420fm",
        "cover": "20211101_235358_6bd8ccafa38c1b6d42c3b1f204094eda.jpg"
    },
    {
        "podcast_id": 89668,
        "title": "ACCESS AI",
        "description": "ACCESS AI is a podcast brought to you by Arabesque AI. Hosted by Head of Business Development, Lloyd Reynolds, the podcast explores all aspects of Artificial Intelligence across financial institutions, focusing particularly around asset management, wealth management, and investment banking. \n\nACCESS is an acronym for the key ways in which AI is empowering financial institutions. AI is Active, Customisable, Cost-Efficient, Scalable & Sustainable. \n\nFind out more about Arabesque AI and AutoCIO, our AI-powered investment strategy platform, here: https://www.arabesque.com/ai/",
        "language": "en",
        "author_name": "Arabesque AI",
        "slug": "arabesque-access-ai",
        "cover": "20211109_104020_981912a4620e2b58cac2796d83d8d00f.jpg"
    },
    {
        "podcast_id": 91028,
        "title": "Snyder & Friends",
        "description": "From the Woods and Water to the Mountains yonder, a podcast of personal stories, unscripted and natural in conversation.  We meet people and talk about what makes us tick.  Subjects could range but not limited to, fishing, hunting, water conservation, sustainable living, real estate, human condition, music, crypto, smoking meat & cooking. 100% Original music. \n",
        "language": "en",
        "author_name": "Christopher Snyder",
        "slug": "snyder",
        "cover": "20211117_024348_5f1a2352fb7df3a5f90f4899a428c1c2.jpg"
    },
    {
        "podcast_id": 92103,
        "title": "5G Techritory Podcast",
        "description": "<p>Uncovering the real value of 5G. The 5G Techritory podcast is an audio-only look-back at the most interesting discussions and presentations from the 5G Techritory forum. 5G Techritory 2023 gathered the leading decision makers and trendsetters to uncover the real value of 5G and share their knowledge for joint growth. Together they answered questions like: Consumer 5G - where is the money? Testbeds and trials - did we learn something? Cross sector standards - are they happening? Funding for 5G - how to get it?</p>",
        "language": "en",
        "author_name": "5G Techritory",
        "slug": "5gtechritory",
        "cover": "20211123_111150_780fc35e696d598befa96e612f045ba5.jpg"
    },
    {
        "podcast_id": 92231,
        "title": "The Estatn' Podcast ",
        "description": "The Estatn' Podcast is a weekly discussion between 2 former NCAA Division II athletes that have no filter on their college experiences & current trending topics. ",
        "language": "en",
        "author_name": "Glen Gibbons & Tre Hendon ",
        "slug": "the-estatn-podcast",
        "cover": "20211124_031152_81d361af0d9ae5178c2f1cc3bf4a0330.jpg"
    },
    {
        "podcast_id": 92799,
        "title": "Planet of the Klimates",
        "description": "POTK is the official podcast for KlimaDAO.\n\nKlimaDAO is blockchain protocol backed by carbon credits that gives people a chance to fight climate change as a collective. \n\nTune in the hear the latest news and insight regarding blockchain technology and climate science!",
        "language": "en",
        "author_name": "KlimaDAO",
        "slug": "potk",
        "cover": "20220212_060254_0aa21fd292c3156a3b3189c9db007ac0.jpg"
    },
    {
        "podcast_id": 93152,
        "title": "Superseed Ventures Podcast",
        "description": "Superseed Ventures is a VC fund and venture studio focused on investing, scaling and building trade tech startups. In this podcast, Superseed interviews TradeTech founders and industry players to unpack the future of how trades businesses will  work and live. Superseed partners with the Reece Group, an ASX listed plumbing, hvac and waterworks distributer based in Australia, the United States and New Zealand. ",
        "language": "en",
        "author_name": "Superseed Ventures",
        "slug": "superseedventurespodcast",
        "cover": "20211129_101127_363d5f9f4fbac5fdf27b69369dd9c166.jpg"
    },
    {
        "podcast_id": 93531,
        "title": "Women In Technology Spotlight",
        "description": "A space where I talk to women working in IT across the spectrum of different roles.\nWe will discuss our career journey, visions, obstacles, roles, our views on the industry, what we love and why we are here to stay\n\n",
        "language": "en",
        "author_name": "Ronke Babajide",
        "slug": "witspotlight",
        "cover": "20211201_071208_5246b4058f4df7b3b68a65fe6603eb5e.jpg"
    },
    {
        "podcast_id": 93666,
        "title": "Crypto Bites - Crypto News, Tips, Education & More ..... in TINY bite size episodes",
        "description": "Crypto News, Tips, Education & More ..... in TINY bite size episodes\n\nEach episode we'll go over some lesser known terms or info about cryptocurrency. \nThen we'll chat about the most recent crypto news.\nFinally we'll end the show with some hot coins to watch!",
        "language": "en",
        "author_name": "R3DRYNO",
        "slug": "cryptobites",
        "cover": "20211202_061216_8d1b19ee2703c330879920734634424b.jpg"
    },
    {
        "podcast_id": 95443,
        "title": "Testmens",
        "description": "TESTMENS van de veiligheidsdienst is een podcast in 5 delen, elke week een aflevering met het persoonlijke verhaal van een Nederlandse man die door  de veiligheidsdienst gebruikt wordt... om op te oefenen.  Dit verzin je niet.  Dit testmens is een proefkonijn die zonder zijn toestemming gebruikt wordt voor de  praktische oefeningen van aankomende agenten, en voor de ontwikkeling van een nieuwe techniek om te verhoren. Hoe kan je dat bewijzen? Zoveel toevalligheden, zoveel voorbeelden, dat het waar is. #ditverzinjeniet",
        "language": "nl",
        "author_name": "Mind You",
        "slug": "mind-you",
        "cover": "20221025_031056_032c807552faa064197be0cb1ca42d7a.jpg"
    },
    {
        "podcast_id": 98900,
        "title": "Gen Z's Digital Decalogue",
        "description": "<p>What have you noticed about the way social media shapes your identity? Has it affected your mental health? How do these algorithms work and do they also affect Big Tech? These are some of the questions we ask on this podcast. We center on digital wellness, ethical technology, and what the LookUp community is doing about it. Hosted by Shivani Murugapiran, and co-hosted by certified digital wellness educator, Kait Kovach.</p>",
        "language": "en",
        "author_name": "LookUp.Live",
        "slug": "genzdigital",
        "cover": "20230307_060321_090001c80ec8b5a5a92a181d94cc7f2a.jpg"
    },
    {
        "podcast_id": 99224,
        "title": "The Esports Report",
        "description": "The Esports Report is a podcast focusing on American High School Esports programs. The hosts, Ashley Hodge and Wil Nix, both started as Season 0 Esports coaches through the PlayVS Georgia Esports program. Wil Nix has experienced significant success with his program by winning the Georgia State Championship for Rocket League, and he serves on the GHSA Esports Board of Advisors. Ashley Hodge serves as a PlayVS Supercoach, A member of the GHSA Esports Board of Advisors, and a member of Riot’s Scholastic Association of America. She has created two successful esports programs in Georgia. Additionally, she is currently working on a esports dissertation. \n\n\nThe goal of this podcast is to educate admins, students, parents, schools, and society about esports in American high schools. Topics include the following: a history of esports in GA, how to start a program, how to fund a program, how to coach, how to manage social media accounts, how to grow your program, and much more. Furthermore, several interviews with GHSA, PlayVS, coaches, students, and players are planned for future episodes. \n\nPlease engage with us by leaving comments on the Youtube episodes, rating and reviewing us on Apple Podcast, and emailing us at theesportsreporths@gmail.com \n\nIf you are a business or potential sponsor, we would love to do promotions for you. Your contribution will help cover the cost of editing software used and other expenses to make this show possible. Please contact us for ad rates at our email listed above. \n\nWe hope you enjoy the show! \n\nLink:\n\nYoutube Link: https://www.youtube.com/channel/UCD72nq805ng_mWteExcbIpA\n\nApple ITunes Podcast:https://podcasts.apple.com/us/podcast/s1e1-the-history-of-georgia-esports/id1603735429?i=1000547152761\n\nSpotify Podcast: https://open.spotify.com/show/6tVaQnmLItIajC9QS5mBm6?fbclid=IwAR2Wrc6Xqq71yJMzrdqNDKLZ5JclWx5j4wV894dP40d-4Y4ZR8-loHzP9-8\n\nGoogle Play: Coming Soon\n\nFacebook Page:https://www.facebook.com/esportsreport/\n\n\nTwitter Page: https://twitter.com/TheesportsR\n\n",
        "language": "en",
        "author_name": "Ashley Hodge and Wil Nix",
        "slug": "theesportsreport",
        "cover": "20220107_010116_4dcb075f3cdb283dacff6a27aadfdda0.jpg"
    },
    {
        "podcast_id": 100309,
        "title": "Triple Confirmed",
        "description": "Your Number One Podcast for everything Bitcoin and Crypto.\n\nJoin the Community Discord: https://discord.gg/tripleconfirmation to listen to our sessions live and uncut.\n\n Think about joining an incredible community with one of the best crypto trading strategies, insights, and community-made indicators created for our strategies.\n\nCheck out our Website www.tripleconfirmation.com\nCheck out Our On-Chain Trading Bot       alpha.tripleconfirmation.com. \n\nDISCLAIMER: Neither tripleconfirmation.com nor its affiliates are registered financial advisors or licensed financial professionals. We will not offer any financial advice or claim to have professional financial insight. Materials posted on this Website or this server are for educational purposes only.",
        "language": "en",
        "author_name": "Crypto Yams",
        "slug": "cryptoyams",
        "cover": "20220918_030936_ea7d3c54fc18b1595aa3f1c18ab70478.jpg"
    },
    {
        "podcast_id": 101991,
        "title": "SCI Science Perspectives",
        "description": "The American Spinal Injury Association (ASIA) brings you SCI Science Perspectives. The podcast is built around two-part dialogues with spinal cord injury (SCI) professionals regarding their emerging scientific work spanning the full spectrum of SCI research, from discovery to clinical application. \n\nThe SCI Science Perspectives podcast disseminates the latest-and-greatest scientific work in the SCI field via a conversation with researchers that approaches their work from two perspectives: the “scholarly” perspective and the “community” perspective. The process begins with ASIA’s Committees informing the podcast about new and influential scientific papers relevant to the committee’s interests. Then the podcast host(s) then interview the author(s) of the papers, approaching their project from each perspective. Finally, the conversation from each perspective is published as its own episode type: \"Scholarly\" and \"Community\" episodes. Keep an eye out too for \"Admin\" episodes too, communicating administrative information relevant to ASIA members and stakeholders. ",
        "language": "en",
        "author_name": "American Spinal Injury Association",
        "slug": "sci-science-perspectives",
        "cover": "20220120_050113_cd3cbe0745b92c65642a427f8f9f6480.jpg"
    },
    {
        "podcast_id": 102345,
        "title": "Los Cracks del Reclutamiento con Eduardo Campos",
        "description": "Los Cracks del Reclutamiento es un podcast original presentado por Eduardo Campos, fundador y CEO de ScreenIT, Managing Director de WillDom y co-fundador de Collokio. \nEn cada episodio, Eduardo ofrece conocimientos y lecciones en tiempo real para un mundo de atracción de talento en constante cambio. Profundiza en las diferentes formas de atraer, reclutar y retener talento a través de la tecnología. Eduardo busca discutirlo todo, desde la experiencia del candidato hasta la incorporación, compartiendo tendencias, teorías probadas para conversarlas con cada uno de sus invitados.",
        "language": "es",
        "author_name": "Collok.io",
        "slug": "collokio-podcast",
        "cover": "20220125_030157_512a282bbec27d09dd1561a27efea922.jpg"
    },
    {
        "podcast_id": 103340,
        "title": "Qredo",
        "description": "Welcome! As well as information on Qredo’s radical new infrastructure for digital assets, you'll also find here panels, AMAs, and interviews on the wider trends shaping crypto investment and DeFI. ",
        "language": "en",
        "author_name": "Qredo",
        "slug": "qredo",
        "cover": "20220125_030138_f1c96485adf792ec7cb36a5bf79f965f.jpg"
    },
    {
        "podcast_id": 104208,
        "title": "GameList",
        "description": "<p>Join Jake and Kaulin as they chat about games, news, and anything surrounding the videogame industry!</p>",
        "language": "en",
        "author_name": "GameList",
        "slug": "gamelist",
        "cover": "20230825_080832_15d81832ea3340cec618ea2f632a6fba.jpg"
    },
    {
        "podcast_id": 104209,
        "title": "Micro Welding Tech",
        "description": "Listen to Sunstone Welders lead engineers, product managers, and micro welding consultants talk about new micro welding technologies and how it's helping people all over the world. Learn about new micro welding tech, micro welding customers, how to make money in micro welding and be the first to hear about new micro welding developments from Sunstone!",
        "language": "en",
        "author_name": "Sunstone Welders",
        "slug": "micro-welding-tech",
        "cover": "20220127_070143_23c474045dbdde19bc9f85026ce107a1.jpg"
    },
    {
        "podcast_id": 104507,
        "title": "Around The Dapper Sports Pod",
        "description": "The latest from NBA Top Shot and NFL All Day, by Dapper Labs. Bringing you information about the latest drops, best moments, and all the news/information you need to know from the NBA and NFL. Hell, I will even attempt to talk about UFC Strike?! Throw in some interviews and bam💥 you have yourself a podcast. What else could you ask for? Besides a cookie I guess? And no this podcast has no cookies.",
        "language": "en",
        "author_name": "Kai Glinsek",
        "slug": "aroundthedappersportspod",
        "cover": "20220128_080104_4b0b9bb6f386cf63eeb40b081571cbd4.jpg"
    },
    {
        "podcast_id": 104769,
        "title": "vCISO Live -  Cyber Security Hot Topipcs Podcast",
        "description": "Come and join us as we discuss the latest cyber security hot topics with renowned Cyber Security professionals from around the world. These podcasts provide insight on how to address the constantly growing threat landscape, protect our small businesses and meet the regulatory requirements. ",
        "language": "en",
        "author_name": "vCISO Cyber Security Hot Topipcs Podcast",
        "slug": "cybersecurity-stealthiss",
        "cover": "20220131_020150_00817295487ae29868f1546c66e92a50.jpg"
    },
    {
        "podcast_id": 105396,
        "title": "Podium Marketing Podcast by Izoard",
        "description": "<p>Le podcast marketing qui aide les PME à générer plus de business avec le digital.</p>",
        "language": "fr",
        "author_name": "Julien Delbauve",
        "slug": "podium-marketing-news",
        "cover": "20230629_110627_6506db490fc81e914e615380232f9976.jpg"
    },
    {
        "podcast_id": 105522,
        "title": "Fill-Finish Podcast",
        "description": "Fill-Finish Podcast, sponsored by ApiJect. With Industry media professional, Rizwan Chaudhrey, as host, the show shares expertise on all aspects of injectables, vaccines, and aseptic fill-finish. This podcast offers a season of 10 episodes focused on topics including facility design, regulatory, quality, supply chain management and AR/VR to name a few. ",
        "language": "en",
        "author_name": "Rizwan Chaudhrey",
        "slug": "fill-finish",
        "cover": "20220201_070209_a877e029ef6311159997ad5664766682.jpg"
    },
    {
        "podcast_id": 108525,
        "title": "The Young Buck & Old Goat Podcast ",
        "description": "Weekly Cryptocurrency and Digital Asset News and commentary.  Young Buck breaks down the technical analysis of the markets, what to expect in the coming weeks, and highlights potential high runner plays.  Old Goat provides macro market and news analysis affecting the market.  ",
        "language": "en",
        "author_name": "Young Buck & Old Goat",
        "slug": "youngbuckandoldgoat",
        "cover": "20220220_010215_fcbf22db80c9a0e02593d46d9d6a86a2.jpg"
    },
    {
        "podcast_id": 108654,
        "title": "La Historia es de todos",
        "description": "Podcast dedicado a contar las preciosas historias de este maravilloso pueblo y que gracias a dios me toco vivir y crecer en sus calles.",
        "language": "es",
        "author_name": "Julio Cesar",
        "slug": "transmisiones",
        "cover": "20230108_040132_73d6207f9d33d61520f3c8fbce396405.jpg"
    },
    {
        "podcast_id": 110332,
        "title": "IX Talks",
        "description": "Open discussions with active members of the IXP community, with whom we explore a wide range of topics related to Peering and the Internet at large. This podcast is brought to you by Euro-IX and AMS-IX.",
        "language": "en",
        "author_name": "Euro-IX & AMS-IX",
        "slug": "ix-talks",
        "cover": "20220221_120237_84f7576b90f81f1c7b159e3d6a70a6bf.jpg"
    },
    {
        "podcast_id": 110680,
        "title": "Het online platform voor fietsend Nederland ",
        "description": "<p>Ik ben Leo Steijn en vindt dat we een slag te maken hebben in onze branche. Er is nog veel oud denken. Als ondernemers mogen we gaan ondernemen. En allen gaat snel maar samen kom je verder.</p><p>Ik zet me er graag voor in. Ik wil graag samen verder komen er gebeurd veel en er staat veel te gebeuren in en rond onze branche. Personeel (met namen monteurs) en winkels verdwijnen. Als klant wil je gewoon graag geholpen worden door een monteur die je fiets kan maken. Dat hij het probleem oplost waar en wanneer jij dat wil.</p><p>Het online platform voor fietsend Nederland <a href=\"http://fietsreparatie.nu\">fietsreparatie.nu</a> de ideale match tussen de fietser en de fietsenmaker en een online leeromgeving. Veel instrcutie, uitleg en gereedschap video's vindt je op ons YouTube kanaal <a href=\"https://www.youtube.com/@vraagdefietsenmaker\">vraagdefietsenmaker</a></p>",
        "language": "nl",
        "author_name": "Leo Steijn",
        "slug": "leosteijn",
        "cover": "20220222_070205_5af82ff9f57ddff0cedd172edfb73345.jpg"
    },
    {
        "podcast_id": 110710,
        "title": "#lifeafterCISO",
        "description": "Join former ICE and NYSE CISO Jerry Perullo as he explores the opportunities available to tech executives after retirement.",
        "language": "en",
        "author_name": "Jerry Perullo",
        "slug": "lifeafterciso",
        "cover": "20220228_080249_9a853f8ee837d929d69cb6187f224a0b.jpg"
    },
    {
        "podcast_id": 110884,
        "title": "Noticias Radio Resultados",
        "description": "Toda la información, en el noticiario más corto, o el resumen de noticias más largo.",
        "language": "es",
        "author_name": "Radio Resultados",
        "slug": "radioresultados",
        "cover": "20220223_010248_0fd7a55ba141e7c3ec495fc736792c09.jpg"
    },
    {
        "podcast_id": 111334,
        "title": "DIGITALIO - In the loop",
        "description": "This is a podcast on digitalisation, crypto, NFT and blockchain technologies from Romania",
        "language": "ro",
        "author_name": "Podcast Editors",
        "slug": "digitalio",
        "cover": "20220225_060242_7e887f2a80ae0a32d9867ddbf13c2d98.jpg"
    },
    {
        "podcast_id": 112202,
        "title": "Freddy Future Talks",
        "description": "<p>Freddy Future Talks : In deze podcast gaat het over innovatie in de gezondheidszorg. Freddy Flux is de spreekbuis van FarmaFlux, een organisatie die zorgt voor een veilige gegevensuitwisseling van en naar de apotheek, maar ook allerlei tools ontwikkelt om apothekers te ondersteunen bij de zorg voor hun patiënten. Ons team is begeesterd door innovatie: VR, AI, 3D-printing, datamining, ... en blikt steeds vooruit in deze snel evoluerende digitale wereld van de gezondheidszorg. Volg ons ook op: - https://www.facebook.com/profile.php?id=100011742976405 - https://twitter.com/FreddyFlux - https://www.instagram.com/apo_freddy_flux/ - https://www.linkedin.com/in/freddy-flux-315261191/</p>",
        "language": "nl",
        "author_name": "Farmaflux",
        "slug": "freddy-future-talks",
        "cover": "20220301_070335_a1d2b4322754990de87d8136b984d76d.jpg"
    },
    {
        "podcast_id": 113819,
        "title": "Cyber Guys",
        "description": "Listen to cybersecurity experts Mike Hill and Andrew Valencia as they break down the complexities of information security, featuring insight and analysis on the latest cybersecurity news, trends, challenges, and threats. This weekly cybersecurity podcast educates and demystifies the ever-evolving space of cybersecurity. ",
        "language": "en",
        "author_name": "Michael Hill & Andrew Valencia",
        "slug": "cyberguys",
        "cover": "20220504_010542_09a2178925fca81902c4544e32ab6f87.jpg"
    },
    {
        "podcast_id": 114235,
        "title": "Sir Share-a-lot",
        "description": "Sir Share-a-lot-Podcast by IOZ AG",
        "language": "de",
        "author_name": "IOZ AG",
        "slug": "sirsharealot",
        "cover": "20220321_020301_540d67ce7e15387ecbcc4968d1fa7796.jpg"
    },
    {
        "podcast_id": 118240,
        "title": "THE HUDDLE",
        "description": "THE HUDDLE is a community based show, by and for the Pudgy Penguins and beyond. We discuss all things cute JPEG's and speak with fellow Pudgy Penguins and everything that's part of that ecosystem. ",
        "language": "en",
        "author_name": "Cyborg",
        "slug": "the-huddle",
        "cover": "20220330_030346_0c3a7e98e32264fa9cc540656743bf2c.jpg"
    },
    {
        "podcast_id": 119374,
        "title": "Resonant Kaos",
        "description": "We are Resonant Kaos, enthusiasts in all things audio and tech related.\nOur team members come from a wide range of backgrounds and walks of life.\nThis allows us to ensure we can cover a wide range of topics in depth and fully\nexplore all the aspects within them.",
        "language": "en",
        "author_name": "Samuel ",
        "slug": "resonantkaospodcast",
        "cover": "20220402_120442_2e2cc071c130afb00bd2c6d98356d36c.jpg"
    },
    {
        "podcast_id": 119528,
        "title": "Stearns Tech Talk",
        "description": "Bringing you some of the latest info in Tech News, Rumors and Product releases. \nSamsung had the next big thing, Apple had their revolutionary iPhone, ... we're eager to bring you a plethora of news on the horizon of technology.\n\n",
        "language": "en",
        "author_name": "JD & Riley ",
        "slug": "docksidetech",
        "cover": "20230111_040147_cf70624934ae94017b282a8e2a783a4b.jpg"
    },
    {
        "podcast_id": 120781,
        "title": "Dreamers Of The Day Podcast",
        "description": "We will feature many individuals involved in the Web3, NFT, and cryptocurrency space to see how they are making their dreams a reality by crafting projects, community, ideals, and culture that will last for years to come and change the current landscape of the space that we all know and love.",
        "language": "en",
        "author_name": "Marcus Brunson",
        "slug": "dreamersoftheday",
        "cover": "20220409_020437_e13f2a86d81e55a124aead6d9801cd81.jpg"
    },
    {
        "podcast_id": 121398,
        "title": "Techbytes: Let's go round the world of Tech",
        "description": "<p>Welcome to Techbytes with Technext. Here we bring to you a brief round-up of everything exciting about the tech space across Africa. From startup announcements to new inventions and the latest gbas gbos on the social space. We'll be sharing industry important highlights and exploring the news within the news. We'll also be bringing experts to share opinions about major news for the week. Let us begin!</p>",
        "language": "en",
        "author_name": "Technext",
        "slug": "techbytes",
        "cover": "20220411_010403_33e7b3adbec07edf41c58e46bc1a447b.jpg"
    },
    {
        "podcast_id": 122157,
        "title": "DegenZ: Alpha Talk",
        "description": "Exploring the world of NFT Projects on the rise, Crypto Market Sentiment in a alpha-degen fun yet enlightening way. Discussing everything from collabs, upcoming projects, wl drops, minting, to technical analysis, price targets, accumulation and much more. The following references are opinions and should not be construed as investment advice. Please seek out an appropriately licensed professional for investment advice.",
        "language": "en",
        "author_name": "Gatsby",
        "slug": "degenzalphatalk",
        "cover": "20220414_080457_717c29de79f6b8d30f87590870d39dce.jpg"
    },
    {
        "podcast_id": 124421,
        "title": "Access42 - Cybersecurity",
        "description": "Podcast / Vlog met sessies van technische, visionaire en bekende sprekers over dreigingen en actualiteiten op het gebied van cybersecurity breid je je kennis snel uit! ",
        "language": "nl",
        "author_name": "Access42",
        "slug": "access42",
        "cover": "20220426_010416_d33434ae6cded77c7bae6dd617c72a1e.jpg"
    },
    {
        "podcast_id": 124604,
        "title": "IT Sessions",
        "description": "Podcast IT Sessions se věnuje trendům a fenoménům ve světě informačních technologií. Jak vypadá budoucnost přenosu a zpracování dat, která jsou „ropou 21. století“? Nejen o tom debatují experti z českých telekomunikačních a IT firem.",
        "language": "cs",
        "author_name": "Quantcom",
        "slug": "quantcom-it-sessions-2022",
        "cover": "20220426_110413_d14c369d94b5007bc49cdbd3136cb2ea.jpg"
    },
    {
        "podcast_id": 124784,
        "title": "Apple+",
        "description": "Jacob and his father talk about Apple tech and more.",
        "language": "en",
        "author_name": "Jacob Baker and Jeff Baker",
        "slug": "appleplus1",
        "cover": "20220427_020406_222df75f8ebf69aaee1fc6d6dc78ae22.jpg"
    },
    {
        "podcast_id": 125972,
        "title": "The Thermal Review",
        "description": "Thermal imaging products and solutions are constantly evolving! Join Markus Tarin, CEO and President of MoviTHERM, and David Bursell, VP of Business Development, as they recap the evolution of thermal imaging applications. Keep up with current application trends in under an hour with focused and curated topics every month!",
        "language": "en",
        "author_name": "Markus Tarin & David Bursell",
        "slug": "thethermalreview",
        "cover": "20220502_080528_b0afc658879e2a432e9f02f1e3c5eae1.jpg"
    },
    {
        "podcast_id": 126184,
        "title": "Mundo Sustentable",
        "description": "Bienvenidos a Mundo Sustentable, el podcast en el que, semanalmente, presentamos entrevistas con temas de conciencia ambiental y sustentabilidad, en compañía de Alberto Larios, Jaime Salazar, Carlos Mendoza, Elías y Erick Larios.",
        "language": "es",
        "author_name": "Alberto Larios, Jaime Sálazar, Carlos Mendoza , Erick y Elías Larios",
        "slug": "mundosustentablemx",
        "cover": "20220509_040530_0bc5321a8b7d8352b08b5027c0d931d0.jpg"
    },
    {
        "podcast_id": 129487,
        "title": "The Canadian Gaming Podcast",
        "description": "Master System Marceau and co-host Canadian Gamer talk about the gaming news of the week with a special guest",
        "language": "en",
        "author_name": "Master System Marceau",
        "slug": "canadiangaming",
        "cover": "20220521_040537_1e9eb0561b180e838607306b04f0c048.jpg"
    },
    {
        "podcast_id": 129746,
        "title": "RetBro Gamers",
        "description": "3 friends talking about Retro and current Video Games. \n\nFollow us on socials @RetBroGamers\nWe do a weekly twitter space talking games on Tuesdays at 7pm central time. \n\nAny feedback please email us at retbrogamers@gmail.com or message us on socials. \n\nIntro by @ricardo_tolbert",
        "language": "en",
        "author_name": "RetBro Gamers",
        "slug": "retbrogamers",
        "cover": "20220522_090513_ad13ec093757baed6e061e61bc36de23.jpg"
    },
    {
        "podcast_id": 129881,
        "title": "The Modern Practice Podcast",
        "description": "Tune into The Modern Practice Podcast to hear from industry experts in the healthcare industry. Learn how your practice or organization can meet the expectations of modern patients with best in class patient payment and engagement technology. ",
        "language": "en",
        "author_name": "Experts from within our organization",
        "slug": "rectanglehealth",
        "cover": "20221018_081034_0c3a053b97401cdfd576e8f6cc23f3d3.jpg"
    },
    {
        "podcast_id": 129935,
        "title": "The Privacy Beat",
        "description": "<p>TerraTrue's The Privacy Beat, featuring host Angelique Carson and guests, is a quick-hit rundown of the important privacy news-you-can use of the week. Listen to sound smart at Happy Hour, informed at strategy meetings, or just to enjoy a conversation between people who speak your language and understand your pain.</p>",
        "language": "en",
        "author_name": "Angelique Carson",
        "slug": "theprivacybeat",
        "cover": "20220523_070542_4508cd2e9f5798def044eaf322015afb.jpg"
    },
    {
        "podcast_id": 130601,
        "title": "Spacelounge: Decoding Crypto",
        "description": "Sit back and relax while elevating your mind to a space where all you need to know about Blockchain and Crytpo is decoded in fun and casual conversations.\n\nBe on top of the latest updates around the XRP Ledger, dive into the world of NFTs, and learn about Entrepreneurship first-hand from experienced special guests. ",
        "language": "en",
        "author_name": "Sologenic",
        "slug": "spacelounge",
        "cover": "20220530_110516_de785a9c9add666aa286271383515a4f.jpg"
    },
    {
        "podcast_id": 131821,
        "title": "Bcommerce Podcast",
        "description": "Your gateway to the bitcoin circular economy.\n\nWhether you're a business owner or bitcoin enthusiast, we'll walk you through the why and HOW to future proof your business and tap into the bitcoin economy as much or as little as you'd like.\n\n",
        "language": "en",
        "author_name": "Michael Atwood & John Burnett",
        "slug": "bcommerce",
        "cover": "20220611_030620_d86627bed0269815a64e418cf9e3424d.jpg"
    },
    {
        "podcast_id": 133901,
        "title": "Bitcoin Cash Hangout",
        "description": "Bitcoin Cash Hangout with Fiendish Crypto.",
        "language": "en",
        "author_name": "Fiendish Crypto",
        "slug": "fiendishcrypto",
        "cover": "20220626_050631_f59826892e963f27c441a603573a7eb7.jpg"
    },
    {
        "podcast_id": 134258,
        "title": "TechBridge",
        "description": "TechBridge is the podcast channel where tech is at the center of everything. Jump in our discussions with subject matter experts, partners, customers and more. Three podcast series will be available : Mic On / Mic Off, Talk with Partners and The Voice of Rainbow.",
        "language": "en",
        "author_name": "TechBridge",
        "slug": "tech-bridge",
        "cover": "20220614_100616_ddd81957b90654db6706f59e8f2980d4.jpg"
    },
    {
        "podcast_id": 134912,
        "title": "Enrise Podcast",
        "description": "Development, IT, startups, digital agencies & online technology \n",
        "language": "nl",
        "author_name": "Peter van Vliet",
        "slug": "enrise",
        "cover": "20220617_110642_2de8ae5e88cb7d8e80971aa92048db9e.jpg"
    },
    {
        "podcast_id": 137318,
        "title": "Quinto Piso",
        "description": "Las cosas tal y como son; tu fuente de noticias destacadas y capsulas informativas.\n\nSigámonos en twitter: @MarioBautOff\n",
        "language": "es",
        "author_name": "Mario Bautista",
        "slug": "quinto-piso",
        "cover": "20220628_090621_63e05c1b87faf6027d08e98aecae775e.jpg"
    },
    {
        "podcast_id": 137774,
        "title": "Notizie tecnologiche ",
        "description": "Curioso e desideroso di incuriosire. Autore dell'ebook \"Computer? Facile!\".",
        "language": "it",
        "author_name": "Fabrizio Ferrara",
        "slug": "fabrizioferrara",
        "cover": "20220630_070613_9447d42b3dc4f3a804240b0185b84139.jpg"
    },
    {
        "podcast_id": 138904,
        "title": "Crypto Market Update - Web3 News, Financial Markets, BTC and Altcoins, NFTs",
        "description": "We designed this podcast to help quench your thirst for entertaining, educational, and valuable cryptocurrency knowledge.\n\nAre inflation, Fed reports, and macro-environment lingo too complex, but you want to understand the price action of Bitcoin?\n\nThis podcast hopes to help change this experience for new and veteran investors by helping podcast listeners navigate the world of crypto.\n\n-\n\nAbout Us:\n\nDegen Brain Finance (DBF) is an upcoming Learn2Earn, NFT, and DeFi Platform that aims to raise the IQ of crypto investors.\n\nWe have a growing community with a shared motivation to help retail traders and crypto investors.\n\nIf you have questions or suggestions for us, we invite you to join our Discord, linked on degenbrains.com.\n\nFollow us on Socials:\nTwitter: @degenbrains\nMedium: @degenbrains\nPodcast Host: @degen_mango",
        "language": "en",
        "author_name": "Degen Brain Finance",
        "slug": "degenbrainfinance",
        "cover": "20220706_050749_027f7e606075953d55f55196722907a1.jpg"
    },
    {
        "podcast_id": 139437,
        "title": "4 Palancas",
        "description": "4 tipos hablan sobre juegos",
        "language": "es-mx",
        "author_name": "Alejandro Gutierrez Ortega",
        "slug": "4palancas",
        "cover": "20220709_060747_dae43b75a4ad81c8121281a64881f483.jpg"
    },
    {
        "podcast_id": 139836,
        "title": "WTF Is Retail?!",
        "description": "The podcast where we speak to retail business owners about their brand. The good, the bad and the ugly! Presented by Excellent Zephyr your favourite NetSuite and Integration specialists for eCommerce. ",
        "language": "en",
        "author_name": "Excellent Zephyr",
        "slug": "excellentzephyr",
        "cover": "20220711_080721_efa05cedc09c97a658aab5c38232025a.jpg"
    },
    {
        "podcast_id": 140271,
        "title": "Topping Talks",
        "description": "Topping Talks is a interview podcast about Business/Entrepreneurship, Information Technology, and Ect. Hosted by Nic Topping. Follow Him atTwitter-https://twitter.com/NicToppingSponsored by Topping Technologies. Topping Technologies is a IT Value Added Reseller and services company based in Texas. If your business could use a hand you can reach them at sales@toppingtechnologies.comSponsored by Express VPNExpress VNN is a great way to maintain your privacy online, promo code below. https://www.xvuslink.com/?a_fid=toppingtribune",
        "language": "en",
        "author_name": "Topping",
        "slug": "toppingtalks",
        "cover": "20220713_100759_071917ef3e8f892e614cda29824e0842.jpg"
    },
    {
        "podcast_id": 140827,
        "title": "FAST Founder Series: Season 1",
        "description": "The FAST accelerator program, in partnership with Microsoft and Flapmax, identifies and supports African innovators building for sustainability at scale- from SMEs and large Enterprises to Governments and Communities. \n\nThe FAST Founder Series was brought to life after the completion of the FAST Accelerator program, where 12 startups were chosen from 800+ applicants. The FAST program provided opportunities for 1:1 mentorship, access to funding, marketing, and talent as well as investment opportunities. Our mission is supporting the next generation of African entrepreneurs building tech and cloud-enabled solutions for enterprises, governments, and communities.To learn more, visit https://www.fastaccelerator.com ",
        "language": "en",
        "author_name": "FAST Accelerator",
        "slug": "fast-accelerator",
        "cover": "20220723_100756_312a30420d21530d133f2f5777a80998.jpg"
    },
    {
        "podcast_id": 141502,
        "title": "Just Automate It",
        "description": "<p>Waylay presents \"Just Automate It,\" the hyperautomation podcast series. Interviews, debates, and discussions of automation across business verticals. Waylay is paving the way and making the world of hyperautomation simple!</p>",
        "language": "en",
        "author_name": "Lindsay Ouellette",
        "slug": "just-automate-it",
        "cover": "20220720_120700_ba3f1bf755b5eb43a0f74259322dc0b2.jpg"
    },
    {
        "podcast_id": 142129,
        "title": "Capital Games Podcast",
        "description": "Co-hosts Tyler Sells and Sam Johnson give you the perspective of a couple of 20 something year olds on markets, the economy, finance, and tech. ",
        "language": "en",
        "author_name": "Sam Johnson and Tyler Sells",
        "slug": "capitalgamespodcast",
        "cover": "20220723_090755_e92896bb647e24d92516dd9d66cdf476.jpg"
    },
    {
        "podcast_id": 142783,
        "title": "Misinput",
        "description": "4 gamers of varying skill talk latest news and happenings with some reminiscing mixed in. Join a commentator (AG), an artist (Max), and a couple of trolls (Gabe/Joltman), for a weekly show with a lot of jokes and a little input.",
        "language": "en",
        "author_name": "Misinput Cast",
        "slug": "misinput",
        "cover": "20220729_070728_6847bbd590d0889c538fa977efc11e48.jpg"
    },
    {
        "podcast_id": 144372,
        "title": "Web3 Demystified",
        "description": "Web3 Demystified is a creative talk show featuring top innovators in the Web3 space, hosted by Vivi Lin. \n\nVivi is an award-winning TV personality, crypto influencer, and media advisor. She works as a spokesperson and partner for Octopus Network (a Web 3.0 infrastructure), a columnist for Financial Times China, and media advisor for various blockchain projects. Prior to that, she was a bilingual TV presenter and producer for Reuters Financial TV and China's National TV.\n\nDon't miss a single episode as Vivi speaks with the biggest names in the exciting, rapidly evolving Web3 space.\n\nFollow Vivi Lin's Twitter\nTwitter: https://twitter.com/vivilinsv\n\nOctopus Network:\n - Official website: https://oct.network/\n - Mainnet: https://mainnet.oct.network/home\n - Testnet: https://testnet.oct.network/appchains\n - Github: https://github.com/octopus-network\n - Medium: https://medium.com/oct-network\n - Youtube: https://www.youtube.com/c/OctopusNetworkOfficial\n - Discord: https://discord.gg/6GTJBkZA9Q",
        "language": "en",
        "author_name": "Octopus Network",
        "slug": "octopus-network",
        "cover": "20220811_080832_2f7499438f599601144a193880550b63.jpg"
    },
    {
        "podcast_id": 144710,
        "title": "Med-Ex The Medical Extrusion Podcast",
        "description": "We interview global experts in the medical device manufacturing industry. This is a great resource for anyone looking to learn more about extrusion materials and processes, catheter technologies, and MedTech industry trends.",
        "language": "en",
        "author_name": "US Extruders, Inc.",
        "slug": "med-ex",
        "cover": "20220805_030829_ab6b4cebb4081babaab343049edb1465.jpg"
    },
    {
        "podcast_id": 145189,
        "title": "Inteligencia Competitiva para empresas y entidades públicas",
        "description": "La solución de Inteligencia Competitiva más apreciada por la industria para analizar la competencia, el mercado, la regulación y los avances tecnológicos. Conoce la tecnología que entiende tu negocio.",
        "language": "es",
        "author_name": "Miguel Borrás",
        "slug": "testantaram",
        "cover": "20220808_070838_6879276ec2c65148ee81470d80c3cca1.jpg"
    },
    {
        "podcast_id": 146335,
        "title": "The G&T Podcast",
        "description": "In the Gaming & Tech podcast we talk all about gaming and tech news! A new episode is uploaded every week on mondays. In each episode we will go over all the new tech products, company acquisitions, new game releases, the gaming industry, tech drama and so much more!",
        "language": "en",
        "author_name": "Chris, Milo, and Gage",
        "slug": "gtpodcast",
        "cover": "20221206_121211_d9aae79eaeb0fb22b1d391108c21969d.jpg"
    },
    {
        "podcast_id": 148166,
        "title": "Шо по коду?",
        "description": "🇺🇦 Технічно-популярний подкаст «Шо по коду?» про програмну інженерію та технології. 💻 Ділимось досвідом, розповідаємо байки та обговорюємо цікаві теми й новини інформаційного світу.\n\nДивіться наш відеопотік на <a href=\"https://youtube.com/@shopokodu\">YouTube</a> та підписуйтесь на наш <a href=\"https://t.me/shopokodu\">Telegram-канал</a>!",
        "language": "uk",
        "author_name": "Ігор, Роман, Руслан",
        "slug": "shopokodu",
        "cover": "20220910_070935_07de8064dc708e7b994795c4fa0675ec.jpg"
    },
    {
        "podcast_id": 148539,
        "title": "Game Changer",
        "description": "El pòdcast científic que posa sobre la taula algunes recerques científiques que canviaran la manera en com veiem el món. Un pòdcast que pretén fer reflexionar sobre les conseqüències que tindrien i l'impacte que causarien en la nostra vida les noves tècniques que es poden arribar a desenvolupar.\n\nEn aquestes gravacions es parlarà sobre la implantació de cèl·lules mare en el món de la reproducció assistida i les implicacions ètiques i morals que això comportaria, entrevistes amb professionals sobre les cèl·lules mare i molt més!\n\nNo et perdis ni un episodi del 'Game Changer' per estar al corrent d'algunes de les innovacions més pioneres en el món de la recerca científica.",
        "language": "ca-es",
        "author_name": "Marta Casals Romero",
        "slug": "gamechanger",
        "cover": "20220825_070840_8c698b35dcf6c1bbe2e521ea605c5a71.jpg"
    },
    {
        "podcast_id": 148692,
        "title": "8Bit & Lit",
        "description": "A podcast hosted by a couple of self proclaimed nerds. We chat about all things lit down to 8bit covering video games, collectables, tv, movies, tech, and all that jazz. Join us weekly!",
        "language": "en",
        "author_name": "Rocky Gargiulo & James Fletcher",
        "slug": "8bitandlit",
        "cover": "20220825_020841_42eaba0c595fb816e27d1a747a1d84da.jpg"
    },
    {
        "podcast_id": 151610,
        "title": "NucleCast",
        "description": "<p>Welcome to NucleCast, the official podcast of the ANWA Deterrence Center.  NucleCast is an engaging, educational podcast featuring a series of discussions and interviews with experts in nuclear policy, technology, and deterrence. The show is hosted by Dr. Adam Lowther, Strategic Advisor to the ANWA Deterrence Center and an expert on nuclear deterrence.</p>",
        "language": "en",
        "author_name": "ANWA Deterrence Center",
        "slug": "nuclecast-podcast",
        "cover": "20220906_080913_df164a03fda3e8e1747f616b6f87e3a6.jpg"
    },
    {
        "podcast_id": 152086,
        "title": "Metaleon Society",
        "description": "Hear about the latest Metaleon Society news and market updates, brought to you by Rekhi!",
        "language": "en",
        "author_name": "Rekhi",
        "slug": "metaleonsociety",
        "cover": "20220908_050908_f8563f47a8f6e10d2d4fdb7f2e6c645b.jpg"
    },
    {
        "podcast_id": 152700,
        "title": "Let's talk ICP",
        "description": "<p>Podcast of interviews related to the Internet Computer Protocol and the DFINITY foundation. Talks with founders, developers, engineers, content creators, and crypto enthusiasts who contribute daily to the Internet Computer ecosystem improving. Learn more about the protagonists who are building the World Computer.</p>",
        "language": "en",
        "author_name": "Javier Arroyo Ferrer",
        "slug": "lets-talk-icp",
        "cover": "20220911_060904_250d934e3315deefcce64c8ade561317.jpg"
    },
    {
        "podcast_id": 152966,
        "title": "Vigilant Cast",
        "description": "Vigilant Cast é um podcast que contará com entrevistas com experts do mercado para falar, por exemplo, do avanço dos ataques dos hackers e de como as empresas podem, com os recursos da inteligência artificial, encontrar os melhores sistemas de monitoramento e defesa para garantir a sua proteção de dados e informações. O assunto é de interesse de todas as empresas, sejam grandes, médias ou pequenas. ",
        "language": "en",
        "author_name": "Vigilant Cast",
        "slug": "vigilant-cast",
        "cover": "20221118_071113_5013955c3ea1ea955cba33f5e104b2f8.jpg"
    },
    {
        "podcast_id": 152993,
        "title": "Lab Talk LIVE!",
        "description": "Join our hosts, Dr. Nichole Thompson and Charisse Stokes, as they have candid conversations on entrepreneurship, technology, innovation, and how these industries are growing are diversifying. \n\nRecorded live from The Lab on Dexter, this podcast was born on one of the most historical streets in the nation: Dexter Avenue. A stone’s throw from the Alabama Capitol, The Lab is located at the crossroads of our nation’s civil and human rights journey. \n\nDr. Nichole Thompson is a serial entrepreneur with a proven track record for launching successful startups both domestically and internationally. She is the founder of She Wins Global, a nonprofit organization that works to advance women and girls in marginalized and vulnerable communities across the globe, and is the founder and co-owner of AdaChic Designs, a socially conscious handbag company that supports entrepreneurs across Africa. She earned her Doctorate degree in Educational Leadership and has also served in several senior administrative roles, including the role of Chief Diversity Officer. She’s co-authored multiple publications and has received numerous awards heralding her ability to thrust organizations to their next envisioned state. \n\nCharisse Stokes is president of Tidal IT Solutions, LLC, an information technology consulting company in Montgomery, Alabama, a position she has held since 2017.  In this role, she supports government and commercial industry clients by providing tech, innovation, and business development consulting services.  She holds a bachelor of science degree in Ceramic Engineering from Clemson University and a master of business administration in Finance from Auburn University Montgomery. She previously served in a variety of leadership roles in the United States Air Force and for small business information technology firms managing multiple, large-scale IT projects worldwide.  She currently serves on the board of Alabama Power Company; in addition to roles on the Business Council of Alabama,  Alabama STEM Advisory Council, Computer Science Task Force, and the Armed Forces Communication and Electronics Association (AFCEA) International, AUM College of Business, Trenholm State Community College Computer Information Systems and Saint James School Boards. As the past Director of the Education Foundation for the Montgomery AFCEA Chapter which provided STEM initiatives to the local community, she founded EduWerx, a nonprofit organization exposing minorities and young women to STEM.  Her greatest joy is spending time with her son, Dylan.",
        "language": "en",
        "author_name": "Lab Talk LIVE!",
        "slug": "dexterlabtalk",
        "cover": "20220912_080944_9f88c91d6b88e26f1a5ee8868eb61b4d.jpg"
    },
    {
        "podcast_id": 153187,
        "title": "WIW3 Tech Talks ",
        "description": "Bienvenue sur la chaîne de Podcasts de l'association WomenInWeb3💎.  \n\n📕 Chaque semaine retrouvez les WIW3 Tech Talks : \n       \n🎙Podcast d'une role model qui partagera son expertise sur la blockchain dans un format \"Uncut\" . ",
        "language": "fr",
        "author_name": "Ava Kouhana pour WomenInWeb3",
        "slug": "wiw3techtalk",
        "cover": "20220913_020953_f72e2a91d1a38caef15f4bf39830672b.jpg"
    },
    {
        "podcast_id": 153396,
        "title": "Future of Retail by TikTok For Business",
        "description": "The \"Future of Retail\" podcast sheds light on the evolution of the retail industry in MENA, and features discussions with some of the retail industry's heavy hitters.",
        "language": "en",
        "author_name": "TikTok MENA",
        "slug": "future-of-retail-by-tiktok-for-business",
        "cover": "20220914_010956_56f225343223b418704a9663982bc8e1.jpg"
    },
    {
        "podcast_id": 153764,
        "title": "Materials.Business",
        "description": "Welcome to Materials Business! This is an initiative oriented towards the creation of a virtual space for the updating and strengthening of your knowledge about relevant topics related to your duties on equipment’s integrity and materials protection.\n\nThis space is designed as the meeting point for all the colleagues being part of your global community of managers and responsible people in charge of the management and decision in relation to materials and equipment integrity (planners, designers, plant managers and engineers, laboratory managers, QA&QC managers, researchers, contractors, and other specialists concerned with caring equipment and materials). From the design and selection, to the disposal, after as long as possible life in service, according to the principles of Circular Economy and the expectations in front of a new economy for a more sustainable world.",
        "language": "en",
        "author_name": "Monica Hernandez/Felipe Rocha",
        "slug": "materials-business-podcast",
        "cover": "20220921_090956_91e1ec50ae2c39547197ce69f4b582ef.jpg"
    },
    {
        "podcast_id": 154335,
        "title": "The Building Blocks Podcast",
        "description": "Your go to source for inspiring conversations about the future that will be built on bitcoin and blockchain.",
        "language": "en",
        "author_name": "Block Builder Labs",
        "slug": "buildingblocks",
        "cover": "20221026_061013_831ae5be96dd605f5a57b88ca83cece5.jpg"
    },
    {
        "podcast_id": 154987,
        "title": "Conoscere il Metaverso",
        "description": "Impariamo a conoscere un argomento che negli ultimi mesi ha raggiunto la popolarità in ambito tech, oggetto di discussione tra esperti di settore, aziende, appassionati di tecnologia, curiosi e gamers: il Metaverso. Che cos'è? Che cosa implica? Quali sono le opportunità? E quali saranno gli sviluppi? Il team di Digital Mosaik, Metaverse Studio, ti accompagnerà in un viaggio alla scoperta delle tecnologie che stanno plasmando il futuro di Internet, per imparare a cogliere le opportunità e conoscere le sfide di questa nuova evoluzione tecnologica.\n\n👉 www.digitalmosaik.com",
        "language": "it",
        "author_name": "Digital Mosaik",
        "slug": "metaverso",
        "cover": "20220921_010917_149ed85f74412c452dd5d485246251eb.jpg"
    },
    {
        "podcast_id": 155048,
        "title": "Cybersecurity Careers Blog",
        "description": "The Cybersecurity Careers Blog features discussions on the latest cybersecurity news, career advice, security tech, and much more. We're dedicated to leveling up your cyber career!",
        "language": "en",
        "author_name": "Cybersecurity Careers Blog",
        "slug": "cybersecuritycareersblog",
        "cover": "20220921_070955_3594bdfaeab32b73e6ad8f01bac1dc63.jpg"
    },
    {
        "podcast_id": 155391,
        "title": "Digital Greenbook",
        "description": "A 100% Black-Owned, Woman-Owned, Web3 Podcast! \n\nStepping boldly into the generational wealth!\n\nWe talk everything from metaverse, to tech adoption, to technical chart analysis!",
        "language": "en",
        "author_name": "Alana Whitaker & Jalissia Ball",
        "slug": "digitalgreenbook",
        "cover": "20220923_060939_e56beda9cd6040db76f7d988c697eea0.jpg"
    },
    {
        "podcast_id": 156088,
        "title": "Die Weekly Hacker News",
        "description": "Willkommen zu den Weekly Hacker News. Zum Abschluss jeder Woche, stellen wir die wichtigsten Cyber Security Nachrichten hier und auf unserem Blog vor. \n\nAlles Wichtige - jede Woche - hier bei uns! 😎",
        "language": "de",
        "author_name": "LastBreach",
        "slug": "infosec-news-der-woche",
        "cover": "20230108_030100_2d6be9e96b7986269841825bcc1a3d0b.jpg"
    },
    {
        "podcast_id": 157530,
        "title": "Weekly digest",
        "description": "A podcast about filosophical thoughts that go around anyones head.",
        "language": "es",
        "author_name": "Victor Moreno",
        "slug": "weekly-digest",
        "cover": "20221002_051041_7070822bcb244b626f46c64f2cde77e1.jpg"
    },
    {
        "podcast_id": 157706,
        "title": "Transforming Healthcare",
        "description": "Hosted by Em Tombash, MD - Cincinnati Children's Hospital Medical Center research fellow. Join Em and her co-hosts Todd Ponsky, MD & Ramy Shaaban MD, PhD for a journey to find the most innovative solutions which transform healthcare into something better, one technology at a time.",
        "language": "en",
        "author_name": "GlobalCastMD",
        "slug": "transforming-healthcare",
        "cover": "20221003_031047_1e79f487c4a6abed12d782efc2a65453.jpg"
    },
    {
        "podcast_id": 160333,
        "title": "TechTalks With Ramanan",
        "description": "Metaverse: This is Creating a new universe all together and we cant stay out of it.\nwhat is Metaverse? How will it shape up billions of minds? what are its technology significance? why are big techs betting on Metaverse? what we should know about billions of dollars of investments and acquisitions? what are the merits and dark side of Metaverse?",
        "language": "en",
        "author_name": "Ramanan Thevarajan",
        "slug": "podcast-with-ramanan",
        "cover": "20221014_121003_633024fc6151a26dae2bbbf3f06dc27d.jpg"
    },
    {
        "podcast_id": 160464,
        "title": "Tech In Motion",
        "description": "How to get into tech. Life in tech. Software Engineering and more!",
        "language": "en",
        "author_name": "Gerald",
        "slug": "techinmotion",
        "cover": "20221014_111021_b9d64dc9e60f26fc15f22fb6f01e174d.jpg"
    },
    {
        "podcast_id": 162601,
        "title": "Two Steps Ahead",
        "description": "Analysis of geopolitics, blockchain and the future of money.",
        "language": "en",
        "author_name": "Molly Elmore",
        "slug": "twostepsahead",
        "cover": "20221023_051000_ecfc0d88d43271876e873f2f5ccc7b98.jpg"
    },
    {
        "podcast_id": 164073,
        "title": "Powered On, Tech Podcast",
        "description": "You host, Asher Dipprey invites guests to talk about the latest Tech, World news, and Lifestyle.",
        "language": "en",
        "author_name": "Asher Dipprey",
        "slug": "poweredon",
        "cover": "20221029_071002_79241ef8a036d74d3eefeb91133f204b.jpg"
    },
    {
        "podcast_id": 167341,
        "title": "On The Vrge Of...",
        "description": "Here, we’ll explore the world of politics and policy and focus on how\ntech companies can navigate the politics of disruption.\n",
        "language": "en",
        "author_name": "Vrge Strategies",
        "slug": "onthevrgeof",
        "cover": "20221220_041237_83ea13956568862f1d96ff7c2052e311.jpg"
    },
    {
        "podcast_id": 167384,
        "title": "NonCompila",
        "description": "Parliamo di programmazione, informatica, algoritmi, test, processi, colloqui di lavoro, ecc... Tutto rigorosamente in italiano.",
        "language": "it",
        "author_name": "Lorenzo & Davide Barasti, Giovanni Sorice",
        "slug": "noncompila",
        "cover": "20221112_111110_0dc8e2ff5ec8c11b8407076678fc51cd.jpg"
    },
    {
        "podcast_id": 168355,
        "title": "Kübercast",
        "description": "KüberCast on küberturvalisuse teemade podcast, kus murrame müüte ja lahkame tabusid. Kõneaineks tulevad teemad on suunatud nii noortele, vanadele, kogenud ja karjääri alustavatele kübermaailma huvilistele ja osalistele. \nSaadet juhivad Ronnie Jaanhold ja Siim Pajusaar.",
        "language": "ee",
        "author_name": "Ronnie Jaanhold & Siim Pajusaar",
        "slug": "kubercast",
        "cover": "20221116_011128_1741049aff100ff18b80a41b87b5501b.jpg"
    },
    {
        "podcast_id": 169937,
        "title": "LOGON to CyberSecurity",
        "description": "Welcome to LOGON to CyberSecurity, where we invite global professionals to one table to discuss cybersecurity, including the latest cybercrime, best solutions, and data privacy. Join our host from LOGON team to get insider tips and professional advice for your cyber protection and prediction.\n\nNew episodes are released every month!",
        "language": "en",
        "author_name": "LOGON Software Asia",
        "slug": "logon-to-cybersecurity",
        "cover": "20221123_061114_2b2afc0e9ac2f7f97f946c56c4b72b21.jpg"
    },
    {
        "podcast_id": 169960,
        "title": "Ask Blue",
        "description": "<p>The new <strong>BlueStar Europe</strong> podcast has arrived! Its all about the insights these days. If you are looking for the market insights from the <strong>BlueStar</strong> team and the vendors themselves, you've come to the right place.</p><p><em>Connect with us!</em></p><p><em>@BlueStar_Europe</em></p>",
        "language": "en",
        "author_name": "BlueStar Europe",
        "slug": "askbluepodcast",
        "cover": "20230424_110442_f10078890c05d2774cbcb56c309cf278.jpg"
    },
    {
        "podcast_id": 170043,
        "title": "\"In it Together\" with The Dunlaps",
        "description": "Deante and Shekema Dunlap are dedicated to empowering their communities through education and technology. Join us on Tuesdays at 6:00 pm CST to hear the latest inspirational news from ATL to ATX. ",
        "language": "en",
        "author_name": "Deante and Shekema Dunlap",
        "slug": "togetherwiththedunlaps",
        "cover": "20221123_061112_4e8ea70ce9175b76b520c6ab40c2917b.jpg"
    },
    {
        "podcast_id": 171593,
        "title": "hackit.co.il -  האקינג בעברית עם יובל אבידני",
        "description": "כל מה שמעניין בעולם ההאקינג, הסייבר והטכנולוגיות - בשפה פשוטה ובעברית!\nהפודקאסט של יובל אבידני, יוצר hackit.co.il ו-avidani.com.",
        "language": "he",
        "author_name": "Yuval Avidani - יובל אבידני",
        "slug": "hackit",
        "cover": "20221201_091222_0b9aea7893fc33b39617a290b20cbce3.jpg"
    },
    {
        "podcast_id": 173311,
        "title": "חנון לשבת",
        "description": "מדברים על דברים של חנונים, תרבות של גיקים והרבה כיף בין לבין",
        "language": "en",
        "author_name": "Omri Baranes & Chen Kahana",
        "slug": "saturdaygeek",
        "cover": "20221220_081246_557d3069251109bda282a8fdbbd70359.jpg"
    },
    {
        "podcast_id": 173383,
        "title": "XI Café Podcast",
        "description": "Welcome to XI Café Podcast—the Experience Improvement podcast brought to you by InMoment. InMoment is trailblazing the customer experience (CX) industry with Integrated CX—the practice of gathering data from customers, prospects, and non-buyers to create actionable insights that drive business outcomes. Join us as we dive into the brightest minds in the customer and employee experience industry to hear their stories, learn new ways of overcoming common CX challenges, and discover the latest industry trends.",
        "language": "en",
        "author_name": "InMoment",
        "slug": "inmoment-xi-cafe",
        "cover": "20221208_081217_4860894d3eb5853f36d1f35004cbfa39.jpg"
    },
    {
        "podcast_id": 174386,
        "title": "Prophet DAO | Inspire Web3.0 growth",
        "description": "<p>Welcome to Prophet DAO web3.0 Podcast. I am your host, Keer.</p><p>This podcast is aiming to inspire you as a web3.0 marketer with cases studies of the fastest-growing web3.0 projects</p><p>Whether you are an experienced marketer in crypto or a college student wanted to step into Web 3.0 and become a marketer of the future, you will find what you need in this channel.</p>",
        "language": "en",
        "author_name": "Keer Liu",
        "slug": "mark3eting",
        "cover": "20230822_040848_932d0f783478075fd60ebdea73960a88.jpg"
    },
    {
        "podcast_id": 174527,
        "title": "Foresight News",
        "description": "<p>Foresight Daily is a daily podcast covering the latest news in the web3 space. Tune in every day for updates and insights on decentralized technology and its impact on the future. Stay ahead of the curve with \"Foresight Daily\". </p><p>ForeCast is the podcast exploring the future of Web3 through engaging discussions with thought leaders in the blockchain and cryptocurrency space. Whether you're a seasoned crypto enthusiast or new to the game, Forecast is your one-stop source for in-depth analysis and informed perspectives on the future of decentralized technology. Tune in for thought-provoking conversations, valuable insights, and a glimpse into the ever-evolving world of Web3. Our guests come from a wide range of backgrounds, including developers, investors, entrepreneurs, and researchers, bringing unique perspectives and experiences to the table. We cover a variety of topics related to Web3, such as decentralized finance, blockchain scalability, privacy and security, token economics, and more. Our goal is to provide an open and honest platform for discussion, where we can challenge assumptions and explore new ideas.</p>",
        "language": "en",
        "author_name": "kean",
        "slug": "kean",
        "cover": "20230201_040253_42ceba7a60c2db38b8bb599efda2cad5.jpg"
    },
    {
        "podcast_id": 175660,
        "title": "What's New",
        "description": "Immaginate di avere un cannocchiale. Uno di quelli allungabili, tipo quello dei pirati nei cartoni animati. Ecco. Lì, lontano, un po’ sfocato, c’è il futuro. Cosa ci aspetta? Dove stiamo andando?\n\nCon Intesa, a Kyndryl Company ntervistiamo le persone più esperte per farci raccontare gli ultimi trend delle tecnologie digitali, ma soprattutto quali applicazioni potranno avere nella nostra vita.",
        "language": "it",
        "author_name": "Intesa, a Kyndryl Company",
        "slug": "intesa-kyndryl-whats-new",
        "cover": "20230118_020108_f7fdbbc1aa0c1e98fb63b698368b8961.jpg"
    },
    {
        "podcast_id": 175737,
        "title": "Germ Syllabus",
        "description": "<p>The founders of Germ Network, Tessa Brown and Brett Duboff, talk to guests and community members about the ethics, technologies, and communities that make social media—for better and worse.</p>",
        "language": "en",
        "author_name": "Germ Network",
        "slug": "germsyllabus",
        "cover": "20230315_030346_2e4527965c3d9f8e80d822821449b34b.jpg"
    },
    {
        "podcast_id": 176020,
        "title": "PowerUp: Conversations with SDSIC Members",
        "description": "Trevor Scullion interviews SDSIC members about exciting projects they're working on and learn how they're creating new solutions to address the growing needs of our Power Grid. In each episode, members share deep, creative thoughts and share insights on their current efforts and projects. PowerUp is a master-class on Electric Utility work, creativity, leadership and how to support grid advancements.",
        "language": "en",
        "author_name": "Trevor Scullion",
        "slug": "powerup",
        "cover": "20230123_110112_1527639c251915bd2504649a6c7145e4.jpg"
    },
    {
        "podcast_id": 179527,
        "title": "Office of The CISO",
        "description": "Office of The CISO is a podcast featuring 2 Chief Information Security Officers (plus guests) discussing and providing opinions / guidance on the latest cybersecurity news, information security processes, and more.",
        "language": "en",
        "author_name": "Michael Pruett",
        "slug": "officeoftheciso",
        "cover": "20230110_030155_1c515fd028eb222dffbe1eddaeedbdc1.jpg"
    },
    {
        "podcast_id": 179555,
        "title": "Caught In The Energy Web ⚡ ",
        "description": "Live Podcast Episodes on Energy Web - EWT ⚡ \nLatest announcements, hottest usecases & biggest alpha drops \n\nFollow us on Twitter: \nhttps://twitter.com/GreenAltCrypto\nhttps://twitter.com/Neolawyer1\nhttps://twitter.com/haiguardian",
        "language": "en",
        "author_name": "Gator, Neo & Ardian",
        "slug": "citew",
        "cover": "20230110_050119_0256d62836a1ba3423860789ede44a0d.jpg"
    },
    {
        "podcast_id": 181309,
        "title": "Industry Standards",
        "description": "<p>Industry Standards is a co-hosted show featuring 3D industry news, visual breakdowns, career stories, and interviews with professionals at the top of their field.</p>",
        "language": "en",
        "author_name": "Ana Carolina Pereira",
        "slug": "industrystandardspodcast",
        "cover": "20230214_070205_3cb760e13272c66f0480a1660039ee4a.jpg"
    },
    {
        "podcast_id": 181692,
        "title": "Sam Talks Technology",
        "description": "Award-winning radio presenter Sam Sethi talks with some of the most brilliant entrepreneurs about their career highlights and current startup.   \n\nHe brings his lifelong passion for all things business & tech to his podcast and asks the key questions you'd ask, all in his fun, relaxed, informative and always entertaining style. \n\nJoin Sam and his guests live every Wednesday on Marlow FM (97.5) at 2pm (GMT) You can listen online at marlowfm.co.uk or just ask your smart speaker to 'Play Marlow FM’. Catch all of Sam’s other shows at https://samtalks.technology",
        "language": "en",
        "author_name": "Sam Sethi",
        "slug": "samtalkstechnology",
        "cover": "podcast_cover.jpg"
    },
    {
        "podcast_id": 183180,
        "title": "The Swift Hour",
        "description": "Today’s leaders are looking for ways to digitize their organizations to increase operational effectiveness while remaining agile to successfully navigate today’s volatile market. Supply chain disruptions can wreak havoc on even the most put together organizations, targeting key areas like operational effectiveness, change warehouse management, and just-in-time readiness. Join us monthly to hear from industry leaders on best practices, and identifying areas for improvement across your supply chain and warehouse management. LeanSwift is here to help you prepare and digitally transform your business and mitigate risk by optimizing your supply chain.\"",
        "language": "en",
        "author_name": "Kysha Barry",
        "slug": "the-swift-hour",
        "cover": "20230124_010119_88959a9fbccbaa29de1703e52afad826.jpg"
    },
    {
        "podcast_id": 183876,
        "title": "InteropTalk",
        "description": "<p>InteropTalk is a monthly discussion with a regular lineup of experts and the occasional special guest to talk about the interoperability landscape, data sharing, patient access to data, government initiatives such as the Trusted Exchange Framework and Common Agreement (TEFCA). Dave Cassel, Health Gorilla's Chief Customer Officer and former Executive Director of Carequality, moderates. The regular panel includes Health Gorilla Chief Medical Officer Steven Lane, MD, MPH,  Jennifer Blumenthal, Product Director, OneRecord, at Milliman IntelliScript, and Invitate's Lead of Data Stewardship and Data Sharing Deven McGraw.</p>",
        "language": "en",
        "author_name": "Health Gorilla",
        "slug": "interop-talk",
        "cover": "20230126_070135_c814cadc150423a5c69e43d814487187.jpg"
    },
    {
        "podcast_id": 186619,
        "title": "Critical Assets Podcast",
        "description": "<p>The Critical Assets Podcast covers important OT and ICS security topics with an eye toward standards and regulation to keep you ahead of your adversaries... and your auditors. Ampere Industrial Security. Securing your world. See our other content such as blogs, cybersecurity news and more at www.amperesec.com</p>",
        "language": "en",
        "author_name": "Patrick Miller",
        "slug": "amperesec",
        "cover": "20230511_080507_38722c855967ab559acfcef8c84c4a40.jpg"
    },
    {
        "podcast_id": 187545,
        "title": "The Dirty Boots Show",
        "description": "Sit down with us as we pour a drink (too early in the day) and talk to the people moving the construction industry forward. Hear from professionals like yourselves with stories to tell, and gain insights into the topics that affect us all.\n\nThe Dirty Boots Show is brought to you by Assignar—the all-in-one construction operations software that empowers contractors worldwide to build more.",
        "language": "en",
        "author_name": "Assignar",
        "slug": "dirtybootsshow",
        "cover": "20230207_110254_38180d4c2ed4388b9a3fed4c4bcda2e5.jpg"
    },
    {
        "podcast_id": 187751,
        "title": "Stuff Keeps Happening",
        "description": "<p>I don't know why, but stuff keeps happening. So here's some of it. A rundown of what's up, along with some rants, rambles and the occasional goof. New episodes every Monday/Wednesday/Friday.</p>",
        "language": "en",
        "author_name": "Endeavorance",
        "slug": "stuffkeepshappening",
        "cover": "20230208_040227_eb8e7f500568d34edbf7af9217dcd1bc.jpg"
    },
    {
        "podcast_id": 189328,
        "title": "Podcast AI",
        "description": "The first ever podcast generated entirely by AI. ",
        "language": "en",
        "author_name": "ChatGPT",
        "slug": "thepodcastai",
        "cover": "20230214_030223_e505c7c4f208c2299608065f7f7f2dff.jpg"
    },
    {
        "podcast_id": 190830,
        "title": "Topics Del Futuro",
        "description": "<p>¡Bienvenidos al primer pódcast de TOPICS DEL FUTURO! Estaremos, hablando, debatiendo y compartiendo de manera natural todo lo relacionado con la tecnología, desde noticias y mucho más.</p><p>--------------------------------------------------------------------------------------------</p><p><a href>#inteligenciaartificial</a> <a href>#IA</a> <a href>#AplicacionesIA</a> <a href>#DesafiosIA</a> <a href>#PerspectivasIA</a> <a href>#TecnologíaIA</a> <a href>#InnovaciónIA</a> <a href>#FuturoIA</a> <a href>#Robótica</a> <a href>#MachineLearning</a> <a href>#AprendizajeAutomatico</a> <a href>#TopicsDelFuturo</a></p>",
        "language": "es",
        "author_name": "topicsdelfuturo",
        "slug": "topicsdelfuturo",
        "cover": "20230219_100237_d232692745c752aacb358a2eb3a3b42f.jpg"
    },
    {
        "podcast_id": 191132,
        "title": "3digital Mx",
        "description": "<p>Somos una empresa de Diseño Web, Marketing Digital y Plataforma de Comunicación Virtual en la Nube</p>",
        "language": "es-mx",
        "author_name": "3digital Mx",
        "slug": "3digitalmx",
        "cover": "20230220_110233_172effb0e471aa042cfbe7742a0abd10.jpg"
    },
    {
        "podcast_id": 192584,
        "title": "Let's Talk Tech by N12 Estudio",
        "description": "<p>La tecnología domina nuestras vidas, de arriba a abajo, pero qué tanto la entendemos? en esta plática cotorra de café o cerveza en mano, hablamos de los diferentes aspectos que impactan en nuestra vida, de la mano de Luis y Gerardo, dos tipos metidos en tech</p>",
        "language": "es-mx",
        "author_name": "N12 Estudio",
        "slug": "n12mx",
        "cover": "20230226_040258_616415e34e64b5c7c6b36d29b3dcf122.jpg"
    },
    {
        "podcast_id": 196216,
        "title": "Solana Made Simple ",
        "description": "<p>Solana Made Simple is a of group a passionate WEB3, NFT, and Crypto investors. We aim to bring vibes and value while educating and cultivating a better community moving forward.</p>",
        "language": "en",
        "author_name": "SMS",
        "slug": "solanamadesimple",
        "cover": "20230325_010305_3917bd5c8593e66ab252e359bb6115f0.jpg"
    },
    {
        "podcast_id": 196807,
        "title": "fAQ by SandboxAQ",
        "description": "<p>Welcome to Sandbox AQ’s podcast, fAQ, hosted by Adam Green and Tai-Danae Bradley. This new series features casual conversations on topics in AI and quantum technologies targeted at general audiences. All curious humans are invited to join!</p><p>New episodes every other Tuesday.</p><p>Want to get in touch? Write us at <a href=\"mailto:faq-podcast@sandboxaq.com\">faq-podcast@sandboxaq.com</a></p><p>Interested in a video version of this podcast? Check out <a href=\"https://www.youtube.com/@sandboxaq\">https://www.youtube.com/@sandboxaq</a></p>",
        "language": "en",
        "author_name": "Adam Green & Tai-Danae Bradley",
        "slug": "faq",
        "cover": "20230314_100324_445d53c10dda0225aa4bd04d2d10ceea.jpg"
    },
    {
        "podcast_id": 197658,
        "title": "Escape Velocity",
        "description": "<p>A weekly news analysis show covering geopolitics, blockchain and the future of money. Brought to you by Valhil Advisors with co-hosts Jimmy Vallee &amp; Molly Elmore</p>",
        "language": "en",
        "author_name": "Molly Elmore",
        "slug": "escapevelocity",
        "cover": "20230318_020324_d105a52281ddb6fc9ac57e029da05898.jpg"
    },
    {
        "podcast_id": 198947,
        "title": "The IaC Podcast",
        "description": "<p>The IaC Podcast explores the world of DevOps and cloud computing through the lens of Infrastructure as Code (IaC). Hosted by industry experts and thought leaders, this podcast delves into the benefits, challenges, and best practices of using code to manage and automate infrastructure. From Terraform to CloudFormation to Pulumi, listeners will gain insights into the latest trends and techniques shaping the future of infrastructure management. Whether you're a seasoned DevOps practitioner or just starting out, this podcast is a must-listen for anyone interested in the power of Infrastructure as Code.</p>",
        "language": "en",
        "author_name": "Ohad Maislish",
        "slug": "theiacpodcast",
        "cover": "20230413_100433_0a6501551026d4659f2f7a7b4df4de7a.jpg"
    },
    {
        "podcast_id": 199576,
        "title": "Radish Dijital Featuring BPX",
        "description": "<p>Radish Dijital will never produce the most content in web3, but we will always provide the most community driven and engaging content for blockchain audiences.</p><p>Join us as we discuss all things BPX related including Lost Miners, Razz games, Geeks, Bantams, Parrots, Pirates, card auctions, the BPX Token, and more.</p><p>BPX is the number one community in Web3 where real world bonds, friendships, and sometimes wealth, are built.</p><p>Like what you hear? Join the conversation in Discord here <a href=\"https://discord.gg/radish\">https://discord.gg/radish</a></p>",
        "language": "en",
        "author_name": "Radish Dijital",
        "slug": "radish",
        "cover": "20230327_050326_4f421652f10117b8c8d1368fd2719e5c.jpg"
    },
    {
        "podcast_id": 199602,
        "title": "CloudTech Talks",
        "description": "<p>CloudTech Talks, the podcast where we explore all things related to cloud technology. Join us as we delve into the latest developments and trends in cloud including topics such as cloud FinOps, migration strategies, and more. Each episode features expert guests from the tech industry, who share their insights, experiences, and practical tips to help you navigate the complexities of the cloud. We'll also discuss real-world use cases and success stories, highlighting how businesses are leveraging the power of the cloud to transform their operations and drive innovation. Whether you're an IT professional, a business leader, or simply curious about the cloud, CloudTech Talks has something for you. So, tune in, subscribe, and join us on this exciting journey into the world of cloud technology.</p>",
        "language": "en",
        "author_name": "Amadis Technologies",
        "slug": "cloudtechtalks",
        "cover": "20230328_010350_c95c575e10719bf1f07c7a436651fac4.jpg"
    },
    {
        "podcast_id": 200323,
        "title": "The Team Me Up Podcast",
        "description": "<p>Join Nabeel Mahmood in The Team Me Up Podcast, discussing with top leaders of the tech industry about the present and future of colaboration for businesses as they go through the Communication Revolution.</p>",
        "language": "en",
        "author_name": "SCB Global LTD",
        "slug": "teammeuppodcast",
        "cover": "20230404_060411_db1e462661044cd76ff15ca04256ec2b.jpg"
    },
    {
        "podcast_id": 200470,
        "title": "The Mobile Pubcast",
        "description": "<p>Welcome to \"The Mobile Pubcast\", the show where we talk all things mobile apps! Join our hosts as they discuss the latest mobile app trends, user acquisition campaigns, and app store optimization strategies. From app development and design to marketing and analytics, we cover it all in a casual and informative way, just like you'd chat with friends at your favorite pub.</p><p>Each episode, we bring you insights and tips from experts in the mobile app industry, as well as stories and experiences from app developers and marketers. You'll learn about the challenges and opportunities of building and growing a successful mobile app, and get practical advice on how to improve your app's user experience, retention, and monetization.</p><p>Whether you're a mobile app enthusiast, a developer, or a marketer, \"The Mobile Pubcast\" is the perfect podcast for you. So grab a drink, pull up a stool, and join us for some lively discussions about the world of mobile apps. Cheers!</p>",
        "language": "en",
        "author_name": "Norbert Mazur",
        "slug": "themobilepubcast",
        "cover": "20230427_010442_b76d5decf6b9513da0d63b1eeedcf6eb.jpg"
    },
    {
        "podcast_id": 201112,
        "title": "Technically Biased",
        "description": "<p>The podcast that discusses bias in tech.</p><p><a href=\"https://gakovii.com/\">Gakovii</a></p>",
        "language": "en",
        "author_name": "Krystyn Gutu",
        "slug": "technicallybiased",
        "cover": "20230416_070424_c5968efb05a672ceba0bd8017980c409.jpg"
    },
    {
        "podcast_id": 203510,
        "title": "Tech It to the Limit",
        "description": "<p>Two wonks, one podcast, on a mission to make digital innovation in healthcare as entertaining as it is relevant! No medical degree required - just a sense of humor and a penchant for transformation!\"</p><p><em>ChatGPT Says: </em>\"Funny, ironic, and surprisingly informative - Tech It to the Limit!</p>",
        "language": "en",
        "author_name": "Elliott Wilson and Sarah Harper",
        "slug": "techittothelimit",
        "cover": "20230623_010635_b53394719107e12a95acaaad4dea782d.jpg"
    },
    {
        "podcast_id": 205397,
        "title": "In The Bat Cave",
        "description": "<p>A recording of the BAT (basic attention token) communities weekly twitter space.</p>",
        "language": "en",
        "author_name": "BAT Community",
        "slug": "batcave",
        "cover": "20230516_020533_dd9f0d3fc3de8f23007d2ea446048a84.jpg"
    },
    {
        "podcast_id": 205519,
        "title": "Hubbub - A chaotic din caused by a crowd of people",
        "description": "<p>A series of business podcasts opening up on the lives of directors local to Sussex, with discussions about their businesses and personal lives.</p><p>Part of The Directors' Hub: Founders Support Club</p>",
        "language": "en",
        "author_name": "Sonny Cutting",
        "slug": "hubbub-s1e1",
        "cover": "20230425_100432_e5ac778a2a885c74e794f7a5e55b1afc.jpg"
    },
    {
        "podcast_id": 205770,
        "title": "Platform Alchemy - Turning Cloud into Gold",
        "description": "<p>Cloud engineering and all the tools that go with it. </p><p><strong>Platform Alchemy</strong> is a podcast about DevOps, Cloud Engineering, SRE and all the things us Infra people get up to.</p><p><a href=\"https://platformalchemy.com\">https://platformalchemy.com</a> coming soon!</p>",
        "language": "en",
        "author_name": "Lajos Nagy",
        "slug": "platformalchemy",
        "cover": "20230426_110403_4476c45adea98ae4f4c7bb675a906211.jpg"
    },
    {
        "podcast_id": 206143,
        "title": "Android iOs & AI Unleashed - Exploring Cutting-Edge AI Trends in the Mobile World (English & French)",
        "description": "<ol><li><p>Dive into the latest Android &amp; iOs &amp; AI trends and innovations shaping the mobile landscape.</p></li><li><p>Stay up-to-date with the newest Android OS features, UI enhancements, and app developments.</p></li><li><p>In-depth analysis and discussions on groundbreaking Android-powered devices and their impact on the market.</p></li><li><p>Exclusive interviews with industry experts, developers, and influencers in the Android community.</p></li><li><p>Weekly app spotlights, highlighting the most exciting and useful apps making waves in the Android ecosystem.</p></li><li><p>Tips, tricks, and hacks for optimizing your Android experience and getting the most out of your device.</p></li><li><p>Listener Q&amp;A segments, where we address your burning questions and offer personalized advice for all things Android.</p></li><li><p>Security and privacy news, ensuring you're informed about the latest threats and vulnerabilities affecting Android users.</p></li><li><p>A glimpse into the future of Android, exploring emerging technologies and their potential applications in the mobile world.</p></li><li><p>Engaging conversations, expert insights, and your one-stop destination for everything Android.</p></li><li><p>Multilingual</p></li></ol>",
        "language": "en",
        "author_name": "Etienne Noumen",
        "slug": "androidunleashed",
        "cover": "20230507_060540_71d9fccf1eaa00866e42f99ccadf5795.jpg"
    },
    {
        "podcast_id": 207497,
        "title": "Fabrication Friday",
        "description": "<p>Joe Fairley, Certified Prosthetist, 3D printing enthusiast, and owner of Ascent Fabrication hosts Fabrication Friday - an all around fun time introducing 3D printing applications, interviews with industry leaders, and much more. Come join us every Friday for an informational discussion around how the additive manufacturing field is growing and evolving, and how we utilize various digital workflows and 3D printing methods in our daily work at Ascent Fabrication.</p><p>Learn more about what we do at Ascent Fabrication by checking us out online!</p><p>Website: <a href=\"http://www.ascentfab.com\">www.ascentfab.com</a></p><p>Email: <a href=\"mailto:joe@ascentfab.com\">joe@ascentfab.com</a></p><p>Instagram: @ascentfab</p><p>TikTok: @ascentfab</p><p>YouTube: @ascentfab</p><p>LinkedIn: <a href=\"https://www.linkedin.com/in/jkfairley3rd/\">https://www.linkedin.com/in/jkfairley3rd/</a></p>",
        "language": "en",
        "author_name": "Joe Fairley",
        "slug": "ascentfab",
        "cover": "20230505_060517_70923cbb5b92d7625c9dc75b29b7e653.jpg"
    },
    {
        "podcast_id": 207971,
        "title": "CISO Talks",
        "description": "<p><strong>CISO Talks</strong> is a <strong>weekly show</strong> which is tailored for <strong>CISOs and I.T. professionals</strong> but can also appeal to anyone with an interest in cybersecurity. We discuss a number of topics regarding the CISO and I.T. professional role and how certain scenarios, changes and trends are shaping the role(s) as well as the cybersecurity industry. <strong>If you are a CISO or an I.T. professional or if you just have an interesting topic to discuss on our show </strong>then please send our producer of the show, Dan, an email. <a href=\"mailto:daniel.curme@lepide.com\">daniel.curme@lepide.com</a> <strong>Watch/listen on your favourite platforms: </strong><a href=\"https://linktr.ee/cisotalks\">https://linktr.ee/cisotalks</a> Copyright ©️ <em>2023 Lepide. All Rights Reserved.</em></p>",
        "language": "en",
        "author_name": "CISO Talks",
        "slug": "ciso-talks",
        "cover": "20230512_090533_454453c93adb15d22cdc44265f1995e7.jpg"
    },
    {
        "podcast_id": 208660,
        "title": "The Chameleons Podcast",
        "description": "<p><strong>The world as we know is changing fast.</strong> We are experiencing a technological shift with an enormous potential for advances in knowledge and solutions for individuals and society. This requires extraordinary human agency and ability to adjust to the changes and navigate this unknown territory together. This is why this podcast is called The Chameleons – as a tribute to our incredibly malleable nature.</p><p><strong>Host Imac Zambrana</strong> is seeking input from a group of international and Norwegian experts and advocates from tech-relevant fields concerning their thoughts about the potential of different interplays between technology, individuals, and societies. These conversations about real and fictional meetings between human and machine in the past, present, and future, are an invitation to reflect on how we can adjust for what might, what will, and what might never come.</p><p><strong>Language: </strong>English &amp; Norwegian (depending on the native language of the guests).</p><p><strong>Music by: </strong>Håkon Onsager.</p><p><strong>Graphics by: </strong>Øivin Horvei.</p><p><strong>Guest Relationship Advisor:</strong> Nicole Patrice De Member</p>",
        "language": "en",
        "author_name": "Imac Zambrana",
        "slug": "thechameleonspodcast",
        "cover": "20230511_090548_a0c912793322bfe865c42cc5887d5430.jpg"
    },
    {
        "podcast_id": 208797,
        "title": "Scanning the Industry with Jamye Carpenter",
        "description": "<p>Scanning the Industry is an automotive podcast presented by UVeye where Jamye Carpenter brings on guests from the automotive industry and talks about trending topics in the world of automotive.</p>",
        "language": "en",
        "author_name": "UVeye",
        "slug": "scanning-the-industry",
        "cover": "20230512_020556_20bd204ee79b8ccea32122c7f179872a.jpg"
    },
    {
        "podcast_id": 208921,
        "title": "Bite Agile ",
        "description": "<p>The Journey Through Agile</p>",
        "language": "en",
        "author_name": "Russell Avre",
        "slug": "glappy",
        "cover": "20230513_030533_445e5ea7ffd1d93743ba9f8ccebd8cd2.jpg"
    },
    {
        "podcast_id": 209037,
        "title": "David talks with...",
        "description": "<p>Welcome to conversations with David concerning intelligence, science, technology, ethics, society, religion, and beyond.</p>",
        "language": "en",
        "author_name": "David Zhang",
        "slug": "ethicalai",
        "cover": "20230910_070959_07b6c27473c47728c3861cb6577764bd.jpg"
    },
    {
        "podcast_id": 210232,
        "title": "AI Hacks - מדברים בינה מלאכותית",
        "description": "<p>הכל על בינה מלאכותית, למתחילים ולמתקדמים, בשפה ברורה ובעברית.</p><p>פודקאסט מבית HACKIT, מאת יובל אבידני</p>",
        "language": "he",
        "author_name": "יובל אבידני",
        "slug": "ai-hacks",
        "cover": "20230519_020508_ea2878047a39ce237b0d05a85b668a3f.jpg"
    },
    {
        "podcast_id": 211455,
        "title": "The Bitcoin Street Journal Market Update",
        "description": "<p>Welcome to The Bitcoin Street Journal Bitcoin Market Update! We bring you current  live bitcoin headline news, market updates, technical analysis, BTC price, market capitalization and accurate market supply data. Join us on The Daily Diary of the Bitcoin Dream for breaking news, business updates, financial and economic news everyday.</p>",
        "language": "en",
        "author_name": "The Bitcoin CEO",
        "slug": "thebitcoinstreetjournal",
        "cover": "20230525_080551_615d92a0f8c52722ca6b5376aac5ac2f.jpg"
    },
    {
        "podcast_id": 211560,
        "title": "Untangling Web3",
        "description": "<p>Untangling Web3 dives deep into the world of the next-generation Internet, exploring the groundbreaking technologies, projects, and ideas shaping the future of the Web. Join us as we demystify the concepts behind Web3 and learn how you can be relevant in this radical digital and societal transformation. This series is produced by Emma Camilleri and hosted by Jack Davies and Alec Burns.</p>",
        "language": "en",
        "author_name": "Jack Davies, Alec Burns & Emma Camilleri",
        "slug": "untanglingweb3",
        "cover": "20230526_120542_4bdde28b96a3e8d1cb26db433cf1bc32.jpg"
    },
    {
        "podcast_id": 211747,
        "title": "Join Supreet Singh of Finlytica, as he discusses with Charlie Kelly -Bank Talk Pod Cast",
        "description": "<p>Join Supreet Singh of Finlytica, as he discusses with Charlie Kelly the importance of understanding profitability at the customer level. <a href=\"https://www.finlytica.ai/Profitability\">https://www.finlytica.ai/Profitability</a> analytics are helping the best-performing banks and credit unions better understand the profitability of individual customers and products and then use these insights to focus on the key products and customers to grow revenue and profits.</p>",
        "language": "en",
        "author_name": "Supreet Singh",
        "slug": "finlytica-podcast-2",
        "cover": "20230527_120532_6582d4fc3292a771c050389109a9f09c.jpg"
    },
    {
        "podcast_id": 211780,
        "title": "The Innovation Conversation: Innovation Unleashed, Conversations Driving Change\"",
        "description": "<p>Are you ready to dive deep into the world of innovation and entrepreneurship? Join us, a group of passionate professionals with over 20 years of combined experience in driving change and fostering innovation, as we bring you inspiring stories of entrepreneurs who are breaking boundaries and reshaping industries.</p><p>In these podcast series, we go behind the scenes and provide you with exclusive access to the minds of these courageous individuals. From their triumphs to their mistakes, we'll uncover the lessons they've learned and the courage it takes to take the leap into entrepreneurship. 🚀</p><p>🌟 Join us as we engage in captivating conversations with leading experts and practitioners who are at the forefront of disruptive innovation. Together, we'll explore recent developments, dive into thought-provoking research, analyse news and controversies, and uncover the latest technological breakthroughs that are shaping the future.</p><p>Whether you're an aspiring entrepreneur, a business professional looking to drive change, or simply someone fascinated by the world of innovation, this podcast is your gateway to gaining invaluable insights and inspiration. Get ready to be inspired, challenged, and empowered to embrace innovation and create positive change in your own life and work.</p><p>Tune in to The Innovation Conversation, where we explore the remarkable journey of entrepreneurs and the game-changing ideas that are transforming industries. Get ready to fuel your curiosity and ignite your passion for innovation. 🎧✨</p>",
        "language": "en",
        "author_name": "Harry McDonough & Ricardo Pascual",
        "slug": "theinnovationconversation",
        "cover": "20230711_110731_e4456e6f6e8a753ac20ac32887aad41a.jpg"
    },
    {
        "podcast_id": 212241,
        "title": "Plebchain Radio",
        "description": "<p>Plebchain Radio is a weekly live audio show made for plebs, by plebs which focuses on the intersection of Nostr protocol and Bitcoin plebs. Quiet Warrior and Avi Burra rundown weekly news on Nostr developments, along with breaking down the \"current thing\" with an assortment of builders, thinkers, doers, and plebs from across the world joining in as guests.</p>",
        "language": "en",
        "author_name": "QW + AVI Burra",
        "slug": "plebchainradio",
        "cover": "20230606_020613_af1676ecbab5e118b4a10684ffee3fae.jpg"
    },
    {
        "podcast_id": 212408,
        "title": "FragManSaul's Gaming Podcast - Industry News, New releases, Mods, Retro, Tech and Community",
        "description": "<p>Weekly Podcast every Tuesday 9:30pm GMT discussing anything gaming related new, old and upcoming, </p><p>The podcast is a #adfree zone so everything is my opinion and not tainted by advertisers. Listen in or join the discussion and let's talk gaming!</p><p>www.fragmansaul.com</p><p>Links </p><p>Discord Server </p><p>►​ FragManSaul's Discord <a href=\"https://discord.com/invite/rUN9bzK\">https://discord.com/invite/rUN9bzK</a> </p><p>► Gorilla HQ Discord <a href=\"https://discord.gg/UNJm95yEuR\">https://discord.gg/UNJm95yEuR</a> ​ </p><p>Support the content ► <a href=\"https://www.patreon.com/FragManSaul\">https://www.patreon.com/FragManSaul</a> </p><p>Content </p><p>► <a href=\"https://www.youtube.com/fragmansaul​\">https://www.youtube.com/fragmansaul​</a> </p><p>​► <a href=\"https://www.twitch.com/fragmansaul\">https://www.twitch.com/fragmansaul</a> </p><p>► <a href=\"https://twitter.com/FragManSaul\">https://twitter.com/FragManSaul</a> ​​ ​</p><p>Websites</p><p> ► <a href=\"https://www.fragmansaul.com\">https://www.fragmansaul.com</a> ​​</p><p>►​ <a href=\"https://www.gorilla-hq.com\">https://www.gorilla-hq.com</a></p><p>#gaming #podcast #gamingnews</p>",
        "language": "en",
        "author_name": "Saul Clay",
        "slug": "fragmansaul",
        "cover": "20230601_070611_bd11cdf5a5c0c962f62e390b58655ebf.jpg"
    },
    {
        "podcast_id": 213367,
        "title": "NewsAI",
        "description": "<p>Your daily news, summarized by AI.</p>",
        "language": "en",
        "author_name": "NewsAI",
        "slug": "news-ai",
        "cover": "20230605_070616_e0a1f4be09d7b3bc4459c30c8c5955cc.jpg"
    },
    {
        "podcast_id": 213397,
        "title": "USURPATOR Pod",
        "description": "<p>USURPATOR is an online magazine sharing critical analysis about the user experience of our current virtual landscape.</p><p>usurpatormag.com</p>",
        "language": "en",
        "author_name": "USURPATOR Pod",
        "slug": "usurpator",
        "cover": "20230901_010941_ccc166eb3447ded0c28d0667329a8411.jpg"
    },
    {
        "podcast_id": 213541,
        "title": "Building Security In - The Next Decade",
        "description": "<p>Synopsys' Software Integrity Group (SIG), a global leader in Application Security, presents the 'Building Security In - The Next Decade' podcast. Hosted by SIG's own Drew Kilbourne, a Managing Director &amp; Sammy Migues, an AppSec visionary, the podcast taps into the advice of industry leaders and AppSec experts, discussing everything from Cybersecurity advancements to challenges and solutions for the future of AppSec.</p>",
        "language": "en",
        "author_name": "Drew Kilbourne + Sammy Migues",
        "slug": "synopsys-software-security",
        "cover": "20230615_090604_4edf6aec520069184c56e0f2faa397c3.jpg"
    },
    {
        "podcast_id": 213546,
        "title": "The Tech Between Us",
        "description": "<p>The Tech Between Us is a part of Mouser Electronics' ongoing mission to Empower Innovation Together.</p><p>Hosted by Raymond Yin, Director of Technical Content for Mouser Electronics, each episode features a different technology or product-oriented conversation between Mouser's tech experts, technical representatives for manufacturer partners, prominent academics, and industry thought leaders.</p><p>To learn more, visit <a href=\"http://mouser.com/empowering-innovation\">mouser.com/empowering-innovation</a>.</p>",
        "language": "en",
        "author_name": "Mouser Electronics",
        "slug": "the-tech-between-us",
        "cover": "20230623_090659_f782e94e68ff09307e47db12cabcc82f.jpg"
    },
    {
        "podcast_id": 213600,
        "title": "The Overrun",
        "description": "<p>The Overrun is your home for all things automotive, from reviews of the hottest new cars on sale today to consumer advice, to news!</p>",
        "language": "en",
        "author_name": "Chase Bierenkoven, Jobe Teehan",
        "slug": "theoverrun",
        "cover": "20230606_100609_332e069601c1173c2c6bb3be6686e7e5.jpg"
    },
    {
        "podcast_id": 214481,
        "title": "Technożercy",
        "description": "<p>\"Technożercy\" to podcast w którym rozmawiamy o jutrze które właśnie nadeszło.</p><p>Dyskutujemy na temat otaczającej nas technologii z perspektywy zarówno dewelopera, jak i całkowitego nowicjusza.</p><p><a href=\"https://instagram.com/technozercy?igshid=NTc4MTIwNjQ2YQ==\">https://instagram.com/technozercy?igshid=NTc4MTIwNjQ2YQ==</a></p>",
        "language": "pl",
        "author_name": "Technożercy",
        "slug": "technozercy",
        "cover": "20230611_090612_19484d8b5ef5ede127f0ee353be33c26.jpg"
    },
    {
        "podcast_id": 214673,
        "title": "UNIFANS",
        "description": "<p>Benvenuti nel nostro Podcast di approfondimento universitario fatto da studenti per gli studenti! Siamo un gruppo di giovani appassionati dell'apprendimento e siamo qui per condividere con te la nostra esperienza, le nostre conoscenze e il nostro entusiasmo per il mondo. Ciò che ci distingue è che siamo proprio come te: studenti che stanno vivendo le sfide e le gioie dell'università in prima persona. Comprendiamo le tue preoccupazioni, le tue ansie e le tue passioni. Vogliamo creare una comunità di studenti che si sostengono a vicenda e che si ispirano reciprocamente nel percorso di apprendimento.</p><p>Instagram: <a href=\"https://www.instagram.com/_unifans_/\">https://www.instagram.com/_unifans_/</a></p><p>TikTok: <a href=\"https://www.tiktok.com/@ilpodcastuniversitario\">https://www.tiktok.com/@ilpodcastuniversitario</a></p><p>Youtube: <a href=\"https://www.youtube.com/@UNIFANS_\">https://www.youtube.com/@UNIFANS_</a></p><p>Per informazioni e collaborazioni: <a href=\"mailto:unifans2@gmail.com\">unifans2@gmail.com</a></p>",
        "language": "it",
        "author_name": "Andrea Fiorilli",
        "slug": "unifans",
        "cover": "20230612_060601_0bc8a932dd990cbe17dcf151b8487482.jpg"
    },
    {
        "podcast_id": 215167,
        "title": "SKYCAST: SKYGEN Specialty Benefits Insights",
        "description": "<p>SKYCAST: SKYGEN Specialty Benefits Insights<strong> </strong>brings you the latest trends in the vision and dental specialty benefits management and technology landscape – all from an industry leader who knows it best. Visit us at <a href=\"https://www.skygenusa.com/\">https://www.skygenusa.com/</a>.</p>",
        "language": "en",
        "author_name": "SKYGEN Team",
        "slug": "skycast-skygen-specialty-benefits-insights",
        "cover": "20230614_060658_e5d2dccedb620e988c3caf8e6531c20c.jpg"
    },
    {
        "podcast_id": 215169,
        "title": "Diálogo Urbano",
        "description": "<p>Diálogo Urbano es un podcast donde, de la mano de Visor Urbano, exploraremos los temas que moldean nuestra vida en las ciudades y cómo interactuamos con ellas.</p><p>Cada mes, nos sumergimos en conversaciones apasionantes y enriquecedoras con personas expertas en el cómo funcionan nuestras ciudades. Únete a nosotros mientras exploramos diversas cuestiones que nos atañen, compartiendo ideas, experiencias y soluciones innovadoras.</p><p>¡Sintoniza Diálogo Urbano el tercer jueves de cada mes y descubre cómo podemos mejorar la vida en las ciudades a través del uso de la tecnología!</p>",
        "language": "es",
        "author_name": "Visor Urbano",
        "slug": "dialogo-urbano",
        "cover": "20230614_060614_0f3ee701377c9db36f0c1180282c7db4.jpg"
    },
    {
        "podcast_id": 215809,
        "title": "TechLovers",
        "description": "<p>Debatimos Tecnología</p>",
        "language": "es",
        "author_name": "TechLovers",
        "slug": "techlovers",
        "cover": "20230619_010659_198b95d9f6365f62f775ef0d63497669.jpg"
    },
    {
        "podcast_id": 216775,
        "title": "THE Bitcoin Podcast",
        "description": "<p>Another F***ing Bitcoin Podcast? No, this is THE Bitcoin Podcast.</p><p>Weekly Bitcoin News Roundup (Wednesdays), Bitcoin Out Loud readings, Bitcoin 101, and Bitcoin Talk interviews.</p><p>Bitcoin is scarce, but Bitcoin Podcasts are abundant. Get the Bitcoin signal you need without taking up half your day.</p><p><a href=\"https://bitcoinpodcast.net/\">BitcoinPodcast.net</a></p>",
        "language": "en",
        "author_name": "Walker America",
        "slug": "bitcoinpodcast",
        "cover": "20230820_050808_c8acc07d7c247142eee9639fb4e7851a.jpg"
    },
    {
        "podcast_id": 216824,
        "title": "ai.cooking",
        "description": "<p>A podcast about artificial intelligence. Recent news items with informational \"corners\" such as Knowledge, History and Prompt Engineering.</p>",
        "language": "en",
        "author_name": "GWFF",
        "slug": "ainews",
        "cover": "20230627_010638_9452254ab813a3078e920707d5c0d893.jpg"
    },
    {
        "podcast_id": 216991,
        "title": "CIOandLeader Quick Bytes",
        "description": "<p>The <a href=\"https://www.linkedin.com/feed/hashtag/?keywords=cioandleaderquickbytes&amp;highlightedUpdateUrns=urn%3Ali%3Aactivity%3A7079077283252047872\">CIOandLeader Quick Bytes</a> podcast for 26 June 2023 looks at the ways banks are innovating with technology and using new tools.</p>",
        "language": "en",
        "author_name": "CIO&Leader",
        "slug": "cioandleader-quick-bytes",
        "cover": "20230627_060630_67f91b06ce574953da0e96ff25e9cb1b.jpg"
    },
    {
        "podcast_id": 217020,
        "title": "Podcast by Redington",
        "description": "<p><em>Connecting the Dots in the Tech World: Tune in to Podcast by Redington for a Friction-Free Tech Journey. B2B tech, limited.</em></p>",
        "language": "en",
        "author_name": "Redington MEA",
        "slug": "podcastbyredington",
        "cover": "20230704_110757_e196bc08ea858f23f0ee52f124d6e130.jpg"
    },
    {
        "podcast_id": 217042,
        "title": "Gaia-X Podcast: Event Series",
        "description": "<p>With our event series we aim to reflect on Gaia-X events and discuss latest topics and trends in the world of Data en Technology. </p>",
        "language": "en",
        "author_name": "Gaia-X Association for Data and Cloud",
        "slug": "gaia-x-podcast-event-series",
        "cover": "20230627_030644_84d037040803ea96f80379f1ae7d0c7f.jpg"
    },
    {
        "podcast_id": 217511,
        "title": "The Artificial Invaders ",
        "description": "<p>In our ever-evolving world, artificial intelligence (AI) has emerged as a groundbreaking force, transforming industries across the board. Join us on our podcast, \"The Artificial Invaders\" as we delve into the captivating realm of AI in healthcare.</p><p>In this series, we explore how AI is revolutionizing patient care, medical research, diagnostics, and more. Discover how advanced algorithms and machine learning models are empowering healthcare professionals to make more accurate diagnoses, predict disease outcomes, and design personalized treatment plans.</p><p>We dive deep into the myriad applications of AI in healthcare, including the use of natural language processing for improving clinical documentation and streamlining administrative tasks. Explore how AI-powered chatbots and virtual assistants are enhancing patient engagement, providing round-the-clock support, and triaging healthcare inquiries.</p>",
        "language": "en",
        "author_name": "Samuel Ang",
        "slug": "theartificialinvaders",
        "cover": "20230630_080605_5f89c511d988af4d9e42ec12d20b5df6.jpg"
    },
    {
        "podcast_id": 217634,
        "title": "Degen Dads",
        "description": "<p>Degen Dads Official Podcast about web3, emerging tech, NFTs and web3 games. </p>",
        "language": "en",
        "author_name": "Degen Dads",
        "slug": "degendads",
        "cover": "20230701_080729_3227ecc9780adf98ae11fb1e9fcd980b.jpg"
    },
    {
        "podcast_id": 217723,
        "title": "Famiboards Discussion Club",
        "description": "<p>A Famiboards community podcast, discussing games and more!</p>",
        "language": "en",
        "author_name": "Famiboards",
        "slug": "famiboards",
        "cover": "20230703_020754_55d8ab16564e8a9ae9e1deb0bc482201.jpg"
    },
    {
        "podcast_id": 217905,
        "title": "A Fake Show",
        "description": "<p>its not a real show, its a fake show.</p><p>with your host @gravyyrobber and your host @nathanhasit</p>",
        "language": "en",
        "author_name": "Gravyyrobber",
        "slug": "afakeshow",
        "cover": "20230703_100757_e61a96555604a901b738fa2124d9ffdd.jpg"
    },
    {
        "podcast_id": 218074,
        "title": "Wearable App Development",
        "description": "<p>In this conversation, Larry and Evelyn discuss the ongoing technological advancements and the increasing popularity of wearables. The conversation covers market statistics, and key considerations such as security, functionality, and the latest technology. They also mention BigOhTech as a leading company in wearable app development, timely project delivery, and focus on unique and modern solutions.</p>",
        "language": "en",
        "author_name": "olivia eve",
        "slug": "wearable-app-development",
        "cover": "20230705_070712_d64e3d6bd59173540a8c36f06c753ab8.jpg"
    },
    {
        "podcast_id": 218104,
        "title": "Assml music ",
        "description": "<p><strong><em>Assml is a esports from India </em></strong></p><p><strong><em>Gives you tutorial </em></strong></p>",
        "language": "en",
        "author_name": "Assml esports ",
        "slug": "assml",
        "cover": "20230705_010729_4ae951ac2a0dd4241f7fa3fbdfc6dcdc.jpg"
    },
    {
        "podcast_id": 218755,
        "title": "Telugu Tech Birds",
        "description": "<p>I Talk about Tech related news, topics in Telugu</p>",
        "language": "te",
        "author_name": "Vaileti Venkata Sai Kumar",
        "slug": "telugutechbirds",
        "cover": "20230710_110751_48a6c856afce3430f5b029528a21332c.jpg"
    },
    {
        "podcast_id": 218803,
        "title": "Wild Beasts",
        "description": "<p>The Markkula Center for Applied Ethics at Santa Clara University presents Wild Beasts, a series of conversations with professionals in applied ethics about current events, new technologies and social issues.</p><p>\"A man without ethics is a wild beast loosed upon this world.\" -Albert Camus</p>",
        "language": "en",
        "author_name": "Markkula Center for Applied Ethics",
        "slug": "wildbeasts",
        "cover": "20230804_070821_93017f3903a6b5b7cae5b674e7c30dfb.jpg"
    },
    {
        "podcast_id": 219043,
        "title": "Yo aprendo a mi manera",
        "description": "<p>¿Hola aprendiz estás listo para conocer algo nuevo el día de hoy?</p><p>En <a href=\"http://www.yoaprendoamimanera.com\">www.yoaprendoamimanera.com</a> puedes explorar el fascinante mundo de la tecnología, pero también puedes conocer acerca de otros temas como la cultura de México hasta exposiciones, música, pintura, recetas de cocina, reseñas de libros, historias extraordinarias y mucho más.</p><p></p>",
        "language": "es",
        "author_name": "Yo aprendo a mi manera",
        "slug": "yoaprendoamimanera",
        "cover": "20230712_020703_cc1b3a29751bf7bd2cceb36ca4725420.jpg"
    },
    {
        "podcast_id": 219353,
        "title": "FGC Cast",
        "description": "<p>Listen along as two amazing fighting game veterans, DaPurpleSharpie and Yohosie, showcase the best of the competitive fighting game community! Episodes are released every TWO WEEKS on YouTube and wherever else you get your favorite podcasts!</p>",
        "language": "en",
        "author_name": "DaPurpleSharpie and Yohosie",
        "slug": "fgc-cast",
        "cover": "20230713_090738_4a018bcd093ff713c42ad1363bf875ef.jpg"
    },
    {
        "podcast_id": 219843,
        "title": "Gaia-X Podcast: Interview Series",
        "description": "<p>Find out more about Gaia-X and its community by listening to the Interviews with Gaia-X insiders and community members recorded in 2022.</p>",
        "language": "en",
        "author_name": "Gaia-X Association for Data and Cloud",
        "slug": "gaia-x-podcast-interview-series",
        "cover": "20230717_020728_b8020b795d027570effe5f565726a0e1.jpg"
    },
    {
        "podcast_id": 219849,
        "title": "Digital Insights",
        "description": "<p>With this series we dive into the complex world of Data and Technology trough the eyes of Gaia-X. In this fast-paced digital age, where innovation and change are the norm, it’s crucial to stay informed and empowered. Join us as we dive deep into the latest trends, breakthroughs, and challenges shaping the tech industry. Welcome to the world of Gaia-X!</p>",
        "language": "en",
        "author_name": "Gaia-X Association for Data and Cloud",
        "slug": "gaia-x-digital-insights",
        "cover": "20230717_030700_1d7b6526420d6730aa5de1208ddefb7c.jpg"
    },
    {
        "podcast_id": 219961,
        "title": "Security Chips",
        "description": "<p>Security Chips is your go-to podcast on all things cyber security and data privacy.</p><p>With our series of episodes we delve deep into the minds of cyberspace experts, as they share their amazing experiences and insights.</p>",
        "language": "en",
        "author_name": "Data Security Council of India (DSCI)",
        "slug": "dsci",
        "cover": "20230718_040751_743cb771d971ab50857f37c8ef171e0c.jpg"
    },
    {
        "podcast_id": 220387,
        "title": "The Wakeup Call",
        "description": "<p>Welcome to \"The Wakeup Call,\" the podcast that brings essential tech insights to enhance your business, bolster your internet security awareness, and develop solid cybersecurity hygiene, especially in developing countries like Uganda. Join us as we delve into the world of technology and uncover practical tips to empower your digital journey.</p><p>Summary of Content Presented</p><ul><li><p>Business Growth in a Digital Age: Learn how to leverage technology to foster business growth and stay competitive in the ever-evolving market. We discuss various tools, resources, and best practices to maximize your online presence and reach a broader audience.</p></li><li><p>Internet Security Awareness: Protecting your digital assets and personal information is crucial in today's connected world. Tune in to discover essential internet security practices and how to safeguard your data from cyber threats.</p></li><li><p>Building Solid Cybersecurity Hygiene in Uganda: In a developing country like Uganda, where digital infrastructure is rapidly growing, establishing strong cybersecurity practices is vital. Our experts share insights into understanding potential risks and adopting proactive measures to ensure a safer digital environment.</p></li></ul><p>We love hearing from our audience! Share your thoughts, questions, and suggestions with us. Connect with us on Facebook /muyanjafred256, and be part of the tech discussion.</p><p>Subscribe to \"The Wakeup Call\" on your favorite podcast platform to stay up-to-date with the latest tech insights and interviews in each episode, one at a time.</p><p>Stay tuned for our next episode, where we will continue to explore fascinating tech topics that can shape your future. Until then, keep exploring, stay curious, and stay safe online!</p>",
        "language": "en",
        "author_name": "Muyanja Fred",
        "slug": "thewakeupcall",
        "cover": "20230720_120723_2dfd41f75f03b470e22f483da56696dd.jpg"
    },
    {
        "podcast_id": 220635,
        "title": "Un Shot de Ciencia",
        "description": "<p>Te traemos notas breves de avances científicos y tecnológicos</p>",
        "language": "es",
        "author_name": "Roxana de León",
        "slug": "unshotdeciencias",
        "cover": "20230722_030732_cd78b2b206475521921ad5f66dcefbe0.jpg"
    },
    {
        "podcast_id": 221048,
        "title": "SNS ICE Podcast",
        "description": "<p>SNS ICE podcast - your go-to source for the latest news and in-depth insights in the world of 6G in Europe. Join us as we dive into the industry news, analyze the latest trends, and discuss the development of the new generation of cellular networks.</p><p>This podcast is brought to you by SNS ICE – an EU-backed project focused on creating a collaborative environment for the development and deployment of 6G smart networks and services. The project has received funding from the European Union’s Horizon Europe Research and Innovation programme under Grant Agreement No 101095841.</p>",
        "language": "en",
        "author_name": "SNS ICE Podcast",
        "slug": "snsice",
        "cover": "20230731_050723_beb76824a14c88fd41a281c001c820cc.jpg"
    },
    {
        "podcast_id": 222862,
        "title": "Explicably Inexplicables",
        "description": "<p>Welcome to \"Explicably Inexplicables\"! We are Nikhil and Arnav, co-hosts and juniors at Lebanon Trail High School, passionate about unraveling the mysteries of finance, technology, and business. </p><p>Tune in every Saturday and Wednesday for a new podcasts!</p><p>Follow us on instagram @explicably_inexplicables and be sure to subscribe to stay tuned for future podcasts!</p><p>We post blogs &amp; discussion boards on our website as well (currently under construction)</p>",
        "language": "en",
        "author_name": "Arnav Senapathi and Nikhil Kotta",
        "slug": "explicablyinexplicables",
        "cover": "20230806_100833_485d385f5cf36354a3f73b7c1bb7bad7.jpg"
    },
    {
        "podcast_id": 223077,
        "title": "WILL INDIA STAY A DEVELOPING COUNTRY FOREVER?",
        "description": "<p>In this episode of GIM the panelists will discuss about migration</p><p>being part of our society and how the pace of the process have</p><p>acceleraterd over years.</p><p>The panelists discuss the impacts of the phenomenon thoroughly</p><p>with various perspectives and leaves the audience with a</p><p>thoughy provoking question of ,</p><p>“ Is Migration benificial for nation building.\"</p>",
        "language": "en",
        "author_name": "AYUSHI AGRAWAL/MANANLI JAIN/SHEEL MUTHA",
        "slug": "hindustan-times",
        "cover": "20230808_070806_9a416bc642912f093909fd1eb69d13e5.jpg"
    },
    {
        "podcast_id": 223108,
        "title": "TechХабѐр",
        "description": "<p>Вашето предаване за технологични новости, с водещ Николай Иванов, в което се коментират последните събития, версии на технологии и други разнообразни теми. С любезното съдействие на Accedia.</p>",
        "language": "bg",
        "author_name": "Accedia",
        "slug": "techhaber",
        "cover": "20230808_120841_a4f74f78ee3d0a1319892254c8d808f2.jpg"
    },
    {
        "podcast_id": 223209,
        "title": "NachoTuesday thought leadership interview series with real SaaS Founders, VCs, and Leaders",
        "description": "<p>NachoTuesday is a production by NachoNacho, the world's largest B2B SaaS Marketplace and the best way to buy SaaS. Our relationships with thousands of industry leaders give you front-row seats to deep insights you can't get anywhere else from tried and true software entrepreneurs and industry leaders. </p><p>In these exclusive interviews, you will learn about incredible new SaaS tools to grow or manage your business and exclusive “behind the scenes” stories about how these companies were started, lessons from key executives, and professional insight into key industry themes. Learn from their deep industry knowledge at the prime of their careers. </p>",
        "language": "en",
        "author_name": "NachoNacho",
        "slug": "nachonacho",
        "cover": "20230809_010812_7a34bfe6312af75271db657753608201.jpg"
    },
    {
        "podcast_id": 224394,
        "title": "Yasmeen's Podcast on Education",
        "description": "<p>I am an Education Manager with 15 years experience in mostly post 16 and Higher Education institutions.</p>",
        "language": "en",
        "author_name": "Yasmeen Mansur",
        "slug": "yasmeen-testing",
        "cover": "20230820_040802_62a7d1b81d4bf6d3fd459c9454179265.jpg"
    },
    {
        "podcast_id": 224681,
        "title": "Why Yall Working - A Tech Radio Show & Podcast",
        "description": "<p>Why Yall Working is a weekly tech &amp; startupsshow hosted by Alairé Jameson and Michael Ogunsanya! Every Thursday from 5-7 pm EST, we dive into the newest tech, VC, and small business news to keep you informed, educated, and entertained! Like and subscribe to the show! #NightCrew</p>",
        "language": "en",
        "author_name": "Why Yall Working - A Tech Radio Show & Podcast",
        "slug": "wyw",
        "cover": "20230818_070820_7e578b26ffb49e8fff4b10c11493c757.jpg"
    },
    {
        "podcast_id": 224874,
        "title": "INOVACIÓN Y TECNOLOGÍA APLICADA A LA EDUCACIÓN",
        "description": "<p>HABLAREMOS PREVIAMENTE DEL GIRO QUE LE HA DADO LA TECNOLOGÍA A LA EDUACIÓN EN CUESTIÓN DE INOVACIÓN </p>",
        "language": "es",
        "author_name": "Abril García García",
        "slug": "abrilgarciagarcia",
        "cover": "20230819_090815_05ce6c8485022adc7d3c243bf1a7affb.jpg"
    },
    {
        "podcast_id": 225479,
        "title": "VuTalk",
        "description": "<p>VuTalk shares the latest technological trends in Video Wall management and Video Wall Cyber Security.</p>",
        "language": "en",
        "author_name": "VuWall",
        "slug": "vutalk",
        "cover": "20230823_020819_1f321500df1fc408410e5008468cc696.jpg"
    },
    {
        "podcast_id": 226126,
        "title": "Scouting Tech",
        "description": "<p>Hello, and welcome to our first edition of the talking tech podcast. My name is Srivar Raj, and here we will divulge into the latest technology related happenings, such as AI, biomedical technologies, aerospace engineering, and so much more. We will also have a segment each podcast where we discuss AI such as ChaGPT so we can learn about it together.</p>",
        "language": "en",
        "author_name": "Srivar Raj",
        "slug": "scouting-tech",
        "cover": "20230827_100811_a74f33200400c4889115a4ab13aa3ec1.jpg"
    },
    {
        "podcast_id": 226127,
        "title": "Scouting Tech",
        "description": "<p>Hello, and welcome to our first edition of the talking tech podcast. My name is Srivar Raj, and here we will divulge into the latest technology related happenings, such as AI, biomedical technologies, aerospace engineering, and so much more. We will also have a segment each podcast where we discuss AI such as ChaGPT so we can learn about it together.</p>",
        "language": "en",
        "author_name": "Srivar Raj",
        "slug": "scouting-tech1",
        "cover": "20230827_100801_d8c6be4326dbee70648b36abd73f9459.jpg"
    },
    {
        "podcast_id": 226503,
        "title": "AI Generated Business News: Information Technology Sector",
        "description": "<p>Your AI associate who reads every call from earnings , industry conferences, investor days , special management updates— distilling key details in under 5 mins. Power up your commute and expand your knowledge about diverse set of companies and industries with this audio podcast!</p><p>Responsible AI Disclaimer: This entire podcast is automatically created by Generative AI algorithms so the content could have factual errors, biased or inappropriate text.</p>",
        "language": "en",
        "author_name": "TeeSnee AI",
        "slug": "teesnee",
        "cover": "20230830_040842_4ab20cf3903258923ecde93e3ba2a257.jpg"
    },
    {
        "podcast_id": 226752,
        "title": "Digital Dive Blog",
        "description": "<p>Welcome to Digital Dive, your ultimate source for exploring the intricate and ever-evolving realms of the digital landscape. In this captivating blog, we embark on a journey to unravel the mysteries</p>",
        "language": "en",
        "author_name": "AR.Remon",
        "slug": "digital-dive-blog",
        "cover": "20230831_080809_4508e34294c4204679ffbacc218ed086.jpg"
    },
    {
        "podcast_id": 226896,
        "title": "Rustropy.dev",
        "description": "<p>Wasm Talk</p><ul><li>Audio book for dev blog</li></ul>",
        "language": "en",
        "author_name": "Alan Poon",
        "slug": "rustropy-dev",
        "cover": "20230902_010928_92f7a6e540c7f97bd84134e2c20f4894.jpg"
    },
    {
        "podcast_id": 227325,
        "title": "The Cyber Security Recruiter Podcast",
        "description": "<p>The mission is simple: To enhance your career growth within the Cybersecurity community &amp; bring interesting and knowledgable guests onto the Podcast so that you can benefit from their experience.</p>",
        "language": "en",
        "author_name": "Thomas Richard",
        "slug": "thecybersecurityrecruiterpodcast",
        "cover": "20230905_030941_0e31f4b42d8c162c8426c7cd28adabca.jpg"
    },
    {
        "podcast_id": 227527,
        "title": "Digital Discovery Podcast",
        "description": "<p>Welcome to the Retail Digital Discovery Podcast, where innovation meets retail! Your go-to resource for all things technology and business in the retail industry, with a special focus on the transformative power of artificial intelligence. Join us as we delve into the cutting-edge trends and advancements that are shaping the retail landscape.</p>",
        "language": "en",
        "author_name": "Nigel Price",
        "slug": "digitaldiscoverypodcast",
        "cover": "20230908_010915_997c23cc227eff79ac43a4e132c5083b.jpg"
    },
    {
        "podcast_id": 227707,
        "title": "Desync Podcast",
        "description": "<p>A podcast featuring content creators Berks and SaltEMike chatting about content creation, gaming, and also interviewing guests from those spaces.</p>",
        "language": "en",
        "author_name": "Desync Podcast",
        "slug": "desync",
        "cover": "20230907_110931_d770f6682b3eb75b390407b74a789759.jpg"
    },
    {
        "podcast_id": 228370,
        "title": "Eye On AI",
        "description": "<p>Welcome to 'Eye on AI', your audio compass guiding you through the intricate maze of Artificial Intelligence. As you tune in, you'll embark on an auditory journey that delves deep beneath the surface of AI, shedding light on the brilliance of its innovations and the dilemmas it presents.</p><p>Have you ever marveled at how Siri or Alexa understands your commands, or pondered how your Netflix recommendations are so spot on? How about the algorithm that tailors your social media feed, making you lose track of time? It's all a result of the magic weaved by AI—a blend of mathematics, programming, and often, sheer genius.</p><p>But AI isn't just about algorithms or technological innovations. It's also about the challenges it presents, the ethical tightropes it has us treading, and the sociopolitical implications it carries. As machines become increasingly intelligent, surpassing human abilities in various fields, where does this leave us—the original thinkers? 'Eye on AI' doesn't shy away from these tough questions. Instead, it invites them, fostering a platform where we can discuss, debate, and decipher the larger implications of this tech phenomenon.</p><p>From the latest breakthroughs that have scholars buzzing to real-world applications that touch our everyday lives, we’ll uncover it all. And it's not just for the tech-savvy. Whether you're an AI aficionado or just curious about that voice inside your GPS, we aim to make AI approachable, understandable, and exciting for all.</p><p>So, if you've ever been intrigued by how AI is reshaping industries, from healthcare to finance, or if you've pondered what the future might look like in an AI-dominated world, this podcast is your ticket. We promise captivating conversations, intriguing insights, and perhaps, a new way to look at the digital world around you.</p><p>Join us, as we embark on this voyage, charting the vast ocean of Artificial Intelligence, a realm where possibilities are endless and the future is now. Subscribe and become a fellow explorer of the AI frontier, navigating its wonders and challenges together. Welcome aboard 'Eye on AI', where every episode promises a deeper understanding of the world's most transformative technology.</p>",
        "language": "en",
        "author_name": "CyberVenger LLC",
        "slug": "eyeonai",
        "cover": "20230912_040955_0a4dd16d2165ed31c3a6cbdb8c169638.jpg"
    },
    {
        "podcast_id": 228510,
        "title": "Innovation Nation",
        "description": "<p>Innovation Nation Podcast tries to help Micro and Small businesses overcome common business challenges by interviewing other owners and CEO's of innovative companies.</p><p>By shedding light on solutions, we want to empower entrepreneurs, and MSMEs, with the tools to be successful.</p>",
        "language": "en",
        "author_name": "Kevin A Francis",
        "slug": "innovationnation",
        "cover": "20230913_020952_e1574fb5b091f1cb4161044c1a3f546c.jpg"
    },
    {
        "podcast_id": 228558,
        "title": "Tech Stories",
        "description": "<p>I have 20+ years of experience in the tech industry. Having worked at giant companies as well as startups with a handful of employees, sometimes doing a side-hustle just to pay the bills. There are so many stories to tell about the people, companies and products. What are some of the new innovations that are coming down the line. Let's have engaging conversations and maybe talk to a few thought leaders as well.</p>",
        "language": "en",
        "author_name": "jman",
        "slug": "techstories",
        "cover": "20230918_070952_f428e5640396e3dc319fd54f9bdbb85d.jpg"
    },
    {
        "podcast_id": 228595,
        "title": "HoloCast",
        "description": "<p>Holographic podcast using HoloConnect</p>",
        "language": "en",
        "author_name": "Dr. Fernando De La Peña Llaca",
        "slug": "holocast",
        "cover": "20230914_040930_8b2a639f09049c8d72b408929ffa0ac2.jpg"
    },
    {
        "podcast_id": 228978,
        "title": "Autotune Me: Play, Unwind, Repeat",
        "description": "<p><strong>Welcome to the Autotune Me Podcast.</strong></p><p><strong>In this podcast, Dr. Kendra Ray and her guests unravel the creative arts therapies and their influence on the brain and memory. Each month, a featured interview will highlight how music, dance, and the arts have played a vital role in the lives of people from suffering from memory disorders as well as their friends and families. Follow us at autotuneme.org.</strong></p>",
        "language": "en",
        "author_name": "Kendra Ray",
        "slug": "autotunemeintroduction",
        "cover": "20230916_100926_bc145d74e8ee2921219db27171581676.jpg"
    }
]