[
    {
        "podcast_id": 283,
        "title": "Why In The World",
        "description": "Join Ben Sheppard as he asks adventurers, athletes, and those with inspiring stories, why? \n\n* NEW EPISODES SOON *\n\n#WhyInTheWorld 🌍",
        "language": "en",
        "author_name": "Ben Sheppard",
        "slug": "whyintheworld",
        "cover": "20200420_090656_472651fde858d411b9b9e2f31b406816.jpeg"
    },
    {
        "podcast_id": 2267,
        "title": "JMO Podcast",
        "description": "<p>The Jason Mitchell Outdoors JMO Podcast covers stories and opinions from behind the scenes in the fishing industry. A deep dive for timely tips and tactics for Midwest fishing opportunities. Guests include some of the biggest and most entertaining names in the fishing world. From seasoned guides to NWT pros and industry insiders, the JMO Podcast delivers some of the most fascinating insights on fishing from across the Midwest.</p>",
        "language": "en",
        "author_name": "Jason Mitchell Outdoors",
        "slug": "jmopodcast",
        "cover": "20230310_120325_02730cd43972da9a634595bbdcfe3c12.jpg"
    },
    {
        "podcast_id": 6018,
        "title": "Dive Bomb Squadcast",
        "description": "Dive Bomb Industries was established in 2011 to provide waterfowl hunters with ultra-high quality products at an unbeatable price with unmatched customer service. Fast-forward 10 years & we are the fastest growing waterfowl decoy company on the planet.\n\nDive Bomb Squadcast was created for both novice & veteran waterfowlers. As we all know, this sport can be very humbling & there is always something new to learn. Our goal with this podcast is to not only give you a deeper look inside Dive Bomb Industries, but to help you be more successful in the field by properly utilizing our products with the help of industry professionals. We will discuss our travels in-depth & the equipment used. We will talk about what worked, what didn't work, & any adjustments that had to be made. We will bring guests on the show from around the world to talk about how they utilize their Dive Bombs & the things that have helped them become more successful. We will discuss new products, funny stories from the road, hear from guests involved in the waterfowl industry & much more! \n\nListen along as we give you a glimpse inside the lives of the #DIVEBOMBSQUAD.",
        "language": "en",
        "author_name": "Ashur Tolliver",
        "slug": "divebombsquadcast",
        "cover": "20200204_043755_46556ad476b0e2fd830b79336c23a5b9.jpeg"
    },
    {
        "podcast_id": 6980,
        "title": "Mad Mountain Collective",
        "description": "Base Camp for Outdoor Culture \n",
        "language": "en",
        "author_name": "Scott Young",
        "slug": "madmountain",
        "cover": "20200423_170957_53cd79219739470b0ab18ff1393a9ff6.jpeg"
    },
    {
        "podcast_id": 7291,
        "title": "Women in Waders",
        "description": "Women in Waders is a storytelling podcast dedicated to supporting and empowering the community of fisherwomen and sharing their stories honestly and authentically.\n",
        "language": "en",
        "author_name": "Natalie Davey",
        "slug": "womeninwaders",
        "cover": "20200331_234045_3b170b49ad2ad32fd5a484f1bfe88d48.jpeg"
    },
    {
        "podcast_id": 7851,
        "title": "Firearms Industry News",
        "description": "Weekly news from the firearms, shooting sports, hunting, and outdoor industry as well as interviews with industry professionals!",
        "language": "en",
        "author_name": "Caleb Giddings",
        "slug": "firearmsindustrynews",
        "cover": "20200416_210533_c6bea003d173eb20ce407acbf4d19e25.jpeg"
    },
    {
        "podcast_id": 8145,
        "title": "Dirty Giants",
        "description": "Tune in every week to listen to stories about big bucks, and get tips and tactics from some of the most successful mule deer hunters around. ",
        "language": "en",
        "author_name": "Konley Heaton ",
        "slug": "dirtygiants",
        "cover": "20200506_030221_553959fc4ddeaaff4a0e78b33d9e93c1.jpeg"
    },
    {
        "podcast_id": 8297,
        "title": "Sauvage de Nature",
        "description": "Dans ce podcast, nous allons à la rencontre d'athlètes, d'aventuriers et de sportifs de haut niveau. Nous explorons leur parcours, leur mode de vie et ce qui les a guidé à poursuivre leur passion. ",
        "language": "fr",
        "author_name": "Martin Richard",
        "slug": "sauvagedenature",
        "cover": "20220604_010642_a893765a9a0a4dfa982b00dd692427fc.jpg"
    },
    {
        "podcast_id": 8417,
        "title": "Crest Surfcast",
        "description": "All things surf from in and out of Wales, hosted by Tom Anderson, Rob Blythe, James 'Rhino' Thomas and others. Interviews with local, national and international legends, topical discussion and general stoke!\n\n(Producer: James Dodd; \nArtwork: GS Design Co;\nMusic copyright James Dodd )",
        "language": "en",
        "author_name": "Tom Anderson",
        "slug": "crestsurfcast",
        "cover": "20210304_135539_5661b1fd3dec6303f85ce36c9a20ee16.jpg"
    },
    {
        "podcast_id": 10036,
        "title": "The Prepared Mindset Podcast",
        "description": "<p>A podcast for the everyday person, interested in preparation, shooting, planning and gear. Features a broad range of guests, topics and discussion points, as well as current events pertaining to politics, training, being prepared, and the world around you.</p>",
        "language": "en",
        "author_name": "The Prepared Mindset Team",
        "slug": "preparedmindset",
        "cover": "20200626_132624_3a1b571ac2b3013294ed9f8cf4a8ed1d.jpeg"
    },
    {
        "podcast_id": 10355,
        "title": "Nope. I'm Scared",
        "description": "Hello! We are just two sisters who love to talk about the weird and spooky. True crime? yep. Ghosts? Of course. Lore? Oh, you bet. Hopefully we are serving up something you can dig (like a grave) and come on our spooky adventure with us. We are in no way pros at this and are very much still figuring this all out, but we're having fun and hope you do too. Byeeeeeee!",
        "language": "en",
        "author_name": "Alexa Bohorquez and Ella Farris",
        "slug": "nopeimscared",
        "cover": "20200708_010532_78266aacb89358d902c2055406a1c8e8.jpg"
    },
    {
        "podcast_id": 11051,
        "title": "Wilder Gents",
        "description": "Just two guys talking all things outdoors and wilderness therapy with years of experience in the woods. Come hangout around the fire with us! New outdoor topic each episode! ",
        "language": "en",
        "author_name": "Rhett Garrett and Dakota Shaffer",
        "slug": "wildergents",
        "cover": "20200801_232247_8dd5961b5d78d1d151a617b8451db0d8.jpg"
    },
    {
        "podcast_id": 12248,
        "title": "SplitLine Offroad",
        "description": "Rodney Cooper & Brandon Whitehair talk offroad racing. We will talk local East Coast races, GNCC and Pro Motocross. Listen to us weekly as we break down what is happening in the offroad community on two and four wheels. ",
        "language": "en",
        "author_name": "Rodney Cooper",
        "slug": "splitlineoffroad",
        "cover": "20200910_020628_f05eaf760862be7f3922b94ac62c9fb0.jpg"
    },
    {
        "podcast_id": 13289,
        "title": "The Rad Times",
        "description": "The Rad Times Podcast es una colección de historias de aventuras y tragedias compartidas por Andrés, sus amigos y personas que conoce alrededor del mundo.  \n\nEn cada episodio se narra una historia de un viaje planificado  que al llevarlo a la práctica no resultó exactamente como fue pensado, allí comienzan los desafíos que llevan al protagonista a decir: \"y ahora cómo salgo de esto? Para ello deberá tomar decisiones y llenarse de aprendizajes, que finalmente,  lo harán crecer como ser humano y como profesional. \n\nSe enfoca en los momentos cómicos, dramáticos, de terror y hasta creepy de las historias traídas por los invitados. \n\nA todo el mundo le gusta una buena historia, luego de un viaje que se complica siempre queda una experiencia vivida y una  lección aprendida que los acompañará de por vida, así que...¡press play and lets have a Rad TIme!!",
        "language": "en",
        "author_name": "Andres Villalobo",
        "slug": "theradtimes",
        "cover": "20211216_091208_7325ac4fec194b8b8d2ca49765f44b9d.jpg"
    },
    {
        "podcast_id": 22555,
        "title": "The Hunter's Quest Podcast",
        "description": "Hunting | Spiritual Formation | Fitness",
        "language": "en",
        "author_name": "Hunter McWaters",
        "slug": "huntersquest",
        "cover": "20220331_080327_7e127c72389016ee7a56ed4d9a2dda4c.jpg"
    },
    {
        "podcast_id": 23293,
        "title": "Narcosis: Into The Deep",
        "description": "Narcosis: Into the Deep is an investigative podcast focusing on SCUBA diving and marine accidents and deaths.\n\nEach episode will feature a deep investigation into a different scuba diving or marine accident, along with facts or theories about the events leading up to them and potential ways these accidents or deaths could have been avoided. \n\nBecome a Patreon for just $3 a month! Receive exclusive updates, vote on what to hear next, get a shout-out at the end of the next episode, and merchandise discount!: https://www.patreon.com/narcosispod?fan_landing=true\n\nBuy Podcast Merch (100% of profits from the \"Save Our Reefs\" line go to the Reef Restoration Foundation): https://www.etsy.com/shop/NarcosisIntoTheDeep\n\nLearn more about the Reef Restoration Foundation here: https://reefrestorationfoundation.org/\n\nFollow the podcast on Instagram: https://www.instagram.com/narcosispod/\n\nJoin the Discord Server: https://discord.gg/hepFA9Jtkj\n\nCheck out our new website here: https://www.narcosispod.com",
        "language": "en",
        "author_name": "Alex",
        "slug": "narcosispod",
        "cover": "20210116_054112_1ec1943ccc8a59d02b34b2ba77f0ab2b.jpg"
    },
    {
        "podcast_id": 23483,
        "title": "Hunting With Jbone",
        "description": "Hey Everyone, if you are like me and struggled getting into hunting. You can learn from my mistakes, this show will cover all the topics you need to get into the sport and become a successful hunter. This is an Edmonton based podcast that will give regulars people like you and me an opportunity to harvest animals without breaking the bank",
        "language": "en",
        "author_name": "Jerome",
        "slug": "huntingwithjbone",
        "cover": "20210110_164926_118b51c2f0fcb6927f8a1936a6375217.jpg"
    },
    {
        "podcast_id": 27618,
        "title": "The Guide Post ",
        "description": "A community hub where anglers, fishing guides, scientists, and policymakers connect to discuss fisheries, their history, their futures, and the importance of effective management.\n\nProduced by the American Saltwater Guides Association.\nPresented by Costa Sunglasses.",
        "language": "en",
        "author_name": "American Saltwater Guides Association",
        "slug": "theguidepost",
        "cover": "20211101_181234_9385d3872fe6c3169c17c44b34152d69.jpg"
    },
    {
        "podcast_id": 33731,
        "title": "Land Ethic",
        "description": "The Land Ethic Podcast features people who have dedicated their lives to conservation and stewardship of the natural world. Hosted by Dylan Bagnasco. ",
        "language": "en",
        "author_name": "Dylan Bagnasco",
        "slug": "landethic",
        "cover": "20220428_030437_8707c1db3eb4973801c3375a438ee88b.jpg"
    },
    {
        "podcast_id": 38580,
        "title": "Hopeful Environmentalist",
        "description": "<p>Previously known as the Angry Environmentalist, our host, Taylor Ganis, has re-branded to the Hopeful Environmentalist with a mission to spread more positivity in the climate space.</p><p>Climate change is here, and it's already wreaking havoc on millions of people from around the world. The Hopeful Environmentalist Podcast provides hope-based discussions with well known and established environmental professionals to both educate and empower you to become a change maker. Together, we can continue our journey towards a better world, while using our hope (and sometimes a million of other intense feelings) to guide us. </p><p>This podcast is for EVERYONE, and we encourage those who may be new to the environmental space to reach out with any questions!</p>",
        "language": "en",
        "author_name": "Taylor Ganis",
        "slug": "angryenvironmentalist",
        "cover": "20220825_050803_a8711a79954dec7e25d8b7abf317fc90.jpg"
    },
    {
        "podcast_id": 41387,
        "title": "Adventure is a Mindset",
        "description": "The Adventure is a Mindset Podcast from Maddog Adventures.\n\nWe'll be chatting to not only Team MDA but also our friends and brands in the outdoor and Veteran community.",
        "language": "en",
        "author_name": "Maddog Adventures",
        "slug": "mdaepisode1",
        "cover": "20210314_122911_92e9266b41ca3358cc4b27dcec0fcd30.jpg"
    },
    {
        "podcast_id": 43975,
        "title": "Abnormal Adventures ",
        "description": "Abnormal Adventures with Kari Taylor. Talking through all life's sometimes abnormal adventures with the amazing people I've meet along the way. ",
        "language": "en",
        "author_name": "Kari Taylor",
        "slug": "abnormaladventures",
        "cover": "20210416_194612_1d14ba43f21cdfa4a674b2a5e3a21182.jpg"
    },
    {
        "podcast_id": 45967,
        "title": "Back 40 Skull Sessions",
        "description": "\"Its your lie, tell it how you want!\"\nAppalachian Holler Hunters VERY FIRST podcast!  After a few months of hard work and waiting, we're finally releasing our first podcast episode!  Its your lie tell it how you want, is kinda the main phrase for the show, this is meant to be entertaining, and give you insights to some of the craziest Appalachian hunting experiences that's ever happened!  It'll be funny and maybe accidentally educational!   Hope you enjoy!\n",
        "language": "en",
        "author_name": "Appalachian Holler Hunters",
        "slug": "back40skullsessions",
        "cover": "20210401_040546_957dfa51aa2144746c87e029da980472.jpg"
    },
    {
        "podcast_id": 49093,
        "title": "Gunday Brunch",
        "description": "We're the firearms industry's calm voice of reason, and that should scare you.",
        "language": "en",
        "author_name": "GAT Daily",
        "slug": "gundaybrunch",
        "cover": "20210413_141213_31e2b24684dce4f8d0471b6b81d5eca0.jpg"
    },
    {
        "podcast_id": 50439,
        "title": "SEATS TAKEN",
        "description": "FIVE ORDINARY GUY'S DOING A PODCAST DISCUSSING OUR PASSION AND TRYING TO FIND OUR SEAT AT THE TABLE!",
        "language": "en",
        "author_name": "SEATS TAKEN",
        "slug": "seatstaken",
        "cover": "20210419_000526_046daf23408b70ee06c2ad22cfd9189e.jpg"
    },
    {
        "podcast_id": 60821,
        "title": "Quackin Smack Podcast",
        "description": "Podcast for Waterfowl Hunting and overall Outdoors life. ",
        "language": "en",
        "author_name": "Quackin Smack",
        "slug": "quackinsmack",
        "cover": "20210603_211636_ab17b7f73c59bac5c39b0090be7345c4.jpg"
    },
    {
        "podcast_id": 62244,
        "title": "Peak Season ",
        "description": "The Peak Season Podcast, brought to you by the Mountain Bureau LLC, is a interview based podcasts following the seasons of North America's iconic Mountain Ranges. The people that explore the rocks, glaciers, slopes and walls are the focus of the show. The host Steffan Gregory, a climbing guide working with the Mountain Bureau will introduce you to the people that have made these places so special to so many. ",
        "language": "en",
        "author_name": "Peak Season",
        "slug": "peakseasonpodcast",
        "cover": "20210612_003412_e93d0f6b19eed5b02d4e665be42aa3c0.jpg"
    },
    {
        "podcast_id": 62805,
        "title": "Josh^2",
        "description": "Join up on an adventure around the US where we talk about what we did that day and other random stuff that comes up in conversation.\nFind us on Instagram @josh_2_squared",
        "language": "en",
        "author_name": "Joshua",
        "slug": "josh2",
        "cover": "20210620_133208_3fed9976ce05f0744251ea9665d70a97.jpg"
    },
    {
        "podcast_id": 69436,
        "title": "Locked On Sound",
        "description": "An outdoorsman's podcast, by outdoorsman. Locked On Sound Podcast Presents itself in all topics circling around hunting, angling, and anything else brought up throughout the laid-back conversation. ",
        "language": "en",
        "author_name": "Locked On Sound",
        "slug": "lockedonsound",
        "cover": "20220826_030801_822d5edc946defa872a9ed06ea77d914.jpg"
    },
    {
        "podcast_id": 70412,
        "title": "Panhandle PoorLand Podcast",
        "description": "This is a podcast that surrounds the upbringing of a Panhandle hunting group, hosted by Chase Mendoza, and Co-Hosted by Stetson Mendoza. \nOur podcast is for anyone that wants to get involved in hunting! Our experience comes from being raised without private land hunting privileges, or money to do any paid hunts, so we started hunting public land with success.\nOur mission as Panhandle PoorLand Hunting Crew is to show everyone that you dont have to be raised with money, raised hunting, or even have private land to hunt on to have success...you just have to jump in and DO IT!!\n\nLets Go Hunting!!",
        "language": "en",
        "author_name": "Chase Mendoza",
        "slug": "panhandlepoorland",
        "cover": "20210727_214548_894338bb3aaf4d9ead858ef75d2721c9.jpg"
    },
    {
        "podcast_id": 75415,
        "title": "Wildly Basic",
        "description": "A place where everyday women can share their love of the outdoors. Find us on Instagram @wildlybasicpodcast\n\nHosted by Allie Donaldson and Emma Martin, Wildly Basic is a podcast dedicated to creating space for, and celebrating, femininity in the backcountry. Join them as they share the experiences of everyday, strong and empowering women to create community and rewrite harmful narratives in the outdoors. \n\nWhether a chat with an insightful guest or a rant between the two hosts, each episode discusses various thoughts and ideas about the feminine outdoors and inspires you to embrace your basic, authentic self!",
        "language": "en",
        "author_name": "Allie and Emma",
        "slug": "wildlybasic",
        "cover": "20210907_013757_32d859fea8c059a0cd954166f0b1dfbc.jpg"
    },
    {
        "podcast_id": 79746,
        "title": "Ridge Hunter Outdoors Podcast",
        "description": "<p>Every Monday, the Ridge Hunter Outdoors team and guests share stories, tips, tactics, and strategies that have made them both successful and unsuccessful in the whitetail woods. Join us and you might learn something to help you become a better hunter. At the very least, you should be entertained.</p><p>Be sure to tune in for Full Draw Fridays as well, where you'll learn even more about habitat management and hunting strategy.</p>",
        "language": "en",
        "author_name": "Ridge Hunter Outdoors",
        "slug": "ridgehunteroutdoorspodcast",
        "cover": "20230308_080318_889ded138c9d3f5e1e3a9e4c662b7e45.jpg"
    },
    {
        "podcast_id": 82450,
        "title": "Sommets et Collets - Le Balado",
        "description": "<p>Sommets et Collets est une baladodiffusion qui met en valeur des randonneurs et aventuriers expérimentés mais aussi des amateurs connus et moins connus qui pratiquent le sport. Ils partagent la passion des grands espaces, de l'aventure et des bières de micro. Animé par Alexis le Randonneur et secondé par Sylvain Bouchard sommelier en bières, ce podcast te feras passer en leur compagnie une heure de pur plaisir!</p>",
        "language": "fr",
        "author_name": "Alexis le Randonneur",
        "slug": "alexislerandonneur",
        "cover": "20220929_050909_8c8fb9dde9ae57f055c03c801316bbc1.jpg"
    },
    {
        "podcast_id": 85172,
        "title": "The Nimrod Outdoors Podcast",
        "description": "M.A. and Chelsea have an imperfect marriage and are raising imperfect children. Marriage and raising a family isn't about acheiving perfection but rather solidifying the foundation their home is built on as they spiritually fight for their children and the generations to follow. Spiritual leadership and discipleship should be priority in the home. Through this passion, they started a nonprofit men's minsitry in 2014 which they operate in the southeastern United States. They use the outdoors as a platform to challenge and equip men to be spiritual leaders in their home. In 2022, they also released a 30 days men's devotion called \"The Hands of a Warrior.\" \n\nJoin M.A. and Chelsea bi-weekly as they explore challenging topics they experience through marriage, parenting, and relationships. They hope to make you laugh through relatable moments while also inviting you to join in on the spiritual discussions.",
        "language": "en",
        "author_name": "M.A. & Chelsea Dozier",
        "slug": "nimrodoutdoors",
        "cover": "20230126_100127_403c3c8386c0b320ca385635215ed76b.jpg"
    },
    {
        "podcast_id": 86055,
        "title": "Mountains Mend Minds (hosted by Ross Cunningham)",
        "description": "A podcast to promote the mental health benefits of hillwalking by speaking to inspirational people who love the mountains as much as we do.",
        "language": "en",
        "author_name": "Ross Cunningham",
        "slug": "mountainsmendminds",
        "cover": "20211019_221928_2f84b7500761175f908045bba217160b.jpg"
    },
    {
        "podcast_id": 88858,
        "title": "The Green Screen Podcast",
        "description": "Account run by University of Minnesota Duluth Student Association. College students talking about sustainability and a variety of topics associated with it! A new episode will be released each week so make to hit the follow button!  ",
        "language": "en",
        "author_name": "The Green Screen Podcast Group",
        "slug": "thegreenscreenpodcast",
        "cover": "20211110_231513_436ed1854457a828609e3ba17b3675b8.jpg"
    },
    {
        "podcast_id": 96431,
        "title": "Back Up For Grabs",
        "description": "The ultimate Survivor rewatch podcast, starting from Season 1. We're launching on January 4th! Tune in for your between-season Survivor rut. ",
        "language": "en",
        "author_name": "Hannah & Kylie",
        "slug": "backupforgrabs",
        "cover": "20211219_021218_02f09bc70f2e92f490425379f685f91c.jpg"
    },
    {
        "podcast_id": 99593,
        "title": "Dock Talk WV",
        "description": "YOUR ULTIMATE RESOURCE for tournament bass fishing in West Virginia and the Tri-State area. Showcasing local anglers and tournament results.",
        "language": "en",
        "author_name": "Chase Sansom",
        "slug": "docktalkwv",
        "cover": "20220108_030134_73a65a682595dcceb682bfe957db2668.jpg"
    },
    {
        "podcast_id": 103887,
        "title": "The Obsession Podcast",
        "description": "This is a podcast for the obsessed, and life changing habits needed to take big deer with a bow every season! We talk about the techniques that we have used over the last twenty five plus years to take great bucks on film with bows. We will give you information on land layouts, tips like mock scrapes, foodplotting, timberstand improvement. Things we have used to take well over two hundred plus deer on film over the years. We came up with this idea to help everyone become a more effective hunter, and to help boost your success in the woods. We are looking forward to helping everyone to have a more fulfilling hunt at every level. Our back ground we have worked in the hunting industry in many levels for over 25yrs. We did the TV thing we worked for Summit treestands on their TV show Summit high place for years. When they sold the company we moved on to our own company RushOutdoorswi, then the Obsession TV which allot of you watched on the hunt channel. Our show The whitetail Obsession was quite popular. When we seen how the decline of the shows at that level was changing, and not representing the everyday hunter we started RushOutdoorswi YouTube channel. A channel for real hunts with well over three hundred hunts it has become quite popular also. We thank all of you for the success. Thank You! We have now been asked to do podcasts on many different aspects of hunting, and to share our 25 plus years each of  hunting knowledge to help everyone become a better hunters. We believe that we can help more people become successful at this level, and are excited about this new venture. We are excited to hear your questions, and give you the answers that we believe will help you get the buck of a lifetime! Remember you can listen right here, Apple Pocast, Goggle Podcast, Iheartradio Podcast, Spotify Podcast, and ask questions. Remember you can see the show if you want to see our ugly mugs on our YouTube channel RushOutdoorswi, and remember to subscribe to the channel. Also remember to ask us anything you want to know about hunting. You can ask your questions right there on the comments at our YouTube channel, or you E mail questions to rushoutdoorswi@gmail.com.  Thanks for listening, and all of your support.           ",
        "language": "en",
        "author_name": "Karl Bethke",
        "slug": "rushoutdoorswi",
        "cover": "20221213_051242_e6196c06fa6bb403ddda13047017b787.jpg"
    },
    {
        "podcast_id": 104255,
        "title": "Exploring Human Excellence with Marc Warnke",
        "description": "Marc believes humans are amazing critters and has spent a lifetime building relationships with amazing, brilliant people who are passionate about human excellence and the pursuit in what fires them up. He LOVES talking with brilliant word-smiths about the deeper meaning to \"all things human.\" Topics they discuss will be outdoor adventure, homesteading, self reliance, pack goats, personal growth, human evolution, philosophy and just plain kicking ass at life.  ",
        "language": "en",
        "author_name": "Marc Warnke",
        "slug": "exploringhumanexcellencewithmarcwarnke",
        "cover": "20220127_100126_a8068e1806186c74fe522198cd6704aa.jpg"
    },
    {
        "podcast_id": 107576,
        "title": "Upland Nomads Podcast",
        "description": "There is nothing better than hanging out and conversing with friends after a day in the field chasing birds. Upland Nomads is a podcast focused on just that, the adventures and comradery that comes with what we all love to do, chase upland game birds.",
        "language": "en",
        "author_name": "Mike Kolness and Wyatt Peppel",
        "slug": "uplandnomadspodcast",
        "cover": "20230214_120252_47a11169f7a35c47908b401740fcf7b4.jpg"
    },
    {
        "podcast_id": 107930,
        "title": "Northern Latitudes",
        "description": "Northern Latitudes is a Canadian-based podcast dedicated to exploring the people, places, news and events that make the great outdoors great.",
        "language": "en",
        "author_name": "Bill Ault",
        "slug": "northernlatitudes",
        "cover": "20220318_020330_bc74452160b7f9c8c08d90b2246c89cc.jpg"
    },
    {
        "podcast_id": 112360,
        "title": "Open Air Humans",
        "description": "<p>Open Air Humans is a bi-weekly podcast in which outdoor luminaries share incredible stories about how they've found a happier, healthier more human life outside. For millennia, humans spent 90% of their lives outside. Today, they spend 90% inside. It’s no wonder so many feel out of balance and disconnected from their essential nature. Recent scientific studies prove what many have long suspected: that more time outside makes the modern human happier, healthier and more fulfilled. In the Open Air Humans podcast, Emmy award winning host Jesse Roesler uncovers the stories that led outdoor luminaires to spend a substantial amount of their time in wild places and the ultimate impact it’s had on their lives. Along the way, guests share actionable advice, rituals, insights, favorite gear and destinations that can help us all live a better life outside.</p>",
        "language": "en",
        "author_name": "Credo Nonfiction",
        "slug": "openairhumans",
        "cover": "20220302_120300_47b88ce3cb46a010250067b549dd3d39.jpg"
    },
    {
        "podcast_id": 113732,
        "title": "Girls Who Camp",
        "description": "Meet the girls who camp! We talk about our most recent (winter) camping adventure and tell you who we are while we drink wine with my dog. Enjoy!",
        "language": "en",
        "author_name": "Emma and Alexa",
        "slug": "girlswhocamp",
        "cover": "20220308_030305_6b08ef9954362242bcd6245e649070bf.jpg"
    },
    {
        "podcast_id": 114326,
        "title": "Bayou Dragons Podcast ",
        "description": "A group of friends who share a driven passion for the outdoors. Good times and good stories.",
        "language": "en",
        "author_name": "Bayou Dragons Podcast",
        "slug": "bayoudragons",
        "cover": "20220310_060323_dbd7dc3df27ba5e94ac3084810aa57d7.jpg"
    },
    {
        "podcast_id": 117104,
        "title": "Women in Whitewater",
        "description": "A four-part limited audio series exploring what it’s like to be a woman in the professional whitewater industry. This is a podcast and Master's Thesis. All episode transcripts can be found at womeninwhitewater.wordpress.com ",
        "language": "en",
        "author_name": "Rowan Stuart",
        "slug": "womeninwhitewater",
        "cover": "20220325_020358_68dba3f85046ec1b1f1c645f92db0ae8.jpg"
    },
    {
        "podcast_id": 117423,
        "title": "The Boston Ski Party",
        "description": "The Ski Monster is an elevated ski and snowboard experience based in the heart of Boston. Our podcast, The Boston Ski Party, offers an unfiltered and honest view behind the scenes of the ski and snowboard industry. We talk with guests ranging from TSM team members to athletes to major movers and shakers that push this industry forward. ",
        "language": "en",
        "author_name": "The Ski Monster",
        "slug": "theskimonster",
        "cover": "20220425_040457_be6160b1d75ae1af306600171e4ed5cf.jpg"
    },
    {
        "podcast_id": 119907,
        "title": "The Blood Money Podcast",
        "description": "This podcast will be defining the occupations in and around the outdoor sector. These are back-stories of the blood, sweat, and tears that have been shed by individuals striving to live a life close to nature.",
        "language": "en",
        "author_name": "Waypoint Outfitters",
        "slug": "bloodmoney",
        "cover": "20220404_050450_30401a0afed157aab5caa0964b35f6b6.jpg"
    },
    {
        "podcast_id": 124869,
        "title": "Natureversity Podcast",
        "description": "Since 2014, Natureversity Outdoor School has been committed to restoring eco-literacy among children and adults in order to help them foster a deeper connection with our natural world. Listen as school director Chris Hyde sits down to interview students, teachers, parents and wilderness survival professionals from around the country about all things nature.",
        "language": "en",
        "author_name": "Natureversity Outdoor School",
        "slug": "natureversity",
        "cover": "20220427_020404_4d5a410edc1f93424d63ed941011e0bf.jpg"
    },
    {
        "podcast_id": 125510,
        "title": "The Chasin Coveys Podcast",
        "description": "Follow us on our journey into the upland community! We will talk all things upland hunting from the dogs we run, the birds we hunt, and our passion for bobwhite quail hunting in the Southeastern United States!",
        "language": "en",
        "author_name": "Hunter Prevatte/Jordan Caudle",
        "slug": "thechasincoveyspodcast",
        "cover": "20220430_020425_4dd7f42f9ccef8cb34a3a524178f876d.jpg"
    },
    {
        "podcast_id": 126570,
        "title": "mostgreen talks",
        "description": "كلام عن البيئة والحياه المستدامة وأشياء أخرى - يقدمه مصطفى مجدي",
        "language": "ar",
        "author_name": "Mostafa Magdy",
        "slug": "mostgreentalks",
        "cover": "20220506_100555_2f26e50aac324325753b9280c439b23b.jpg"
    },
    {
        "podcast_id": 127328,
        "title": "Spent Shells",
        "description": "Let’s talk GOOD, BAD and UGLY. \nWhy’d it happen? Why didn’t it happen?\nOn here, we’re talking about trips and adventures.\nPros and Cons of each and what we learned from them all. \n\nJoin in with me, Blake Hodge, and let’s talk. ",
        "language": "en",
        "author_name": "Blake Hodge",
        "slug": "spentshellsbhodge",
        "cover": "20220510_120555_222750c0341dd2b2f2918ecee8b4a5df.jpg"
    },
    {
        "podcast_id": 129880,
        "title": "The Outdoor Wiser Brand",
        "description": "The Outdoor Wiser Brand is a small group of outdoorsmen bringing everything to you that will help out on your adventures and make you laugh along the way.\nStay smart, stay Outdoor Wiser.",
        "language": "en",
        "author_name": "Seth Petersen",
        "slug": "the-outdoor-wiser-brand",
        "cover": "20220523_020510_92625476665c3027399bd9f8ccae81fc.jpg"
    },
    {
        "podcast_id": 131578,
        "title": "A Just Natural Africa ",
        "description": "Africa holds up to 30% of the global biodiversity yet losing it at the fastest rate then ever recorded in the history of humanity. \nThis podcast brings forth unique narratives, experiences and insights from young African across the continent speaking to and sharing stories from their landscapes. ",
        "language": "en",
        "author_name": "Aiita Joshua Apamaku ",
        "slug": "naturewild",
        "cover": "20221022_081033_32afded38d28f315169abb981d613250.jpg"
    },
    {
        "podcast_id": 135368,
        "title": "Rugged Identity Podcast ",
        "description": "Rugged Identity Podcast is hosted by Blake Blackwell and special guests who go over all things bow hunting and scripture each week. One deserves to know their identity isn’t determined by their success in the field but in their savior Jesus Christ. The core values of rugged identity are: follow Jesus, love your neighbor, and work hard. Whether you’re new to the faith, a seasoned hunter, a born again believer, or just getting into the outdoors, this podcast has something for you. ",
        "language": "en",
        "author_name": "Blake Blackwell",
        "slug": "ruggedidentity",
        "cover": "20220619_100608_790e89fc846800e4e4bc82435fa0a373.jpg"
    },
    {
        "podcast_id": 135413,
        "title": "Kentucky Hiker Project Podcast",
        "description": "Highlighting some of the best hiking in the Commonwealth and benefiting organizations conserving and expanding our Public Lands.",
        "language": "en",
        "author_name": "Michael Harr",
        "slug": "kentuckyhikerproject",
        "cover": "20220620_020646_6514ceb643d8a26f4df9a5642ecfeaae.jpg"
    },
    {
        "podcast_id": 135919,
        "title": "HBRV Lifestyle",
        "description": "<p>We talk about everything about the RV Business, Camping, Fishing, and of course RV loans and finance. We take questions and will answer them on the show. Submit questions to levingstonrvservices@gmail.com You can also follow us on YouTube https://www.youtube.com/c/HBRVLifestyle</p>",
        "language": "en",
        "author_name": "Johnathan Levingston",
        "slug": "honeybadgershow",
        "cover": "20230911_110945_d3bdc5834275c9fc85018d0994387343.jpg"
    },
    {
        "podcast_id": 139856,
        "title": "Making It Fitz Podcast",
        "description": "<p>Hosted by Martin and Kaitlin Fitzpatrick. We share budget friendly tips to the US National and State Parks as well as stories from our DIY projects and life. Follow us at MakingItFitz on Instagram and subscribe to www.KaitlinCreatesHome.com newsletter to get updates on all things</p>",
        "language": "en",
        "author_name": "Martin & Kaitlin",
        "slug": "makingitfitz",
        "cover": "20220909_050934_5027750dffbb63f671664cadfaaf04a4.jpg"
    },
    {
        "podcast_id": 139858,
        "title": "Snowbirds & RV Travelers",
        "description": "Snowbirds & RV Travelers is the bi-weekly show for RV travel enthusiasts from casual to veterans, weekenders to full-time RVers, staycationers to snowbirds. Tech Tuesdays are all about Maintenance, Upgrades, Reviews, Trends and Accessories; while on Thirsty for Travel Thursdays we talk about Parks, Attractions, Destinations, Travel Tips, and the latest news affecting your RV experience. For exclusive content, stickers, merchandise, guest opportunities on the show, head over to our website at rvpodcasts.com and tell all your RV friends that the show is completely free anywhere that you can stream podcasts.",
        "language": "en",
        "author_name": "Perry Mack",
        "slug": "snowbirdsrvtravelers",
        "cover": "20220711_100716_4fd2883273560104864573a9821f1b64.jpg"
    },
    {
        "podcast_id": 142931,
        "title": "Big World, Small Bites",
        "description": "As the climate crisis carries on, it can be daunting to try and follow along and find your role. Is it worth it to recycle? Does composting make a difference? Do we blame the corporations and step back? In Big World, Small Bites, hosts Calli Lambard and Grant Rowe walk you through the wicked problem of climate change, offering action in small, digestible pieces. Listen in and learn about the true impact of your actions, what you can do, and how to find your place in this fight. Using their campus as a small case study, Calli and Grant exemplify how impactful small actions can be. We all play a part in our future. The world can seem big, but Calli and Grant will break it down into small bites. ",
        "language": "en",
        "author_name": "Grant Rowe and Calli Lambard",
        "slug": "bigworld-smallbites",
        "cover": "20220915_020927_1adf4dff29c354c4f6f4aee4ace3ac4f.jpg"
    },
    {
        "podcast_id": 143688,
        "title": "The Lookout Podcast",
        "description": "Host Luke Barrett sits down with guests to discuss topics such as Wildland Firefighting, Forest Service, Montana, home brewed beer, hockey, fishing, hunting, outdoor recreation, mental health, and mindfulness. ",
        "language": "en",
        "author_name": "The Lookout Podcast",
        "slug": "the-lookout-podcast",
        "cover": "20220731_100717_5c173cff8d5c427ba036c114f58cc113.jpg"
    },
    {
        "podcast_id": 145138,
        "title": "NSD 411 Podcast",
        "description": "NSD 411 is a Podcast to inform, promote, and report results of National Sporting Dog events. We look forward to having you listening in!",
        "language": "en",
        "author_name": "National Sporting Dog, Inc.",
        "slug": "nsd411",
        "cover": "20220816_020816_bde0762ec9adc607b5612f5041c4d4b8.jpg"
    },
    {
        "podcast_id": 145964,
        "title": "Cheap Therapy ",
        "description": "Very unorthodox podcast, recorded from a very unorthodox gun store in Garland, TX.\nWe cover a great many interests and topics; spanning across firearms laws, hunting, entrepreneurship, music, masculine endeavors, and plenty of hair-raising topics.\n\nSponsored by Lateral Limits, LLC (www.laterallimits.com)",
        "language": "en",
        "author_name": "Keenan Allemond",
        "slug": "cheaptherapy-laterallimits",
        "cover": "20220821_080840_f155953d3056468bfb4959d72c37d75b.jpg"
    },
    {
        "podcast_id": 146897,
        "title": "Chasing Tail Podcast",
        "description": "3 dudes being dudes. Talking everything bowhunting and outdoors.",
        "language": "en",
        "author_name": "Midwest Tail Chasers",
        "slug": "chasingtail",
        "cover": "20230214_010258_1d78ddd646bb4c1006db017b0106e847.jpg"
    },
    {
        "podcast_id": 147138,
        "title": "ALL PAK'D UP",
        "description": "PAKMULE is a conservation-minded company, whose goal is to encourage and inspire folks to escape on the weekends to wild places that invigorate their senses and warm their souls.  It’s about recovery, renewal, confidence and inspiration; while also gaining a greater appreciation for our wild places, public lands, parks. We’re building future stewards who will dig in, and work to protect these great places for generations to come. ",
        "language": "en",
        "author_name": "PAKMULE",
        "slug": "pakmule",
        "cover": "20221021_051008_b835e15bbbe7782e1241586c7aa9c662.jpg"
    },
    {
        "podcast_id": 150730,
        "title": "Across the Gun Counter",
        "description": "Across the Gun Counter - A gun podcast brought to you by Joe and Tyler, whom both work in the business of firearms but different sides. Joe, working from the perspective of sales and managing a gun store, where Tyler runs and operates his own gunsmithing business \"Precision Rifle Works\". Both have similar views and different experiences not only working with firearms, but growing up around firearms. If you are looking for a different perspective on the firearms and the industry that comes with it, this is the place for you. ",
        "language": "en",
        "author_name": "Joe Riva",
        "slug": "acrosstheguncounter",
        "cover": "20221103_011127_d8eb5d9f25e77d168fc9e3d18a531dad.jpg"
    },
    {
        "podcast_id": 153694,
        "title": "The Alba Cross",
        "description": "The Alba Cross podcast explores the connections between land, sea and people, through the means of sustainable and active travel to promote accessibility in the Scottish Outdoors. ",
        "language": "en",
        "author_name": "The Alba Cross",
        "slug": "thealbacross",
        "cover": "20220915_050929_d36035ebfcc1a666a0d5665e6a283155.jpg"
    },
    {
        "podcast_id": 154039,
        "title": "The Midwest Tines",
        "description": "The Midwest Tines Hunt Podcast.",
        "language": "en",
        "author_name": "Braeden Towles",
        "slug": "whitetailthirtyfourpodcast",
        "cover": "20230111_100113_4ca44700459ae16c01a3b3126bc531ef.jpg"
    },
    {
        "podcast_id": 155970,
        "title": "Up North Rocks",
        "description": "<p>Up North Rocks is a podcast all about climbing in Northern Ontario. Listen to hear from the folks who make Northern Ontario climbing great!</p><p>Follow us on Instagram @upnorthrockspodcast to stay up to date with the show and climbing news in the North!</p><p>The climbing scene in northern Ontario is not huge – but what we lack in numbers we more than make up for in commitment, passion, and the massive wealth of rock we have to play on. There has to be at least 5 routes for every climber in the region – lineups are non-existent, parking is rarely an issue. We really are blessed. A huge part of that blessing is that we all have the privilege to live and play on the vast Anishnaabe territories north of gitchi gumee (also known as Lake Superior). Up North Rocks seeks to build community and connection between the humans who love the rocks of Northern Ontario. Come join us.</p><p></p><p>Graphic Design by Quintin Golka</p>",
        "language": "en",
        "author_name": "Mike Hyer",
        "slug": "upnorthrocks",
        "cover": "20230414_030411_54d8c23b6099355f13cf52d4d22c38cf.jpg"
    },
    {
        "podcast_id": 158858,
        "title": "The Environment Today",
        "description": "Welcome to the Environment Today! Every week we talk all things environment. What are the pressing issues? What is going on around the world? What is the future going to look like? Join us every Friday for a new episode!",
        "language": "en",
        "author_name": "Kevin Tankersley",
        "slug": "theenvironmenttoday",
        "cover": "20221008_021037_d500fe4b1059561955316b35641fcf88.jpg"
    },
    {
        "podcast_id": 159345,
        "title": "Thoughts of a woodsman preacher",
        "description": "Wilderness, wisdom and theology. Join me as we seek the truth of God from the prospective of rivers, woodlands and mountains. ",
        "language": "en",
        "author_name": "Josh Lutje",
        "slug": "woodsmanpreacher",
        "cover": "20221010_071007_730395006bf2b645006380284f762a0d.jpg"
    },
    {
        "podcast_id": 160084,
        "title": "The Shot Call Podcast",
        "description": "This podcast will talk about everything outdoors including waterfowl hunting, big game hunting, upland bird hunting and everything in between. Sometimes the topics might be about the outdoors and other times be ready. ",
        "language": "en",
        "author_name": "LIF Hunting",
        "slug": "theshotcall",
        "cover": "20221013_111037_73b3d509af6befae27851901221e7d4c.jpg"
    },
    {
        "podcast_id": 162803,
        "title": "The Fishing Podcast",
        "description": "Una lenza, un amo e qualche pesce: fiumi, laghi e mari sono da sempre il refugium peccatorum di milioni di pescatori.\nNon senza problemi, la pesca in Italia muove moltissime persone.\nMa oggi, nonostante comodità e tecnologia, perché andiamo ancora a pescare?",
        "language": "it",
        "author_name": "Gianmarco Mondini",
        "slug": "thefishingpodcast",
        "cover": "20221024_011029_112399d3c8c470197d15e8dc60ca04e4.jpg"
    },
    {
        "podcast_id": 165821,
        "title": "Camping on the wild side ",
        "description": "Hello and welcome \nMy name is Steve Walker I am an Actor, Voiceover Artist, Radio Presenter, Rookie You Tuber and now venturing into Podcasting. If you have a passion for Wild Camping, Tents the Outdoors and Scotland then this will be for you. Here I will be talking about my Wild Camping trips around Scotland, talking in detail about preparation, foods, gear, tents and the whole set up that I go through, so join me as I take you Camping on the wild side.",
        "language": "en",
        "author_name": "Steve Walker",
        "slug": "campingonthewildside",
        "cover": "20221106_061151_b736a2a7699525a4562cfc4b03170b95.jpg"
    },
    {
        "podcast_id": 166728,
        "title": "Brandon On The Go",
        "description": "Brandon On The Go vous propose de partir en road trip au chaque deux semaines pour aller à la rencontre de gens passionnés d'ici dans le but de vous présenter toutes les activitées à faire en région et découvrir l'authentique Outaouais! À travers nos rencontres, nous allons vous proposer plusieurs choses à faire, des joyaux cachés, des conseilles, bref tout ce que vous avez besoin pour profiter pleinement de vos vacances en Outaouais. En discutant avec des entrepreneurs d'ici, on pourra mieux comprendre leurs réalités, mais surtout mieux apprécier les produits et les services offerts en Outaouais. Abonnez-vous dès aujourd'hui et préparez-vous pour toute une aventure en Outaouais avec Brandon dans le siège du conducteur!\n\nBrandon On The Go Podcast est développé en partenariat avec Aventure Outaouais et Outaouais Plein Air. Aventure Outaouais est la seule entreprise de tours guidés tout-inclus en Outaouais et elle vous propose plusieurs esapades tout au long de l'année, comme des Routes des vins, une Tournée des microbrasseries de Gatineau, des excursions en kayak, etc. ",
        "language": "fr",
        "author_name": "Brandon Bolduc",
        "slug": "brandononthego",
        "cover": "20221109_101140_31b5553263b6080819d09865bb52572b.jpg"
    },
    {
        "podcast_id": 169874,
        "title": "SBSoutdoors",
        "description": "We are a group of outdoorsman enjoying everything the great outdoors have to offer and documenting the journey. Join us as we chat about our adventures and talk to guests about theirs as well. See ya out there!",
        "language": "en",
        "author_name": "the Crew",
        "slug": "sbsoutdoors",
        "cover": "20221122_101137_c70dfbb6528c9d04bb0c65ec61809b7c.jpg"
    },
    {
        "podcast_id": 169987,
        "title": "The Outdoor Hour",
        "description": "<p>Oklahoma City’s exclusive outdoor radio show—hosted by Taylor Maples. As a lifelong outdoorsman and former college athlete, Taylor has always been fascinated by the crossover between the life lessons learned in sports and lessons learned in the outdoors. Alongside weekly guests like experts from the Department of Wildlife Conservation, hunting guides, college coaches, professional athletes, and more, Taylor discusses hunting, fishing, conservation, and recreation while building community and educating Oklahoma City on relevant outdoor topics. This fun, engaging, inclusive, and educational segment is the only Outdoor focused radio show in the market-and a great way to reach outdoor enthusiasts! Listen live Wednesday at 8p &amp; Sunday at 9a CT locally on 107.7 FM The Franchise and stream it online at www.TheFranchiseOK.com; or catch the podcast release each Thursday at 8am CT.</p>",
        "language": "en",
        "author_name": "Taylor Maples",
        "slug": "theoutdoorhour",
        "cover": "20221123_121118_f0d8d97312d23f491132a61e02281896.jpg"
    },
    {
        "podcast_id": 174908,
        "title": "Poor Way Podcast",
        "description": "Welcome to the official Poor Way Outdoors' Podcast, sponsored by the Poor Way Outdoors' social medial accounts. If you've got any ideas, special guests, or topics give us a shout and look us up on our Facebook Page and group along with our Instagram account!",
        "language": "en",
        "author_name": "Poor Way Outdoors",
        "slug": "poorwayoutdoors",
        "cover": "20230125_040140_79d9a36c857b9f58891bc9e1b7269c68.jpg"
    },
    {
        "podcast_id": 176551,
        "title": "Flap N your Gums",
        "description": " Couple of brothers just hanging out chatting it up about life. Talking about everything. Getting to know us and what is coming up on future Podcasts. Just having fun and want to bring others along. ",
        "language": "en",
        "author_name": "Vinny & Hessey",
        "slug": "flapnyourgums",
        "cover": "20230207_050220_fd52a95668d4bc5930ed4339224dd39b.jpg"
    },
    {
        "podcast_id": 179064,
        "title": "Nature's Finest Hikes",
        "description": "Feed your sense of wanderlust and get inspiration and ideas for hiking trips of your own from Nature's Finest, a talk show showcasing amazing places for hiking and recreation in Kentucky and bordering states. Episodes will generally be about 45-60 minutes in length, covering everything from nearby lodging and food to all the park's amenities, of course including a long discussion of trails and hiking in the park. \n\nWhether you're looking for somewhere with family fun, history, backpacking, vast overlooks, or a combination, you're bound to find your next destination right here, on Nature's Finest. 1-2 new episodes per month!\n\nMy aim is to be a great resource on places to visit and escape the fluorescent lights or city noise, but this is an entertainment show, and you should contact real pros, like a Ranger's Office, for example, and be sure to do your own homework before tackling a new destination. There's no such thing as too much research when it comes to Mother Nature. Always take notice of posted recreation rules and recommendations wherever you go.",
        "language": "en",
        "author_name": "Garrett Blank",
        "slug": "naturesfinesthikes",
        "cover": "20230108_060155_567047e02b82da1b5b7b4eb4f2958be3.jpg"
    },
    {
        "podcast_id": 179859,
        "title": "Norse Wilderness ",
        "description": "Hunting, Fishing, and Adventure, the tales are all relived here.",
        "language": "en",
        "author_name": "Justin Stearns",
        "slug": "norsewilderness",
        "cover": "20230111_060102_efa9cf714ac8d915410d9f5b1ceebc92.jpg"
    },
    {
        "podcast_id": 181353,
        "title": "Boundless Pursuit with David Graham",
        "description": "<p>Boundless Pursuit is a podcast dedicated to the unique exploits and experiences of multi-species anglers and passionate outdoorsman. We cover a wide array of topics in angling from the Arctic down to the jungles of Amazonia and everything in-between. Alligator gar, sturgeon, arapaima, goliath grouper, sharks, bass, trout, bowfin and snakeheads... everything! Join the host, David Graham, as he brings weekly guests that shed insight on their experiences in the Outdoors that will leave you feeling encouraged, laughing, provoked, curious and inspired!</p>",
        "language": "en",
        "author_name": "HRWT Studios",
        "slug": "boundlesspursuit",
        "cover": "20230201_040219_eba0cbec78ffd78c853891abb54cc493.jpg"
    },
    {
        "podcast_id": 183666,
        "title": "Species Specific with Josh Dolin",
        "description": "A fishing podcast hosted by Master Angler Josh Dolin in which he highlights and breaks down individual species and everything it takes to research, target, and capture trophy fish within them.",
        "language": "en",
        "author_name": "HRWT Studios",
        "slug": "speciesspecific",
        "cover": "20230201_040232_f1349e0ca14df0d3f3165d7f6b3f06f7.jpg"
    },
    {
        "podcast_id": 183667,
        "title": "The Peelin Drag Podcast with Josh Dolin and Grant Alvis",
        "description": "A weekly podcast hosted by anglers Grant Alvis and Josh Dolin, two friends that have spent the last 15 years traveling and chasing big fish. Join them as they discuss current topics in the angling world and relive some of the ridiculous stories that have gotten them to where they are now.",
        "language": "en",
        "author_name": "HRWT Studios",
        "slug": "peelindrag",
        "cover": "20230201_040206_21e127e168bef0d6a4dc67402e08d96d.jpg"
    },
    {
        "podcast_id": 183670,
        "title": "Have Rods Will Travel with Josh Dolin and David Graham",
        "description": "Join David Graham and Josh Dolin as they host a weekly program where they catch up, talk fishing in their respective parts of the country, and discuss the filming of the \"Have Rods Will Travel\" TV Show.",
        "language": "en",
        "author_name": "HRWT Studios",
        "slug": "haverodswilltravel",
        "cover": "20230201_050219_89318086c620fe91eb98e5032a739e2f.jpg"
    },
    {
        "podcast_id": 187549,
        "title": "Harvesting The Gospel Podcast",
        "description": "Our goal is to reach people with the outdoors and most importantly, Jesus. We give tips on how to become a better outdoorsman, and how to strengthen your walk with God.",
        "language": "en",
        "author_name": "Harvesting The Gospel Podcast",
        "slug": "harvesting-the-gospel-podcast",
        "cover": "20230208_120205_2a660a8ba849387d7839bafb68644292.jpg"
    },
    {
        "podcast_id": 190047,
        "title": "The Tailwater Fly Shop Podcast",
        "description": "<p>This podcast is about all things fly fishing at Tailwater Fly Shop in Palm Harbor, FL. We discuss gear like rods and reels, techniques for species like Tarpon, Snook, and Redfish, and talk with captains and how they approach these things. Tune in for some insider information from professionals in the industry</p>",
        "language": "en",
        "author_name": "Tailwater Outfitters",
        "slug": "tailwaterflyshopodcast",
        "cover": "20230216_080241_77b023af853f3466997398f4b88acf9e.jpg"
    },
    {
        "podcast_id": 191437,
        "title": "Outdoor Adventures Podcast ",
        "description": "<p>This is the Outdoor Adventures Podcast. The O.A.P. crewmembers are regular guys, with normal lives, with a passion for the outdoors. We discuss hunting, fishing, hiking, back-packing, mushroom hunting, and all things wild. E-mail us at <a href=\"mailto:oapcrewquestions@gmail.com\">oapcrewquestions@gmail.com</a> to suggest topics or share stories.</p>",
        "language": "en",
        "author_name": "Sam Williams",
        "slug": "outdooradventures",
        "cover": "20230222_120212_913054cadee3e91107ed7baa6543eba8.jpg"
    },
    {
        "podcast_id": 199904,
        "title": "Storied",
        "description": "<p>As participants in our natural world, we are fortunate to witness some awe-inspiring events. Not limited to hunting and fishing, this is a fireside chat podcast that dives into all stories made in the outdoors. Join us to relive great memories made in wild places.</p>",
        "language": "en",
        "author_name": "Ryan Wierzba & Reuben Frey",
        "slug": "storied-podcast",
        "cover": "20230331_120342_258c3db165da9a5cf48de4cba65f1919.jpg"
    },
    {
        "podcast_id": 201103,
        "title": "Hunter Fishes",
        "description": "<p>On the Hunter Fishes podcast we love to talk about fishing. But we want to know more about our guests than just fishing. Everyone’s story is different and unique. We want to know their story. The story of how they got to where they are now and how fishing played a roll in getting there.</p>",
        "language": "en",
        "author_name": "Hunter Baughman",
        "slug": "hunterfishes",
        "cover": "20230403_070428_8351104a376e6b1631eed72d2b15a7c7.jpg"
    },
    {
        "podcast_id": 203001,
        "title": "CACCIA Outdoors Podcast",
        "description": "<p>Welcome to the CACCIA Outdoors Podcast, your go-to source for everything related to hunting and outdoor recreation in California and beyond. Our show is all about providing the latest information, tips, and strategies to help you make the most of your time in the great outdoors.</p><p>Whether you're a seasoned hunter or just starting out, we've got you covered. We'll be discussing everything from the best hunting spots in California to gear recommendations and safety tips. We'll also be sharing stories and experiences from our own hunting trips and those of our guests, so you can learn from the pros and maybe even get inspired to plan your own adventure.</p><p>But we're not just about hunting. We'll also be covering other outdoor activities like hiking, camping, fishing, and more. California is home to some of the most breathtaking scenery in the country, and we want to help you explore it all.</p><p>So whether you're looking to bag that trophy buck, catch some trout in a mountain stream, or just soak up the natural beauty of the Golden State, tune in to the CACCIA Outdoors Podcast. We'll be your guide to everything the great outdoors has to offer.</p>",
        "language": "en",
        "author_name": "Clayton Wyatt",
        "slug": "cacciaoutdoors",
        "cover": "20230413_020446_45dec79d07fb61c4a693a15dcd49a173.jpg"
    },
    {
        "podcast_id": 204727,
        "title": "In Her Nature",
        "description": "<p><a href=\"https://www.instagram.com/inhernaturepod/\"><strong>In Her Nature</strong></a> is a podcast &amp; community where you can learn from other’s experiences to make your next adventure more approachable. We believe new experiences make us better people. Join Caroline as she figures out from others what's in her nature.</p><p>(As always, take our advice with a grain of salt! We don’t claim to know it all, but hopefully this content provides you direction in pursuing your current idea. Things pertinent to your safety and health should be discussed with a professional.)</p>",
        "language": "en",
        "author_name": "Caroline Miller",
        "slug": "inhernature",
        "cover": "20230424_070450_7dee79534373dbb1491e89e6a6609c33.jpg"
    },
    {
        "podcast_id": 206719,
        "title": "Justice For Jackie Podcast",
        "description": "<p>We rewatch yellowjackets and talk about each episode drops every Friday</p><p>Twitter @jackie_pod</p><p>Instagram @justice.for.jackie</p><p>Email in your favourite theories</p><p>justiceforjackiepod@mail.com</p>",
        "language": "en",
        "author_name": "Aidan O'Sullivan and India Day",
        "slug": "justice-for-jackie",
        "cover": "20230505_060517_450658262096d09bef5d4be6a70408d2.jpg"
    },
    {
        "podcast_id": 208303,
        "title": "TestaMonials with Chuck Testa",
        "description": "<p>Viral Taxidermist Chuck Testa hosts TestaMonials with his buddy and fellow taxidermist extraordinaire, Matt Dockstader. The two talk all thing stuffed, outdoors, and more</p>",
        "language": "en",
        "author_name": "Thomas McClain",
        "slug": "testamonials",
        "cover": "20230510_070513_af2ded478a4ff4ff8c98a6dca33bb27b.jpg"
    },
    {
        "podcast_id": 208307,
        "title": "Off-Centered Outdoors with Matt Dockstader",
        "description": "<p>The incredibly talented multi award winning taxidermist and highly decorated BBQ Pitmaster Matt Dockstader hosts \"Off-Centered Outdoors\" along with his buddy Chuck Testa</p>",
        "language": "en",
        "author_name": "Thomas McClain",
        "slug": "offcenteredoutdoors",
        "cover": "20230510_070541_3e4d5d513d3b2a862a578bd090ce12f4.jpg"
    },
    {
        "podcast_id": 211328,
        "title": "BD Waterfowl Podcast",
        "description": "<p>Welcome to the BD Waterfowl Podcast! We are four guys, just winging it. Hoping to bring some joy to our listeners while spending time together.</p>",
        "language": "en",
        "author_name": "BDWaterfowl Pod",
        "slug": "bdwaterfowlpod",
        "cover": "20230525_010557_058a11d147e903526af3ac8949a0518a.jpg"
    },
    {
        "podcast_id": 211610,
        "title": "A Courage Experiment",
        "description": "<p>Random conversations with all walks of life, with a focus on living better through discussions about culture, fitness, hunting, relationships, wildlife, health and anything else of interest.</p>",
        "language": "en",
        "author_name": "Jason Chan - acourageexperiment@gmail.com ",
        "slug": "acourageexperiment",
        "cover": "20230529_040529_9aa4a8ff40ff5edfd09d9c2dd93e86a4.jpg"
    },
    {
        "podcast_id": 214619,
        "title": "The Game Trail",
        "description": "<p>The Game Trail is Trail Kreitzer’s biweekly deep dive into gear, hunting, and whatever else comes to his mind. Trail has over two decades of western big game hunting experience and is a professed gear junkie and constant tinkerer. Join him and a variety of experienced guests as they discuss everything from boots to backpacks, bows to baselayers, tents, tripods, tuning, tactics and everything in between.</p>",
        "language": "en",
        "author_name": "GOHUNT- Trail Kreitzer",
        "slug": "thegametrail",
        "cover": "20230612_010626_668b713955b0167ba1b6ed15f8cfd95f.jpg"
    },
    {
        "podcast_id": 216865,
        "title": "For Every Adventure by Outdoor Warehouse",
        "description": "<p>Whether you’re a seasoned outdoor enthusiast or just starting to explore nature, For Every Adventure has something for everyone who loves to be outside. We bring you all the inspiration, information, and entertainment you need to help you gear up for your next great adventure.</p>",
        "language": "en",
        "author_name": "Outdoor Warehouse",
        "slug": "foreveryadventure",
        "cover": "20230626_010652_9e0fc15b0ac81b5723c04dd7a3378240.jpg"
    },
    {
        "podcast_id": 216973,
        "title": "Songs that deserve to be on mainstream",
        "description": "<p>Songs that deserve to be on mainstream</p>",
        "language": "en",
        "author_name": "Girl With The Blonde Hair",
        "slug": "girlwiththeblondehair",
        "cover": "20230627_100603_f55bd7ae9a504bd6860a27f52cd933eb.jpg"
    },
    {
        "podcast_id": 220063,
        "title": "Vermont Trail Chatter",
        "description": "<p>Vermont Trail Chatter is a podcast focused on sharing stories and experiences from organizations and individuals that make the Green Mountain State such an awesome place to recreate. We'll talk with land managers, trail builders, volunteers, and other trail users. We'll explore new outdoor trends. Sometimes we'll talk about gear... People love gear! Ultimately, we want to help you develop a deeper understanding and appreciation of all trails... From how much work is required to create and maintain a trail... To the experiences our trails facilitate.</p>",
        "language": "en",
        "author_name": "Catamount Trail Association & Mountain Ops VT",
        "slug": "vttrailchatter",
        "cover": "20230718_070724_d6a56428f7d481aeefbc76504401641e.jpg"
    },
    {
        "podcast_id": 221160,
        "title": "The Obscene Outdoors Podcast",
        "description": "<p>Bert and Sean get explicit with what’s floating in their minds while exploring the great outdoors</p>",
        "language": "en",
        "author_name": "Bert and Sean",
        "slug": "theobsceneoutdoorspodcast",
        "cover": "20230725_110714_879896e18c974d61dff8c34f4a16e2e5.jpg"
    },
    {
        "podcast_id": 222534,
        "title": "The Hunting Republic",
        "description": "<p>Podcast about all things hunting and outdoors.</p>",
        "language": "en",
        "author_name": "The Hunting Republic ",
        "slug": "thehuntingrepublic",
        "cover": "20230804_050802_bee8809771e926c0c89218f7be62bdfb.jpg"
    },
    {
        "podcast_id": 223158,
        "title": "Hawkes Outdoors With Brad Flume",
        "description": "<p>What's new and interesting with #overlanding and #camping today. Monthly #podcast with Brad Flume talking about events, ideas, companies, places to visit, and what is #trending in the #Outdoors industry. Want to offer some suggestions, or comments feel free to send us a message by phone or email. 210-251-2882 or <a href=\"mailto:contact@hawkesoutdoors.com\">contact@hawkesoutdoors.com</a></p>",
        "language": "en",
        "author_name": "Brad Flume",
        "slug": "hawkesoutdoors",
        "cover": "20230808_060836_ac0db54c6a632069be0b40fbf546182c.jpg"
    },
    {
        "podcast_id": 223905,
        "title": "The AYA Outdoors Podcast",
        "description": "<p>Join me and friends as we swap stories and have gut wrenching laughs. Maybe even trade a couple Game Warden stories!</p>",
        "language": "en",
        "author_name": "Jarrett Clary",
        "slug": "ayaoutdoors",
        "cover": "20230814_010835_d84960ca8256b9aa2222f38ccebf9fe5.jpg"
    },
    {
        "podcast_id": 224113,
        "title": "The Outdoor Conquest Podcast",
        "description": "<p>If your life revolves around fishing and hunting like me....your in the RIGHT PLACE!</p><p>Welcome to my podcast. I will be covering MANY topics involving the outdoor lifestyle (hunting, fishing) from all over Michigan as well as surrounding states. </p><p>I'm an avid kayak angler from ice out to ice on here in Michigan. I spend most of my Fall chasing big game and my Winter season is consumed with ice fishing content.</p><p>I upload weekly on Youtube and run my own social media channels on instagram and facebook as well.</p><p>I will be hosting solo shows as well as bringing on guests to talk about a slew of topics. I will do my best to keep it fresh.</p>",
        "language": "en",
        "author_name": "Lucas Pawlosky",
        "slug": "theoutdoorconquest",
        "cover": "20230815_010810_e380efd172cdef0c63c55e95ab7a9672.jpg"
    },
    {
        "podcast_id": 224121,
        "title": "The Honker Heaven Podcast",
        "description": "<p>Welcome to The Honker Heaven Podcast. Follow along on our waterfowling journey where we will discuss hunting stories, past and present, all while giving insight on how to be more effective in the field. Whether you are looking for a good laugh or a few tips to bag more birds, this is the podcast for you!</p>",
        "language": "en",
        "author_name": "Eric Staebler and Michael Kolness",
        "slug": "thehonkerheavenpodcast",
        "cover": "20230815_020823_e566819810cff87e755d94bfd1fee254.jpg"
    },
    {
        "podcast_id": 225684,
        "title": "Prep-Life Pro Pod",
        "description": "<p>Your favorites from Prep-Life Pro!</p>",
        "language": "en",
        "author_name": "Prep-Life Pro",
        "slug": "preplifepro",
        "cover": "20230824_040849_be9818346183608c7e12f1742b1031f8.jpg"
    },
    {
        "podcast_id": 226998,
        "title": "Unlucky Hunters Matter",
        "description": "<p>On Unlucky Hunters Matter I will be talking weekly about my past experiences, my goals for the up coming hunting seasons, lessons that I have learned and how I can be a better hunter from those lessons. I will also include my friends and family and get their stories and goals and experiences on the show as well.</p>",
        "language": "en",
        "author_name": "Unlucky Hunters Matter",
        "slug": "unlucky-hunters-matter",
        "cover": "20230903_010949_0f5a3e5adc882affabf32e297c12dd1c.jpg"
    },
    {
        "podcast_id": 228763,
        "title": "Campfire Chronicles",
        "description": "<p>Join hosts Todd and Smokey around the virtual campfire as they share their love for the great outdoors on 'Campfire Chronicles.' From hunting and fishing tales to wilderness adventures and spirited conversations, this podcast is your ticket to the wild side. Explore nature's wonders with us!</p>",
        "language": "en",
        "author_name": "Todd Craighead, Smokey Solis",
        "slug": "campfirechronicles",
        "cover": "20230915_030952_2d8ae153091801bce2dda0be04bb7d3f.jpg"
    }
]